[{"data":1,"prerenderedAt":116},["ShallowReactive",2],{"publication-daily-threat-publications-2025-12-25":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-12-25","ServiceNow's $7.75B Armis Buy, Pro-Russian DDoS Attacks, and AI-Powered Scams Define Holiday News Cycle","This cybersecurity brief for December 25, 2025, covers a volatile period marked by significant industry consolidation and escalating cyber threats. The lead story is ServiceNow's landmark $7.75 billion acquisition of Armis, signaling a major push towards AI-driven security platforms. In tandem, pro-Russian hacktivists launched a disruptive DDoS attack against France's postal service, crippling operations before Christmas. Regulatory actions saw the SEC charge seven firms in a $14 million AI-themed crypto scam that used deepfakes. Other major incidents include a supply chain breach at Nissan exposing 21,000 customers via a compromised Red Hat server, and a significant healthcare data breach originating from subcontractor TriZetto with a year-long dwell time. Reports also highlight a surge in AI-powered phishing targeting holiday shoppers and ICS systems in East Asia.","2025-12-25",6,[10,34,54,70,87,104],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":26,"createdAt":28,"updatedAt":29,"readingTime":30,"isUpdate":31,"updateSummary":32,"updateContent":33},"4ddc798f-d783-441c-8a03-f67208717968","palo-alto-networks-report-ai-driving-massive-expansion-of-cloud-attack-surface","AI Adoption Fuels 'Massive' Cloud Attack Surface Expansion, Palo Alto Networks Report Warns","Palo Alto Networks Report: 99% of Organizations See Attacks on AI Systems Amid Surge in Cloud Risk","informational","Palo Alto Networks' 2025 'State of Cloud Security Report' reveals that the rapid adoption of AI is creating an unprecedented expansion of the cloud attack surface. The study, surveying 2,800 security leaders, found that 99% of organizations have had their AI systems attacked in the last year. The use of generative AI in coding is producing insecure code faster than security teams can remediate it, creating a significant risk gap. API attacks have surged by 41% year-over-year, and lenient identity and access management (IAM) remains a top vulnerability. The report calls for a unified, platform-based approach to cloud security to counter AI-weaponized threats.",[18,19,20,21,22,23,24,25],"Cloud Security","AI Security","Palo Alto Networks","API Security","IAM","DevSecOps","CNAPP","Threat Intelligence",[18,25,27],"Policy and Compliance","2025-12-17T15:00:00.000Z","2025-12-25T00:00:00.000Z",5,true,"ServiceNow acquires Armis for $7.75B, creating an AI-native security platform, exemplifying industry consolidation to address AI-driven cloud risks.","ServiceNow's acquisition of Armis for $7.75 billion marks a significant industry move towards platform consolidation, directly addressing the need for unified cloud security solutions highlighted in the Palo Alto Networks report. This deal aims to integrate Armis's agentless asset visibility with ServiceNow's workflow automation, creating an AI-native security platform to manage and remediate threats across the entire technology estate. This development reinforces the report's call for a platform-based approach to counter the expanding cloud attack surface fueled by AI.",{"id":35,"slug":36,"headline":37,"title":38,"severity":39,"excerpt":40,"tags":41,"categories":49,"createdAt":51,"updatedAt":51,"readingTime":52,"isUpdate":53},"3e9ef092-0e43-4a7f-a7bb-0671e8319084","sec-charges-seven-firms-in-14m-ai-themed-crypto-investment-scam","SEC Busts $14M AI-Powered Crypto Scam That Used Deepfakes","SEC Charges Seven Entities in $14 Million Cryptocurrency Scheme Using AI and Deepfake Videos","high","The U.S. Securities and Exchange Commission (SEC) has charged seven entities for their involvement in a sophisticated cryptocurrency investment scam that defrauded retail investors of over $14 million. The scheme, which ran for a year, used social media ads featuring deepfake videos of financial professionals to lure victims into private messaging groups. Inside these groups, fraudsters posing as experts used AI-generated investment tips to build trust before directing victims to fraudulent trading platforms. When investors tried to withdraw funds, they were hit with advance fee demands, compounding their losses.",[42,43,44,45,46,47,48],"Crypto Scam","SEC","AI","Deepfake","Phishing","Investment Fraud","WhatsApp",[46,50,25],"Regulatory","2025-12-25T15:00:00.000Z",4,false,{"id":55,"slug":56,"headline":57,"title":58,"severity":15,"excerpt":59,"tags":60,"categories":69,"createdAt":51,"updatedAt":51,"readingTime":52,"isUpdate":53},"711fc9f8-cc66-445c-8af2-54cb7d345386","2025-cybersecurity-ma-review-mega-deals-reshape-industry","2025 in Review: Mega-Deals Like Google/Wiz and Palo Alto/CyberArk Reshape Cybersecurity","Year-End Analysis Shows Cybersecurity M&A Surged in 2025, Driven by Platform Consolidation","The cybersecurity industry witnessed a massive wave of consolidation in 2025, with total M&A deal value approaching the record $75 billion set in 2021. A year-end analysis highlights several multi-billion dollar mega-deals, including Google's $32 billion acquisition of Wiz, Palo Alto Networks' $25 billion purchase of CyberArk, and ServiceNow's $7.75 billion deal for Armis. This surge reflects a fundamental market shift away from point solutions and towards integrated, simplified, and automated security platforms capable of managing complex risks across cloud, AI, and identity.",[61,62,63,64,65,20,66,67,68],"M&A","Cybersecurity Industry","Consolidation","Google","Wiz","CyberArk","ServiceNow","Armis",[27,25],{"id":71,"slug":72,"headline":73,"title":74,"severity":15,"excerpt":75,"tags":76,"categories":84,"createdAt":51,"updatedAt":51,"readingTime":86,"isUpdate":53},"81cb6069-b98a-4288-b11a-33c113dc640e","nist-mitre-launch-20m-ai-centers-for-manufacturing-and-cybersecurity","NIST and MITRE Launch $20M AI Centers to Secure Critical Infrastructure","NIST and MITRE Partner on $20 Million Investment to Establish AI Research Centers for Manufacturing and Cybersecurity","The U.S. National Institute of Standards and Technology (NIST) and the non-profit MITRE Corporation have announced a $20 million investment to establish two new national artificial intelligence (AI) research centers. The initiative aims to accelerate the adoption of AI to boost U.S. manufacturing competitiveness and to develop advanced methods for securing the nation's critical infrastructure from AI-driven cyberthreats. The centers will leverage MITRE's extensive experience in operating federal R&D centers and its public contributions like the ATT&CK framework.",[77,78,44,79,80,81,82,83],"NIST","MITRE","Cybersecurity","Critical Infrastructure","Manufacturing","Government","Research",[27,50,85],"Industrial Control Systems",3,{"id":88,"slug":89,"headline":90,"title":91,"severity":92,"excerpt":93,"tags":94,"categories":102,"createdAt":51,"updatedAt":51,"readingTime":30,"isUpdate":53},"909adcef-ac55-4f57-9713-96369bf04af6","kaspersky-report-malicious-scripts-phishing-surge-in-east-asian-ics","Malicious Scripts Targeting ICS Surge in East Asia, Kaspersky Reports","Kaspersky Q3 2025 Report Reveals Spike in Malicious Scripts and Phishing Targeting Industrial Control Systems in East Asia","medium","A Q3 2025 threat report from Kaspersky's ICS CERT reveals a significant increase in cyber threats targeting Industrial Control Systems (ICS) in East Asia. The region jumped to third place globally for the percentage of ICS computers where malicious objects were blocked. The most alarming trend was a surge in malicious scripts and phishing pages, which became the top threat category, with attack rates 1.4 times higher than the global average. This spike is primarily attributed to attacks targeting the engineering and ICS integrator sector in Mainland China, where malware was found hidden in customized P2P client applications.",[95,96,97,98,99,100,101],"ICS","SCADA","Kaspersky","Threat Report","Malicious Scripts","East Asia","China",[85,25,103],"Malware",{"id":105,"slug":106,"headline":107,"title":108,"severity":92,"excerpt":109,"tags":110,"categories":115,"createdAt":51,"updatedAt":51,"readingTime":86,"isUpdate":53},"c2073d4f-9a82-4615-a537-314b7cf2ef35","coordinated-scams-target-mena-region-with-fake-online-job-advertisements","Fake Job Ad Scams Surge Across MENA Region, Experts Warn","Coordinated Scam Campaigns Target Job Seekers in MENA Region with Fake Online Advertisements","Security researchers are warning of a rising tide of coordinated scam campaigns targeting job seekers across the Middle East and North Africa (MENA) region. These campaigns utilize fake online job advertisements posted on social media and job portals to deceive individuals. The goal is to trick victims into divulging sensitive personal information or making fraudulent payments for non-existent application fees or training materials. This trend aligns with a global increase in sophisticated digital fraud, where criminals exploit economic conditions and the need for employment.",[111,112,46,113,114],"Job Scam","MENA","Social Engineering","Fraud",[46,25],1769006407854]