title: Database Dump Utility Execution
id: 7c5b9f3a-1e8d-4f6b-8c4a-9d2e1f7b3a9c
status: experimental
description: 'Detects the execution of common database dump utilities (mysqldump, pg_dump) which can be used by attackers to stage data for exfiltration.'
author: cyber.netsecops.io
date: 2026-06-09
references:
  - https://securityaffairs.com/193274/data-breach/dentaquest-breach-shinyhunters-publish-data-impacting-2-6m-people.html
tags:
  - attack.t1213
  - attack.collection
level: medium
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
      - '\mysqldump.exe'
      - '\pg_dump.exe'
  condition: selection