title: Suspicious Browser Extension Installation
id: 2b9c1f8a-4d7e-4b0f-8c9a-1f2e3d4b5a6b
status: experimental
description: Detects file creation events in common browser extension directories, which could indicate the installation of a new, potentially malicious, extension.
references:
  - https://www.manilatimes.net/2026/07/20/tmt-newswire/globenewswire/free-vpn-extensions-caught-harvesting-clipboard-data-cyberinsider-warns-browser-users/2387620
author: cyber.netsecops.io
date: 2026-07-20
tags:
  - attack.t1176
level: low
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|contains:
      - '\Google\Chrome\User Data\Default\Extensions\'
      - '\Mozilla\Firefox\Profiles\'
    TargetFilename|endswith: '\manifest.json'
  condition: selection