title: Anomalous IT Protocol Traffic in OT Segment
id: 45654e16-89f6-413b-b5c1-23819d43c44c
status: experimental
description: Detects common IT protocols (SSH, FTP, HTTP/S) directed towards an OT network segment. This could indicate unauthorized access or lateral movement. The destination IP range should be customized to the specific OT environment.
references:
  - https://www.securityweek.com/ics-patch-tuesday-vulnerabilities-fixed-by-siemens-schneider-phoenix-contact/
author: cyber.netsecops.io
date: 2026-06-10
falsepositives:
  - Legitimate administrative traffic to OT devices.
level: medium
logsource:
  category: network_connection
detection:
  selection:
    DestinationPort:
      - 21
      - 22
      - 80
      - 443
  condition: selection
---
title: Potential Unexplained PLC Mode Change
id: 829bea8f-5150-4372-9c27-62d4e4eed08d
status: experimental
description: Detects log entries that may indicate an unexplained PLC or RTU mode change, such as from 'Run' to 'Program' or 'Stop'. Such changes outside of scheduled maintenance could indicate malicious activity.
references:
  - https://www.securityweek.com/ics-patch-tuesday-vulnerabilities-fixed-by-siemens-schneider-phoenix-contact/
author: cyber.netsecops.io
date: 2026-06-10
tags:
  - attack.t0858
  - attack.t0831
level: high
logsource:
  category: application
detection:
  keywords:
    - 'mode change to program'
    - 'mode change to stop'
    - 'controller state changed to program'
    - 'PLC mode set to PROG'
    - 'logic change'
    - 'firmware update initiated'
  condition: keywords