title: SendGrid Phishing Lure Subject Line
id: 09f68d02-ecff-4c7a-b0f1-1693b48efc9f
status: experimental
description: Detects emails with subject lines used in a SendGrid impersonation phishing campaign.
references:
  - https://www.mailguard.com.au/blog/sendgrid-support-email-phish-now-circulating?hs_amp=true
author: cyber.netsecops.io
date: 2026-06-04
tags:
  - attack.t1598.001
  - attack.reconnaissance
level: medium
logsource:
  category: email
detection:
  selection:
    Subject|contains:
      - 'Insufficient Account Permissions'
      - 'Message Rejection Notification'
  condition: selection