title: Suspicious Robocopy Execution for Data Staging
id: a99130a1-4832-43b9-8b39-d71f71da97d9
status: experimental
description: Detects the use of the legitimate 'robocopy' utility, often abused by attackers to copy large volumes of files to a staging directory for exfiltration.
references:
  - https://www.breachsense.com/breaches/
author: cyber.netsecops.io
date: 2026-06-27
tags:
  - attack.t1560.001
  - attack.collection
level: medium
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\robocopy.exe'
    CommandLine|contains|all:
      - ' /s'
      - ' /e'
  condition: selection
---
title: Creation of Large Archive Files
id: 4390f844-3b71-410b-840a-c4ad35446832
status: experimental
description: Detects the creation of large archive files (.rar, .zip, .7z), which can be a sign of data staging before exfiltration, especially when created by service accounts or outside of business hours.
references:
  - https://www.breachsense.com/breaches/
author: cyber.netsecops.io
date: 2026-06-27
tags:
  - attack.t1560.001
  - attack.collection
level: medium
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith:
      - '.rar'
      - '.zip'
      - '.7z'
  condition: selection