title: Suspicious PowerShell Encoded Command Execution
id: 27c3c55b-2d4a-4b87-a25f-b51e4b3c9d6a
status: experimental
description: Detects the use of PowerShell with encoded command arguments, a common technique for obfuscating malicious scripts.
references: []
author: cyber.netsecops.io
date: 2026-04-27
tags:
  - attack.t1027
  - attack.t1059.001
level: medium
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\powershell.exe'
    CommandLine|contains:
      - ' -e '
      - ' -en '
      - ' -enc '
      - ' -enco'
      - ' -encod'
      - ' -encode'
      - ' -encoded'
      - ' -encodedc'
      - ' -encodedco'
      - ' -encodedcom'
      - ' -encodedcomm'
      - ' -encodedcomma'
      - ' -encodedcomman'
      - ' -encodedcommand '
  condition: selection