title: Volume Shadow Copy Deletion via WMIC
id: 2b8b3235-1442-4399-825f-2300081335b4
status: experimental
description: Detects the use of wmic.exe to delete volume shadow copies. This is a common technique used by ransomware to inhibit system recovery.
references:
  - https://www.breachsense.com/breaches/
author: cyber.netsecops.io
date: 2026-07-04
tags:
  - attack.t1490
  - attack.impact
level: high
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  condition: selection
---
title: Addition of User to Domain Admins Group
id: 9c582e19-31e1-4a5a-9e7f-3e5d78889a2b
status: experimental
description: Detects the use of 'net.exe' to add a user to the 'Domain Admins' group, a common privilege escalation and persistence technique.
references:
  - https://www.breachsense.com/breaches/
author: cyber.netsecops.io
date: 2026-07-04
tags:
  - attack.t1098
  - attack.persistence
level: high
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
      - '\net.exe'
      - '\net1.exe'
    CommandLine|contains|all:
      - 'group'
      - 'Domain Admins'
      - '/add'
  condition: selection