title: Ransomware Volume Shadow Copy Deletion
id: 2b8092da-b191-4b35-8640-1135694c345b
status: experimental
description: Detects commands used to delete volume shadow copies, a common technique used by ransomware to inhibit system recovery.
references:
  - https://www.kaseya.com/blog/2026/05/20/the-week-in-breach-news-may-20-2026/
author: cyber.netsecops.io
date: 2026-05-20
tags:
  - attack.t1490
  - attack.impact
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains:
      - 'shadowcopy'
      - 'delete'
  condition: 1 of them
falsepositives:
  - Legitimate administrative activity, though rare.
level: high