[{"data":1,"prerenderedAt":1970},["ShallowReactive",2],{"articles-index":3},{"articles":4,"totalCount":1968,"lastUpdated":1969},[5,29,44,60,78,96,114,132,148,161,176,188,203,219,231,245,262,272,286,302,313,327,337,346,360,373,384,396,406,418,430,445,459,472,490,503,513,525,536,545,556,574,587,601,614,628,639,650,664,675,690,701,715,731,744,758,771,784,795,807,821,834,845,857,870,883,895,906,921,933,946,959,973,984,1001,1013,1026,1037,1049,1061,1071,1082,1093,1104,1116,1129,1144,1155,1168,1179,1191,1200,1210,1222,1232,1244,1256,1268,1278,1288,1300,1311,1325,1338,1348,1360,1370,1382,1393,1403,1417,1428,1438,1451,1462,1475,1486,1498,1511,1523,1535,1547,1560,1571,1584,1595,1605,1617,1629,1640,1650,1663,1674,1688,1698,1711,1722,1733,1742,1753,1763,1772,1782,1791,1802,1812,1823,1833,1846,1854,1863,1874,1884,1896,1907,1918,1929,1937,1947,1957],{"id":6,"slug":7,"headline":8,"title":9,"severity":10,"article_type":11,"excerpt":12,"tags":13,"categories":22,"createdAt":25,"updatedAt":25,"displayDate":26,"isUpdated":27,"readingTime":28},"59389e45-858f-475d-996f-d07bb531a90a","shadow-escape-zero-click-attack-steals-data-from-ai-agents","\"Shadow Escape\": New Zero-Click Attack Steals Data from ChatGPT, Claude, and Gemini","\"Shadow Escape\" Zero-Click Attack Exploits AI Agents like ChatGPT to Silently Exfiltrate Data","high","NewsArticle","A novel zero-click attack vector named \"Shadow Escape\" has been discovered by researchers at Operant, capable of silently exfiltrating sensitive data from popular AI agents like OpenAI's ChatGPT, Anthropic's Claude, and Google's Gemini. The attack exploits the Model Context Protocol (MCP) by embedding hidden malicious instructions within seemingly benign documents. This allows for the theft of personally identifiable information (PII) without any user interaction, bypassing traditional security tools and posing a significant threat to enterprises adopting agentic AI.",[14,15,16,17,18,19,20,21],"AI Security","Zero-Click","ChatGPT","Gemini","Claude","MCP","Data Breach","Prompt Injection",[23,24,20],"Cyberattack","Cloud Security","2025-10-29T15:00:00.000Z","Created: Oct 29, 2025",false,5,{"id":30,"slug":31,"headline":32,"title":33,"severity":10,"article_type":11,"excerpt":34,"tags":35,"categories":42,"createdAt":25,"updatedAt":25,"displayDate":26,"isUpdated":27,"readingTime":28},"477ad402-77a7-438e-ad7d-a6d0f1f170c1","tata-motors-exposes-70tb-of-data-via-misconfigured-aws-keys","Massive 70TB Data Leak at Tata Motors from Exposed AWS Keys","Tata Motors Data Leak Exposes 70TB of Sensitive Data Due to Misconfigured AWS Credentials","A colossal security failure at Tata Motors has resulted in the exposure of over 70 terabytes of sensitive corporate data, customer information, and infrastructure details. The breach, which was first identified in 2023, stemmed from multiple critical misconfigurations, including plaintext Amazon Web Services (AWS) access keys hardcoded on a customer-facing website. These credentials provided unrestricted access to numerous S3 buckets containing a vast trove of data, including customer PII and financial records.",[36,37,38,39,24,40,41],"Data Leak","AWS","S3 Bucket","Misconfiguration","Tata Motors","PII",[20,24,43],"Policy and Compliance",{"id":45,"slug":46,"headline":47,"title":48,"severity":10,"article_type":11,"excerpt":49,"tags":50,"categories":58,"createdAt":25,"updatedAt":25,"displayDate":26,"isUpdated":27,"readingTime":28},"a8a4cd7d-74c9-427b-aa20-66e8225890ae","airstalk-malware-used-in-suspected-nation-state-supply-chain-attack","New \"Airstalk\" Malware Abuses VMware API in Nation-State Supply Chain Attack","Suspected Nation-State Actor Deploys \"Airstalk\" Malware in Supply Chain Attack, Abusing VMware Workspace ONE API","A newly identified malware strain, \"Airstalk,\" has been deployed in a sophisticated supply chain attack believed to be sponsored by a nation-state actor. The activity, tracked as the cluster CL-STA-1009, is notable for its novel command-and-control (C2) technique: it misuses the API of VMware's Workspace ONE Unified Endpoint Management (UEM), formerly AirWatch, to communicate covertly. The malware is also signed with a likely stolen digital certificate to evade detection, pointing to a well-resourced and stealthy adversary.",[51,52,53,54,55,56,57],"Airstalk","Supply Chain Attack","Nation-State","VMware","Workspace ONE","Code Signing","Malware",[52,57,59],"Threat Actor",{"id":61,"slug":62,"headline":63,"title":64,"severity":65,"article_type":11,"excerpt":66,"tags":67,"categories":74,"createdAt":25,"updatedAt":25,"displayDate":26,"isUpdated":27,"readingTime":77},"181f887c-d8d5-4093-85c7-05b1af205ba1","herodotus-android-malware-mimics-human-typing-to-evade-detection","Herodotus Android Malware Mimics Human Typing to Bypass Biometric Security","New \"Herodotus\" Android Banking Trojan Evades Detection by Mimicking Human Typing","medium","A new Android banking trojan named Herodotus has emerged, offered as a Malware-as-a-Service (MaaS) by a threat actor known as 'K1R0'. The malware is notable for its novel evasion technique: it mimics human typing behavior by introducing random delays during remote control sessions. This method is specifically designed to defeat behavioral biometric security systems that analyze user interaction patterns to detect fraud. Active campaigns have been observed targeting banking and crypto app users in Italy and Brazil.",[68,69,57,70,71,72,73],"Herodotus","Android","Banking Trojan","MaaS","Behavioral Biometrics","SMiShing",[57,75,76],"Mobile Security","Phishing",4,{"id":79,"slug":80,"headline":81,"title":82,"severity":83,"article_type":11,"excerpt":84,"tags":85,"categories":94,"createdAt":25,"updatedAt":25,"displayDate":26,"isUpdated":27,"readingTime":28},"22a73d23-ae9a-410b-a01c-b4280d89a5a1","chrome-zero-day-exploited-in-espionage-campaign-by-mem3nt0-mori","Chrome Zero-Day Exploited by \"Mem3nt0 mori\" APT to Deploy Spyware","\"Mem3nt0 mori\" APT Exploits Chrome Zero-Day (CVE-2025-2783) in \"Operation ForumTroll\" Espionage Campaign","critical","A critical zero-day vulnerability in Google Chrome, CVE-2025-2783, has been actively exploited in a targeted espionage campaign dubbed \"Operation ForumTroll.\" The campaign, which began in March 2025, is attributed to the advanced persistent threat (APT) group known as \"Mem3nt0 mori.\" The attackers used the exploit to deliver a sophisticated backdoor called LeetAgent, a spyware tool developed by the Italian vendor Memento Labs, primarily targeting organizations in Russia and Belarus.",[86,87,88,89,90,91,92,93],"Chrome","Zero-Day","CVE-2025-2783","APT","Mem3nt0 mori","Spyware","Espionage","Memento Labs",[95,59,23],"Vulnerability",{"id":97,"slug":98,"headline":99,"title":100,"severity":10,"article_type":11,"excerpt":101,"tags":102,"categories":108,"createdAt":109,"updatedAt":110,"displayDate":111,"isUpdated":112,"readingTime":113},"23c3ba71-cc33-4132-89a7-378c36dbc468","qantas-customer-data-leaked-online-after-ransom-deadline-passes","Qantas Data Breach: 5.7M Customer Records Leaked in Salesforce Supply Chain Attack","Hacker Collective 'Scattered Lapsus$ Hunters' Leaks 5.7 Million Qantas Customer Records Following Ransom Demand","The personal data of 5.7 million Qantas Airways customers has been published on the dark web by a group calling itself 'Scattered Lapsus$ Hunters'. The leak, which occurred after a ransom deadline passed on October 11, 2025, is part of a broader supply chain attack that compromised a third-party Salesforce system used by one of the airline's offshore call centers. The compromised data includes names, emails, frequent flyer information, and for some, addresses, phone numbers, and dates of birth. The attack vector involved social engineering, with hackers impersonating Salesforce employees to gain access. Qantas confirmed the breach, stating it is one of 39 companies affected by the campaign and that financial data and passwords were not compromised. The incident has prompted warnings of secondary phishing attacks and a class-action complaint.",[20,52,103,104,105,106,41,107],"Scattered Lapsus$ Hunters","Salesforce","Qantas","Social Engineering","Dark Web",[20,52,59],"2025-10-12T15:00:00.000Z","2025-10-29T12:00:00Z","Updated: Oct 29, 2025",true,7,{"id":115,"slug":116,"headline":117,"title":118,"severity":10,"article_type":11,"excerpt":119,"tags":120,"categories":128,"createdAt":129,"updatedAt":130,"displayDate":131,"isUpdated":112,"readingTime":28},"c8e50d4d-8c97-4c48-9583-73047a32a21e","clop-ransomware-breaches-american-airlines-subsidiary-via-oracle-ebs-flaw","Clop Ransomware Breaches American Airlines Subsidiary Envoy Air, Exploiting Oracle EBS Flaw","Envoy Air, an American Airlines Subsidiary, Confirms Breach by Clop Ransomware in Oracle EBS Hacking Campaign","Envoy Air, a regional airline owned by American Airlines, has confirmed it was a victim of a hacking campaign orchestrated by the Clop ransomware group. The attackers exploited vulnerabilities in Oracle's E-Business Suite (EBS) to gain access and exfiltrate data. While Envoy Air states that no sensitive customer or personal data was compromised, the breach involved some business information and commercial contacts. Clop has listed American Airlines among more than 60 victims of its recent campaign targeting unpatched Oracle systems, threatening to leak stolen data if ransoms are not paid.",[121,122,123,124,125,126,127,20],"Clop","Ransomware","Envoy Air","American Airlines","Oracle","E-Business Suite","CVE-2023-21931",[122,20,95],"2025-10-18T15:00:00.000Z","2025-10-29T00:00:00Z","Updated: Oct 28, 2025",{"id":133,"slug":134,"headline":135,"title":136,"severity":10,"article_type":11,"excerpt":137,"tags":138,"categories":144,"createdAt":146,"updatedAt":146,"displayDate":147,"isUpdated":27,"readingTime":28},"64ea5947-5f98-4beb-9453-ac1def13cc05","swedish-power-grid-operator-svenska-kraftnat-hit-by-everest-ransomware","Everest Ransomware Hits Swedish Power Grid Operator, Steals 280GB of Data","Everest Ransomware Group Claims Data Breach at Swedish Power Grid Operator Svenska kraftnät","Sweden's national electricity operator, Svenska kraftnät, has confirmed a data breach following a claim by the Everest ransomware group. The attackers alleged on their dark web leak site that they had stolen 280 GB of internal data. Svenska kraftnät stated that the attack was confined to an external file transfer system and that the nation's core power grid operations and electricity supply were not affected. An investigation is underway to determine the scope of the compromised data.",[139,122,20,140,141,142,143],"Everest","Sweden","Critical Infrastructure","ICS","Energy Sector",[23,20,145],"Industrial Control Systems","2025-10-28T15:00:00.000Z","Created: Oct 28, 2025",{"id":149,"slug":150,"headline":151,"title":152,"severity":83,"article_type":11,"excerpt":153,"tags":154,"categories":160,"createdAt":146,"updatedAt":146,"displayDate":147,"isUpdated":27,"readingTime":28},"02f8a2b5-ce3b-46b8-a2ac-95fbaa311925","massive-data-breach-at-kenyan-health-platform-m-tiba-hits-millions","Massive Breach at Kenyan Health Platform M-TIBA Exposes 4.8 Million Patients","Threat Actor 'Kazu' Claims Massive Data Breach of Kenyan Health Platform M-TIBA, Affecting 4.8 Million Users","A threat actor named 'Kazu' has claimed responsibility for a catastrophic data breach against M-TIBA, a major mobile health platform in Kenya backed by Safaricom. The hacker alleges the theft of 2.15 terabytes of data, impacting up to 4.8 million users. The compromised information reportedly includes a vast trove of personally identifiable information (PII) and highly sensitive protected health information (PHI), such as patient diagnoses and treatment records from nearly 700 healthcare facilities. A 2GB data sample has already been leaked to substantiate the claim.",[20,155,156,41,157,158,159,107],"Healthcare","PHI","Kenya","M-TIBA","Kazu",[20,59,24],{"id":162,"slug":163,"headline":164,"title":165,"severity":83,"article_type":166,"excerpt":167,"tags":168,"categories":174,"createdAt":146,"updatedAt":146,"displayDate":147,"isUpdated":27,"readingTime":28},"8d521ec4-8cb3-46a9-9c33-46423f05eff7","cisa-issues-alert-for-critical-flaws-in-veeder-root-fuel-gauge-systems","CISA Warns of Critical Flaws in Global Fuel Gauge Systems, Risking Infrastructure Disruption","CISA Issues Alert for Critical Vulnerabilities in Veeder-Root Fuel Gauge Systems Used in Global Energy Sector","Advisory","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued a critical advisory for two vulnerabilities in Veeder-Root's TLS4B Automatic Tank Gauge (ATG) systems, which are used globally to monitor fuel levels. The most severe flaw, CVE-2025-58428, has a CVSS score of 9.9 and could allow a remote, authenticated attacker to execute system-level commands, potentially causing widespread disruption to fuel infrastructure. A second flaw, CVE-2025-55067, relates to the 'Year 2038' problem and could cause denial-of-service conditions.",[142,169,170,171,141,143,172,173],"OT","CISA","Veeder-Root","Command Injection","Y2038",[145,95,175],"Patch Management",{"id":177,"slug":178,"headline":179,"title":180,"severity":10,"article_type":166,"excerpt":181,"tags":182,"categories":187,"createdAt":146,"updatedAt":146,"displayDate":147,"isUpdated":27,"readingTime":28},"ecc2a698-9ff5-46d9-89a9-00b2267b52b6","critical-apache-tomcat-flaws-expose-servers-to-rce-and-console-manipulation","Critical Apache Tomcat Flaws Expose Servers to RCE and Console Hijacking","Apache Software Foundation Patches Critical Tomcat Vulnerabilities Leading to Potential RCE","The Apache Software Foundation has released patches for two critical vulnerabilities, CVE-2025-55752 and CVE-2025-55754, affecting Apache Tomcat versions 9, 10, and 11. The most severe flaw, CVE-2025-55752, is a directory traversal bug that can be escalated to remote code execution (RCE) if non-default settings like PUT requests are enabled. The second flaw could allow for console manipulation on Windows systems. Administrators are urged to upgrade to the latest versions immediately.",[183,95,184,185,175,186],"Apache Tomcat","RCE","Directory Traversal","Java",[95,175,23],{"id":189,"slug":190,"headline":191,"title":192,"severity":10,"article_type":193,"excerpt":194,"tags":195,"categories":202,"createdAt":146,"updatedAt":146,"displayDate":147,"isUpdated":27,"readingTime":28},"b0e2593f-f1d3-4fb4-9d41-da567971a366","north-koreas-bluenoroff-apt-deploys-new-macos-malware-in-sophisticated-campaigns","North Korea's BlueNoroff APT Targets macOS Users with New 'GhostCall' Malware","North Korean APT BlueNoroff Deploys New 'GhostCall' and 'GhostHire' Malware in Campaigns Targeting macOS Users in Crypto Sector","Analysis","The North Korean advanced persistent threat (APT) group BlueNoroff has been linked to two new sophisticated campaigns, 'GhostCall' and 'GhostHire,' which specifically target macOS users. According to Kaspersky, the financially motivated group, a subset of the Lazarus Group, is targeting venture capitalists and Web3 developers with fake Zoom and Microsoft Teams clients, AI-enhanced social engineering, and a new suite of malware designed to steal cryptocurrency. Victims have been identified globally, including in Japan, Italy, France, and Singapore.",[196,197,198,199,57,200,106,201],"BlueNoroff","APT38","Lazarus Group","macOS","Cryptocurrency","Kaspersky",[59,57,76],{"id":204,"slug":205,"headline":206,"title":207,"severity":208,"article_type":11,"excerpt":209,"tags":210,"categories":217,"createdAt":146,"updatedAt":146,"displayDate":147,"isUpdated":27,"readingTime":77},"162978eb-d211-4bab-b874-08ccfcffd25c","us-coast-guard-receives-billions-in-funding-for-maritime-cybersecurity-overhaul","U.S. Coast Guard Poised for 'Generational Change' in Maritime Cybersecurity with $25B Funding","U.S. Coast Guard Receives Billions in New Funding for Comprehensive Maritime Cybersecurity Overhaul","informational","The U.S. Coast Guard (USCG) is set for a 'generational change' in maritime cybersecurity, according to an analysis by the Center for Strategic and International Studies (CSIS). Nearly $25 billion in new funding, combined with expanded regulatory authorities, will allow the USCG to comprehensively modernize its systems, implement a zero-trust architecture, and enforce new cybersecurity standards across the entire U.S. Marine Transportation System. The move signals a major strategic shift, elevating cyberspace to an operational domain on par with air, land, and sea.",[211,212,213,214,215,216,141],"US Coast Guard","Maritime Security","CSIS","Policy","Regulation","Zero Trust",[43,218,145],"Regulatory",{"id":220,"slug":221,"headline":222,"title":223,"severity":83,"article_type":166,"excerpt":224,"tags":225,"categories":230,"createdAt":146,"updatedAt":146,"displayDate":147,"isUpdated":27,"readingTime":77},"91a892a2-1ad0-4603-9163-93f488175ce9","cisa-adds-critical-motex-lanscope-vulnerability-to-kev-catalog","CISA Adds Actively Exploited Motex LANSCOPE RCE Flaw to KEV Catalog","CISA Adds Critical Motex LANSCOPE Endpoint Manager Vulnerability (CVE-2025-61932) to KEV Catalog Amid Active Exploitation","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical vulnerability in Motex's LANSCOPE Endpoint Manager, CVE-2025-61932, to its Known Exploited Vulnerabilities (KEV) catalog following confirmation of active attacks. The flaw, rated 9.3 CVSS, allows for unauthenticated remote code execution on affected endpoints. Attackers have reportedly been weaponizing the vulnerability to install backdoors on victim systems, primarily observed in Japan. Federal agencies are now mandated to patch by November 12, 2025.",[170,226,227,228,95,184,229],"KEV","Motex","LANSCOPE","Endpoint Security",[95,175,23],{"id":232,"slug":233,"headline":234,"title":235,"severity":10,"article_type":193,"excerpt":236,"tags":237,"categories":243,"createdAt":146,"updatedAt":146,"displayDate":147,"isUpdated":27,"readingTime":28},"34b335bc-0f57-4cc5-b073-e9ac48203cd2","active-directory-at-risk-from-over-privileged-domain-join-accounts","Over-Privileged Active Directory Domain-Join Accounts Create Major Security Risk","Misconfigured Active Directory Domain-Join Accounts Provide Reliable Path to Domain Compromise","A new security analysis reveals that Active Directory (AD) domain-join accounts, even when configured according to official guidance, often inherit excessive privileges that create a reliable pathway for attackers to achieve full domain compromise. These specialized accounts, used for automated machine provisioning, can have their credentials exposed during deployment. Attackers can then abuse the account's powerful default permissions, such as object ownership and rights related to Resource-Based Constrained Delegation (RBCD), to escalate privileges and take over computer objects.",[238,239,240,39,241,242],"Active Directory","Privilege Escalation","RBCD","Kerberos","Security Operations",[242,95,244],"Threat Intelligence",{"id":246,"slug":247,"headline":248,"title":249,"severity":10,"article_type":250,"excerpt":251,"tags":252,"categories":259,"createdAt":129,"updatedAt":260,"displayDate":261,"isUpdated":112,"readingTime":28},"02a78710-0d01-46eb-a99b-9aed6ffd560e","ai-powered-phishing-emails-prove-4-5-times-more-effective-microsoft-report-finds","Microsoft Report: AI-Generated Phishing Now 4.5x More Effective, Bypassing Traditional Defenses","AI-Powered Phishing Emails Achieve 54% Click-Through Rate, Microsoft's 2025 Digital Defense Report Reveals","Report","According to the Microsoft 2025 Digital Defense Report, the effectiveness of phishing attacks has surged with the adoption of artificial intelligence. AI-generated emails now achieve a 54% click-through rate, 4.5 times higher than traditional methods. The report, covering July 2024 to June 2025, also highlights a 32% increase in identity-based attacks and the growing use of AI by nation-state actors for disinformation. Microsoft stresses that phishing-resistant MFA remains the most effective defense, blocking over 99% of identity attacks.",[253,76,254,244,255,256,257,258],"AI","Microsoft","MFA","Identity Attack","Infostealer","ClickFix",[76,244,57],"2025-10-28T00:00:00Z","Updated: Oct 27, 2025",{"id":263,"slug":264,"headline":265,"title":266,"severity":10,"article_type":166,"excerpt":267,"tags":268,"categories":270,"createdAt":271,"updatedAt":260,"displayDate":261,"isUpdated":112,"readingTime":28},"3ce4bc15-1f72-4c84-9d41-44c648b88418","cisa-adds-new-actively-exploited-vulnerability-to-kev-catalog","CISA Orders Federal Agencies to Patch New Actively Exploited Vulnerability","CISA Adds New Vulnerability to Known Exploited Vulnerabilities (KEV) Catalog, Mandating Federal Patching","On October 22, 2025, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) added a new, unspecified vulnerability to its Known Exploited Vulnerabilities (KEV) catalog. This action confirms that the flaw is being actively exploited in the wild by malicious actors. Under Binding Operational Directive (BOD) 22-01, all Federal Civilian Executive Branch (FCEB) agencies are now required to remediate this vulnerability by a specific deadline to protect federal networks. While the CVE identifier was not immediately released, the alert serves as a critical warning to all organizations to prioritize its patching.",[170,226,95,175,269,87],"BOD 22-01",[95,175,218],"2025-10-23T15:00:00.000Z",{"id":273,"slug":274,"headline":275,"title":276,"severity":83,"article_type":193,"excerpt":277,"tags":278,"categories":285,"createdAt":271,"updatedAt":260,"displayDate":261,"isUpdated":112,"readingTime":113},"e891d09c-251e-4489-9c26-a5a24434a34b","ransomware-automation-cuts-attack-timelines-to-18-minutes","18 Minutes to Mayhem: Ransomware Attacks Now Fully Automated, Slashing Defender Response Time","Ransomware Automation Reduces Attacker 'Breakout Time' to Just 18 Minutes, ReliaQuest Reports","A new report from ReliaQuest reveals a dramatic acceleration in ransomware attacks, with the average time from initial access to lateral movement ('breakout time') plummeting to just 18 minutes. This is a significant decrease from 48 minutes in 2024, driven by the adoption of automation and AI by 80% of Ransomware-as-a-Service (RaaS) groups. The report highlights the Qilin ransomware gang as a prime example, whose platform automates key attack phases like discovery, backup deletion, and encryption. Other groups like LockBit are also integrating AI to enhance their operations, creating a hyper-competitive landscape where speed and automation are paramount. This shrinking response window poses a monumental challenge for security teams, demanding automated detection and response capabilities to counter the threat.",[122,279,253,280,281,282,283,284],"Automation","Qilin","LockBit","Breakout Time","Incident Response","SOAR",[122,59,244],{"id":287,"slug":288,"headline":289,"title":290,"severity":83,"article_type":166,"excerpt":291,"tags":292,"categories":299,"createdAt":300,"updatedAt":300,"displayDate":301,"isUpdated":27,"readingTime":28},"e7631828-2635-4207-afc7-4f094cd537d8","critical-adobe-commerce-flaw-cve-2025-54236-under-active-exploitation","Critical Adobe Commerce Flaw Under Active Exploitation, CISA Warns","Actively Exploited 'SessionReaper' Vulnerability (CVE-2025-54236) in Adobe Commerce Allows Session Hijacking","A critical improper input validation vulnerability in Adobe Commerce and Magento, tracked as CVE-2025-54236, is being actively exploited in the wild. Dubbed 'SessionReaper,' the flaw allows an unauthenticated remote attacker to hijack user sessions via the REST API, leading to potential web shell deployment and complete store takeover. CISA has added the vulnerability to its KEV catalog, and with reports suggesting over 60% of Magento stores remain unpatched, immediate action is urged for all administrators.",[293,294,295,226,296,297,298],"Session Hijacking","Web Shell","REST API","Improper Input Validation","Adobe","Magento",[95,23,20],"2025-10-27T15:00:00.000Z","Created: Oct 27, 2025",{"id":303,"slug":304,"headline":305,"title":306,"severity":65,"article_type":193,"excerpt":307,"tags":308,"categories":312,"createdAt":300,"updatedAt":300,"displayDate":301,"isUpdated":27,"readingTime":77},"a7d9cbaf-5b0f-485d-95d7-545bc6544feb","chatgpt-atlas-browser-vulnerability-allows-memory-poisoning","ChatGPT Flaw Allows 'Memory Poisoning' via CSRF Attack","New Vulnerability in ChatGPT Atlas Browser Allows Persistent Memory Poisoning and Account Takeover","A novel vulnerability discovered in OpenAI's ChatGPT Atlas web browser allows attackers to perform 'memory poisoning' through a Cross-Site Request Forgery (CSRF) attack. Researchers at LayerX Security found that this flaw can be used to invisibly inject malicious instructions into ChatGPT's persistent 'Memory' feature. These instructions survive across sessions and devices, and can be triggered by a user's normal prompts to execute malicious code, potentially leading to account takeover or malware deployment.",[16,309,310,14,311,95],"OpenAI","CSRF","Memory Poisoning",[95,24],{"id":314,"slug":315,"headline":316,"title":317,"severity":10,"article_type":193,"excerpt":318,"tags":319,"categories":326,"createdAt":300,"updatedAt":300,"displayDate":301,"isUpdated":27,"readingTime":77},"3bb589b6-130b-49a9-8cea-ab5e72349cf4","apt-c-60-intensifies-cyber-espionage-campaign-against-japan","APT-C-60 Escalates 'SpyGlace' Campaign Against Japan","South Korea-Linked APT-C-60 Intensifies Cyber-Espionage Against Japan with Updated SpyGlace Backdoor","The South Korea-aligned cyber-espionage group APT-C-60 has significantly intensified its campaign against Japanese organizations in the third quarter of 2025. According to JPCERT/CC and Cyble, the group has deployed at least three new versions of its custom 'SpyGlace' backdoor. The attackers have evolved their tactics, now attaching malicious VHDX files directly to phishing emails and abusing legitimate services like GitHub and StatCounter for stealthy command-and-control communications and malware delivery, making detection more challenging.",[320,321,322,323,324,325],"APT-C-60","SpyGlace","Cyber-Espionage","VHDX","Living off the Land","Japan",[59,23,57],{"id":328,"slug":329,"headline":330,"title":331,"severity":10,"article_type":11,"excerpt":332,"tags":333,"categories":336,"createdAt":300,"updatedAt":300,"displayDate":301,"isUpdated":27,"readingTime":77},"d193cf8f-d5d4-49ba-b840-001e6cd66454","data-breaches-hit-toys-r-us-askul-verisure","Data Breaches Hit Toys 'R' Us Canada, Askul, and Verisure","Multiple Retail and Service Companies Disclose Data Breaches, Exposing Customer PII","A wave of data breaches has impacted several consumer-facing companies globally. Toys \"R\" Us Canada has had customer records leaked on the dark web. Japanese retailer Askul suffered a disruptive ransomware attack that halted operations and may have resulted in a data leak. Additionally, Swedish security firm Verisure disclosed a breach affecting 35,000 customers via a third-party vendor, and U.S.-based Jewett-Cameron Trading reported the theft of financial documents.",[20,41,122,334,335,52],"Retail","Vendor Breach",[20,122],{"id":338,"slug":339,"headline":340,"title":341,"severity":10,"article_type":11,"excerpt":342,"tags":343,"categories":345,"createdAt":300,"updatedAt":300,"displayDate":301,"isUpdated":27,"readingTime":77},"32f126c4-f07b-4b47-95d4-c2b00c4b6e0b","healthcare-data-breaches-affect-modmed-lifebridge-right-at-home","Healthcare Sector Rocked by Breaches at ModMed, LifeBridge, and Right at Home","Multiple Healthcare Providers and Vendors Announce Data Breaches, Exposing Patient PHI","The healthcare sector continues to be a prime target for cyberattacks, with recent data breaches announced by Electronic Health Record (EHR) provider Modernizing Medicine (ModMed), home healthcare provider Right at Home, and Baltimore-based LifeBridge Health. The incidents, which include a ransomware attack claimed by the Sinobi group and a third-party breach via Oracle Health, have exposed a vast range of sensitive Protected Health Information (PHI), including Social Security numbers, medical diagnoses, and financial data.",[155,20,156,344,122,335,52],"HIPAA",[20,122,218],{"id":347,"slug":348,"headline":349,"title":350,"severity":10,"article_type":11,"excerpt":351,"tags":352,"categories":357,"createdAt":358,"updatedAt":359,"displayDate":261,"isUpdated":112,"readingTime":28},"64168166-52f3-4bb3-81ed-6417726386ea","ransomware-attacks-skyrocket-50-percent-in-2025-qilin-emerges-as-leader","Ransomware Attacks Surge 50% in 2025; Qilin Group Takes the Lead","Ransomware Landscape Shifts as Attacks Increase 50% in 2025, with Qilin and The Gentlemen Emerging as Dominant Threats","Cybersecurity researchers report a staggering 50% increase in ransomware attacks in 2025, with over 5,000 incidents claimed on dark web leak sites by late October. This surge occurs amidst a significant realignment in the ransomware ecosystem, with formerly dominant groups fading while new and resurgent actors like Qilin take their place. The Qilin group has been particularly prolific, leading in victim counts for most of the past six months. The United States remains the most targeted nation, and the industrial sector is the most heavily impacted industry. PowerShell has become the primary tool for attackers, used in nearly 78% of observed campaigns.",[122,280,353,354,355,244,356],"The Gentlemen","PowerShell","Industrial Sector","RaaS",[122,59,244],"2025-10-25T15:00:00.000Z","2025-10-27T12:00:00Z",{"id":361,"slug":362,"headline":363,"title":364,"severity":10,"article_type":11,"excerpt":365,"tags":366,"categories":370,"createdAt":371,"updatedAt":371,"displayDate":372,"isUpdated":27,"readingTime":77},"f3948923-5a86-4219-8437-3ce065cc5cd7","ddos-attack-russian-food-safety-agency-disrupts-supply-chain","DDoS Attack on Russian Food Agency Cripples National Supply Chains","Massive DDoS Attack on Russia's Rosselkhoznadzor Disrupts Food Shipments Nationwide","Russia's federal agency for veterinary and phytosanitary surveillance, Rosselkhoznadzor, has been targeted by a large-scale distributed denial-of-service (DDoS) attack starting October 22, 2025. The attack crippled the agency's critical electronic certification systems, including the 'Mercury' platform, which is essential for tracking animal products. The outage caused significant delays in food shipments from major producers of meat, milk, and baby food across the nation, highlighting the vulnerability of critical national infrastructure to cyberattacks. Russian telecom providers are working to mitigate the attack, for which no group has claimed responsibility.",[367,368,141,369,23],"DDoS","Russia","Food Supply Chain",[23,145,43],"2025-10-26T15:00:00.000Z","Created: Oct 26, 2025",{"id":374,"slug":375,"headline":376,"title":377,"severity":10,"article_type":11,"excerpt":378,"tags":379,"categories":383,"createdAt":371,"updatedAt":371,"displayDate":372,"isUpdated":27,"readingTime":28},"607b1187-f7c0-4705-8a0b-8a8a31841725","safepay-ransomware-targets-german-video-surveillance-firm-xortec","Safepay Ransomware Hits German Surveillance Firm Xortec, Sparking Supply Chain Fears","Safepay Ransomware Claims Attack on German Video Surveillance Provider Xortec, Threatens Data Leak","The Safepay ransomware group has claimed responsibility for a cyberattack against Xortec GmbH, a German provider of professional video surveillance solutions. The group has listed Xortec on its data leak site with a payment deadline of October 27, 2025. This attack raises significant supply chain concerns, as a compromise of a value-added distributor like Xortec could potentially lead to backdoored hardware or software being deployed in sensitive client environments. Safepay is a relatively new but aggressive ransomware-as-a-service (RaaS) operation known for its rapid double-extortion attacks.",[122,380,52,381,382,356],"Safepay","Video Surveillance","Germany",[122,52,59],{"id":385,"slug":386,"headline":387,"title":388,"severity":83,"article_type":11,"excerpt":389,"tags":390,"categories":394,"createdAt":358,"updatedAt":358,"displayDate":395,"isUpdated":27,"readingTime":77},"a84131b0-7a86-4f4f-b172-de636e4531bd","google-patches-critical-rce-flaw-cve-2025-12036-in-chrome-v8-engine","Google Issues Emergency Patch for Critical Chrome RCE Flaw Found by AI","Google Patches Critical Remote Code Execution Vulnerability (CVE-2025-12036) in Chrome's V8 Engine","Google has released an emergency security update for the Chrome browser, addressing a critical remote code execution (RCE) vulnerability in its V8 JavaScript engine. The flaw, tracked as CVE-2025-12036, was discovered by Google's internal AI-driven research project, 'Big Sleep.' Successful exploitation could allow an attacker to execute arbitrary code on a user's system by tricking them into visiting a malicious website. The patch has been rolled out for Windows, macOS, and Linux users, who are urged to update their browsers immediately to mitigate the high-severity threat.",[391,392,184,393,95,175,253],"Google Chrome","V8","CVE-2025-12036",[95,175],"Created: Oct 25, 2025",{"id":397,"slug":398,"headline":399,"title":400,"severity":10,"article_type":250,"excerpt":401,"tags":402,"categories":405,"createdAt":358,"updatedAt":358,"displayDate":395,"isUpdated":27,"readingTime":28},"ddb8e12a-d5dc-4950-ab85-47e4e321b839","nation-state-financial-cybercrime-converge-industrial-sector-targeted","Nation-State and Financial Cybercrime Blur as Industrial Sector Becomes Top Target","Trellix Report: Nation-State Espionage and Financial Cybercrime Converge, with Industrial Sector as Primary Target","A new report from Trellix reveals a significant convergence between the tactics of nation-state actors and financially motivated cybercriminals, with both increasingly leveraging AI-powered tools. The industrial sector has emerged as the most targeted industry, accounting for over 36% of attacks analyzed between April and September 2025. The research highlights the dominance of PowerShell as a key attack tool, used in nearly 78% of ransomware campaigns. The United States remains the most targeted nation, and the ransomware landscape is highly fragmented, with the top five groups accounting for less than 40% of all incidents.",[244,403,89,404,355,142,354],"Trellix","Cybercrime",[244,59,145],{"id":407,"slug":408,"headline":409,"title":410,"severity":208,"article_type":11,"excerpt":411,"tags":412,"categories":417,"createdAt":358,"updatedAt":358,"displayDate":395,"isUpdated":27,"readingTime":77},"bc32a3b6-78e3-4eb9-9776-eafc79c38429","india-implements-new-telecom-cybersecurity-rules-for-imei-and-mobile-validation","India Enacts New Telecom Cybersecurity Rules for IMEI and Mobile Number Validation","India Implements Telecommunications (Telecom Cyber Security) Amendment Rules, 2025","India's Ministry of Communications has enacted new cybersecurity regulations for its telecommunications sector, effective October 22, 2025. The 'Telecommunications (Telecom Cyber Security) Amendment Rules, 2025' introduce two key measures: the establishment of a centralized Mobile Number Validation (MNV) platform to secure digital communications, and stricter controls on International Mobile Equipment Identity (IMEI) numbers. The new IMEI rules prohibit the assignment of already-used IMEIs to new devices and mandate that sellers and buyers of used devices verify the IMEI against a national database to combat theft and tampering.",[413,215,214,414,415,416],"India","Cybersecurity","IMEI","Telecom",[218,43,75],{"id":419,"slug":420,"headline":421,"title":422,"severity":208,"article_type":11,"excerpt":423,"tags":424,"categories":429,"createdAt":358,"updatedAt":358,"displayDate":395,"isUpdated":27,"readingTime":77},"0543b6ff-5b45-4faf-a20a-7deb910574e2","un-convention-against-cybercrime-signed-in-hanoi-vietnam","UN Convention Against Cybercrime Signed in Hanoi Amid Global Endorsement and Controversy","Nearly 100 Nations Sign UN Convention against Cybercrime in Hanoi","In a landmark event in Hanoi, Vietnam, representatives from nearly 100 UN member states have signed the United Nations Convention against Cybercrime. Adopted by the UN General Assembly in December 2024, this treaty, also known as the Hanoi Convention, establishes the first global legal framework for international cooperation in combating a wide array of online crimes, including fraud, child exploitation, and money laundering. While hailed as a milestone by the UN Secretary-General, the event drew criticism from rights groups over the choice of Vietnam as the host, and a major tech industry group, the Cybersecurity Tech Accord, declined to attend.",[425,404,214,426,427,428],"United Nations","Law","International Cooperation","Hanoi Convention",[43,218],{"id":431,"slug":432,"headline":433,"title":434,"severity":208,"article_type":11,"excerpt":435,"tags":436,"categories":444,"createdAt":358,"updatedAt":358,"displayDate":395,"isUpdated":27,"readingTime":77},"e6c6b5a6-f2d4-4822-8a5a-53e7fdceb303","eu-finds-meta-and-tiktok-in-preliminary-breach-of-digital-services-act","EU Accuses Meta and TikTok of Breaching Digital Services Act Transparency Rules","European Commission Finds Meta and TikTok in Preliminary Breach of Digital Services Act (DSA)","The European Commission has issued preliminary findings that Meta's platforms (Facebook and Instagram) and TikTok have breached their obligations under the Digital Services Act (DSA). The Commission alleges the companies failed to provide adequate access to public data for researchers, hindering independent scrutiny of their platforms. Furthermore, Meta is accused of using 'dark patterns' and creating a burdensome process for users to report illegal content. These are initial findings, and both companies will have the opportunity to respond and propose remedies before any final decision or penalties are imposed.",[437,438,439,440,441,215,442,443],"EU","Digital Services Act","DSA","Meta","TikTok","Transparency","Dark Patterns",[218,43],{"id":446,"slug":447,"headline":448,"title":449,"severity":10,"article_type":250,"excerpt":450,"tags":451,"categories":455,"createdAt":456,"updatedAt":457,"displayDate":458,"isUpdated":112,"readingTime":28},"b226db0e-079e-4f27-87c5-f64ddf73203f","ransomware-attacks-on-critical-industries-surge-34-percent","Ransomware Attacks on Critical Industries Skyrocket by 34%, KELA Reports","KELA Report Finds Ransomware Attacks on Critical Infrastructure Surged 34% in 2025, with U.S. as Top Target","A new report from cyber intelligence firm KELA reveals a staggering 34% year-over-year increase in ransomware attacks targeting critical industries between January and September 2025. These vital sectors, including manufacturing, healthcare, and energy, accounted for half of all 4,701 recorded global incidents. The United States was the most heavily targeted nation. The report also highlights the consolidation of the ransomware ecosystem, with just five groups—Qilin, Clop, Akira, Play, and SafePay—responsible for nearly a quarter of all attacks.",[122,452,453,280,121,454,23],"KELA","CriticalInfrastructure","Akira",[122,244,23],"2025-10-21T15:00:00.000Z","2025-10-25T12:00:00Z","Updated: Oct 25, 2025",{"id":460,"slug":461,"headline":462,"title":463,"severity":83,"article_type":166,"excerpt":464,"tags":465,"categories":470,"createdAt":471,"updatedAt":457,"displayDate":458,"isUpdated":112,"readingTime":28},"7f44633c-3e5e-4c37-b430-9657be2823ec","microsoft-october-2025-patch-tuesday-fixes-four-zero-days","Patch Now: Microsoft Fixes 170+ Flaws, Including Four Actively Exploited Zero-Days","Microsoft's October 2025 Patch Tuesday Addresses Over 170 Vulnerabilities, Including Four Zero-Days Under Active Exploitation","Microsoft has released its October 2025 Patch Tuesday update, a massive release fixing over 170 security vulnerabilities across its product ecosystem. The update is critical for all users, as it contains patches for four zero-day vulnerabilities that are being actively exploited in the wild. Two of these flaws, CVE-2025-24990 and CVE-2025-59230, allow for local privilege escalation to Administrator or SYSTEM rights. CISA has added the exploited vulnerabilities to its KEV catalog, mandating urgent patching for federal agencies.",[466,254,87,95,467,468,469,239,226,170],"Patch Tuesday","CVE-2025-24990","CVE-2025-59230","CVE-2025-47827",[175,95],"2025-10-16T15:00:00.000Z",{"id":473,"slug":474,"headline":475,"title":476,"severity":208,"article_type":166,"excerpt":477,"tags":478,"categories":486,"createdAt":487,"updatedAt":488,"displayDate":489,"isUpdated":112,"readingTime":28},"00ce9a8e-670f-4e45-85c4-62808d380e34","uk-government-and-ncsc-urge-businesses-to-bolster-cyber-defenses","UK Gov & NCSC Issue Urgent Warning to FTSE 350 Boards on Cyber Resilience","NCSC and UK Government Urge FTSE 350 to Make Cyber Resilience a Board-Level Priority Amid 50% Rise in Major Incidents","The UK's National Cyber Security Centre (NCSC) and government ministers have sent a formal letter to the leaders of all FTSE 350 companies, demanding that cyber resilience be treated as a top board-level priority. The call to action follows the NCSC's latest annual review, which revealed a 50% increase in significant cyber incidents. The letter outlines three practical steps: adopt the government's Cyber Governance Code, enroll in the NCSC's Early Warning service, and mandate Cyber Essentials certification throughout supply chains.",[479,480,481,482,483,484,485],"NCSC","UK","cyber resilience","governance","board responsibility","FTSE 350","supply chain security",[43,218,242],"2025-10-22T15:00:00.000Z","2025-10-25T00:00:00Z","Updated: Oct 24, 2025",{"id":491,"slug":492,"headline":493,"title":494,"severity":83,"article_type":166,"excerpt":495,"tags":496,"categories":500,"createdAt":501,"updatedAt":501,"displayDate":502,"isUpdated":27,"readingTime":28},"0671f402-6143-4947-ac94-59845c4bd809","google-patches-sixth-actively-exploited-chrome-zero-day-cve-2025-10585","Google Patches 6th Actively Exploited Chrome Zero-Day of 2025","Google Patches Actively Exploited Chrome V8 Zero-Day (CVE-2025-10585)","Google has issued an emergency security update for its Chrome web browser to address CVE-2025-10585, a high-severity type confusion vulnerability in the V8 JavaScript engine. This marks the sixth time in 2025 that Google has patched a Chrome zero-day vulnerability that was being actively exploited in the wild. The flaw could allow an attacker to achieve arbitrary code execution on a victim's machine by tricking them into visiting a malicious website. All users of Chrome and other Chromium-based browsers are urged to update immediately.",[86,87,497,184,498,499],"V8 Engine","Browser Security","CVE-2025-10585",[95,175],"2025-10-24T15:00:00.000Z","Created: Oct 24, 2025",{"id":504,"slug":505,"headline":506,"title":507,"severity":10,"article_type":193,"excerpt":508,"tags":509,"categories":512,"createdAt":501,"updatedAt":501,"displayDate":502,"isUpdated":27,"readingTime":28},"3d18fb6e-61fb-4f9b-9d7d-ecfbdf065b81","agenda-qilin-ransomware-abuses-legit-tools-targets-critical-infrastructure","Agenda Ransomware Evolves, Hits Critical Infrastructure","Agenda (Qilin) Ransomware Abuses Legitimate Tools in Attacks on Critical Infrastructure","The Agenda ransomware group, also known as Qilin, is escalating its attacks by targeting critical infrastructure sectors with evolved tactics. According to research from Trend Micro, the ransomware-as-a-service (RaaS) operation is using a cross-platform approach, abusing legitimate remote management tools and deploying Linux-based ransomware on Windows hosts to evade security. The group also employs Bring Your Own Vulnerable Driver (BYOVD) attacks to neutralize endpoint defenses and steals backup credentials to hinder recovery, primarily targeting high-value organizations in the U.S., Canada, and the U.K.",[510,280,356,511,141],"Agenda Ransomware","BYOVD",[122,59,145],{"id":514,"slug":515,"headline":516,"title":517,"severity":10,"article_type":11,"excerpt":518,"tags":519,"categories":524,"createdAt":501,"updatedAt":501,"displayDate":502,"isUpdated":27,"readingTime":77},"f00d6aa9-669b-48b5-b80d-a83251782af2","tengu-ransomware-claims-attack-on-brazilian-education-provider-unicursos","Tengu Ransomware Hits Brazilian Education Provider","Tengu Ransomware Group Claims Attack on Brazilian Education Provider UniCursos","The Tengu ransomware group has claimed responsibility for a cyberattack against UniCursos, a prominent education provider in Brazil. The attack, which was posted to the group's leak site on October 23, 2025, follows the common double-extortion model, where the attackers threaten to publish sensitive stolen data if their ransom demands are not met. The incident highlights the continued targeting of the education sector by ransomware gangs, who view them as valuable targets due to the sensitive student and staff data they hold.",[520,521,522,523],"Tengu Ransomware","Brazil","Education Sector","Double Extortion",[122,20,23],{"id":526,"slug":527,"headline":528,"title":529,"severity":10,"article_type":11,"excerpt":530,"tags":531,"categories":535,"createdAt":501,"updatedAt":501,"displayDate":502,"isUpdated":27,"readingTime":77},"abec11d8-2962-4148-b105-aeb03ce343b7","jewett-cameron-operations-disrupted-by-ransomware-attack","Ransomware Hits Jewett-Cameron, Steals Financial Data","Jewett-Cameron Manufacturing Disrupted by Ransomware Attack, Financial Data Stolen","Jewett-Cameron, an Oregon-based manufacturing and distribution company, has confirmed in an SEC filing that it suffered a ransomware attack on October 15, 2025. The attack caused significant disruption to its business operations and resulted in the theft of sensitive corporate data. The exfiltrated information reportedly includes IT and financial data being prepared for the company's upcoming Form 10-K filing, as well as screen captures from video meetings. The unidentified attackers have demanded a ransom and threatened to leak the stolen material.",[122,532,533,534],"Manufacturing","SEC Filing","Data Exfiltration",[122,20,23],{"id":537,"slug":538,"headline":539,"title":540,"severity":65,"article_type":11,"excerpt":541,"tags":542,"categories":544,"createdAt":501,"updatedAt":501,"displayDate":502,"isUpdated":27,"readingTime":77},"b4372021-27b6-42ff-9eee-d231fa583f99","lawsuit-filed-against-south-carolina-school-district-after-ransomware-attack","Lawsuit Hits SC School District After Ransomware Breach","Lawsuit Filed Against SC School District Following Ransomware Attack Exposing 31,000+ Records","South Carolina's Lexington-Richland School District 5 (LR5) is facing a class-action lawsuit following a ransomware attack in June 2025 that exposed the personally identifiable information (PII) of over 31,000 students, staff, and alumni. The lawsuit alleges that the school district was negligent in protecting sensitive data and violated state law by failing to provide timely and complete notification of the breach. The compromised data included names, birthdates, Social Security numbers, and financial files, making it one of the most significant breaches for an educational institution in the region.",[20,122,522,543,41],"Lawsuit",[20,122,218],{"id":546,"slug":547,"headline":548,"title":549,"severity":10,"article_type":193,"excerpt":550,"tags":551,"categories":555,"createdAt":501,"updatedAt":501,"displayDate":502,"isUpdated":27,"readingTime":28},"5bb0e2c4-6232-4595-80c7-d354e7ce37e5","north-korean-lazarus-group-targets-european-drone-companies","Lazarus Group's 'Operation DreamJob' Targets EU Drone-Makers","North Korean Lazarus Group Targets European Drone Companies in 'Operation DreamJob'","The notorious North Korea-linked APT group, Lazarus, is conducting a cyber-espionage campaign dubbed 'Operation DreamJob' targeting European defense and aerospace companies. The campaign specifically focuses on firms involved in Unmanned Aerial Vehicle (UAV) technology. The attackers use sophisticated social engineering, creating fake recruiter profiles and job offers to lure employees. The ultimate goal is to compromise the target's network to steal sensitive intellectual property related to advanced drone technology.",[198,552,89,553,554],"Operation DreamJob","Cyber-espionage","Defense Industry",[59,23,76],{"id":557,"slug":558,"headline":559,"title":560,"severity":10,"article_type":166,"excerpt":561,"tags":562,"categories":570,"createdAt":487,"updatedAt":571,"displayDate":572,"isUpdated":112,"readingTime":573},"ced22459-5550-4ad9-bb0d-683544c191e7","iran-linked-muddywater-apt-targets-governments-with-phoenix-backdoor","Iran's MuddyWater APT Targets 100+ Governments with Phoenix Backdoor","MuddyWater Cyber-Espionage Campaign Uses Compromised Mailbox and Macros to Deploy Phoenix v4 Backdoor","The Iranian state-sponsored threat group MuddyWater is conducting a large-scale cyber-espionage campaign targeting over 100 government entities, primarily in the Middle East and North Africa (MENA). According to Group-IB, the attackers are using phishing emails sent from a compromised mailbox, leveraging the NordVPN service for anonymity. The emails contain malicious Word documents that use macros to deploy version 4 of the 'Phoenix' backdoor, a payload designed for foreign intelligence gathering. The campaign highlights the group's return to classic macro-based attack vectors.",[563,89,564,565,566,567,568,569],"MuddyWater","Iran","Phoenix","cyber-espionage","phishing","macros","MENA",[59,23,76],"2025-10-24T00:00:00Z","Updated: Oct 23, 2025",6,{"id":575,"slug":576,"headline":577,"title":578,"severity":65,"article_type":11,"excerpt":579,"tags":580,"categories":586,"createdAt":271,"updatedAt":571,"displayDate":572,"isUpdated":112,"readingTime":28},"3e880826-408a-40ef-aa24-875ee3603b2f","palo-alto-networks-uncovers-smishing-and-gift-card-fraud-campaigns","Unit 42 Exposes 'Smishing Deluge' from China and 'Jingle Thief' Gift Card Fraud","Palo Alto Networks' Unit 42 Details Global Smishing Campaign and Cloud-Based Gift Card Fraud","Researchers at Palo Alto Networks' Unit 42 have detailed two distinct and significant cybercrime operations. The first, a massive smishing campaign dubbed 'The Smishing Deluge,' is attributed to a China-based threat actor and is flooding mobile users globally with malicious SMS messages. The second campaign, named 'Jingle Thief,' is a sophisticated cloud-based operation focused on automating the theft and monetization of gift cards. These findings, highlighted in Unit 42's October Threat Bulletin, showcase the diverse tactics of modern criminals, from large-scale social engineering to highly targeted financial fraud.",[581,76,582,583,584,24,585],"Smishing","Fraud","Gift Card","Unit 42","China",[76,244,24],{"id":588,"slug":589,"headline":590,"title":591,"severity":83,"article_type":166,"excerpt":592,"tags":593,"categories":599,"createdAt":600,"updatedAt":571,"displayDate":572,"isUpdated":112,"readingTime":77},"b7d06076-6ab7-4d40-8dac-1d76d362cb9a","critical-rce-flaw-cve-2025-59287-in-windows-server-update-services","Critical RCE Flaw in WSUS Allows Unauthenticated SYSTEM Takeover","Critical Unauthenticated RCE Vulnerability (CVE-2025-59287, CVSS 9.8) Disclosed in Microsoft WSUS","A critical remote code execution (RCE) vulnerability, CVE-2025-59287, with a CVSS score of 9.8, has been discovered in Microsoft's Windows Server Update Services (WSUS). The flaw allows an unauthenticated attacker on the same network to gain SYSTEM-level privileges on a vulnerable server by sending a maliciously crafted cookie. The vulnerability stems from an unsafe deserialization process. While not yet exploited in the wild, Microsoft rates exploitation as \"more likely.\" Given that compromising WSUS could enable an attacker to distribute malicious updates across an entire enterprise, immediate patching is strongly advised.",[594,595,184,466,596,597,598],"CVE-2025-59287","WSUS","deserialization","critical vulnerability","supply chain",[95,175,52],"2025-10-19T15:00:00.000Z",{"id":602,"slug":603,"headline":604,"title":605,"severity":83,"article_type":11,"excerpt":606,"tags":607,"categories":612,"createdAt":613,"updatedAt":571,"displayDate":572,"isUpdated":112,"readingTime":113},"84f9d81b-d725-46db-8d42-1d5890c64966","prosper-lending-data-breach-affects-17-million","Massive Prosper Data Breach Exposes Social Security Numbers of 17.6 Million Users","Prosper Lending Platform Confirms Major Data Breach Affecting 17.6 Million Individuals","The peer-to-peer lending platform Prosper has confirmed a catastrophic data breach compromising the sensitive personally identifiable information (PII) of approximately 17.6 million people. The exposed data includes full names, physical addresses, IP addresses, income levels, and, most critically, Social Security numbers. The breach, first detected in September 2025, places millions of individuals at severe risk of identity theft and sophisticated financial fraud.",[20,41,608,609,610,611],"Identity Theft","Fintech","Social Security Number","Prosper",[20,76,24],"2025-10-20T15:00:00.000Z",{"id":615,"slug":616,"headline":617,"title":618,"severity":65,"article_type":166,"excerpt":619,"tags":620,"categories":626,"createdAt":271,"updatedAt":271,"displayDate":627,"isUpdated":27,"readingTime":28},"012d902d-8704-41ef-bc55-ae4791f4262f","ny-dfs-issues-guidance-on-third-party-cybersecurity-risks","NY Regulator Puts Financial Firms on Notice: You Are Accountable for Your Vendors' Security","New York DFS Issues Formal Guidance on Managing Third-Party Cybersecurity Risk","The New York State Department of Financial Services (DFS) has issued new guidance for financial institutions, emphasizing their ultimate accountability for managing cybersecurity risks originating from third-party service providers (TPSPs). The regulator warned that as firms increasingly rely on cloud computing, AI, and fintech solutions from vendors, their exposure to threats grows. The guidance explicitly states that boards of directors and senior officers must possess sufficient cybersecurity knowledge to oversee and challenge management's third-party risk strategies. DFS Acting Superintendent Kaitlin Asrow stressed that regulated entities cannot outsource their responsibility for protecting consumer data and ensuring operational security.",[621,215,622,623,624,625],"NYDFS","Compliance","Third-Party Risk Management","Financial Services","Supply Chain",[218,43,52],"Created: Oct 23, 2025",{"id":629,"slug":630,"headline":631,"title":632,"severity":65,"article_type":11,"excerpt":633,"tags":634,"categories":638,"createdAt":271,"updatedAt":271,"displayDate":627,"isUpdated":27,"readingTime":28},"9acb5d41-5105-4901-828a-b644f0b70ffa","september-healthcare-breaches-decline-but-data-incomplete-due-to-shutdown","Healthcare Breaches Seem to Drop, But Government Shutdown Hides True Numbers","September Healthcare Data Breach Numbers Artificially Low Due to HHS Shutdown, HIPAA Journal Warns","Official data for September 2025 shows only 26 major healthcare data breaches, the lowest monthly total since 2018. However, The HIPAA Journal cautions that this apparent decline is misleading. A US government shutdown has largely halted the HHS's Office for Civil Rights (OCR) from processing and updating its public breach portal. The 26 reported breaches affected over 1.29 million individuals, with hacking incidents accounting for 98.8% of the exposed records. Experts believe the true number of breaches for September is significantly higher and will be reflected in a surge of reports once the OCR resumes normal operations.",[344,155,20,635,636,637,622],"HHS","OCR","Government Shutdown",[20,218,43],{"id":640,"slug":641,"headline":642,"title":643,"severity":10,"article_type":11,"excerpt":644,"tags":645,"categories":649,"createdAt":271,"updatedAt":271,"displayDate":627,"isUpdated":27,"readingTime":28},"0614fed7-3fd9-4597-9d52-28405d88a88c","palomar-health-medical-group-discloses-data-breach-affecting-patients","Palomar Health Breach Exposes Highly Sensitive Patient Data, Including Biometrics","Palomar Health Medical Group Discloses Data Breach Exposing Patient Biometric and Financial Data","Palomar Health Medical Group (PHMG), a California-based healthcare provider, has announced it was the victim of a cybersecurity incident that exposed sensitive patient data. The compromised information includes not only names and personal identifiers but also highly sensitive data types such as biometric data, U.S. alien registration numbers, and financial account information. The full scope of the breach, including the number of affected patients, has not yet been disclosed. The national class action law firm Lynch Carpenter is now investigating claims against PHMG, signaling significant legal and financial fallout for the provider.",[20,155,646,344,647,648],"Biometric Data","Palomar Health","California",[20,218],{"id":651,"slug":652,"headline":653,"title":654,"severity":208,"article_type":250,"excerpt":655,"tags":656,"categories":661,"createdAt":456,"updatedAt":663,"displayDate":572,"isUpdated":112,"readingTime":28},"98ff4866-f416-4676-a0fb-980d2637d211","ai-powered-ransomware-outpacing-defenses-crowdstrike-warns","CrowdStrike: 76% of Organizations Can't Keep Pace with AI-Powered Ransomware","AI-Powered Ransomware Outpacing Defenses, CrowdStrike's 2025 State of Ransomware Survey Warns","According to CrowdStrike's '2025 State of Ransomware Survey,' a staggering 76% of global organizations feel their defensive capabilities cannot match the speed and sophistication of AI-powered cyberattacks. Adversaries are now weaponizing artificial intelligence to accelerate every stage of the ransomware attack chain, from malware creation to social engineering, rendering legacy detection methods obsolete. Nearly half of organizations now view AI-automated attacks as their single greatest ransomware threat.",[253,122,657,658,659,660],"CrowdStrike","CybersecuritySurvey","ThreatIntelligence","Deepfakes",[244,122,662],"Other","2025-10-23T12:00:00Z",{"id":665,"slug":666,"headline":667,"title":668,"severity":10,"article_type":166,"excerpt":669,"tags":670,"categories":672,"createdAt":129,"updatedAt":673,"displayDate":674,"isUpdated":112,"readingTime":77},"a610d974-d341-431f-b4f1-8a7c4d1f1760","uk-ncsc-warns-of-rising-supply-chain-attacks-as-significant-incidents-double","UK's NCSC Warns of Doubling 'Nationally Significant' Cyberattacks, Cites Supply Chain Risk","UK NCSC Sounds Alarm as Significant Cyber Incidents Double, Highlighting Supply Chain Vulnerabilities","The UK's National Cyber Security Centre (NCSC) has reported a sharp increase in cyberattacks, with 'nationally significant' cases more than doubling in the past year. In response, the NCSC is urging organizations to bolster their incident preparedness. Experts are pointing to vulnerabilities within the digital supply chain as a primary entry point for these attacks, with service providers like helpdesks becoming gateways to core business systems. A recent survey found that nearly a third of UK procurement managers reported a supply chain partner had been attacked in recent months.",[479,480,52,414,244,671],"Vendor Risk Management",[52,43,23],"2025-10-23T00:00:00Z","Updated: Oct 22, 2025",{"id":676,"slug":677,"headline":678,"title":679,"severity":83,"article_type":166,"excerpt":680,"tags":681,"categories":688,"createdAt":487,"updatedAt":487,"displayDate":689,"isUpdated":27,"readingTime":573},"c2523115-4b81-495d-af64-b12331079d23","critical-zero-day-in-netty-library-allows-email-auth-bypass","Critical Netty Zero-Day Bypasses All Major Email Authentication","CVE-2025-59419: Critical SMTP Injection Flaw in Netty Library Allows Full Bypass of SPF, DKIM, and DMARC","A critical zero-day vulnerability, CVE-2025-59419, has been discovered in the widely used Netty Java library, affecting countless applications that handle email. The flaw allows an unauthenticated attacker to perform SMTP injection by embedding carriage return and line feed characters into email commands. This enables them to bypass standard email authentication defenses like SPF, DKIM, and DMARC, making it possible to send highly convincing spoofed emails that appear to originate from trusted domains. A patch is available and should be applied immediately.",[682,683,186,684,685,686,687,567],"CVE-2025-59419","Netty","zero-day","vulnerability","email security","SMTP injection",[95,76,175],"Created: Oct 22, 2025",{"id":691,"slug":692,"headline":693,"title":694,"severity":83,"article_type":166,"excerpt":695,"tags":696,"categories":700,"createdAt":487,"updatedAt":487,"displayDate":689,"isUpdated":27,"readingTime":28},"e0504a65-01e2-4deb-beac-941a073a0321","oracle-e-business-suite-hit-by-critical-marketing-module-flaws","Patch Now: Critical RCE Flaws in Oracle E-Business Suite Marketing Module","Oracle Patches Two Critical 9.8 CVSS RCE Flaws (CVE-2025-53072, CVE-2025-62481) in E-Business Suite","Oracle has issued urgent patches for two critical, unauthenticated remote code execution (RCE) vulnerabilities in its E-Business Suite. The flaws, CVE-2025-53072 and CVE-2025-62481, both carry a CVSS score of 9.8 and affect the Oracle Marketing module. An attacker with network access can exploit these vulnerabilities via a simple HTTP request, without any user interaction, to achieve a full takeover of the marketing component. Oracle urges customers using affected versions (12.2.3 through 12.2.14) to apply the October 2025 Critical Patch Update immediately.",[697,698,125,126,184,685,699],"CVE-2025-53072","CVE-2025-62481","patch management",[95,175,20],{"id":702,"slug":703,"headline":704,"title":705,"severity":10,"article_type":11,"excerpt":706,"tags":707,"categories":713,"createdAt":487,"updatedAt":487,"displayDate":689,"isUpdated":27,"readingTime":28},"f1c82939-249a-460a-a0a3-ac64a1ff4eb3","pwn2own-ireland-day-1-hackers-earn-522k-for-34-zero-days","Pwn2Own Day 1: Hackers Net $522K for 34 Zero-Days in SOHO Devices","Pwn2Own Ireland 2025 Day 1 Sees Researchers Earn $522,500 for 34 Zero-Days Across Printers, NAS, and Routers","The first day of Trend Micro's Pwn2Own Ireland 2025 competition was a resounding success for security researchers, who earned a total of $522,500 for demonstrating 34 unique zero-day vulnerabilities. In a stunning display, every single one of the 17 scheduled attempts against popular SOHO devices—including printers, NAS devices, and smart home products from brands like QNAP, Synology, Canon, and HP—was successful. The highlight was a complex 'SOHO Smashup' that chained eight bugs to compromise a router and a NAS device.",[708,684,685,709,710,711,712],"Pwn2Own","hacking","IoT","SOHO","ZDI",[95,714,244],"IoT Security",{"id":716,"slug":717,"headline":718,"title":719,"severity":83,"article_type":11,"excerpt":720,"tags":721,"categories":729,"createdAt":456,"updatedAt":456,"displayDate":730,"isUpdated":27,"readingTime":28},"1068c58e-cc4d-4536-9a40-967992ad278e","dhs-breach-fema-cbp-data-exposed-via-citrix-zero-day","DHS Breach: 'CitrixBleed 2.0' Zero-Day Exposes FEMA & CBP Employee Data","U.S. Department of Homeland Security Confirms Data Breach Affecting FEMA and CBP Employees via Citrix 'CitrixBleed 2.0' Zero-Day","A critical zero-day vulnerability in Citrix NetScaler Gateway, dubbed 'CitrixBleed 2.0' (CVE-2025-5777), was exploited to breach the U.S. Department of Homeland Security. The attack, which began in June 2025, compromised the personal and employment data of staff at the Federal Emergency Management Agency (FEMA) and U.S. Customs and Border Protection (CBP). The threat actor gained initial access through FEMA's Region 6 network and moved laterally, leading to significant federal scrutiny and subsequent staff dismissals.",[722,723,724,725,726,727,728],"CitrixBleed","ZeroDay","DataBreach","DHS","FEMA","CBP","RemoteAccess",[20,95,23],"Created: Oct 21, 2025",{"id":732,"slug":733,"headline":734,"title":735,"severity":10,"article_type":11,"excerpt":736,"tags":737,"categories":743,"createdAt":456,"updatedAt":456,"displayDate":730,"isUpdated":27,"readingTime":28},"52268908-1329-472e-97d9-56a009fc7cad","china-linked-apt-salt-typhoon-targets-european-telecom","Chinese APT Salt Typhoon Targets European Telecom with SNAPPYBEE Backdoor","China-Linked Salt Typhoon APT Exploits Citrix Vulnerability to Deploy SNAPPYBEE Backdoor in Attack on European Telecom Firm","The Chinese state-sponsored group Salt Typhoon has been observed targeting a European telecommunications firm by exploiting a known Citrix NetScaler vulnerability for initial access. Post-exploitation, the attackers deployed a backdoor known as SNAPPYBEE (or Deed RAT) using DLL side-loading techniques, hiding the malicious payload alongside legitimate antivirus executables to evade detection. The attack, which was part of a broader cyber-espionage campaign, was detected in its early stages by Darktrace before significant data exfiltration occurred.",[738,89,585,739,740,741,742],"SaltTyphoon","SNAPPYBEE","DLLSideloading","Citrix","Telecommunications",[59,23,57],{"id":745,"slug":746,"headline":747,"title":748,"severity":83,"article_type":11,"excerpt":749,"tags":750,"categories":757,"createdAt":456,"updatedAt":456,"displayDate":730,"isUpdated":27,"readingTime":28},"658ccbb4-5ad7-43e6-a1b0-67e41173d0d2","glassworm-worm-hits-vs-code-devs-in-supply-chain-attack","'GlassWorm' Worm Uses Unicode Obfuscation and Solana C2 in VS Code Supply Chain Attack","Sophisticated 'GlassWorm' Malware Targets Visual Studio Code Developers via OpenVSX Marketplace in Novel Supply Chain Attack","A highly sophisticated, self-propagating worm named 'GlassWorm' is targeting Visual Studio developers through malicious extensions on the OpenVSX marketplace. The malware employs advanced evasion techniques, including using invisible Unicode characters to obfuscate its code and leveraging the Solana blockchain for a resilient command-and-control (C2) infrastructure. The worm is designed to steal NPM, GitHub, and Git credentials, as well as drain cryptocurrency from 49 different wallet extensions.",[751,752,57,753,754,755,756],"GlassWorm","SupplyChainAttack","VSCode","Solana","UnicodeObfuscation","OpenVSX",[52,57,244],{"id":759,"slug":760,"headline":761,"title":762,"severity":10,"article_type":11,"excerpt":763,"tags":764,"categories":770,"createdAt":456,"updatedAt":456,"displayDate":730,"isUpdated":27,"readingTime":28},"a59b59eb-b0df-432c-a8d2-3f0e24d766e1","russian-apt-coldriver-deploys-new-malware-after-disclosure","Russian APT COLDRIVER Rapidly Deploys New NOROBOT Malware After Public Disclosure","Russian State-Sponsored Group COLDRIVER (UNC4057) Deploys NOROBOT and MAYBEROBOT Malware Days After LOSTKEYS Tool Was Exposed","The Russian state-sponsored threat group COLDRIVER, also known as Star Blizzard and UNC4057, has demonstrated remarkable operational agility by deploying new malware families just five days after its LOSTKEYS malware was publicly disclosed in May 2025. According to Google's Threat Intelligence Group (GTIG), the group has ceased using LOSTKEYS and is now actively using a new toolset, including the NOROBOT DLL and a PowerShell backdoor called MAYBEROBOT, to target high-value individuals such as NGOs, policy advisors, and dissidents.",[765,766,767,89,368,768,769,354],"COLDRIVER","UNC4057","StarBlizzard","NOROBOT","MAYBEROBOT",[59,57,23],{"id":772,"slug":773,"headline":774,"title":775,"severity":208,"article_type":166,"excerpt":776,"tags":777,"categories":783,"createdAt":456,"updatedAt":456,"displayDate":730,"isUpdated":27,"readingTime":77},"84ae249e-4bb9-46c8-a8cc-068c05c6caba","uk-financial-regulators-publish-cyber-attack-recovery-guide","UK Regulators Issue Cyber Recovery Guide for Financial Firms","Bank of England, FCA, and PRA Jointly Publish Guide on Effective Cyber Response and Recovery for UK Financial Sector","The United Kingdom's top financial regulators—the Bank of England (BoE), the Financial Conduct Authority (FCA), and the Prudential Regulation Authority (PRA)—have jointly published a guide on effective cyber response and recovery practices. The guidance, aimed at all financial firms, emphasizes the critical need for the ability to recover from severe attacks by using immutable backups, maintaining segregated recovery environments, and conducting rigorous testing of both internal and third-party resilience.",[480,778,218,622,779,780,781,782],"Finance","BankOfEngland","FCA","PRA","IncidentResponse",[43,218,283],{"id":785,"slug":786,"headline":787,"title":788,"severity":208,"article_type":166,"excerpt":789,"tags":790,"categories":793,"createdAt":456,"updatedAt":456,"displayDate":730,"isUpdated":27,"readingTime":794},"9c79ec59-88c5-41c5-b0d3-490ec51c0e5a","eu-launches-cybersecurity-reserve-to-bolster-incident-response","EU Launches Cybersecurity Reserve to Bolster Incident Response Across Member States","European Union Establishes European Cybersecurity Reserve with €36M Budget to Aid Member States During Major Cyber Incidents","The European Union has officially established the European Cybersecurity Reserve as a key component of its Cyber Solidarity Act. Managed by the EU Agency for Cybersecurity (ENISA), the reserve has a €36 million budget and consists of 45 pre-vetted, trusted private providers, such as Airbus Protect and Spike Reply. This 'cyber reinforcement team' is designed to be deployed to assist EU member states and institutions during large-scale cyber incidents affecting critical infrastructure.",[437,414,791,792,782,218],"ENISA","CyberSolidarityAct",[43,218,283],3,{"id":796,"slug":797,"headline":798,"title":799,"severity":10,"article_type":11,"excerpt":800,"tags":801,"categories":806,"createdAt":456,"updatedAt":456,"displayDate":730,"isUpdated":27,"readingTime":28},"17828d55-a6a1-485f-a9ec-3fde7ea33e1e","apt-group-cavalry-werewolf-targets-russian-critical-infrastructure","'Cavalry Werewolf' APT Targets Russian Critical Infrastructure with Custom Malware","APT Group Cavalry Werewolf (YoroTrooper) Targets Russian Public Sector and Critical Industries with Custom Malware and SOCKS5 Proxying","The Advanced Persistent Threat (APT) group known as Cavalry Werewolf (also tracked as YoroTrooper and Silent Lynx) conducted a targeted cyberattack campaign against Russia's public sector and critical industries between May and August 2025. The group leveraged spear-phishing emails to deliver custom malware, including FoalShell and StallionRAT. Post-compromise activities focused on reconnaissance and establishing persistence via Windows Registry modifications, while using SOCKS5 proxies for command-and-control and data exfiltration.",[802,803,89,368,453,804,805],"CavalryWerewolf","YoroTrooper","Spearphishing","SOCKS5",[59,23,57],{"id":808,"slug":809,"headline":810,"title":811,"severity":10,"article_type":166,"excerpt":812,"tags":813,"categories":818,"createdAt":613,"updatedAt":613,"displayDate":819,"isUpdated":27,"readingTime":820},"24aad6c2-8fd6-46f6-9f94-b6734c299ee9","cisa-adds-five-actively-exploited-vulnerabilities-to-kev-catalog","CISA Mandates Patching for 5 New Actively Exploited Flaws in Apple, Microsoft, Oracle, and Kentico","CISA Adds Five Vulnerabilities in Apple, Kentico, Microsoft, and Oracle Products to KEV Catalog","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added five new vulnerabilities to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild. The flaws affect a range of widely used products, including Apple devices, Kentico Xperience, Microsoft Windows SMB Client, and Oracle E-Business Suite. Federal agencies are now mandated to apply patches by a specified deadline, and CISA strongly urges all organizations to prioritize remediation to mitigate significant cyber risk.",[226,170,269,814,815,816,817],"Patching","Vulnerability Management","SSRF","Authentication Bypass",[175,95,218],"Created: Oct 20, 2025",8,{"id":822,"slug":823,"headline":824,"title":825,"severity":10,"article_type":11,"excerpt":826,"tags":827,"categories":833,"createdAt":613,"updatedAt":613,"displayDate":819,"isUpdated":27,"readingTime":573},"abea1fbd-51c7-4ab3-bad5-d84ca955caf3","aws-us-east-1-outage-causes-global-service-disruption","AWS Outage in us-east-1 Knocks Major Global Services Offline","Widespread Internet Outage Linked to AWS us-east-1 Infrastructure Failure","A significant infrastructure fault within Amazon Web Services' (AWS) us-east-1 region in North Virginia on October 20, 2025, triggered a global outage affecting numerous major online services. Platforms including Snapchat, Fortnite, Disney Plus, and various banking applications experienced widespread disruptions. The incident, caused by issues with core services like DynamoDB and EC2, highlights the critical dependency of the digital economy on a few major cloud providers and underscores the importance of robust architectural resilience.",[37,828,24,829,830,831,832],"Outage","Resilience","Business Continuity","us-east-1","Disaster Recovery",[24,283],{"id":835,"slug":836,"headline":837,"title":838,"severity":10,"article_type":11,"excerpt":839,"tags":840,"categories":844,"createdAt":613,"updatedAt":613,"displayDate":819,"isUpdated":27,"readingTime":113},"a60bf688-d593-4d13-9819-969ba474cd9f","anubis-ransomware-targets-australian-engineering-firm","Anubis Ransomware Hits Australian Engineering Firm Aussie Fluid Power","Anubis Ransomware Group Claims Attack on Australian Industrial Firm Aussie Fluid Power","The Australian industrial engineering company, Aussie Fluid Power, has confirmed it was hit by a ransomware attack claimed by the emerging 'Anubis' ransomware group. The incident, which has impacted company operations and stakeholder data, aligns with warnings from the Australian Cyber Security Centre (ACSC) about increasing cyber threats to critical infrastructure and the industrial sector. This attack underscores the growing risk posed by new ransomware gangs targeting operational technology (OT) environments.",[122,841,142,842,843,141],"Anubis","OT Security","Australia",[122,145,23],{"id":846,"slug":847,"headline":848,"title":849,"severity":208,"article_type":11,"excerpt":850,"tags":851,"categories":856,"createdAt":613,"updatedAt":613,"displayDate":819,"isUpdated":27,"readingTime":28},"dafebed1-c56f-4255-990d-877485670002","eu-ukraine-bolster-cyber-cooperation-amidst-russian-threats","EU and Ukraine Deepen Cyber Defense Alliance in Face of Russian Aggression","EU and Ukraine Strengthen Cybersecurity Cooperation at 4th Cyber Dialogue","The European Union and Ukraine have reaffirmed their strategic partnership on cybersecurity during their 4th Cyber Dialogue held in Kyiv. Against the backdrop of Russia's ongoing war, both parties committed to deepening cooperation on cyber defense, policy alignment with EU standards like the NIS2 Directive, and the protection of critical infrastructure. Ukraine will continue to share threat intelligence gained from defending against Russian cyberattacks to bolster the EU's collective security.",[437,852,368,853,854,141,855],"Ukraine","Cyber Diplomacy","NIS2","Cyber Defense",[43,218,244],{"id":858,"slug":859,"headline":860,"title":861,"severity":10,"article_type":11,"excerpt":862,"tags":863,"categories":866,"createdAt":867,"updatedAt":868,"displayDate":869,"isUpdated":112,"readingTime":77},"77c71212-7070-4352-a53b-3845d884de79","lending-platform-prosper-reports-data-breach-affecting-17-million","Lending Platform Prosper Breached, 17.6 Million Accounts Exposed","Prosper Confirms Massive Data Breach Affecting 17.6 Million Users; Data Added to 'Have I Been Pwned'","The peer-to-peer lending platform Prosper has confirmed a massive data breach that exposed the personal and sensitive information of approximately 17.6 million user accounts. The breach notification service 'Have I Been Pwned' has already incorporated the data set, which includes names, email addresses, and phone numbers. The incident places millions of users at a significantly higher risk of targeted phishing campaigns, identity theft, and other fraudulent activities. Affected users are strongly advised to change their passwords and enable multi-factor authentication immediately.",[20,41,611,864,865,608,76],"FinTech","Have I Been Pwned",[20,76,218],"2025-10-17T15:00:00.000Z","2025-10-20T12:00:00Z","Updated: Oct 20, 2025",{"id":871,"slug":872,"headline":873,"title":874,"severity":10,"article_type":11,"excerpt":875,"tags":876,"categories":880,"createdAt":109,"updatedAt":881,"displayDate":882,"isUpdated":112,"readingTime":28},"f7f77e15-89ba-4343-ae20-710a353bb65e","clop-ransomware-gang-claims-breach-of-harvard-university","Clop Ransomware Claims Harvard University Breach, Threatens Data Leak","Notorious Ransomware Group Clop Adds Harvard University to its Dark Web Leak Site","The prolific Russian-speaking ransomware group Clop has claimed responsibility for a cyberattack against Harvard University, adding the prestigious institution to its data leak site on October 12, 2025. The group, known for its 'big-game hunting' and exploitation of zero-day vulnerabilities, threatened to publish stolen data, stating that a torrent link would be available soon. The claim has not yet been confirmed by Harvard. Clop, also known as TA505, has a history of high-profile attacks using double-extortion tactics, including the mass exploitation of flaws in MOVEit Transfer and GoAnywhere MFT, which affected hundreds of organizations worldwide.",[122,121,877,878,36,879,87],"TA505","Harvard University","Big Game Hunting",[122,59,20],"2025-10-20T00:00:00Z","Updated: Oct 19, 2025",{"id":884,"slug":885,"headline":886,"title":887,"severity":83,"article_type":166,"excerpt":888,"tags":889,"categories":893,"createdAt":894,"updatedAt":881,"displayDate":882,"isUpdated":112,"readingTime":28},"e4671433-87a5-4e0e-888e-4068118b7aa4","f5-discloses-nation-state-breach-cisa-issues-emergency-directive","F5 Breached by Nation-State Actor; BIG-IP Source Code Stolen, CISA Issues Emergency Directive","F5 Discloses Major Breach by Nation-State Actor; CISA Issues Emergency Directive After BIG-IP Source Code and Vulnerability Data Exfiltrated","Application security vendor F5 has disclosed a major security breach attributed to a 'highly sophisticated nation-state threat actor.' The attackers maintained long-term access to F5's internal development environments, exfiltrating portions of the BIG-IP source code, information on undisclosed vulnerabilities, and some customer configuration data. While F5 states there is no evidence of software supply chain modification, the incident poses a significant future risk. In response, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued Emergency Directive 26-01, mandating all federal civilian agencies to immediately patch F5 products, inventory devices, and remove end-of-life systems from their networks.",[53,89,890,170,891,892],"Source Code Leak","Emergency Directive","BIG-IP",[52,20,59],"2025-10-14T15:00:00.000Z",{"id":896,"slug":897,"headline":898,"title":899,"severity":10,"article_type":11,"excerpt":900,"tags":901,"categories":905,"createdAt":471,"updatedAt":881,"displayDate":882,"isUpdated":112,"readingTime":28},"b979a5ed-aecc-46a9-b40c-a9d89bc1fbb6","airlines-data-breach-hits-millions-vietnam-airlines-qantas-customers","Massive Airline Data Breach Hits 13 Million Vietnam Airlines and Qantas Customers","Third-Party Breach at Salesforce Partner Exposes Personal Data of 7.3M Vietnam Airlines and 5.7M Qantas Customers","A major data breach originating from a third-party service provider has compromised the personal information of approximately 13 million customers of Vietnam Airlines and Qantas. A group calling itself 'Scattered LAPSUS$ Hunters' claims to have stolen the data in June by breaching the Salesforce accounts of a technology partner used by the airlines. The leaked data includes full names, dates of birth, email addresses, phone numbers, and loyalty program details. Both airlines have confirmed the breach and are urging customers to change their passwords.",[20,902,105,104,903,904,625,41],"Vietnam Airlines","Scattered LAPSUS$ Hunters","Third-Party Risk",[20,52],{"id":907,"slug":908,"headline":909,"title":910,"severity":10,"article_type":11,"excerpt":911,"tags":912,"categories":919,"createdAt":600,"updatedAt":600,"displayDate":920,"isUpdated":27,"readingTime":28},"53fc65f8-66e6-4f19-bad8-821ba6f838a3","simcartel-caas-network-dismantled-in-european-operation","\"SIMCARTEL\" CaaS Network Busted in Major European Takedown","Europol and Partners Dismantle \"SIMCARTEL\" Cybercrime-as-a-Service Platform in Latvia","A coordinated international law enforcement operation codenamed \"SIMCARTEL\" has dismantled a massive Cybercrime-as-a-Service (CaaS) platform operating out of Latvia. The operation, involving authorities from Austria, Estonia, and Finland with support from Europol, resulted in seven arrests and the seizure of a vast infrastructure that enabled millions of euros in financial fraud. The network provided criminals with access to over 40,000 active SIM cards via SIM box devices, which were used to create approximately 49 million fraudulent online accounts, facilitating crimes like phishing, smishing, and investment fraud across Europe.",[913,914,915,916,917,567,918],"CaaS","SIM box","fraud","Europol","law enforcement","smishing",[23,59,43],"Created: Oct 19, 2025",{"id":922,"slug":923,"headline":924,"title":925,"severity":10,"article_type":11,"excerpt":926,"tags":927,"categories":932,"createdAt":600,"updatedAt":600,"displayDate":920,"isUpdated":27,"readingTime":28},"4ea3656f-bb42-49cb-ad29-700a1cb037ec","silver-fox-apt-expands-attacks-to-japan-malaysia","Silver Fox APT Expands Reach, Targets Japan and Malaysia with New RAT","Chinese APT Group \"Silver Fox\" Expands Operations to Japan and Malaysia, Deploying Winos 4.0 and HoldingHands RAT","The Chinese-nexus cybercrime group known as \"Silver Fox\" has expanded its targeting beyond China and Taiwan to include organizations in Japan and Malaysia. Researchers report the group is using phishing emails with malicious PDFs to distribute the HoldingHands RAT. This expansion follows previous campaigns where the group used diverse tactics, including SEO poisoning to spread the Winos 4.0 (ValleyRAT) malware and Bring Your Own Vulnerable Driver (BYOVD) attacks to disable security software. The group's evolving tactics and widening geographic scope indicate an increased threat to government and commercial entities across Asia.",[928,89,929,930,931,511,567],"Silver Fox","Winos 4.0","HoldingHands RAT","cyber espionage",[59,57,23],{"id":934,"slug":935,"headline":936,"title":937,"severity":65,"article_type":11,"excerpt":938,"tags":939,"categories":945,"createdAt":600,"updatedAt":600,"displayDate":920,"isUpdated":27,"readingTime":77},"71714a28-0941-4db6-b9f3-885c45b7cac4","panera-bread-2-5-million-settlement-2024-data-breach","Panera Bread Reaches $2.5M Settlement for 2024 Data Breach","Panera Bread Agrees to $2.5 Million Class-Action Settlement Over March 2024 Data Breach","Panera Bread has agreed to a $2.5 million settlement to resolve a class-action lawsuit related to a data breach that occurred in March 2024. The breach exposed the personal information, including names and Social Security numbers, of approximately 147,321 individuals, primarily current and former employees. Under the settlement, affected individuals can file claims for reimbursement of expenses and time spent dealing with the breach's aftermath, with a claim deadline of November 11, 2025.",[940,941,942,943,41,944],"data breach","settlement","class action","Panera Bread","Social Security Numbers",[20,218,43],{"id":947,"slug":948,"headline":949,"title":950,"severity":10,"article_type":11,"excerpt":951,"tags":952,"categories":958,"createdAt":600,"updatedAt":600,"displayDate":920,"isUpdated":27,"readingTime":28},"29ffa8db-78c4-4ff3-ad19-5d6abd25dbd4","volkswagen-investigates-8base-ransomware-attack-claim","Volkswagen Probes 8Base Ransomware Attack Claim","Volkswagen Investigates Data Breach Claim by 8Base Ransomware Group","The Volkswagen Group is investigating a claim from the 8Base ransomware group that it has breached the automotive giant and stolen sensitive data. 8Base, a data extortion group linked to Phobos ransomware, posted a trove of allegedly stolen files on its dark web site, including accounting documents and employee contracts. Volkswagen stated its core IT systems are secure but acknowledged the possibility of a breach through a third-party supplier, highlighting the growing threat of supply chain attacks. The incident places Volkswagen under potential GDPR scrutiny.",[953,954,955,940,598,956,957],"8Base","ransomware","Volkswagen","GDPR","Phobos",[122,20,52],{"id":960,"slug":961,"headline":962,"title":963,"severity":65,"article_type":193,"excerpt":964,"tags":965,"categories":970,"createdAt":894,"updatedAt":971,"displayDate":972,"isUpdated":112,"readingTime":28},"d740524d-7930-40a4-b514-744c6f7ef440","mysterious-elephant-apt-deploys-custom-tools-against-south-asian-governments","'Mysterious Elephant' APT Evolves, Deploys Custom Tools in Espionage Campaign","'Mysterious Elephant' APT Shifts to Custom Malware in Cyber-Espionage Campaign Targeting South Asian Governments","The cyber-espionage group known as 'Mysterious Elephant' has demonstrated a significant evolution in its capabilities, moving away from recycled malware to deploying its own custom-developed tools. Since early 2025, the APT group has been targeting government and diplomatic entities in South Asia. This strategic shift indicates an increased level of sophistication and investment, allowing the group to create more effective and evasive malware for its intelligence-gathering operations. The campaign poses a notable threat to the targeted governments and may have indirect implications for European nations with interests in the region.",[89,966,553,967,968,969],"Mysterious Elephant","Custom Malware","South Asia","Government",[59,244],"2025-10-19T00:00:00Z","Updated: Oct 18, 2025",{"id":974,"slug":975,"headline":976,"title":977,"severity":83,"article_type":166,"excerpt":978,"tags":979,"categories":983,"createdAt":867,"updatedAt":971,"displayDate":972,"isUpdated":112,"readingTime":28},"3c60bed5-8cff-4ab9-85de-0875f49717b1","microsoft-october-2025-patch-tuesday-fixes-172-flaws-and-three-zero-days","Microsoft Patches 172 Flaws, Including Three Actively Exploited Zero-Days","Microsoft's October 2025 Patch Tuesday Addresses Over 172 Vulnerabilities, Three Zero-Days, and Critical WSUS Flaw","Microsoft's October 2025 Patch Tuesday update is one of the largest of the year, addressing over 172 vulnerabilities across its product suite. The release is critically important as it includes patches for three zero-day vulnerabilities under active attack. These include an elevation of privilege flaw in the Windows Remote Access Connection Manager (CVE-2025-59230), which has been added to CISA's KEV catalog. Additionally, a highly critical, pre-authentication remote code execution vulnerability (CVE-2025-59287) in the Windows Server Update Service (WSUS) with a 9.8 CVSS score requires immediate attention. The update also marks the final security patch for most versions of Windows 10, pushing organizations towards migration.",[466,87,184,980,981,982,595,170,226],"EoP","Windows 10","Windows 11",[175,95,242],{"id":985,"slug":986,"headline":987,"title":988,"severity":83,"article_type":166,"excerpt":989,"tags":990,"categories":999,"createdAt":129,"updatedAt":129,"displayDate":1000,"isUpdated":27,"readingTime":28},"4b0d5163-fb73-4372-9e0c-c5fd4952cdb9","cisco-zero-day-cve-2025-20352-exploited-to-deploy-linux-rootkits-on-switches","Cisco Zero-Day Flaw Actively Exploited to Implant Linux Rootkits on Network Switches","Cisco Zero-Day (CVE-2025-20352) Exploited in 'ZeroDisco' Operation to Deploy Linux Rootkits on Network Switches","A critical zero-day vulnerability in Cisco IOS and IOS XE software, tracked as CVE-2025-20352, has been actively exploited in the wild to install Linux rootkits on network devices. The campaign, dubbed 'ZeroDisco' by Trend Micro, targeted Cisco 9400, 9300, and 3750G series switches. The attackers leveraged the SNMP stack overflow flaw for remote code execution after obtaining high-privilege credentials, implanting a fileless rootkit that could evade detection by disappearing after a reboot. Cisco has released patches and urges customers to update affected devices immediately.",[991,87,992,993,994,995,95,996,997,998],"Cisco","CVE-2025-20352","Rootkit","Linux","SNMP","ZeroDisco","IOS","IOS XE",[95,23,57],"Created: Oct 18, 2025",{"id":1002,"slug":1003,"headline":1004,"title":1005,"severity":10,"article_type":11,"excerpt":1006,"tags":1007,"categories":1012,"createdAt":129,"updatedAt":129,"displayDate":1000,"isUpdated":27,"readingTime":77},"ead32ea2-3e1d-4365-a1fb-5d0fe95236dc","deloitte-agrees-to-6-3-million-settlement-for-rhode-island-data-breach","Deloitte to Pay $6.3M in Settlement for Rhode Island Data Breach Affecting 640,000","Deloitte Reaches $6.3 Million Proposed Settlement in Class-Action Lawsuit Over Rhode Island Data Breach","Deloitte has agreed to a proposed $6.3 million class-action settlement related to a 2024 cyberattack that compromised the personal data of 640,000 Rhode Island residents—nearly half the state's population. The breach affected the state's 'RIBridges' social services system, which was managed by Deloitte. The incident resulted in significant disruption to state government services and the eventual leak of some compromised data on the dark web. This settlement is in addition to a previous $5 million payment Deloitte made to the state to cover breach-related expenses.",[20,1008,1009,1010,1011,969,41,107],"Deloitte","Rhode Island","Settlement","Class Action",[20,218,43],{"id":1014,"slug":1015,"headline":1016,"title":1017,"severity":65,"article_type":11,"excerpt":1018,"tags":1019,"categories":1025,"createdAt":129,"updatedAt":129,"displayDate":1000,"isUpdated":27,"readingTime":77},"b3592b17-d8af-4f58-8b45-3c01c8c441e9","new-capi-backdoor-malware-targets-russian-auto-and-e-commerce-sectors","New 'CAPI Backdoor' Malware Targets Russian Auto and E-Commerce Firms","New CAPI Backdoor Phishing Campaign Targets Russian Automobile and E-Commerce Industries","A new cyberespionage campaign is targeting the Russian automobile and e-commerce sectors using a previously undocumented .NET malware known as 'CAPI Backdoor'. According to researchers at Seqrite Labs, the attack is initiated through phishing emails containing a ZIP archive with a malicious LNK file. The malware uses a living-off-the-land technique, executing via 'rundll32.exe', and establishes persistence through scheduled tasks and startup folder entries. CAPI Backdoor is designed to gather system information, check for antivirus products, and exfiltrate data to a C2 server.",[1020,57,1021,76,1022,368,1023,1024],"CAPI Backdoor",".NET","Cyber Espionage","LotL","rundll32",[57,76,59],{"id":1027,"slug":1028,"headline":1029,"title":1030,"severity":10,"article_type":11,"excerpt":1031,"tags":1032,"categories":1036,"createdAt":129,"updatedAt":129,"displayDate":1000,"isUpdated":27,"readingTime":77},"afa8a3d8-4a04-4c2b-9648-74743c13bb28","everest-ransomware-claims-collins-aerospace-breach-then-site-goes-offline","Everest Ransomware Claims Collins Aerospace Hack; Leak Site Mysteriously Goes Offline","Everest Ransomware Group Takes Credit for Collins Aerospace Breach, Then Its Data Leak Site Goes Offline","The Everest ransomware group has claimed responsibility for the September 2025 cyberattack on Collins Aerospace, a major aviation and defense contractor. The attack caused widespread disruption, affecting check-in and boarding systems at major European airports like Heathrow and Brussels. Shortly after posting the claim on its dark web data leak site, the site became inaccessible, displaying a \"Fatal error\" message. This has fueled speculation about a potential law enforcement takedown or internal disruption within the ransomware group.",[139,122,1033,1034,52,1035,23],"Collins Aerospace","Aviation","Heathrow",[122,23,52],{"id":1038,"slug":1039,"headline":1040,"title":1041,"severity":83,"article_type":11,"excerpt":1042,"tags":1043,"categories":1048,"createdAt":129,"updatedAt":129,"displayDate":1000,"isUpdated":27,"readingTime":77},"5f0b563c-bc1f-42b7-abaf-cd1098d10d5e","critical-supply-chain-risk-uncovered-in-vscode-extension-marketplaces","Massive Supply Chain Risk Found in VSCode Marketplace; 100+ Extensions Leaked Access Tokens","Critical Supply Chain Risk Uncovered in VSCode Extension Marketplaces, Potentially Affecting 150,000 Users","Researchers at Wiz have discovered a significant supply chain risk in the popular VSCode and OpenVSX extension marketplaces. They found that publishers of over 100 extensions had inadvertently leaked their access tokens, which could have allowed attackers to hijack the extensions and distribute malware to more than 150,000 users. The research also uncovered over 550 exposed secrets within 500+ extensions, providing access to developer accounts on services like AWS, GitHub, and OpenAI, further highlighting the pervasive security risks in the software development ecosystem.",[753,52,1044,1045,1046,1047,95],"Wiz","Secrets Management","DevSecOps","GitHub",[52,95,24],{"id":1050,"slug":1051,"headline":1052,"title":1053,"severity":208,"article_type":250,"excerpt":1054,"tags":1055,"categories":1058,"createdAt":1059,"updatedAt":1060,"displayDate":972,"isUpdated":112,"readingTime":77},"8a4fabd5-07e0-44e4-bc44-b2ff1c88d744","uk-ncsc-reports-nationally-significant-cyberattacks-more-than-doubled","UK's NCSC Warns of 'Alarming' Rise in Cyberattacks, Doubling in Past Year","UK's National Cyber Security Centre Reports \"Nationally Significant\" Cyberattacks More Than Doubled","The UK's National Cyber Security Centre (NCSC) revealed in its 2025 annual review that it managed 204 \"nationally significant\" cyberattacks over the past year, more than double the 89 incidents from the previous year. The agency attributed the alarming surge to increasing threats from state-sponsored actors, particularly Russia and China, as well as the proliferation of sophisticated ransomware gangs. The NCSC has urged UK businesses to treat cybersecurity as a matter of survival and to elevate cyber resilience to a board-level responsibility to combat the growing threat.",[479,480,1056,1057,122,214],"Threat Report","State-Sponsored Hacking",[43,218,244],"2025-10-06T15:00:00.000Z","2025-10-18T12:00:00Z",{"id":1062,"slug":1063,"headline":1064,"title":1065,"severity":10,"article_type":250,"excerpt":1066,"tags":1067,"categories":1070,"createdAt":867,"updatedAt":1060,"displayDate":972,"isUpdated":112,"readingTime":77},"2fb9c34f-89ef-4d9f-a17f-952f8c7a5912","ransomware-attacks-surged-36-percent-in-q3-2025","Ransomware Attacks Surge 36% in Q3 2025, Data Stolen in 96% of Cases","BlackFog Report: Ransomware Attacks Rose 36% in Q3 2025, Qilin Most Active Group","A new report from cybersecurity firm BlackFog reveals that publicly disclosed ransomware attacks surged by 36% year-over-year in the third quarter of 2025, setting a new record. The analysis highlights the near-universal adoption of double-extortion tactics, with data exfiltration occurring in 96% of all incidents. The Qilin ransomware group was identified as the most active publicly attributed gang. Healthcare remained the most targeted public sector, while manufacturing was the hardest-hit sector in non-disclosed attacks, underscoring the pervasive and growing threat of ransomware across all industries.",[122,244,1068,1069,280,534,155],"Q3 2025","BlackFog",[122,244,59],{"id":1072,"slug":1073,"headline":1074,"title":1075,"severity":83,"article_type":166,"excerpt":1076,"tags":1077,"categories":1080,"createdAt":867,"updatedAt":867,"displayDate":1081,"isUpdated":27,"readingTime":77},"d54e7f58-bcf0-4bfb-96f6-770af82906f7","cisa-warns-of-actively-exploited-adobe-aem-flaw-with-cvss-10","CISA Warns: Critical Adobe AEM Flaw (CVSS 10.0) Actively Exploited","CISA Adds Critical Adobe Experience Manager RCE Flaw (CVE-2025-54253) to KEV Catalog","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued an urgent warning for a critical remote code execution (RCE) vulnerability in Adobe Experience Manager (AEM) Forms, tracked as CVE-2025-54253. The flaw, which carries a perfect 10.0 CVSS score, allows for unauthenticated arbitrary code execution and is being actively exploited in the wild. CISA has added it to its Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to patch by November 5, 2025. The vulnerability stems from a misconfiguration in JEE versions of AEM that exposes a debug servlet, allowing attackers to achieve full system compromise.",[297,1078,184,170,226,1079,87,95],"AEM","CVSS 10",[95,175,23],"Created: Oct 17, 2025",{"id":1083,"slug":1084,"headline":1085,"title":1086,"severity":65,"article_type":11,"excerpt":1087,"tags":1088,"categories":1092,"createdAt":867,"updatedAt":867,"displayDate":1081,"isUpdated":27,"readingTime":77},"dd6fafd8-133a-4333-abeb-59d47c331248","uk-regulator-fines-capita-14-million-for-preventable-2023-data-breach","UK Fines Capita £14M for \"Preventable\" 2023 Data Breach","UK's ICO Fines Capita £14 Million for Failures in 2023 Data Breach Response","The UK's Information Commissioner's Office (ICO) has levied a £14 million fine against outsourcing giant Capita for significant data protection failures related to a March 2023 data breach that impacted 6.6 million people. The ICO's investigation concluded the breach was 'preventable' and heavily criticized Capita's slow incident response, noting that a compromised device remained active on the network for 58 hours after detection, allowing for further exploitation. The penalty highlights the increasing regulatory focus on the speed and efficacy of breach containment.",[1089,1090,20,218,283,1091,480],"ICO","Fine","Capita",[218,43,20],{"id":1094,"slug":1095,"headline":1096,"title":1097,"severity":10,"article_type":166,"excerpt":1098,"tags":1099,"categories":1103,"createdAt":867,"updatedAt":867,"displayDate":1081,"isUpdated":27,"readingTime":77},"8e174e01-1d55-4cb7-ac57-c2a550178fe0","cisa-issues-13-advisories-for-industrial-control-systems","CISA Issues 13 Advisories for Critical ICS/OT Vulnerabilities","CISA Publishes 13 ICS Advisories for Flaws in Rockwell, Siemens, and Schneider Electric Products","On October 16, 2025, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) released a significant batch of thirteen advisories for vulnerabilities affecting Industrial Control Systems (ICS). These alerts impact widely used Operational Technology (OT) products from major vendors including Rockwell Automation, Siemens, Hitachi Energy, Schneider Electric, and Delta Electronics. The flaws pose a direct risk to critical infrastructure sectors such as manufacturing and energy. CISA is urging all asset owners and operators to review the advisories and implement the recommended mitigations immediately.",[142,169,1100,170,95,141,1101,1102],"SCADA","Siemens","Rockwell Automation",[145,95,175],{"id":1105,"slug":1106,"headline":1107,"title":1108,"severity":65,"article_type":11,"excerpt":1109,"tags":1110,"categories":1115,"createdAt":867,"updatedAt":867,"displayDate":1081,"isUpdated":27,"readingTime":77},"117f1c92-ad99-474d-886e-fe148bfd4bde","california-enacts-stricter-data-breach-law-30-day-notification","California Enacts Stricter Data Breach Law with 30-Day Notification Deadline","California's New Senate Bill 446 Mandates 30-Day Data Breach Notification","California has enacted Senate Bill 446, a new law that significantly shortens the data breach notification timeline for businesses. Organizations must now inform affected California residents of a data breach involving unencrypted personal information within 30 calendar days of its discovery. This amendment to the state's already stringent privacy laws places increased pressure on companies to have highly efficient incident detection and response processes in place to meet the accelerated deadline.",[648,1111,1112,1113,1114,218,622],"Data Breach Notification","Privacy Law","CCPA","CPRA",[218,43,20],{"id":1117,"slug":1118,"headline":1119,"title":1120,"severity":208,"article_type":250,"excerpt":1121,"tags":1122,"categories":1125,"createdAt":1126,"updatedAt":1127,"displayDate":1128,"isUpdated":112,"readingTime":77},"420fec70-a0d6-4f48-8322-6d5bb8ccaa49","ransomware-attacks-surge-46-percent-construction-manufacturing-hit-hardest","Ransomware Attacks Surge by 46% as Threat Actors Target Construction and Manufacturing","Check Point Report Shows 46% Surge in Ransomware Activity, with Qilin Group Leading Attacks on Industrial Sectors","Despite a slight decrease in overall weekly cyber attacks, ransomware activity has surged by 46%, according to a new report from Check Point Research. This indicates a strategic shift by threat actors towards more focused and impactful ransomware campaigns. The construction, business services, and industrial manufacturing sectors have been the most victimized, bearing the brunt of this new wave. The report identifies the Qilin ransomware-as-a-service (RaaS) group as one of the most prominent actors, responsible for 14.1% of publicly disclosed victims. The findings highlight an urgent need for organizations, especially in the industrial and business services sectors, to bolster their defenses against an increasingly targeted ransomware threat.",[122,244,1123,280,532,1124],"Check Point","Construction",[122,244],"2025-10-15T15:00:00.000Z","2025-10-17T12:00:00Z","Updated: Oct 17, 2025",{"id":1130,"slug":1131,"headline":1132,"title":1133,"severity":83,"article_type":11,"excerpt":1134,"tags":1135,"categories":1140,"createdAt":1141,"updatedAt":1142,"displayDate":1143,"isUpdated":112,"readingTime":573},"d50b2ed9-7abd-4058-bdf5-bd2350b87674","akira-ransomware-exploits-sonicwall-ssl-vpn-devices","Akira Ransomware Gang Actively Exploiting SonicWall VPNs for Network Breaches","Akira Ransomware Group Targets SonicWall SSL VPN Devices for Initial Access","The Akira ransomware group is actively exploiting vulnerabilities in SonicWall SSL VPN devices to gain initial access to corporate networks. By targeting these widely used, internet-facing appliances, the threat actors can establish a foothold, move laterally, exfiltrate sensitive data, and ultimately deploy the Akira ransomware payload. This campaign underscores the critical importance of promptly patching edge devices and enforcing multi-factor authentication for all remote access solutions to defend against sophisticated ransomware attacks.",[454,954,1136,1137,1138,1139],"SonicWall","VPN","initial access","double extortion",[122,23,95],"2025-10-11T15:00:00.000Z","2025-10-17T00:00:00Z","Updated: Oct 16, 2025",{"id":1145,"slug":1146,"headline":1147,"title":1148,"severity":83,"article_type":166,"excerpt":1149,"tags":1150,"categories":1154,"createdAt":471,"updatedAt":1142,"displayDate":1143,"isUpdated":112,"readingTime":573},"07ee8e3b-f105-4c42-9e2d-c027905f5e56","cisa-issues-emergency-directive-after-nation-state-actor-steals-f5-source-code","CISA Orders Urgent Patching After Chinese Hackers Steal F5 Source Code","Nation-State Actor Breaches F5, Stealing BIG-IP Source Code and Undisclosed Vulnerabilities, CISA Issues Emergency Directive","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued Emergency Directive 26-01, ordering federal agencies to take immediate action after F5 disclosed a severe breach by a sophisticated nation-state actor, reportedly linked to China. The attackers maintained access for at least a year, exfiltrating proprietary source code for F5 BIG-IP products and details of unpatched vulnerabilities. This breach poses an imminent supply chain risk, as the stolen data could allow adversaries to craft powerful zero-day exploits against F5 customers worldwide, including government and critical infrastructure.",[1151,892,170,891,1152,52,1153,585,87],"F5","Source Code","Nation-State Actor",[52,20,59],{"id":1156,"slug":1157,"headline":1158,"title":1159,"severity":10,"article_type":11,"excerpt":1160,"tags":1161,"categories":1166,"createdAt":471,"updatedAt":471,"displayDate":1167,"isUpdated":27,"readingTime":28},"473606c9-f272-475b-87cf-94cbf3c8fdc8","microsoft-disrupts-vanilla-tempest-ransomware-campaign-by-revoking-certificates","Microsoft Thwarts Ransomware Campaign by Revoking 200+ Malicious Code-Signing Certificates","Microsoft Disrupts Vanilla Tempest (Vice Society) by Revoking Over 200 Code-Signing Certificates Used to Sign Fake Microsoft Teams Installers","Microsoft has taken decisive action to disrupt a ransomware campaign by the threat group Vanilla Tempest (also known as Vice Society), which has been targeting education and healthcare. The group was using over 200 fraudulently obtained code-signing certificates to sign counterfeit Microsoft Teams installers. These fake installers delivered the Oyster backdoor, which in turn deployed the Rhysida ransomware. By revoking the certificates from providers like DigiCert, SSL.com, and its own Trusted Signing service, Microsoft has significantly hindered the malware's ability to evade detection.",[122,1162,1163,1164,56,1165,57,254],"Vanilla Tempest","Vice Society","Rhysida","Microsoft Teams",[122,59,57],"Created: Oct 16, 2025",{"id":1169,"slug":1170,"headline":1171,"title":1172,"severity":83,"article_type":166,"excerpt":1173,"tags":1174,"categories":1178,"createdAt":471,"updatedAt":471,"displayDate":1167,"isUpdated":27,"readingTime":28},"ead93c2b-2c75-4ad8-b7b8-6945f0f2226c","two-cvss-10-flaws-disclosed-in-red-lion-industrial-rtus","Full Industrial Control: Two CVSS 10.0 Flaws Found in Red Lion ICS RTUs","Researchers Disclose Two CVSS 10.0 Vulnerabilities in Red Lion Industrial RTUs, Allowing Unauthenticated Remote Code Execution","Security researchers have discovered and disclosed two critical vulnerabilities, both rated CVSS 10.0, in Red Lion Sixnet series industrial remote terminal units (RTUs). The flaws, CVE-2023-42770 (authentication bypass) and CVE-2023-40151 (remote code execution), can be chained together. An unauthenticated attacker can exploit them over the network to execute arbitrary commands with root privileges on affected devices, which are commonly used in critical infrastructure sectors like energy and water treatment, posing a risk of severe physical disruption.",[142,842,95,141,1079,1175,1176,1177,184],"Red Lion","CVE-2023-42770","CVE-2023-40151",[145,95,23],{"id":1180,"slug":1181,"headline":1182,"title":1183,"severity":10,"article_type":11,"excerpt":1184,"tags":1185,"categories":1190,"createdAt":471,"updatedAt":471,"displayDate":1167,"isUpdated":27,"readingTime":573},"f21772cf-7e31-48e8-983e-934a9b79b31c","new-linkpro-linux-rootkit-uses-ebpf-to-hide-from-security-tools","New 'LinkPro' Linux Rootkit Uses eBPF and 'Magic Packets' for Ultimate Stealth","Novel 'LinkPro' Linux Rootkit Discovered Using eBPF for Stealth and Remote Activation via Magic Packet","Security researchers have uncovered a sophisticated new GNU/Linux rootkit named 'LinkPro' after investigating a compromised AWS environment. The malware demonstrates advanced stealth capabilities by leveraging extended Berkeley Packet Filter (eBPF) modules to hide its processes and files from security tools. Furthermore, it employs a novel activation mechanism, lying dormant until it receives a specially crafted 'magic packet' over the network. The initial intrusion vector was a vulnerable Jenkins server, from which the attackers deployed the rootkit via a malicious Docker image.",[1186,994,993,1187,57,24,37,1188,1189],"LinkPro","eBPF","Jenkins","Docker",[57,24],{"id":1192,"slug":1193,"headline":1194,"title":1195,"severity":10,"article_type":11,"excerpt":1196,"tags":1197,"categories":1198,"createdAt":894,"updatedAt":1199,"displayDate":1143,"isUpdated":112,"readingTime":77},"b83fea03-c19f-4d8d-97c8-bb739db82367","qilin-ransomware-group-claims-new-victims","Qilin Ransomware Group Adds New Victims to Leak Site","Qilin Ransomware Group Continues Attacks, Listing New U.S. Victims on Data Leak Site","The Qilin ransomware-as-a-service (RaaS) operation continues its campaign of double extortion, recently adding new victims to its data leak site. Among the latest targets are U.S.-based electrical equipment manufacturer Beta Dyne and Middlesex Appraisal Associates. According to research from Resecurity, the group's operational resilience is bolstered by its use of a global network of bulletproof hosting providers, making its infrastructure difficult to disrupt. The group's continued activity poses a persistent threat to organizations across various sectors, leveraging data encryption and the threat of public data release to pressure victims into paying ransoms.",[122,280,356,523,36],[122,59],"2025-10-16T09:00:00Z",{"id":1201,"slug":1202,"headline":1203,"title":1204,"severity":10,"article_type":11,"excerpt":1205,"tags":1206,"categories":1207,"createdAt":109,"updatedAt":1208,"displayDate":1209,"isUpdated":112,"readingTime":28},"56b670f7-cd05-425d-859b-1e4386e76e40","vietnam-airlines-hit-by-massive-data-breach-affecting-7-3m-customers","Vietnam Airlines Breach: 7.3M Customer Records Exposed in Salesforce Supply Chain Attack","Data of 7.3 Million Vietnam Airlines Customers Leaked in Attack by 'Scattered LAPSUS$ Hunters'","Vietnam Airlines has suffered a massive data breach exposing the records of 7.3 million unique customers. The attack, revealed on October 11, 2025, is attributed to the 'Scattered LAPSUS$ Hunters' hacking group, the same collective behind the recent Qantas breach. The compromise occurred in June 2025 when attackers gained access to the airline's Salesforce-based CRM platform. The stolen data, which includes 7.3 million unique email addresses and other personal details, was released in October. The incident highlights the growing threat of supply chain attacks targeting major software vendors like Salesforce to compromise their extensive client bases. The airline's delayed response has drawn criticism for a lack of transparency.",[20,52,902,104,903,41],[20,52,59],"2025-10-16T00:00:00Z","Updated: Oct 15, 2025",{"id":1211,"slug":1212,"headline":1213,"title":1214,"severity":65,"article_type":11,"excerpt":1215,"tags":1216,"categories":1220,"createdAt":1126,"updatedAt":1126,"displayDate":1221,"isUpdated":27,"readingTime":77},"c83560a8-cf9b-418c-9a42-66ccca1d1e9e","canadian-tire-discloses-e-commerce-customer-data-breach","Canadian Tire Reveals E-Commerce Data Breach Affecting Multiple Retail Brands","Canadian Tire Corp. Discloses Data Breach Impacting Online Customers of Canadian Tire, SportChek, and Mark's","Canadian Tire Corp., a major Canadian retail conglomerate, has reported a data breach affecting its e-commerce customers. Discovered on October 2, 2025, the incident involved unauthorized access to a single database serving multiple brands, including Canadian Tire, SportChek, Mark's/L'Équipeur, and Party City. The exposed data includes customer names, addresses, email addresses, and years of birth. The company stated that financial data and its Triangle Rewards loyalty program were not impacted. For a subset of fewer than 150,000 customers whose full birth dates were exposed, Canadian Tire is offering complimentary credit monitoring services.",[20,334,41,1217,1218,1219],"Canadian Tire","Canada","E-commerce",[20,218],"Created: Oct 15, 2025",{"id":1223,"slug":1224,"headline":1225,"title":1226,"severity":10,"article_type":193,"excerpt":1227,"tags":1228,"categories":1231,"createdAt":1126,"updatedAt":1126,"displayDate":1221,"isUpdated":27,"readingTime":28},"58c091b3-c8ec-4bd4-8b36-ab83e7741476","lockbit-ransomware-returns-with-upgraded-version-5-0","LockBit Ransomware Returns from Hiatus with Upgraded 'Version 5.0'","Notorious LockBit Ransomware Group Resurfaces with Upgraded LockBit 5.0 Malware Featuring Anti-Analysis Capabilities","After a two-month hiatus following law enforcement disruption, the prolific LockBit ransomware group has returned, announcing the release of LockBit 5.0. This new version of the ransomware-as-a-service (RaaS) malware incorporates significant technical upgrades designed to evade detection and analysis. According to researchers, a key new feature is the ability to patch Event Tracing for Windows (ETW), a technique that blinds security monitoring tools by altering in-memory logging. The upgraded malware is designed for cross-platform attacks, targeting Windows, Linux, and VMware ESXi environments, signaling LockBit's intent to reclaim its dominant position in the cybercrime ecosystem.",[281,122,356,57,1229,1230,404],"ETW","ESXi",[122,57,59],{"id":1233,"slug":1234,"headline":1235,"title":1236,"severity":10,"article_type":11,"excerpt":1237,"tags":1238,"categories":1243,"createdAt":1126,"updatedAt":1126,"displayDate":1221,"isUpdated":27,"readingTime":77},"183e3e90-d37a-4f64-8c08-2ec4c099a1db","israeli-defense-firm-maya-targeted-in-hacktivist-attack","Israeli Defense R&D Firm 'MAYA' Targeted in Pro-Resistance Hacktivist Attack","Hacktivist Group 'Cyber Support Front' Claims Cyberattack on Israeli Defense R&D Firm MAYA","A hacktivist group calling itself the 'Cyber Support Front' has claimed responsibility for a cyberattack against MAYA, an Israeli research and development firm with close ties to the country's Ministry of Defense and major defense contractors like Elbit Systems and Rafael. In a public statement on October 14, the group alleged it had disrupted MAYA's systems and exfiltrated sensitive data, including designs for current and future military equipment. The claims have not been officially confirmed by Israeli authorities, but the incident highlights the ongoing threat of politically motivated cyberattacks against the defense industrial base.",[1239,23,1240,1241,20,1242],"Hacktivism","Israel","Defense","Cyber Support Front",[23,59,20],{"id":1245,"slug":1246,"headline":1247,"title":1248,"severity":10,"article_type":166,"excerpt":1249,"tags":1250,"categories":1255,"createdAt":1126,"updatedAt":1126,"displayDate":1221,"isUpdated":27,"readingTime":77},"d8c88a43-edd4-4f6d-86dd-5a4a40daa00b","fortinet-discloses-high-severity-fortios-cli-vulnerability","Fortinet Discloses High-Severity Authenticated RCE Flaw in FortiOS CLI","Fortinet Reveals High-Severity Authenticated Command Execution Vulnerability in FortiOS Command Line Interface","Fortinet has disclosed a high-severity vulnerability in the command line interface (CLI) of its FortiOS operating system. The flaw could allow an authenticated attacker to execute arbitrary commands on the underlying system. While a CVE identifier has not yet been assigned and specific affected versions are not detailed, the vulnerability poses a significant risk. An attacker with valid CLI credentials could leverage this flaw to gain full control of a Fortinet appliance, bypass security controls, and use the device as a pivot point for further network intrusion. Administrators are urged to monitor for an official security advisory and apply patches as soon as they are available.",[1251,1252,95,1253,1254,184],"Fortinet","FortiOS","CLI","Authenticated",[95,175],{"id":1257,"slug":1258,"headline":1259,"title":1260,"severity":10,"article_type":193,"excerpt":1261,"tags":1262,"categories":1266,"createdAt":894,"updatedAt":894,"displayDate":1267,"isUpdated":27,"readingTime":28},"09cf6221-51e9-4bc7-b5d4-c7cbd2a04e6c","chinese-apt-jewelbug-infiltrates-russian-it-provider-in-espionage-campaign","Chinese APT 'Jewelbug' Breaches Russian IT Firm in Supply Chain Threat","Chinese APT Jewelbug Targets Russian IT Provider in Five-Month Espionage Campaign, Raising Supply Chain Attack Concerns","In a rare instance of Chinese cyber-espionage targeting a Russian entity, the APT group known as Jewelbug compromised a Russian IT service provider for five months in early 2025. According to Symantec, the attackers gained access to the firm's code repositories and software build systems, creating a significant risk of a software supply chain attack. The group used the powerful ShadowPad backdoor and exfiltrated data to Yandex Cloud to evade detection. This campaign highlights the expanding target scope of Chinese APTs and their focus on compromising trusted providers to enable downstream attacks.",[89,1263,553,52,1264,1265,368],"Jewelbug","ShadowPad","Yandex Cloud",[59,52,23],"Created: Oct 14, 2025",{"id":1269,"slug":1270,"headline":1271,"title":1272,"severity":65,"article_type":11,"excerpt":1273,"tags":1274,"categories":1277,"createdAt":894,"updatedAt":894,"displayDate":1267,"isUpdated":27,"readingTime":77},"c0a0cfd8-a661-4c15-ae9f-fcd30e083b88","mango-discloses-data-breach-via-third-party-marketing-vendor","Fashion Retailer MANGO Discloses Data Breach from Third-Party Vendor","Spanish Retailer MANGO Confirms Data Breach via Compromised Third-Party Marketing Vendor","Global fashion retailer MANGO has notified customers of a data breach that originated from a compromise at an external marketing service provider. The incident, disclosed on October 14, 2025, resulted in the unauthorized access of customer contact information, including names, country, postal codes, email addresses, and phone numbers. MANGO has confirmed that its internal systems were not affected and that no sensitive financial data or account credentials were exposed. The company has reported the breach to the Spanish Data Protection Agency (AEPD) and is advising customers to be wary of potential phishing attacks.",[20,1275,52,334,41,1276],"Third-Party Breach","Customer Data",[20,52],{"id":1279,"slug":1280,"headline":1281,"title":1282,"severity":10,"article_type":166,"excerpt":1283,"tags":1284,"categories":1287,"createdAt":894,"updatedAt":894,"displayDate":1267,"isUpdated":27,"readingTime":77},"e3664f94-6aa3-43b5-abab-1ed0d88efb94","adobe-october-2025-patch-tuesday-fixes-critical-connect-flaw","Adobe Patches 35+ Flaws, Including Critical RCE Bug in Connect","Adobe's October 2025 Security Updates Address Over 35 Vulnerabilities, Including Critical Code Execution Flaw in Adobe Connect","As part of its October 2025 security updates, Adobe has released patches for more than 35 vulnerabilities across a dozen products. The most severe of these is a critical cross-site scripting (XSS) vulnerability in Adobe Connect, tracked as CVE-2025-49553, which could lead to arbitrary code execution. The flaw holds a CVSS score of 9.3. Other high-severity flaws were addressed in Adobe Commerce and Magento Open Source. Adobe has assigned a lower priority rating to most updates but recommends that users of Commerce and Magento patch promptly due to a historically elevated risk of attack.",[297,466,95,184,1285,1286],"XSS","Adobe Connect",[175,95],{"id":1289,"slug":1290,"headline":1291,"title":1292,"severity":10,"article_type":11,"excerpt":1293,"tags":1294,"categories":1299,"createdAt":894,"updatedAt":894,"displayDate":1267,"isUpdated":27,"readingTime":28},"d163096b-d644-4c0e-baa7-c10e7b28f055","large-scale-botnet-targets-rdp-services-in-us","Massive Botnet of 100k+ IPs Targets U.S. RDP Services","Coordinated Botnet with Over 100,000 IPs Targets U.S. Remote Desktop Protocol (RDP) Services","Security researchers at GreyNoise have identified a massive, coordinated botnet campaign targeting Remote Desktop Protocol (RDP) services across the United States. The operation, which began on October 8, 2025, involves over 100,000 unique IP addresses from more than 100 countries. The botnet is using enumeration and timing attacks against RD Web Access and RDP web clients to identify valid user credentials. The widespread and centrally controlled nature of the campaign poses a significant threat to any organization exposing RDP to the internet, as a successful compromise can quickly lead to ransomware deployment or data theft.",[1295,1296,1297,1298,23],"Botnet","RDP","Brute Force","Credential Stuffing",[23,244],{"id":1301,"slug":1302,"headline":1303,"title":1304,"severity":10,"article_type":11,"excerpt":1305,"tags":1306,"categories":1307,"createdAt":1308,"updatedAt":1309,"displayDate":1310,"isUpdated":112,"readingTime":77},"d9d55e9c-df2a-4761-8f83-e869c01eae67","qilin-ransomware-claims-attack-on-japanese-beverage-giant-asahi","Qilin Ransomware Hits Japanese Beer Giant Asahi, Steals 27GB of Data","Qilin Ransomware Group Claims Responsibility for Cyberattack on Asahi Group Holdings","The Russia-based Qilin ransomware group has claimed responsibility for a cyberattack that disrupted operations at Asahi Group Holdings, Japan's largest brewing company. The attack, confirmed by Asahi on October 6, impacted order and shipment systems. On its dark web leak site, the Qilin gang stated it exfiltrated 27 gigabytes of sensitive corporate data, including contracts, financial documents, and employee information. The group has posted samples of the stolen data to pressure Asahi into paying the ransom, highlighting the severe risk ransomware poses to manufacturing and supply chain operations.",[280,122,523,532,625,325],[122,23,20],"2025-10-09T15:00:00.000Z","2025-10-14T12:00:00Z","Updated: Oct 14, 2025",{"id":1312,"slug":1313,"headline":1314,"title":1315,"severity":10,"article_type":11,"excerpt":1316,"tags":1317,"categories":1322,"createdAt":1308,"updatedAt":1323,"displayDate":1324,"isUpdated":112,"readingTime":28},"d69a02fa-c01c-4125-909f-cd68d1253764","legitimate-dfir-tool-velociraptor-weaponized-in-ransomware-attacks","Living Off the Land: Hackers Abuse Velociraptor DFIR Tool to Deploy Ransomware","China-Linked Group Storm-2603 Abuses Velociraptor DFIR Tool to Deploy LockBit, Babuk Ransomware","A suspected China-based threat group, Storm-2603, is weaponizing the legitimate open-source digital forensics and incident response (DFIR) tool, Velociraptor. According to Cisco Talos, the attackers are using an outdated and vulnerable version of the tool (exploiting CVE-2025-6264) to gain persistence, escalate privileges, and deploy multiple ransomware families, including Warlock, LockBit, and Babuk. The campaign highlights the growing trend of attackers abusing trusted security tools to evade detection while compromising VMware ESXi and Windows environments.",[324,1318,1319,1320,281,1321,54],"DFIR","Velociraptor","Storm-2603","Babuk",[59,122,57],"2025-10-14T00:00:00Z","Updated: Oct 13, 2025",{"id":1326,"slug":1327,"headline":1328,"title":1329,"severity":10,"article_type":11,"excerpt":1330,"tags":1331,"categories":1335,"createdAt":1336,"updatedAt":1336,"displayDate":1337,"isUpdated":27,"readingTime":77},"cc1f383d-f3ff-454f-a55a-27c6ade5abcc","discord-vendor-breach-exposes-70000-users-government-ids","Supply Chain Attack Hits Discord: Vendor Breach Exposes 70,000 User IDs","Third-Party Breach at Discord Vendor 5CA Exposes Government IDs and Personal Data of 70,000 Users","The communication platform Discord has disclosed a significant data breach originating from a third-party customer service vendor, 5CA. The incident, which occurred in early October 2025, resulted in unauthorized access to the sensitive data of approximately 70,000 users who had interacted with Discord's support teams. Exposed information includes photos of government-issued IDs, names, email addresses, IP addresses, and partial billing data. The breach highlights the persistent and growing risk of supply chain attacks, where attackers target less secure partners to access data from larger organizations.",[1332,1333,20,52,41,608,1334],"Discord","5CA","Extortion",[20,52,76],"2025-10-13T15:00:00.000Z","Created: Oct 13, 2025",{"id":1339,"slug":1340,"headline":1341,"title":1342,"severity":10,"article_type":250,"excerpt":1343,"tags":1344,"categories":1347,"createdAt":1336,"updatedAt":1336,"displayDate":1337,"isUpdated":27,"readingTime":77},"273f9834-6654-4cac-8cc7-80f0e08415bd","healthcare-ransomware-attacks-shift-to-vendors-surging-30-percent","Ransomware Groups Pivot to Healthcare Vendors, Attacks Surge 30%","Healthcare Ransomware Attacks Shift to Vendors, Surging 30% in 2025 as Criminals Target Supply Chain","A new report from Comparitech reveals a significant strategic shift in ransomware attacks targeting the healthcare sector. While attacks on direct care providers remained steady, incidents involving healthcare-affiliated businesses and vendors surged by 30% in the first nine months of 2025. Threat actors like Qilin and INC are increasingly targeting less-secure partners such as medical billing services and pharmaceutical manufacturers to disrupt the healthcare supply chain, leading to the breach of over 6 million records from confirmed attacks on these adjacent businesses alone.",[122,155,52,280,1345,20,1346],"INC Ransomware","Comparitech",[122,52,59],{"id":1349,"slug":1350,"headline":1351,"title":1352,"severity":10,"article_type":193,"excerpt":1353,"tags":1354,"categories":1359,"createdAt":1336,"updatedAt":1336,"displayDate":1337,"isUpdated":27,"readingTime":77},"066f28b4-2434-4dab-9467-0e66882b42bb","russian-apt-seashell-blizzard-targets-european-critical-infrastructure","Russian APT Seashell Blizzard Targets European Critical Infrastructure","Sandworm Subgroup 'Seashell Blizzard' Targets European Critical Infrastructure with Custom Malware","A subgroup of the Russian state-sponsored threat actor Sandworm, tracked as Seashell Blizzard, is conducting a new campaign against critical infrastructure in Ukraine and Europe. The attacks leverage phishing emails with malicious XLL attachments to deliver a custom downloader, CheapShot, which in turn deploys a backdoor called ShroudDoor. The campaign targets organizations in the agricultural, defense, transportation, and manufacturing sectors, highlighting ongoing espionage and disruptive efforts by Russian APTs.",[1355,1356,1357,368,141,852,76,57,1358],"Seashell Blizzard","Sandworm","APT28","ShroudDoor",[59,23,57],{"id":1361,"slug":1362,"headline":1363,"title":1364,"severity":65,"article_type":166,"excerpt":1365,"tags":1366,"categories":1369,"createdAt":1336,"updatedAt":1336,"displayDate":1337,"isUpdated":27,"readingTime":77},"6594d259-da2c-4b48-89e8-b2707f940db6","lastpass-warns-of-active-phishing-campaign-impersonating-brand","LastPass Warns of Active Phishing Campaign Impersonating Brand","LastPass Issues Alert on Active Phishing Campaign Falsely Claiming a Hack","Password manager LastPass issued an alert on October 13, 2025, about an active phishing campaign targeting its users. The attackers are sending emails from a fraudulent domain with subject lines like \"We Have Been Hacked,\" creating a false sense of urgency to trick users into clicking a malicious link. The link directs victims to a convincing phishing site designed to steal their master password. LastPass has confirmed it was not hacked and is working to take down the malicious infrastructure.",[1367,76,1368,106,255],"LastPass","Credential Theft",[76,242],{"id":1371,"slug":1372,"headline":1373,"title":1374,"severity":10,"article_type":11,"excerpt":1375,"tags":1376,"categories":1381,"createdAt":1336,"updatedAt":1336,"displayDate":1337,"isUpdated":27,"readingTime":77},"c891107a-0dd3-45c8-ab8a-46afde590baa","new-android-spyware-clayrat-spreads-via-telegram","New Android Spyware \"ClayRat\" Spreads via Telegram, Hijacks SMS","Android Spyware \"ClayRat\" Targets Russian Users via Telegram, Stealing SMS and Spreading to Contacts","A new Android spyware named \"ClayRat\" is targeting Russian users through fake applications distributed on phishing sites and Telegram. The malware uses sophisticated techniques to bypass Android 13+ security restrictions, install itself as the default SMS handler to intercept 2FA codes, and exfiltrate a wide range of data including call logs and photos. A key feature of ClayRat is its self-propagation mechanism, where it automatically sends malicious links via SMS to all contacts on the victim's device, rapidly expanding the infection.",[69,91,1377,57,1378,1379,1380,75],"ClayRat","Telegram","SMS","2FA",[57,75,76],{"id":1383,"slug":1384,"headline":1385,"title":1386,"severity":10,"article_type":166,"excerpt":1387,"tags":1388,"categories":1392,"createdAt":1336,"updatedAt":1336,"displayDate":1337,"isUpdated":27,"readingTime":77},"954d38b1-22d2-4e97-9fb5-349b7887b484","ivanti-discloses-13-vulnerabilities-in-endpoint-manager","Ivanti Discloses 13 Vulnerabilities in Endpoint Manager, Two High-Severity","Ivanti Publishes Advisory for 13 Vulnerabilities in Endpoint Manager (EPM), Including High-Severity RCE and Privilege Escalation Flaws","Ivanti has released a security advisory for its Endpoint Manager (EPM) software, detailing 13 new vulnerabilities. The batch includes two high-severity flaws—one allowing for local privilege escalation and another for remote code execution with user interaction—and eleven medium-severity bugs, many of which are SQL injection vulnerabilities. While none of the flaws are known to be actively exploited, Ivanti is urging customers to upgrade from the now end-of-life EPM 2022 to the more secure 2024 version and apply forthcoming patches.",[1389,95,175,1390,184,1391,239],"Ivanti","EPM","SQL Injection",[95,175],{"id":1394,"slug":1395,"headline":1396,"title":1397,"severity":65,"article_type":11,"excerpt":1398,"tags":1399,"categories":1402,"createdAt":1336,"updatedAt":1336,"displayDate":1337,"isUpdated":27,"readingTime":794},"936f0675-8b79-492e-882d-dc508be36f28","new-york-state-inflation-refund-program-exploited-in-phishing-scams","New York Inflation Refund Program Exploited in Phishing Scams","Scammers Exploit New York State Inflation Refund Program with Phishing and Smishing Campaigns","The New York State Department of Taxation and Finance is warning residents about phishing and smishing (SMS phishing) campaigns that are exploiting a legitimate state inflation relief program. Scammers are sending fraudulent messages claiming that recipients must submit personal and payment information via a malicious link to receive their refund. In reality, the legitimate program sends checks automatically to eligible taxpayers with no action required. The scams use social engineering to create urgency and trick victims into giving up sensitive data.",[76,581,1400,1401,106,608],"Scam","New York",[76,43],{"id":1404,"slug":1405,"headline":1406,"title":1407,"severity":83,"article_type":166,"excerpt":1408,"tags":1409,"categories":1414,"createdAt":1415,"updatedAt":1416,"displayDate":1324,"isUpdated":112,"readingTime":573},"7a1299e2-8537-43ad-a952-d3e5a8ebbf72","clop-exploits-oracle-ebs-zero-day-prompting-urgent-fbi-warning","Cl0p Exploits Oracle EBS Zero-Day in Widespread Extortion Campaign, FBI Issues Emergency Warning","Cl0p-Affiliated Group Exploits Oracle E-Business Suite Zero-Day (CVE-2025-61882) for Months, Triggering FBI Alert","A financially motivated threat group, claiming ties to the notorious **[Cl0p](https://attack.mitre.org/groups/G0114/)** ransomware gang, has been exploiting a critical zero-day vulnerability in **[Oracle E-Business Suite](https://www.oracle.com/applications/ebs/)** (EBS). The flaw, **CVE-2025-61882**, is an unauthenticated remote code execution vulnerability with a 9.8 CVSS score. Investigations by Google and Mandiant reveal the attackers exploited the flaw since at least August 2025, months before Oracle released a patch on October 4. The campaign involves exfiltrating large volumes of data and sending extortion emails to executives. The **[FBI](https://www.fbi.gov)** has issued an emergency directive urging immediate patching, highlighting the severe risk to sectors like healthcare and education, with Harvard University confirmed as one of the victims.",[684,1410,184,1411,1412,1413],"extortion","fileless malware","data theft","enterprise software",[95,23,59],"2025-10-10T15:00:00.000Z","2025-10-13T12:00:00Z",{"id":1418,"slug":1419,"headline":1420,"title":1421,"severity":10,"article_type":166,"excerpt":1422,"tags":1423,"categories":1426,"createdAt":109,"updatedAt":109,"displayDate":1427,"isUpdated":27,"readingTime":77},"bcb975bc-9b64-4416-b3a2-973cd8840d1a","oracle-discloses-new-high-severity-flaw-in-e-business-suite","Oracle Issues Emergency Patch for High-Severity EBS Flaw Amid Active Clop Attacks","Oracle Patches Unauthenticated Data Exposure Flaw (CVE-2025-61884) in E-Business Suite","Oracle has released an emergency security patch for a high-severity vulnerability, CVE-2025-61884, in its E-Business Suite (EBS). The flaw, which has a CVSS score of 7.5, allows an unauthenticated, remote attacker to access sensitive data within the Oracle Configurator module. It affects EBS versions 12.2.3 through 12.2.14. This alert is especially critical as it comes while the Clop ransomware group is actively exploiting a separate, critical zero-day (CVE-2025-61882) in EBS for an executive extortion campaign. While there's no confirmed link, the active targeting of EBS by Clop significantly increases the risk that this new vulnerability will be weaponized. Administrators are urged to apply the patch immediately.",[95,125,126,1424,1425,121,87,175],"CVE-2025-61884","CVE-2025-61882",[95,175,122],"Created: Oct 12, 2025",{"id":1429,"slug":1430,"headline":1431,"title":1432,"severity":65,"article_type":11,"excerpt":1433,"tags":1434,"categories":1437,"createdAt":109,"updatedAt":109,"displayDate":1427,"isUpdated":27,"readingTime":28},"676ae08d-364d-47c1-98ae-eec43d1702d5","discord-denies-breach-as-hackers-claim-to-leak-1-5tb-of-user-data","Discord Denies Massive Breach Claim After Hackers Allege 1.5TB Data Leak","Discord Refutes Claims of a Major Data Breach and Leak of Government-Issued IDs","Discord is publicly denying claims that it suffered a major data breach. On October 11, 2025, an unknown group of hackers alleged they had exfiltrated and leaked 1.5 terabytes of user data, including highly sensitive government-issued identification documents. Some reports suggested the breach was linked to Discord's Zendesk customer support portal, an allegation Zendesk also refuted, stating its systems were not vulnerable. Discord maintains that its services were not compromised and that the claims are unverified. The significant discrepancy between the hackers' claims and the company's denial leaves the situation unclear, but the mere allegation of leaked IDs poses a serious concern for users.",[1332,20,1435,1436,608],"Zendesk","Unconfirmed",[20,242],{"id":1439,"slug":1440,"headline":1441,"title":1442,"severity":10,"article_type":11,"excerpt":1443,"tags":1444,"categories":1450,"createdAt":109,"updatedAt":109,"displayDate":1427,"isUpdated":27,"readingTime":28},"93bd5619-0192-4d37-a9ec-9df0ab9c9711","north-korean-hackers-stole-record-2-billion-in-crypto-in-2025","North Korean Hackers Shatter Records, Stealing $2 Billion in Crypto in 2025","North Korean State-Sponsored Hackers Steal Record-Breaking $2 Billion in Cryptocurrency Assets in 2025","North Korean state-sponsored hacking groups have stolen over $2 billion in cryptocurrency assets in 2025 so far, marking the largest annual total ever recorded for the regime. A report highlighted on October 11, 2025, points to the increasing scale and sophistication of these financially motivated cyber operations. The single largest heist of the year was the February 2025 attack on the Bybit cryptocurrency exchange, which accounted for $1.46 billion of the total losses. These attacks on crypto exchanges and DeFi platforms are a critical source of revenue for North Korea, allowing it to circumvent international sanctions and fund its weapons programs.",[1445,198,200,1446,1447,1448,1449],"North Korea","Cyber Heist","Bybit","DeFi","Sanctions Evasion",[59,23,57],{"id":1452,"slug":1453,"headline":1454,"title":1455,"severity":10,"article_type":11,"excerpt":1456,"tags":1457,"categories":1461,"createdAt":109,"updatedAt":109,"displayDate":1427,"isUpdated":27,"readingTime":28},"2713fd11-2ed8-4b67-b262-a9ffd39a3224","north-korean-it-worker-fraud-scheme-expands-globally","North Korean IT Worker Fraud Scheme Expands, Targeting 5,000 Companies","Global Alert: North Korean Scheme Using Fake IT Workers Infiltrates Thousands of Companies","A sophisticated North Korean scheme using fraudulent IT worker personas to infiltrate companies has expanded into a massive global operation. According to a report from October 11, 2025, researchers have identified over 130 fake identities used in more than 6,500 job interviews with approximately 5,000 companies over a four-year period. These state-sponsored operatives pose as skilled freelance IT workers to secure remote employment, then use their insider access to conduct espionage, steal intellectual property, and divert funds. The campaign, previously thought to be focused on the U.S., is now confirmed to be global, prompting warnings for businesses to enhance their hiring and verification processes for remote workers.",[1445,1458,92,1459,1460,106],"Insider Threat","Hiring Fraud","Remote Work",[59,283,43],{"id":1463,"slug":1464,"headline":1465,"title":1466,"severity":83,"article_type":166,"excerpt":1467,"tags":1468,"categories":1474,"createdAt":109,"updatedAt":109,"displayDate":1427,"isUpdated":27,"readingTime":77},"d04251c6-6a5b-4a43-9275-35062e945acd","critical-flaw-in-wordpress-plugin-woocommerce-designer-pro-allows-file-deletion","Critical RCE Flaw in WooCommerce Designer Pro Plugin Puts WordPress Sites at Risk","Critical Path Traversal Vulnerability (CVE-2025-6439) in WooCommerce Designer Pro Allows Unauthenticated File Deletion","A critical vulnerability, CVE-2025-6439, has been disclosed in the WooCommerce Designer Pro WordPress plugin. The flaw, rated 9.8 out of 10 on the CVSS scale, is a path traversal issue that allows an unauthenticated attacker to delete arbitrary files on the web server. This could lead to complete data loss, website destruction, or even remote code execution (RCE) by deleting critical files like wp-config.php and re-running the WordPress installation. The vulnerability affects all versions up to and including 1.9.26 and is also present in the 'Pricom' theme which bundles the plugin. Users are urged to update immediately.",[1469,95,1470,1471,1472,184,1473],"WordPress","CVE-2025-6439","WooCommerce","Path Traversal","Critical",[95,175],{"id":1476,"slug":1477,"headline":1478,"title":1479,"severity":65,"article_type":166,"excerpt":1480,"tags":1481,"categories":1485,"createdAt":109,"updatedAt":109,"displayDate":1427,"isUpdated":27,"readingTime":77},"557850c8-cb3d-4583-be18-5c4f0eb2b613","wordpress-plugin-contest-gallery-vulnerable-to-csv-injection","WordPress Plugin 'Contest Gallery' Vulnerable to CSV Injection Attacks","Medium-Severity CSV Injection Flaw (CVE-2025-11254) Disclosed in Contest Gallery WordPress Plugin","A medium-severity CSV injection vulnerability, CVE-2025-11254, has been disclosed in the 'Contest Gallery' plugin for WordPress. The flaw affects all versions up to and including 27.0.3. It allows an unauthenticated attacker to embed malicious formulas into data fields that are later exported as a CSV file by a site administrator. If the administrator opens the malicious CSV file in a spreadsheet program like Microsoft Excel, the formulas can execute, potentially leading to arbitrary code execution on their local machine. The vulnerability has a CVSS score of 4.3 and has been patched in version 28.0.0 of the plugin.",[1469,95,1482,1483,1484],"CSV Injection","CVE-2025-11254","Contest Gallery",[95,175],{"id":1487,"slug":1488,"headline":1489,"title":1490,"severity":10,"article_type":11,"excerpt":1491,"tags":1492,"categories":1496,"createdAt":1141,"updatedAt":1141,"displayDate":1497,"isUpdated":27,"readingTime":28},"50d68aaf-5022-4631-ba79-3a54daff8605","discord-confirms-data-breach-via-third-party-support-vendor","Discord Breach Exposes 5.5M Users via Third-Party Vendor Compromise","Discord Confirms Data Breach Through Compromised Third-Party Support Vendor, Zendesk","Discord has officially confirmed a data breach that originated from a compromised third-party customer support vendor, Zendesk. The incident exposed the data of users who had interacted with Discord's support channels. Hackers claim to have exfiltrated information from 5.5 million users, including usernames, email addresses, IP addresses, and the contents of support tickets. Discord has assured its community that sensitive data such as passwords and authentication tokens were not compromised. In response, Discord has revoked the vendor's system access and is in the process of notifying all affected individuals, highlighting the persistent risks associated with third-party supply chain security.",[1493,598,1494,1495,567],"third-party risk","customer support","data exfiltration",[20,52,24],"Created: Oct 11, 2025",{"id":1499,"slug":1500,"headline":1501,"title":1502,"severity":10,"article_type":11,"excerpt":1503,"tags":1504,"categories":1510,"createdAt":1141,"updatedAt":1141,"displayDate":1497,"isUpdated":27,"readingTime":28},"18d396dc-e598-4f7a-8e38-f3a37694112d","175-malicious-npm-packages-used-in-phishing-campaign","175 Malicious NPM Packages Target Developers in Widespread Phishing Attack","Researchers Uncover 175 Malicious npm Packages with 26,000 Downloads in Credential Phishing Campaign","A significant software supply chain attack has been identified on the npm open-source repository, where researchers discovered 175 malicious packages that were downloaded approximately 26,000 times. These packages were trojanized to execute credential phishing attacks against developers, aiming to steal logins and API keys. The campaign, which primarily targeted the technology and energy sectors, often used typosquatting techniques to mimic legitimate packages. This incident highlights the critical need for organizations to implement stringent dependency vetting and runtime security monitoring to defend against attacks targeting the software development lifecycle.",[1505,1506,1507,1508,1509],"npm","open-source","dependency confusion","typosquatting","credential theft",[52,57,76],{"id":1512,"slug":1513,"headline":1514,"title":1515,"severity":10,"article_type":11,"excerpt":1516,"tags":1517,"categories":1522,"createdAt":1141,"updatedAt":1141,"displayDate":1497,"isUpdated":27,"readingTime":28},"de655449-eb76-4d50-a5a0-984bc6229c5e","chaosbot-malware-uses-cisco-vpn-active-directory-passwords","New 'Chaosbot' Malware Weaponizes Cisco VPN & AD Credentials for Lateral Movement","'Chaosbot' Malware Identified Using Stolen Cisco VPN and Active Directory Passwords for Network Compromise","A new malware strain named \"Chaosbot\" has been discovered by security researchers. It specializes in using stolen Cisco VPN and Active Directory credentials to execute commands and move laterally within compromised corporate networks. By leveraging legitimate enterprise tools and protocols, this 'living off the land' technique makes the malware's activity difficult to distinguish from normal administrative behavior. Chaosbot represents a significant threat for establishing persistence, escalating privileges, and deploying secondary payloads like ransomware.",[1518,1519,1520,238,1521],"lateral movement","credential abuse","living off the land","Cisco VPN",[57,244,23],{"id":1524,"slug":1525,"headline":1526,"title":1527,"severity":10,"article_type":11,"excerpt":1528,"tags":1529,"categories":1534,"createdAt":1141,"updatedAt":1141,"displayDate":1497,"isUpdated":27,"readingTime":28},"e3c62aaa-dc0d-407a-96b1-0449d4caabbf","stealit-malware-targets-windows-via-nodejs-extensions","New 'Stealit' Malware Targets Developers via Malicious Node.js Extensions","'Stealit' Information-Stealer Malware Discovered Targeting Windows Systems Through Node.js Extensions","A new information-stealing malware named \"Stealit\" is targeting Windows systems by using malicious Node.js extensions as its infection vector. This novel approach specifically targets software developers, aiming to steal sensitive data such as source code, API keys, and other credentials directly from their development environments. The emergence of Stealit highlights an increasing focus by threat actors on compromising the software supply chain at its source, turning trusted development tools into attack vectors.",[1530,1531,1532,598,1533],"infostealer","Node.js","developer tools","Windows",[57,52,244],{"id":1536,"slug":1537,"headline":1538,"title":1539,"severity":83,"article_type":11,"excerpt":1540,"tags":1541,"categories":1546,"createdAt":1141,"updatedAt":1141,"displayDate":1497,"isUpdated":27,"readingTime":573},"2b1a7464-9cad-48e3-b7dc-442f2998f295","malterminal-malware-uses-gpt4-to-generate-ransomware","'MalTerminal' Malware Uses OpenAI's GPT-4 to Auto-Generate Ransomware Code","Novel 'MalTerminal' Malware Leverages GPT-4 to Dynamically Create Ransomware, Evading Detection","Researchers have discovered \"MalTerminal,\" a novel malware that uses OpenAI's GPT-4 large language model (LLM) to dynamically generate ransomware code. This represents a significant and dangerous evolution in malware development, enabling the creation of polymorphic code that can evade traditional signature-based detection. The technique dramatically lowers the barrier for less-skilled actors to create sophisticated attacks and poses a major new challenge for cybersecurity defenses, requiring a shift towards behavioral analysis and anomaly detection.",[1542,1543,1544,1545,954],"AI-generated malware","LLM","GPT-4","polymorphic",[57,122,244],{"id":1548,"slug":1549,"headline":1550,"title":1551,"severity":10,"article_type":11,"excerpt":1552,"tags":1553,"categories":1559,"createdAt":1141,"updatedAt":1141,"displayDate":1497,"isUpdated":27,"readingTime":28},"67c7e7ac-02a8-41d5-a8a6-a824e5afc245","juniper-networks-patches-220-vulnerabilities-nine-critical","Juniper Networks Patches 220 Flaws, Including Nine Critical Bugs Dating Back Years","Juniper Networks Releases Patches for 220 Vulnerabilities, Nine Rated Critical","Juniper Networks has released a massive security update for October 2025, addressing a total of 220 vulnerabilities across its broad portfolio of networking products. The patch bundle includes fixes for nine flaws rated as critical, posing a severe risk of remote code execution or system takeover. Alarmingly, analysis suggests some of these vulnerabilities have existed in products since at least 2019, creating a long window of exposure for potential exploitation. Customers are urged to review the advisories and apply the necessary updates with extreme urgency.",[1554,1555,685,1556,1557,1558],"Juniper","patching","networking","critical infrastructure","Junos OS",[175,95,244],{"id":1561,"slug":1562,"headline":1563,"title":1564,"severity":83,"article_type":166,"excerpt":1565,"tags":1566,"categories":1568,"createdAt":1059,"updatedAt":1569,"displayDate":1570,"isUpdated":112,"readingTime":28},"255dbbaf-45ad-423c-9033-df19bd7f0c20","cl0p-ransomware-exploits-oracle-e-business-suite-zero-day-in-mass-attack","Cl0p Ransomware Exploits Oracle E-Business Suite Zero-Day in Mass Attack","Cl0p Ransomware Gang Exploits Unauthenticated RCE Zero-Day (CVE-2025-61882) in Oracle E-Business Suite","The notorious Cl0p ransomware gang is conducting a widespread extortion campaign by exploiting a critical, unauthenticated remote code execution (RCE) zero-day vulnerability (CVE-2025-61882) in Oracle E-Business Suite. The campaign, active since at least August, involves Cl0p breaching vulnerable systems to steal data and then sending extortion emails to thousands of accounts. Oracle has released an emergency patch for the flaw, which affects versions 12.2.3 through 12.2.14, and is urging customers to update immediately. This attack follows Cl0p's established pattern of leveraging high-impact zero-days in enterprise software for mass compromise.",[1567,122,87,125,20,1334],"Cl0p",[122,95,20],"2025-10-11T00:00:00Z","Updated: Oct 10, 2025",{"id":1572,"slug":1573,"headline":1574,"title":1575,"severity":10,"article_type":11,"excerpt":1576,"tags":1577,"categories":1582,"createdAt":1415,"updatedAt":1415,"displayDate":1583,"isUpdated":27,"readingTime":28},"716fe449-ba81-4707-a952-64cd853f90a3","camoleak-flaw-in-github-copilot-allowed-silent-code-exfiltration","GitHub Patches 'CamoLeak' Flaw in Copilot That Allowed Silent Code and Secret Exfiltration","'CamoLeak' Vulnerability in GitHub Copilot Chat Enabled Covert Data Theft via Prompt Injection","A critical vulnerability, dubbed 'CamoLeak,' has been discovered and patched in **[GitHub Copilot Chat](https://github.com/features/copilot)**. The flaw, rated 9.6 CVSS by researcher Omer Mayraz of Legit Security, allowed attackers to silently steal private source code, API keys, and other secrets from developers' repositories. The attack involved a novel prompt injection technique where malicious instructions were hidden in a pull request's markdown. When a developer used Copilot to review the PR, the AI would execute the hidden commands. The stolen data was then exfiltrated character-by-character using a clever trick involving **[GitHub](https://github.com/)**'s own image proxy service, Camo, bypassing standard security controls. GitHub has mitigated the flaw by disabling image rendering in Copilot Chat.",[1578,1579,1580,1495,1581,1046],"prompt injection","AI security","GitHub Copilot","source code leak",[95,24,52],"Created: Oct 10, 2025",{"id":1585,"slug":1586,"headline":1587,"title":1588,"severity":10,"article_type":11,"excerpt":1589,"tags":1590,"categories":1594,"createdAt":1415,"updatedAt":1415,"displayDate":1583,"isUpdated":27,"readingTime":28},"d9777cbe-406c-425f-a8fa-723cde2ddb3d","crypto-platform-shuffle-hit-by-third-party-data-breach","Crypto Platform Shuffle.com Discloses Major Data Breach via Third-Party CRM Provider","Shuffle.com User Data, Including KYC Documents, Exposed in Breach at CRM Partner Fast Track","Crypto betting platform **[Shuffle.com](https://shuffle.com/)** has confirmed a significant data breach affecting a majority of its users. The incident occurred not on Shuffle's own systems, but at its third-party CRM provider, **Fast Track**. On October 10, Shuffle announced that attackers compromised Fast Track and gained access to a trove of sensitive user data. The exposed information includes full names, emails, phone numbers, home addresses, transaction histories, and, most critically, Know Your Customer (KYC) identity documents like passports and driver's licenses. While user funds and passwords are safe, the breach creates a severe risk of identity theft and targeted phishing for affected customers. Shuffle has revoked the provider's access and is urging users to enable 2FA.",[1591,940,1592,1593,41,1493],"supply chain attack","crypto","KYC",[20,52,76],{"id":1596,"slug":1597,"headline":1598,"title":1599,"severity":10,"article_type":11,"excerpt":1600,"tags":1601,"categories":1604,"createdAt":1415,"updatedAt":1415,"displayDate":1583,"isUpdated":27,"readingTime":28},"79e8c1fc-43cf-4b60-9f30-8d0de78e9890","new-white-lock-ransomware-demands-4-bitcoin-ransom","New 'White Lock' Ransomware Emerges, Demanding 4 Bitcoin and Threatening Data Leaks","'White Lock' Ransomware Surfaces with Double Extortion Tactics, Appends '.fbin' Extension to Files","A new ransomware strain named **White Lock** has been identified by cybersecurity researchers. Operating as a double-extortion threat, the malware first exfiltrates sensitive data before encrypting files on the victim's Windows system, appending the `.fbin` extension. A ransom note, `c0ntact.txt`, is dropped in each affected folder, demanding a payment of 4 Bitcoin within a stringent four-day deadline. The operators threaten to notify the victim's customers, sell the stolen data to competitors, and ultimately leak it publicly if the ransom is not paid. Victims are instructed to use the **[Tor](https://www.torproject.org/)** browser to communicate with the attackers, suggesting a focus on high-value enterprise targets.",[954,1139,1495,1602,1603],"Windows malware","Tor",[122,57,59],{"id":1606,"slug":1607,"headline":1608,"title":1609,"severity":208,"article_type":11,"excerpt":1610,"tags":1611,"categories":1616,"createdAt":1415,"updatedAt":1415,"displayDate":1583,"isUpdated":27,"readingTime":28},"7974936d-4304-48e1-a3b1-35668cb90161","pro-russian-hackers-tricked-into-attacking-decoy-water-utility","Humiliation for Pro-Russian Hackers 'TwoNet' After Attacking Decoy Water Utility Honeypot","Hacktivist Group TwoNet Publicly Brags About Hacking Dutch Water Utility, Only to Find It Was a Forescout Honeypot","The pro-Russian hacktivist group **TwoNet** has been publicly embarrassed after cybersecurity firm **[Forescout](https://www.forescout.com/)** revealed the group was duped into attacking a sophisticated decoy system. In September, TwoNet boasted on Telegram about disrupting a Dutch water utility's control systems. However, Forescout's research, published on October 10, confirmed the 'attack' was against one of their industrial control system (ICS) honeypots. The attacker, 'Barlati,' gained access using default credentials (`admin`/`admin`), defaced the HMI, and changed settings, believing it was a real facility. The incident highlights the naivety of some hacktivist groups and provides valuable intelligence on their TTPs against critical infrastructure.",[1612,1613,142,1614,1557,1615,368],"hacktivism","honeypot","OT security","threat intelligence",[59,145,244],{"id":1618,"slug":1619,"headline":1620,"title":1621,"severity":65,"article_type":11,"excerpt":1622,"tags":1623,"categories":1628,"createdAt":1415,"updatedAt":1415,"displayDate":1583,"isUpdated":27,"readingTime":28},"b0cf7e2d-bfe0-4b3f-b7d9-0e260ded9a7f","key-us-cyber-information-sharing-law-expires-sparking-concerns","US Cyber Threat Sharing Law 'CISA 2015' Expires, Creating Potential Intelligence Gap","Cybersecurity Information Sharing Act of 2015 Sunsets, Sparking Industry Fears of Reduced Public-Private Collaboration","The Cybersecurity Information Sharing Act of 2015 (CISA 2015), a foundational U.S. law that provided liability protections to encourage private companies to share cyber threat data with the government, expired on October 1, 2025. Amidst a government shutdown and a block by Senator Rand Paul, lawmakers failed to reauthorize the act. Security and legal experts warn this could have a chilling effect on threat intelligence sharing, with one law firm predicting a potential 80% drop. The lapse creates uncertainty and could hinder national cybersecurity efforts. In response, new legislation, the PACT Act, has been introduced to retroactively restore and extend the protections, but its future is uncertain.",[1624,1625,1615,1626,1627,170],"cybersecurity law","information sharing","US government","policy",[43,218,244],{"id":1630,"slug":1631,"headline":1632,"title":1633,"severity":10,"article_type":193,"excerpt":1634,"tags":1635,"categories":1639,"createdAt":1415,"updatedAt":1415,"displayDate":1583,"isUpdated":27,"readingTime":573},"dd6612c6-3d49-43ef-8aa9-38dc2dd6ee02","phantom-taurus-chinese-apt-targets-global-geopolitical-intel","New Chinese APT 'Phantom Taurus' Targets Global Geopolitical Intel with 'NET-STAR' Malware","China-Aligned 'Phantom Taurus' APT Group Linked to Long-Term Espionage Campaigns Against Government and Telecom Sectors","A newly designated, sophisticated threat group aligned with China, named **Phantom Taurus**, has been identified conducting long-term cyber-espionage campaigns. Active for over two years, the group targets government, military, and telecommunications organizations across Africa, the Middle East, and Asia. Its operations focus on strategic intelligence gathering that aligns with China's geopolitical interests. **Phantom Taurus** is distinguished by its stealth and use of a custom malware suite called **NET-STAR**, which targets **[Microsoft Internet Information Services (IIS)](https://www.iis.net/)** servers. While showing some infrastructure overlap with known APTs like **[APT27](https://attack.mitre.org/groups/G0045/)** and **[Mustang Panda](https://attack.mitre.org/groups/G0129/)**, its unique tools and TTPs mark it as a distinct and advanced threat.",[89,566,585,1636,1637,1638],"IIS","malware","threat actor",[59,23,244],{"id":1641,"slug":1642,"headline":1643,"title":1644,"severity":10,"article_type":11,"excerpt":1645,"tags":1646,"categories":1649,"createdAt":1415,"updatedAt":1415,"displayDate":1583,"isUpdated":27,"readingTime":28},"0da08529-653f-4e54-9dad-aa9a3ea279e8","killsec-ransomware-strikes-indonesian-fintech-firm-walletku","Killsec Ransomware Claims Attack on Indonesian FinTech WalletKu, Threatens to Leak KYC Data","Killsec Ransomware Group Adds Indonesian Digital Payment App WalletKu to Victim List, Exposing Customer KYC Data","The **Killsec** ransomware group has claimed responsibility for an attack on **WalletKu Indompet Indonesia**, a financial technology firm based in Jakarta. WalletKu provides a digital payment application primarily for micro, small, and medium enterprises. According to a post on an underground forum, Killsec has compromised the company and is threatening to release a significant amount of sensitive customer data. The exposed data reportedly includes Know Your Customer (KYC) information, such as full names, photos, government-issued IDs, and addresses. The attack highlights the growing trend of ransomware groups targeting FinTech companies, where the theft of KYC data poses a severe risk of identity theft and fraud for customers.",[954,864,1593,940,1647,1648],"Indonesia","Killsec",[122,20,59],{"id":1651,"slug":1652,"headline":1653,"title":1654,"severity":10,"article_type":11,"excerpt":1655,"tags":1656,"categories":1662,"createdAt":1415,"updatedAt":1415,"displayDate":1583,"isUpdated":27,"readingTime":28},"4f1173b6-5d9a-472a-961c-cea9fe37088c","datzbro-trojan-targets-seniors-via-ai-powered-facebook-scams","'Datzbro' Android Trojan Targets Seniors in Global AI-Powered Facebook Scam","Cybercriminals Use AI-Generated Content in Fake Facebook Groups to Lure Seniors into Installing 'Datzbro' Banking Trojan","A global malicious campaign is using AI-generated content to create fake **[Facebook](https://www.facebook.com/)** groups that target seniors. The campaign, detailed in a CYFIRMA report, sets up convincing-looking communities for social events to lure victims into downloading a malicious Android application. This app is a potent banking trojan and spyware known as **Datzbro**. The malware can grant attackers full remote control of the device, enabling them to record audio and video, steal files, and use phishing overlays to capture banking credentials. The campaign has been observed targeting users in Australia, Canada, the UK, and Southeast Asia. The threat is amplified by the fact that the builder for the Datzbro trojan was previously leaked online, allowing any criminal to use it.",[1657,1658,1659,253,1660,567,1661],"Android malware","banking trojan","social engineering","Facebook","seniors",[57,76,75],{"id":1664,"slug":1665,"headline":1666,"title":1667,"severity":83,"article_type":166,"excerpt":1668,"tags":1669,"categories":1671,"createdAt":1308,"updatedAt":1672,"displayDate":1673,"isUpdated":112,"readingTime":28},"dcf8686b-2588-4cd6-b5f1-69a55ee6db88","clop-ransomware-exploits-oracle-e-business-suite-zero-day-cve-2025-61882","Cl0p Gang Exploits Oracle EBS Zero-Day in Massive Data Theft Spree","Cl0p Ransomware Linked to Widespread Data Theft via Critical Oracle E-Business Suite Zero-Day (CVE-2025-61882)","The Cl0p ransomware syndicate, also known as Graceful Spider, is actively exploiting a critical zero-day vulnerability, CVE-2025-61882, in Oracle's E-Business Suite (EBS). The flaw, which has a CVSS score of 9.8, allows for unauthenticated remote code execution and has been used to steal data from numerous organizations since at least August 2025. The attackers exfiltrated data for weeks before sending extortion demands in late September. In response, Oracle released an emergency patch on October 4, 2025, and CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating a patch deadline for federal agencies.",[87,184,1670,1334,125,1567,226],"Data Theft",[95,122,20],"2025-10-10T00:00:00Z","Updated: Oct 9, 2025",{"id":1675,"slug":1676,"headline":1677,"title":1678,"severity":83,"article_type":166,"excerpt":1679,"tags":1680,"categories":1686,"createdAt":1308,"updatedAt":1308,"displayDate":1687,"isUpdated":27,"readingTime":28},"479a9828-475a-4ca2-afbb-07f692d6f3ef","microsoft-links-storm-1175-to-goanywhere-mft-zero-day-cve-2025-10035","Perfect 10.0 CVSS Flaw in GoAnywhere MFT Exploited by Medusa Ransomware Group","Microsoft Attributes GoAnywhere MFT Zero-Day Exploitation (CVE-2025-10035) to Medusa Ransomware Operator Storm-1175","Microsoft has linked the cybercrime group Storm-1175, known for deploying Medusa ransomware, to the active exploitation of a critical vulnerability in Fortra's GoAnywhere Managed File Transfer (MFT) solution. The flaw, CVE-2025-10035, is an unauthenticated remote code execution vulnerability with a perfect 10.0 CVSS score. Storm-1175 has been exploiting this zero-day since at least September 11, 2025, to compromise organizations in finance, healthcare, and technology, deploying backdoors and RMM tools before exfiltrating data and deploying ransomware.",[1681,184,1682,1683,1684,1685],"Deserialization","MFT","GoAnywhere","Storm-1175","Medusa Ransomware",[95,122,59],"Created: Oct 9, 2025",{"id":1689,"slug":1690,"headline":1691,"title":1692,"severity":65,"article_type":11,"excerpt":1693,"tags":1694,"categories":1697,"createdAt":1308,"updatedAt":1308,"displayDate":1687,"isUpdated":27,"readingTime":77},"d049647b-a4ca-4105-abbd-d5069a50af49","fake-job-phishing-campaign-targets-marketing-professionals","Phishing Campaign Lures Marketing Professionals with Fake Jobs at Tesla, Google","Cofense Uncovers Phishing Campaign Targeting Marketers with Fake Job Offers from Major Brands","Security firm Cofense has detailed a sophisticated phishing campaign that targets marketing and social media professionals with fake job opportunities from high-profile brands like Tesla, Google, Ferrari, and Red Bull. The campaign uses realistic emails and multi-step credential harvesting portals to trick victims. Unlike typical phishing attacks, the primary goal is to collect detailed resumes and other personally identifiable information (PII). This data can then be used by threat actors to craft more convincing social engineering attacks, bypass security questions, or commit identity theft.",[76,106,1695,41,1696],"Credential Harvesting","Cofense",[76,20],{"id":1699,"slug":1700,"headline":1701,"title":1702,"severity":208,"article_type":250,"excerpt":1703,"tags":1704,"categories":1710,"createdAt":1308,"updatedAt":1308,"displayDate":1687,"isUpdated":27,"readingTime":794},"0dfec9e0-d167-4b4e-b8de-e950268daec9","financial-firms-boost-cyber-budgets-and-board-oversight-moodys-report","Financial Firms Tie CEO Pay to Cyber Performance Amid Budget Hikes, Moody's Finds","Moody's Report: Financial and Insurance Firms Increase Cyber Budgets and Board-Level Governance","A new report from Moody's indicates a significant shift in how financial and insurance firms are managing cyber risk. Companies are increasing cybersecurity spending, with nearly half dedicating 8% or more of their IT budget to cyber. Governance is also strengthening, as 40% of firms now link CEO compensation directly to cybersecurity performance, up from 24% in 2023. Furthermore, CISO briefings to the board are becoming more frequent, and firms are maturing their operational readiness with annual incident response tests and daily data backups.",[1705,1706,1707,624,1708,1709],"Cybersecurity Budget","Governance","Board of Directors","Insurance","Moody's",[43,242],{"id":1712,"slug":1713,"headline":1714,"title":1715,"severity":208,"article_type":193,"excerpt":1716,"tags":1717,"categories":1721,"createdAt":1308,"updatedAt":1308,"displayDate":1687,"isUpdated":27,"readingTime":794},"e8c43ebd-0759-4794-8910-776d7ecc0540","guidance-on-protecting-critical-infrastructure-with-limited-budgets","Expert Advice on Securing Critical Infrastructure with Limited Budgets","Security Leaders Advised on Protecting Critical Infrastructure Amid Budget Constraints","In a recent podcast, cybersecurity expert Chetrice Romero from Ice Miller provided guidance for leaders responsible for protecting critical infrastructure, particularly those facing limited budgets. The discussion covered common cyber and physical threats to utilities, the need for scalable and resilient strategies, and practical advice for maximizing security investments. Key recommendations included embracing cloud-native platforms for efficiency and designing future-proof command centers, offering actionable insights for securing essential systems in a challenging economic environment.",[141,1718,1719,829,1720,842],"Budget","Cybersecurity Strategy","ICS Security",[242,145,43],{"id":1723,"slug":1724,"headline":1725,"title":1726,"severity":83,"article_type":166,"excerpt":1727,"tags":1728,"categories":1729,"createdAt":1730,"updatedAt":1731,"displayDate":1732,"isUpdated":112,"readingTime":28},"876cd663-5651-48fe-bbc5-f088d248a886","clop-exploits-critical-oracle-e-business-suite-zero-day-cve-2025-61882","Clop Exploits Critical Oracle Zero-Day; CISA Issues Emergency Patch Directive","Clop Ransomware Group Actively Exploiting Critical Oracle E-Business Suite Zero-Day (CVE-2025-61882)","Multiple international cybersecurity agencies, including CISA, the UK's NCSC, and Singapore's CSA, have issued urgent warnings about a critical zero-day vulnerability, CVE-2025-61882, in Oracle E-Business Suite. The flaw, which has a CVSS score of 9.8, is being actively exploited by the Clop ransomware group in a campaign that began in August 2025. The attackers are leveraging the vulnerability to exfiltrate corporate data and are now sending extortion emails to executives of victim organizations. CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to patch by October 28, 2025, highlighting the extreme risk posed by this unauthenticated remote code execution flaw.",[87,184,125,121,122,226,170],[95,59,122],"2025-10-07T15:00:00.000Z","2025-10-09T00:00:00Z","Updated: Oct 8, 2025",{"id":1734,"slug":1735,"headline":1736,"title":1737,"severity":10,"article_type":11,"excerpt":1738,"tags":1739,"categories":1740,"createdAt":1741,"updatedAt":1731,"displayDate":1732,"isUpdated":112,"readingTime":77},"62443d6f-4cda-496d-92c0-61206be98447","qilin-ransomware-claims-attack-on-asahi-breweries","Qilin Ransomware Claims Disruptive Attack on Japanese Beverage Giant Asahi","Qilin Ransomware Gang Takes Responsibility for Cyberattack on Asahi Group, Claims Theft of 27GB of Data","The Russia-based Qilin ransomware group has claimed responsibility for a significant cyberattack against Asahi Group Holdings, one of Japan's largest beverage companies. The attack, first disclosed in late September 2025, caused major operational disruptions, forcing the suspension of order and shipment systems. On October 7, Qilin added Asahi to its data leak site, alleging the theft of 27 gigabytes of sensitive data, including contracts and employee information. Asahi is still working to restore its systems, highlighting the vulnerability of manufacturing and supply chain operations to ransomware.",[523,356,532,625,325],[122,23,145],"2025-10-08T15:00:00.000Z",{"id":1743,"slug":1744,"headline":1745,"title":1746,"severity":65,"article_type":166,"excerpt":1747,"tags":1748,"categories":1751,"createdAt":1741,"updatedAt":1741,"displayDate":1752,"isUpdated":27,"readingTime":77},"0bb44782-ac74-4ed4-bbf3-0ce592482d6d","microsoft-warns-attackers-abusing-teams-for-session-hijacking","Microsoft Warns of Attackers Abusing Teams for Session Hijacking","Threat Actor Storm-2372 Abusing Microsoft Teams for Malware Delivery and Session Hijacking, Microsoft Warns","Microsoft has issued a warning about a threat actor group, tracked as Storm-2372, that is abusing legitimate Microsoft Teams features for cyberattacks. In a report on October 7, 2025, Microsoft detailed how the group uses social engineering within Teams chats and file sharing to deliver malware, trick users into fraudulent authentication flows, and ultimately steal access tokens to hijack user sessions. The attacks are effective because they originate from within the trusted Teams environment, making users more likely to fall for the lures.",[293,1749,1750,106,24],"Token Theft","OAuth",[76,59,24],"Created: Oct 8, 2025",{"id":1754,"slug":1755,"headline":1756,"title":1757,"severity":83,"article_type":11,"excerpt":1758,"tags":1759,"categories":1762,"createdAt":1741,"updatedAt":1741,"displayDate":1752,"isUpdated":27,"readingTime":28},"b391ba89-76c5-48c4-88eb-f330d0fcce46","red-hat-confirms-data-theft-from-consulting-gitlab-instance","Red Hat Consulting GitLab Breached; ShinyHunters Leaks Sensitive Client Data","Red Hat Confirms Data Breach of Consulting GitLab Server; \"Crimson Collective\" and \"ShinyHunters\" Claim Theft of 570GB of Sensitive Client Data","Red Hat has confirmed a security breach affecting an internal GitLab server used by its consulting division. A group named 'Crimson Collective,' in collaboration with the notorious extortion group 'ShinyHunters,' claims to have stolen 570GB of data from over 28,000 repositories. The stolen data allegedly includes highly sensitive 'Customer Engagement Reports' containing network diagrams, configurations, and access details for over 800 organizations, including Bank of America, Verizon, and the U.S. National Security Agency. While Red Hat states the breach was contained and did not impact its product supply chain, the incident represents a massive supply chain risk for its clients.",[52,1760,890,1334,1761],"GitLab","Client Data",[20,52,59],{"id":1764,"slug":1765,"headline":1766,"title":1767,"severity":10,"article_type":11,"excerpt":1768,"tags":1769,"categories":1771,"createdAt":1741,"updatedAt":1741,"displayDate":1752,"isUpdated":27,"readingTime":77},"f475a15e-4575-4071-ad6e-8e3d2575998b","methodist-homes-discloses-data-breach-affecting-26000","Methodist Homes Discloses Healthcare Data Breach Affecting Nearly 26,000","Methodist Homes of Alabama & Northwest Florida Discloses Data Breach Exposing PHI of Nearly 26,000 Individuals","Methodist Homes of Alabama & Northwest Florida, a senior living and healthcare provider, announced on October 8, 2025, that it suffered a data breach affecting 25,579 individuals. The incident, which occurred over a 12-day period in October 2024, resulted in unauthorized access to sensitive personal and protected health information (PHI). The compromised data includes names, Social Security numbers, driver's license numbers, and detailed clinical information. The organization's disclosure comes nearly a year after the initial detection of the breach.",[156,344,155,283,1770],"Delayed Disclosure",[20,218],{"id":1773,"slug":1774,"headline":1775,"title":1776,"severity":10,"article_type":1777,"excerpt":1778,"tags":1779,"categories":1781,"createdAt":1741,"updatedAt":1741,"displayDate":1752,"isUpdated":27,"readingTime":77},"cb1e6566-d4f9-4daa-b269-8af288ec4ce1","critical-command-injection-flaw-cve-2025-53967-patched-in-figma-tool","Critical RCE Flaw (CVE-2025-53967) Patched in Figma AI Tool","High-Severity Command Injection Vulnerability (CVE-2025-53967) in figma-developer-mcp Allows Remote Code Execution","TechArticle","A high-severity command injection vulnerability, CVE-2025-53967, has been discovered and patched in the 'figma-developer-mcp' Model Context Protocol server, a tool used with the Figma design platform. The flaw, rated with a CVSS score of 7.5, could allow an unauthenticated attacker to achieve remote code execution (RCE) on a server running the tool. The vulnerability, discovered by Imperva, stemmed from the unsanitized use of user input in command-line strings. Users are urged to update to the patched version to mitigate the risk of server compromise.",[172,184,1046,1780,253],"Open Source Security",[95,175],{"id":1783,"slug":1784,"headline":1785,"title":1786,"severity":65,"article_type":166,"excerpt":1787,"tags":1788,"categories":1790,"createdAt":1741,"updatedAt":1741,"displayDate":1752,"isUpdated":27,"readingTime":794},"4bc856d6-cac1-416b-acda-e62908f94828","google-releases-october-2025-security-update-for-pixel-devices","Google Rolls Out October 2025 Security Update for Pixel Devices","Google Publishes October 2025 Pixel Update Bulletin, Patching Numerous Security Vulnerabilities","Google has released its scheduled October 2025 security update for all supported Pixel devices. The update, detailed in the Pixel Update Bulletin on October 8, 2025, addresses numerous security vulnerabilities. It incorporates all patches from the broader October 2025 Android Security Bulletin, along with additional fixes for flaws specific to Pixel hardware components. Google urges all Pixel users to accept the over-the-air (OTA) update to protect their devices from potential exploitation.",[466,69,75,1789,95],"Firmware",[175,75],{"id":1792,"slug":1793,"headline":1794,"title":1795,"severity":208,"article_type":11,"excerpt":1796,"tags":1797,"categories":1801,"createdAt":1741,"updatedAt":1741,"displayDate":1752,"isUpdated":27,"readingTime":794},"0712a7a9-6dc2-41a6-80fd-e278af28cec6","atos-partners-with-qevlar-ai-to-bolster-soc-with-virtual-analyst","Atos Partners with Qevlar AI to Deploy \"Virtual SOC Analyst\"","Atos Announces Strategic Partnership with Qevlar AI to Integrate Agentic AI into Global SOC Network","On October 7, 2025, the global digital transformation and cybersecurity firm Atos announced a strategic partnership with Qevlar AI. The collaboration will integrate Qevlar's 'Virtual SOC Analyst,' an agentic AI technology, into Atos's global network of 17 Security Operations Centers (SOCs). The goal is to automate routine and intermediate security alert investigations, allowing Atos's human analysts to focus on more complex tasks like proactive threat hunting. The partnership aims to enhance operational efficiency for Atos's 2,000+ managed security customers.",[253,279,1798,1799,1800,283],"SOC","MSSP","Threat Detection",[242,43],{"id":1803,"slug":1804,"headline":1805,"title":1806,"severity":10,"article_type":11,"excerpt":1807,"tags":1808,"categories":1810,"createdAt":1059,"updatedAt":1811,"displayDate":1732,"isUpdated":112,"readingTime":28},"fd5bf19a-d6c5-4d4f-b08d-3cb5eb4431f3","sonicwall-breach-escalates-100-percent-of-cloud-backups-stolen","SonicWall Breach Escalates: 100% of Cloud Backups Confirmed Stolen","SonicWall Confirms 100% of Cloud Backup Customers Had Firewall Configurations Stolen","Firewall vendor SonicWall has dramatically escalated the severity of a recent data breach, confirming that an investigation found that 100% of customers using its cloud backup service had their firewall configuration files stolen. This admission, made on October 6, 2025, after an investigation with Mandiant, starkly contrasts with the company's initial September statement that only 5% of its user base was affected. The stolen files, accessed via the MySonicWall portal, contain sensitive network architecture details and encrypted credentials, posing a significant reconnaissance risk for future attacks against all affected customers.",[20,1136,52,24,1809],"Firewall",[20,52,24],"2025-10-08T12:00:00Z",{"id":1813,"slug":1814,"headline":1815,"title":1816,"severity":10,"article_type":11,"excerpt":1817,"tags":1818,"categories":1822,"createdAt":1730,"updatedAt":1811,"displayDate":1732,"isUpdated":112,"readingTime":28},"7cb110e1-0712-454f-bee4-308175f8c70e","scattered-lapsus-hunters-launches-extortion-site-targeting-salesforce-customers","New 'Scattered Lapsus$ Hunters' Gang Extorts 39 Salesforce Customers on Leak Site","Scattered Lapsus$ Hunters Collective Launches Leak Site, Extorting Salesforce and 39 High-Profile Customers","A new cybercriminal collective calling itself 'Scattered Lapsus$ Hunters' has emerged, claiming to be a merger of members from Scattered Spider, Lapsus$, and ShinyHunters. The group launched a dark web data leak site over the weekend of October 4-5, listing 39 major companies, including Cisco, Toyota, and Marriott, as victims of a massive data breach affecting their Salesforce instances. The actors claim to have exfiltrated nearly one billion records and have set an October 10 deadline for ransoms to be paid. In an unusual tactic, they have also demanded that Salesforce pay a ransom to spare the listed victims, threatening to release documents proving alleged security negligence. The breaches are suspected to have originated from vishing attacks targeting IT help desks.",[1334,36,104,1819,1820,1821,106],"Scattered Spider","Lapsus$","Vishing",[59,20,122],{"id":1824,"slug":1825,"headline":1826,"title":1827,"severity":10,"article_type":166,"excerpt":1828,"tags":1829,"categories":1832,"createdAt":1730,"updatedAt":1811,"displayDate":1732,"isUpdated":112,"readingTime":77},"eeb00ca1-e027-47fe-ba40-a655d4f16796","cisa-adds-actively-exploited-zimbra-xss-zero-day-to-kev-catalog","CISA Adds Actively Exploited Zimbra XSS Zero-Day (CVE-2025-27915) to KEV Catalog","Actively Exploited Zero-Day XSS Vulnerability in Zimbra Collaboration Suite (CVE-2025-27915) Added to CISA KEV","On October 7, 2025, CISA added CVE-2025-27915, a high-severity zero-day vulnerability in the Zimbra Collaboration Suite (ZCS), to its Known Exploited Vulnerabilities (KEV) catalog. The flaw is a stored cross-site scripting (XSS) issue in the ZCS Classic Web Client that can be triggered with no user interaction beyond viewing a malicious email. An attacker can craft a malicious iCalendar invitation that, when processed, executes arbitrary JavaScript in the victim's authenticated session. This allows for account takeover, data exfiltration, and redirection of sensitive emails. Federal agencies are mandated to apply mitigations by October 28, 2025.",[87,1285,1830,170,226,1831],"Zimbra","Email Security",[95,76],{"id":1834,"slug":1835,"headline":1836,"title":1837,"severity":208,"article_type":11,"excerpt":1838,"tags":1839,"categories":1844,"createdAt":1730,"updatedAt":1730,"displayDate":1845,"isUpdated":27,"readingTime":77},"ae8fc38d-51b2-416f-ab66-c8faf8eef973","signal-threatens-eu-exit-over-chat-control-mass-surveillance-bill","Signal Threatens to Exit EU Market if \"Chat Control\" Mass Surveillance Bill Passes","Signal Vows to Cease Operations in European Union Over Proposed \"Chat Control\" Encryption-Breaking Law","Meredith Whittaker, the president of the Signal Foundation, has declared that the encrypted messaging service will withdraw from the European Union if the controversial 'Chat Control' legislation is enacted. The proposed law, which faces a critical vote on October 14, would mandate that communication platforms like Signal and WhatsApp scan all user content, including private messages and photos, for illicit material before it is encrypted. Critics, including Signal, argue this would create a backdoor for mass surveillance, fundamentally break end-to-end encryption, and create a dangerous cybersecurity precedent. The statement is a direct appeal to EU member states, particularly Germany, to vote against the measure.",[1840,1841,437,215,1842,1843],"Encryption","Privacy","Chat Control","Signal",[43,218],"Created: Oct 7, 2025",{"id":1847,"slug":1848,"headline":1849,"title":1850,"severity":10,"article_type":166,"excerpt":1851,"tags":1852,"categories":1853,"createdAt":1730,"updatedAt":1730,"displayDate":1845,"isUpdated":27,"readingTime":77},"91f680ec-de23-440b-b4a5-1cabef88eaf6","cisa-adds-actively-exploited-windows-clfs-privilege-escalation-flaw-to-kev","CISA Warns of Actively Exploited Windows Privilege Escalation Flaw (CVE-2021-43226)","CISA Adds Windows CLFS Driver Privilege Escalation Vulnerability (CVE-2021-43226) to KEV Catalog","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added CVE-2021-43226, a high-severity privilege escalation vulnerability in the Microsoft Windows Common Log File System (CLFS) Driver, to its Known Exploited Vulnerabilities (KEV) catalog. The action, taken on October 6, 2025, confirms the flaw is being actively exploited in the wild. The vulnerability allows a local, authenticated attacker to execute code with SYSTEM-level privileges by leveraging a buffer overflow. The flaw affects a wide range of Windows versions, including Windows 10, 11, and Server editions. Federal agencies have been directed to patch the vulnerability by October 27, 2025.",[239,1533,170,226,175],[95,175],{"id":1855,"slug":1856,"headline":1857,"title":1858,"severity":10,"article_type":11,"excerpt":1859,"tags":1860,"categories":1862,"createdAt":1730,"updatedAt":1730,"displayDate":1845,"isUpdated":27,"readingTime":28},"c8f13620-2aa7-4dd5-ac5d-611ab72be216","jaguar-land-rover-begins-phased-production-restart-after-cyberattack","Jaguar Land Rover Begins Phased Restart a Month After Crippling Cyberattack","Jaguar Land Rover Initiates Phased Production Restart Following Month-Long Shutdown from Cyberattack","On October 7, 2025, Jaguar Land Rover (JLR) announced it is beginning a phased restart of its manufacturing plants, more than a month after a major cyberattack on August 31 halted its global operations. The attack disrupted everything from production lines and parts flow to retail systems. The restart is beginning cautiously, with engine plants and stamping operations coming online first, and full production is hoped for by the end of October. The incident has caused a significant financial blow, with sales dropping sharply in all markets. In response to the crisis, JLR has also launched a new financing program to support its struggling suppliers who have lost weeks of orders.",[23,283,532,1861,122,625],"JLR",[23,283,145],{"id":1864,"slug":1865,"headline":1866,"title":1867,"severity":208,"article_type":11,"excerpt":1868,"tags":1869,"categories":1873,"createdAt":1730,"updatedAt":1730,"displayDate":1845,"isUpdated":27,"readingTime":77},"5deb3b2c-0b53-475f-9f65-d138552736d7","ai-risk-disclosures-surge-among-sp-500-companies-report","AI Risk Disclosures Skyrocket Among S&P 500, Cybersecurity a Top Concern","Report: Over 70% of S&P 500 Companies Now Cite AI as a Material Risk, Up from 12% in 2023","A new report from The Conference Board, released on October 7, 2025, reveals a dramatic shift in corporate risk perception, with over 70% of S&P 500 companies now formally disclosing AI-related risks in their public filings. This is a massive jump from just 12% in 2023. Reputational damage is the most cited concern (38%), followed closely by cybersecurity risks (20%). Companies are increasingly worried about how AI expands the attack surface, introduces new vulnerabilities through third-party tools, and creates new legal and regulatory challenges. The findings highlight that while AI adoption is accelerating, corporate governance and oversight are still struggling to keep pace.",[253,1870,1871,1872,622],"Artificial Intelligence","Risk Management","Corporate Governance",[43,24],{"id":1875,"slug":1876,"headline":1877,"title":1878,"severity":83,"article_type":166,"excerpt":1879,"tags":1880,"categories":1883,"createdAt":1730,"updatedAt":1730,"displayDate":1845,"isUpdated":27,"readingTime":28},"37be1090-7bdb-4c1f-bc59-2f57c0131285","redis-patches-critical-redishell-rce-vulnerability-cve-2025-49844","Redis Patches Critical \"RediShell\" RCE Flaw (CVE-2025-49844) in Lua Sandbox","Critical \"RediShell\" RCE Vulnerability (CVE-2025-49844) in Redis Allows Sandbox Escape","Redis has released patches for CVE-2025-49844, a critical use-after-free vulnerability nicknamed \"RediShell\" by the Wiz researchers who discovered it. The flaw, announced on October 7, 2025, allows an authenticated attacker to escape the Lua sandbox and achieve remote code execution (RCE) on the underlying server. The risk is especially high for the estimated 330,000 internet-exposed Redis instances, around 60,000 of which are believed to have no authentication enabled. Because official Redis container images disable authentication by default, these instances are vulnerable to unauthenticated RCE. Security agencies like Germany's BSI are warning of imminent exploitation.",[184,1881,1882,95,1044,24],"Redis","Sandbox Escape",[95,24],{"id":1885,"slug":1886,"headline":1887,"title":1888,"severity":208,"article_type":11,"excerpt":1889,"tags":1890,"categories":1895,"createdAt":1730,"updatedAt":1730,"displayDate":1845,"isUpdated":27,"readingTime":794},"0b155f34-525b-474b-b706-67d6d4f0f6c8","digicloud-africa-partners-with-google-to-distribute-secops-platform","Digicloud Africa to Distribute Google's AI-Powered SecOps Platform Across Continent","Digicloud Africa Becomes Official Distributor for Google Security Operations in Africa","Digicloud Africa, a major Google Cloud distributor, announced on October 6, 2025, that it has partnered with Google Security Operations. This collaboration will make Google's advanced, AI-driven cybersecurity solutions, including its cloud-native SIEM and SOAR platform, available to enterprises and organizations across the African continent. The partnership aims to help African businesses modernize their security posture, moving from reactive to proactive, intelligence-driven defense strategies to combat the growing complexity of cyber threats in the region.",[1891,1892,1893,284,1894,24],"Google","SecOps","SIEM","Africa",[242,24],{"id":1897,"slug":1898,"headline":1899,"title":1900,"severity":10,"article_type":166,"excerpt":1901,"tags":1902,"categories":1904,"createdAt":1059,"updatedAt":1905,"displayDate":1906,"isUpdated":112,"readingTime":77},"4e038bfd-2ffc-4a59-a536-063a672dbc35","cisa-issues-advisories-for-widespread-industrial-control-system-flaws","CISA Warns of Widespread Flaws in Industrial Control Systems from Major Vendors","CISA Issues Multiple Advisories for Vulnerabilities in Rockwell, Hitachi, and Mitsubishi ICS Products","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has released a series of advisories warning of numerous vulnerabilities in Industrial Control Systems (ICS) from prominent vendors, including Rockwell Automation, Hitachi Energy, Mitsubishi Electric, and Delta Electronics. These flaws affect products widely deployed in the energy sector and other critical infrastructure domains. CISA is urging administrators to review the advisories and apply patches and mitigations immediately to prevent potential exploitation that could lead to operational disruptions or cyberattacks against critical national infrastructure.",[142,842,170,95,141,1102,1903],"Hitachi Energy",[145,95,218],"2025-10-07T00:00:00Z","Updated: Oct 6, 2025",{"id":1908,"slug":1909,"headline":1910,"title":1911,"severity":83,"article_type":166,"excerpt":1912,"tags":1913,"categories":1916,"createdAt":1059,"updatedAt":1059,"displayDate":1917,"isUpdated":27,"readingTime":28},"4e4731ac-f25f-4327-884c-325af1e320f0","microsoft-october-2025-patch-tuesday-fixes-3-actively-exploited-zero-days","Microsoft Patches 3 Zero-Days Under Active Attack in Massive October Update","Microsoft's October 2025 Patch Tuesday Addresses 175 Vulnerabilities, Including Three Actively Exploited Zero-Days","Microsoft has released its October 2025 Patch Tuesday update, a colossal release addressing 175 security flaws across its product suite. The update is highlighted by emergency patches for three zero-day vulnerabilities confirmed to be actively exploited in the wild. These critical flaws, now added to CISA's KEV catalog, include two privilege escalation bugs in Windows components (CVE-2025-59230 and CVE-2025-24990) and a Secure Boot bypass (CVE-2025-47827). The update also fixes a critical 9.8 CVSS RCE vulnerability in WSUS (CVE-2025-59287), posing a significant supply-chain risk. Administrators are urged to apply these updates immediately to mitigate active threats.",[466,87,239,184,1914,1533,1915],"Secure Boot","CISA KEV",[175,95,23],"Created: Oct 6, 2025",{"id":1919,"slug":1920,"headline":1921,"title":1922,"severity":10,"article_type":193,"excerpt":1923,"tags":1924,"categories":1928,"createdAt":1059,"updatedAt":1059,"displayDate":1917,"isUpdated":27,"readingTime":28},"850c557b-6554-4129-af07-24cdba996a4a","chinese-apt-flax-typhoon-uses-arcgis-server-as-backdoor-for-espionage","Chinese APT Flax Typhoon Weaponizes ArcGIS Server as Persistent Backdoor in Year-Long Spy Campaign","Flax Typhoon APT Exploited Esri ArcGIS Server for Over a Year as a Backdoor into Government Networks","The China-linked threat group Flax Typhoon (also known as Ethereal Panda) conducted a sophisticated, year-long espionage campaign against a government agency by compromising an Esri ArcGIS server. According to researchers at ReliaQuest, the attackers modified a legitimate Java server object extension (SOE) to create a persistent web shell. This backdoor, combined with extensive use of living-off-the-land techniques like PowerShell and a renamed SoftEther VPN client, allowed the APT group to maintain long-term access, move laterally, and harvest credentials while evading detection by hiding within legitimate server traffic.",[89,1925,294,1926,92,1927,969],"Flax Typhoon","Living-off-the-land","ArcGIS",[59,23,145],{"id":1930,"slug":1931,"headline":1932,"title":1933,"severity":10,"article_type":11,"excerpt":1934,"tags":1935,"categories":1936,"createdAt":1059,"updatedAt":1059,"displayDate":1917,"isUpdated":27,"readingTime":28},"5b3a9737-c722-4150-8fb6-2e1e6a4fa744","qilin-ransomware-demands-10m-after-crippling-asahi-breweries","Qilin Ransomware Cripples Asahi Breweries, Demands $10 Million Ransom","Qilin Ransomware Group Claims Attack on Asahi, Halting Production and Demanding $10M Ransom","The Qilin ransomware group has claimed responsibility for a devastating cyberattack against Asahi Group Holdings, one of Japan's largest beverage companies. The attack, which occurred in late September, forced the company to halt production at 30 factories and suspend shipments, leading to significant operational and financial disruption. The threat actors are now reportedly demanding a $10 million ransom to prevent the public release of exfiltrated company data, employing a classic double extortion tactic. The incident highlights the increasing trend of ransomware gangs targeting the manufacturing sector to maximize impact and pressure victims into paying large ransoms.",[122,280,523,532,325],[122,23,145],{"id":1938,"slug":1939,"headline":1940,"title":1941,"severity":65,"article_type":193,"excerpt":1942,"tags":1943,"categories":1946,"createdAt":1059,"updatedAt":1059,"displayDate":1917,"isUpdated":27,"readingTime":77},"3b22c614-55aa-4d69-b319-6fa60b7eb70e","novel-phishing-attack-abuses-npm-and-unpkg-cdn-for-credential-theft","Phishing Campaign Abuses NPM and UNPKG CDN to Steal Credentials","Novel \"Beamglea\" Phishing Campaign Weaponizes NPM Registry and UNPKG CDN to Deliver Malware","A sophisticated phishing campaign, dubbed \"Beamglea,\" is abusing the public NPM registry and the trusted unpkg.com CDN to host and deliver credential-stealing malware. Researchers at Socket discovered over 175 malicious, disposable NPM packages created solely to serve a malicious JavaScript file. Attackers send HTML lures to victims that load the script from the reputable unpkg.com domain, bypassing traditional domain-based security filters. This technique, which has targeted over 135 organizations in Europe, represents a dangerous evolution in supply chain abuse, turning developer infrastructure into a tool for direct phishing attacks.",[76,52,1944,1945,1368],"NPM","CDN Abuse",[76,52,57],{"id":1948,"slug":1949,"headline":1950,"title":1951,"severity":208,"article_type":250,"excerpt":1952,"tags":1953,"categories":1956,"createdAt":1059,"updatedAt":1059,"displayDate":1917,"isUpdated":27,"readingTime":77},"2c8dfb05-b646-4f4b-b6e5-48d986719584","g7-cyber-experts-issue-statement-on-managing-ai-risks-in-financial-sector","G7 Cyber Experts Issue Statement on Managing AI Risks in Financial Sector","G7 Cyber Expert Group Publishes Statement on Managing Artificial Intelligence Risks in the Financial Sector","The G7 Cyber Expert Group (CEG) has issued a formal statement on the cybersecurity implications of Artificial Intelligence (AI) within the financial sector. Released on October 6, 2025, the document highlights the dual nature of AI, acknowledging its potential to bolster cyber defenses while also warning that it can amplify existing threats and introduce new vulnerabilities. The G7 CEG urges financial institutions and regulators to proactively develop robust governance and risk management frameworks to ensure the secure and resilient adoption of AI, promoting collaboration to establish global best practices.",[253,1870,1954,778,1955,214],"G7","Cyber Risk",[43,218,24],{"id":1958,"slug":1959,"headline":1960,"title":1961,"severity":10,"article_type":193,"excerpt":1962,"tags":1963,"categories":1967,"createdAt":1059,"updatedAt":1059,"displayDate":1917,"isUpdated":27,"readingTime":28},"607ea6bb-2047-4dc9-84bb-4f7b349c92e6","maverick-new-banking-trojan-spreads-via-whatsapp-in-brazil","\"Maverick\": New Banking Trojan Spreads via WhatsApp in Brazil","New \"Maverick\" Banking Trojan Spreads via WhatsApp in Massive Campaign Targeting Brazilian Users","A new and sophisticated fileless banking Trojan named \"Maverick\" is spreading rapidly in Brazil through a large-scale WhatsApp campaign. According to Kaspersky researchers, the malware is delivered via ZIP archives containing malicious LNK files, a method that bypasses the platform's file-blocking. Maverick operates entirely in memory to evade detection, using PowerShell and encrypted shellcode to steal credentials for 26 Brazilian banks and multiple cryptocurrency exchanges. The Trojan also features a worm-like self-propagation mechanism, hijacking the victim's WhatsApp Web session to automatically send the malicious payload to all their contacts.",[57,70,1964,1965,1966,76,521],"Maverick","WhatsApp","Fileless",[57,76,75],0,"2025-10-29T18:54:02.502Z",1761764042104]