[{"data":1,"prerenderedAt":79},["ShallowReactive",2],{"publication-daily-threat-publications-2026-01-13":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2026-01-13","CISA KEV Alert for Gogs RCE Flaw; BreachForums Database Leaked; AI Threats Forecasted to Rise","This cybersecurity brief for January 13, 2026, covers several major incidents. CISA has added a critical, actively exploited Gogs vulnerability (CVE-2025-8110) to its KEV catalog, demanding urgent patching. In a significant blow to the cybercrime ecosystem, the user database of the notorious BreachForums was leaked, exposing nearly 324,000 members. Additionally, telecom provider Brightspeed is investigating a major breach claim, while reports from Experian and Everstream Analytics forecast a surge in AI-driven attacks and cyber threats against the global supply chain. Other key events include a critical 10.0 CVSS vulnerability in the n8n automation platform and a new roadmap from the G7 for post-quantum cryptography in the financial sector.","2026-01-13",4,[10,35,52,66],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":24,"createdAt":28,"updatedAt":28,"readingTime":29,"cves":30,"cvssScore":33,"isUpdate":34},"afaa2e60-38c3-45b9-b3ac-088582b7ae50","cisa-adds-actively-exploited-gogs-rce-vulnerability-to-kev-catalog","Urgent Patch: CISA Adds Actively Exploited Gogs RCE Flaw to KEV Catalog","CISA Catalogs Actively Exploited Gogs Path Traversal Vulnerability (CVE-2025-8110) Leading to RCE","critical","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical path traversal vulnerability, CVE-2025-8110, in the Gogs self-hosted Git service to its Known Exploited Vulnerabilities (KEV) catalog. This flaw, which allows for remote code execution (RCE) via symlink manipulation, is confirmed to be actively exploited in the wild. With a CVSS score of 8.7, it bypasses a previous patch for CVE-2024-55947. Federal agencies are mandated to remediate by February 2, 2026. The vulnerability affects an estimated 1,600 internet-exposed Gogs servers, posing a significant risk to organizations using the platform for source code management.",[18,19,20,21,22,23],"KEV","Path Traversal","RCE","Symlink","Git","Source Code Management",[25,26,27],"Vulnerability","Cyberattack","Patch Management","2026-01-13T15:00:00.000Z",6,[31,32],"CVE-2025-8110","CVE-2024-55947",8.7,false,{"id":36,"slug":37,"headline":38,"title":39,"severity":40,"excerpt":41,"tags":42,"categories":49,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":34},"e389f984-106b-4e25-b7f7-792ceb89bd84","breachforums-user-database-leaked-exposing-324000-cybercriminals","Poetic Justice: BreachForums Hacked, Database of 324,000 Cybercriminals Leaked","BreachForums User Database Leaked, Exposing Private Data of Nearly 324,000 Forum Members","high","In a significant turn of events for the cybercrime community, the user database for the notorious hacking marketplace BreachForums was leaked online on January 9, 2026. The dump contains sensitive records for 323,986 users, including usernames, email addresses, IP addresses, private messages, and Argon2-hashed passwords. The breach, allegedly occurring in August 2025 and claimed by an individual named \"James,\" represents a major operational security failure and provides a trove of intelligence for law enforcement agencies seeking to identify and prosecute threat actors like 'IntelBroker' and 'ShinyHunters' who were active on the forum.",[43,44,45,46,47,48],"Cybercrime","Hacking Forum","Database Leak","Law Enforcement","Threat Intelligence","OPSEC",[50,26,51],"Data Breach","Threat Actor",{"id":53,"slug":54,"headline":55,"title":56,"severity":40,"excerpt":57,"tags":58,"categories":64,"createdAt":28,"updatedAt":28,"readingTime":8,"isUpdate":34},"1a3b8a82-4caf-4b22-ae3f-1cbfdda7750c","oregon-deq-data-breach-of-4800-people-kept-secret-for-nine-months","Oregon DEQ Kept Data Breach of 4,800 People Secret for Nine Months","Oregon Department of Environmental Quality Confirms April 2025 Data Breach After Nine-Month Delay","The Oregon Department of Environmental Quality (DEQ) confirmed on January 13, 2026, that a cyberattack in April 2025 exposed the personal data of approximately 4,800 people. The agency opted not to issue a broad public disclosure, citing that Oregon law did not require it, and instead began sending notification letters to affected individuals in late December 2025, over eight months after the incident. The initial attack, which the Rhysida ransomware gang later claimed, caused significant operational disruption. The delay in notification has drawn criticism and raises questions about the agency's transparency and incident response process.",[59,60,61,62,63],"Incident Response","Data Breach Notification","Transparency","Government","Ransomware",[50,59,65],"Regulatory",{"id":67,"slug":68,"headline":69,"title":70,"severity":40,"excerpt":71,"tags":72,"categories":78,"createdAt":28,"updatedAt":28,"readingTime":8,"isUpdate":34},"c77dc7ca-d2b3-40fd-8da2-ef306095664a","french-immigration-agency-data-leaked-via-third-party-contractor-breach","French Immigration Agency Data Leaked via Third-Party Breach","Data of Foreign Residents in France Leaked in Supply Chain Attack on Immigration Agency's Contractor","France's Office for Immigration and Integration (OFII) has confirmed a data breach originating from a compromised third-party service provider. In early January 2026, a hacker claimed to be selling a database of up to 2.1 million records of foreign residents on BreachForums, posting samples that included names, contact details, and nationalities. OFII clarified that its own systems were not breached, but that the attack targeted a private training provider responsible for mandatory integration courses. The incident highlights the significant risks of supply chain attacks for government agencies and could lead to GDPR penalties for OFII as the data controller.",[73,74,75,62,76,77],"Supply Chain Attack","Third Party Breach","GDPR","France","PII",[50,73,65],1770214189211]