[{"data":1,"prerenderedAt":143},["ShallowReactive",2],{"publication-daily-threat-publications-2025-12-07":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-12-07","React2Shell Exploitation Surges as CISA Adds to KEV; Clop Hits NHS via Oracle Zero-Day","This cybersecurity brief for December 7, 2025, covers a critical period marked by the widespread, active exploitation of the React2Shell vulnerability (CVE-2025-55182), prompting its addition to CISA's KEV catalog. State-sponsored actors and cybercriminals are leveraging the flaw for broad attacks. Concurrently, the Clop ransomware group executed a significant data breach against the UK's Barts Health NHS Trust by exploiting an Oracle zero-day. Other major developments include the discovery of long-running supply chain attacks in Go and Rust package registries, a joint US-Canada warning about Chinese 'Brickstorm' malware targeting VMware, and a no-click vulnerability in WhatsApp leading to account takeovers. These events underscore the increasing sophistication of threats against software supply chains, critical infrastructure, and widely used applications.","2025-12-07",7,[10,33,56,78,95,110,122],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":25,"createdAt":27,"updatedAt":28,"readingTime":29,"isUpdate":30,"updateSummary":31,"updateContent":32},"bff50863-f8f0-4b0b-a731-84f7fd3ab456","washington-post-confirms-breach-in-massive-oracle-software-attack","Washington Post Breached by Clop Ransomware via Oracle Flaws","Washington Post Confirms Breach in Widespread Clop Ransomware Campaign Targeting Oracle E-Business Suite","high","The Washington Post has officially confirmed it was a victim of a large-scale cyberattack orchestrated by the Clop ransomware group. The threat actors exploited vulnerabilities in Oracle's E-Business Suite, compromising over 100 organizations globally. The campaign involves data exfiltration followed by aggressive extortion tactics, with Clop publicly naming victims on its dark web leak site to pressure them into paying ransoms reportedly as high as $50 million. This incident underscores the significant risk posed by vulnerabilities in widely used enterprise software and the sophisticated, multi-faceted extortion methods employed by modern ransomware gangs.",[18,19,20,21,22,23,24],"Clop","Ransomware","Oracle","E-Business Suite","Data Breach","Extortion","TA505",[19,22,26],"Cyberattack","2025-11-09T15:00:00.000Z","2025-12-07T12:00:00.000Z",6,true,"Clop ransomware campaign adds Barts Health NHS Trust as victim, exploiting a now-patched Oracle E-Business Suite zero-day, leading to patient data leak.","The Clop ransomware campaign, previously reported for breaching the Washington Post, has claimed another significant victim: Barts Health NHS Trust. This attack, which occurred in August 2025, leveraged a zero-day vulnerability in Oracle E-Business Suite, leading to the exfiltration of patient and staff names and addresses from an invoice database. This sensitive data was subsequently published on Clop's dark web leak site. The vulnerability exploited in this wider campaign has now been patched. This incident highlights the severe impact on critical infrastructure and the ongoing threat of data compromise and regulatory fines, further increasing the overall severity of this campaign.",{"id":34,"slug":35,"headline":36,"title":37,"severity":38,"excerpt":39,"tags":40,"categories":48,"createdAt":51,"updatedAt":52,"readingTime":53,"isUpdate":30,"updateSummary":54,"updateContent":55},"b87d6791-586c-40b6-bc5c-8d6366198b6c","global-agencies-launch-effort-against-bulletproof-hosting-providers","Global Coalition Targets 'Bulletproof' Hosting Services Fueling Cybercrime","NSA, CISA, FBI and International Partners Issue Joint Guidance to Dismantle Criminal 'Bulletproof' Hosting Providers","informational","An international coalition of cybersecurity agencies, including the NSA, CISA, and the FBI, has launched a coordinated effort to combat 'bulletproof' hosting (BPH) providers. These services knowingly lease infrastructure to cybercriminals for activities like ransomware and phishing. A new joint advisory urges Internet Service Providers (ISPs) and network defenders to adopt strategies to identify, block, and report these malicious hosts. The guidance focuses on a nuanced approach, including creating high-confidence blocklists and improving 'know your customer' processes, to disrupt the foundational infrastructure of cybercrime.",[41,42,43,44,45,46,47],"Bulletproof Hosting","BPH","CISA","NSA","FBI","Cybercrime Infrastructure","Threat Intelligence",[49,47,50],"Policy and Compliance","Regulatory","2025-11-21T15:00:00.000Z","2025-12-07T00:00:00.000Z",4,"Discovery of Indonesian gambling network abused as resilient C2 infrastructure for malware operators.","Security researchers have uncovered a vast Indonesian gambling network now serving as a command-and-control (C2) and anonymity service for malware operators. This dual-use infrastructure allows threat actors to hide malicious traffic within high-volume gambling communications, making detection and attribution significantly harder. The network provides a resilient platform for various malware campaigns, illustrating a real-world manifestation of the 'bulletproof' hosting challenge that international coalitions are working to disrupt. This discovery highlights the evolving sophistication of cybercrime infrastructure.",{"id":57,"slug":58,"headline":59,"title":60,"severity":15,"excerpt":61,"tags":62,"categories":70,"createdAt":73,"updatedAt":74,"readingTime":75,"isUpdate":30,"updateSummary":76,"updateContent":77},"b7985627-53b7-4ba9-ba85-8d6fc7d1fd4b","cisa-warns-commercial-spyware-targets-signal-whatsapp-users","CISA: Commercial Spyware Hijacking Signal & WhatsApp via Zero-Clicks","CISA Warns of Commercial Spyware Targeting High-Value Individuals via Signal and WhatsApp","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued a critical alert regarding active campaigns using commercial spyware to compromise the Signal and WhatsApp accounts of high-value targets. Attackers are employing sophisticated methods including social engineering, malicious QR codes for device linking, and zero-click exploits that require no user interaction. The campaigns are reportedly targeting current and former government officials, military personnel, and civil society organizations across the U.S., Europe, and the Middle East. CISA warns that initial access to messaging apps is often used as a beachhead to deploy further malware and achieve full device compromise.",[43,63,64,65,66,67,68,69],"spyware","mobile security","Signal","WhatsApp","zero-click","phishing","social engineering",[71,72,47],"Malware","Mobile Security","2025-11-25T15:00:00.000Z","2025-12-07T10:00:00.000Z",5,"WhatsApp zero-click attacks surge globally, 2FA critical defense against widespread exploitation.","A significant surge in 'no-click' WhatsApp account hijackings has been reported globally, with Kuwaiti authorities issuing urgent warnings. This wave of attacks exploits a technical vulnerability allowing account compromise without user interaction. While specific technical details remain undisclosed, the widespread exploitation has led to a sharp increase in compromised accounts. Users are strongly advised to immediately enable two-factor authentication (2FA) within WhatsApp settings, as it is identified as the most effective defense against this ongoing threat.",{"id":79,"slug":80,"headline":81,"title":82,"severity":15,"excerpt":83,"tags":84,"categories":90,"createdAt":93,"updatedAt":93,"readingTime":53,"isUpdate":94},"8d67414b-9543-422b-ac36-06c0b3ced656","malicious-go-packages-impersonate-google-uuid-library-in-supply-chain-attack","Malicious Go Packages Impersonating Google UUID Library Steal Data","Long-Running Typosquatting Campaign Uncovered: Malicious Go Packages Mimic Google UUID Library to Exfiltrate Data","A sophisticated and long-running supply chain attack targeting Go developers has been discovered, active since at least May 2021. The attack involves two malicious packages, `github.com/bpoorman/uuid` and `github.com/bpoorman/uid`, which impersonate a popular Google UUID library using a typosquatting technique. The counterfeit packages are fully functional to avoid suspicion but contain a hidden backdoor. A specific function, `Valid`, is weaponized to secretly encrypt and exfiltrate any data passed to it, such as user IDs or session tokens, to an external paste site. This stealthy method allows the attacker, 'bpoorman', to siphon sensitive information from compromised applications.",[85,86,87,88,89],"Go","Typosquatting","Dependency Confusion","Software Supply Chain","Data Exfiltration",[91,71,92],"Supply Chain Attack","Threat Actor","2025-12-07T15:00:00.000Z",false,{"id":96,"slug":97,"headline":98,"title":99,"severity":38,"excerpt":100,"tags":101,"categories":107,"createdAt":93,"updatedAt":93,"readingTime":109,"isUpdate":94},"cdfdf124-43a4-46f8-af87-9d6488a1f6dd","maguen-group-launches-fortem-cybersecurity-to-global-market","Mexico's Maguen Group Launches Global Cybersecurity Brand 'Fortem'","Mexican Security Giant Maguen Group Rebrands Cyber Division to Fortem Cybersecurity for Global Expansion","Maguen Group, a leading private security firm based in Mexico, has officially launched Fortem Cybersecurity, its new global cybersecurity brand, on December 7, 2025. The new entity is an evolution of the company's existing cybersecurity arm, MT Cyber, which it acquired in 2019. With Fortem, Maguen Group aims to 'democratize cybersecurity' by offering enterprise-level protection to companies of all sizes. The launch marks a strategic push for global expansion, leveraging its existing presence in Mexico, Ecuador, and Germany, with the United States targeted as the next major market.",[102,103,104,105,106],"Cybersecurity Industry","Corporate News","Mexico","Market Expansion","MSSP",[108],"Other",2,{"id":111,"slug":112,"headline":113,"title":114,"severity":15,"excerpt":115,"tags":116,"categories":121,"createdAt":93,"updatedAt":93,"readingTime":53,"isUpdate":94},"15324bb0-143c-4e40-9e1f-c233a9b066e3","malicious-rust-package-evm-units-targets-web3-developers","Malicious Rust Package 'evm-units' Targets Web3 Developers","Malicious Rust Crate 'evm-units' Impersonates Ethereum Tool to Steal Crypto from Web3 Developers","A malicious software package named 'evm-units' has been discovered and removed from Rust's official crates.io registry. The package, downloaded over 7,200 times, targeted Web3 developers by impersonating a legitimate utility for the Ethereum Virtual Machine (EVM). While appearing functional, the crate contained a stealthy, multi-stage loader designed to download and execute operating system-specific malware. The malware included code to specifically evade 360 Total Security, a popular antivirus in China, suggesting the threat actor's focus was on stealing cryptocurrency from developers, likely in the Asian market. A second package, 'uniswap-utils', was also removed for depending on the malicious crate.",[117,118,119,120,91,71],"Rust","crates.io","Web3","Cryptocurrency",[91,71,47],{"id":123,"slug":124,"headline":125,"title":126,"severity":127,"excerpt":128,"tags":129,"categories":136,"createdAt":93,"updatedAt":93,"readingTime":139,"cves":140,"isUpdate":94},"28121332-fdb3-4f8e-bd11-22542188a142","wireshark-vulnerabilities-pose-denial-of-service-risk","Wireshark Vulnerabilities Create Denial-of-Service Risk for Security Teams","CERT-FR Warns of Critical Denial-of-Service Vulnerabilities (CVE-2025-13945, CVE-2025-13946) in Wireshark","medium","France's national cybersecurity agency, CERT-FR, has issued a security advisory for two critical vulnerabilities in Wireshark, the world's most popular network protocol analyzer. The flaws, identified as CVE-2025-13945 and CVE-2025-13946, can be exploited by a remote attacker to cause a denial-of-service (DoS) condition. This poses a significant risk to security operations, as an attacker could crash the tool during a live incident investigation, effectively blinding security analysts. Users are urged to update to the patched versions (4.4.12 and 4.6.2) to mitigate the risk.",[130,131,132,133,134,135],"Wireshark","Denial of Service","DoS","CERT-FR","Security Tools","Patch Management",[137,135,138],"Vulnerability","Security Operations",3,[141,142],"CVE-2025-13945","CVE-2025-13946",1766106524041]