[{"data":1,"prerenderedAt":123},["ShallowReactive",2],{"publication-daily-threat-publications-2025-10-12":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-10-12","Massive Supply Chain Attacks Expose Millions; Clop Ransomware Targets Harvard and Oracle","In the period covering October 12, 2025, the cybersecurity landscape was dominated by large-scale supply chain attacks and aggressive ransomware campaigns. A hacker collective dubbed 'Scattered Lapsus$ Hunters' leaked data for 5.7 million Qantas customers and 7.3 million Vietnam Airlines customers after compromising a shared Salesforce environment. Concurrently, the Clop ransomware gang claimed a breach of Harvard University and was found actively exploiting a zero-day in Oracle E-Business Suite, for which Oracle released an emergency patch for a separate, newly discovered high-severity flaw. Other significant events include the abuse of the Velociraptor DFIR tool to deploy ransomware and reports of North Korean hackers stealing a record $2 billion in crypto assets in 2025.","2025-10-12",7,[10,31,48,62,79,94,110],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":25,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"f7f77e15-89ba-4343-ae20-710a353bb65e","clop-ransomware-gang-claims-breach-of-harvard-university","Clop Ransomware Claims Harvard University Breach, Threatens Data Leak","Notorious Ransomware Group Clop Adds Harvard University to its Dark Web Leak Site","high","The prolific Russian-speaking ransomware group Clop has claimed responsibility for a cyberattack against Harvard University, adding the prestigious institution to its data leak site on October 12, 2025. The group, known for its 'big-game hunting' and exploitation of zero-day vulnerabilities, threatened to publish stolen data, stating that a torrent link would be available soon. The claim has not yet been confirmed by Harvard. Clop, also known as TA505, has a history of high-profile attacks using double-extortion tactics, including the mass exploitation of flaws in MOVEit Transfer and GoAnywhere MFT, which affected hundreds of organizations worldwide.",[18,19,20,21,22,23,24],"Ransomware","Clop","TA505","Harvard University","Data Leak","Big Game Hunting","Zero-Day",[18,26,27],"Threat Actor","Data Breach","2025-10-12T15:00:00.000Z",5,false,{"id":32,"slug":33,"headline":34,"title":35,"severity":15,"excerpt":36,"tags":37,"categories":44,"createdAt":28,"updatedAt":28,"readingTime":45,"cves":46,"cvssScore":47,"isUpdate":30},"bcb975bc-9b64-4416-b3a2-973cd8840d1a","oracle-discloses-new-high-severity-flaw-in-e-business-suite","Oracle Issues Emergency Patch for High-Severity EBS Flaw Amid Active Clop Attacks","Oracle Patches Unauthenticated Data Exposure Flaw (CVE-2025-61884) in E-Business Suite","Oracle has released an emergency security patch for a high-severity vulnerability, CVE-2025-61884, in its E-Business Suite (EBS). The flaw, which has a CVSS score of 7.5, allows an unauthenticated, remote attacker to access sensitive data within the Oracle Configurator module. It affects EBS versions 12.2.3 through 12.2.14. This alert is especially critical as it comes while the Clop ransomware group is actively exploiting a separate, critical zero-day (CVE-2025-61882) in EBS for an executive extortion campaign. While there's no confirmed link, the active targeting of EBS by Clop significantly increases the risk that this new vulnerability will be weaponized. Administrators are urged to apply the patch immediately.",[38,39,40,41,42,19,24,43],"Vulnerability","Oracle","E-Business Suite","CVE-2025-61884","CVE-2025-61882","Patch Management",[38,43,18],4,[41,42],9.8,{"id":49,"slug":50,"headline":51,"title":52,"severity":53,"excerpt":54,"tags":55,"categories":60,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"676ae08d-364d-47c1-98ae-eec43d1702d5","discord-denies-breach-as-hackers-claim-to-leak-1-5tb-of-user-data","Discord Denies Massive Breach Claim After Hackers Allege 1.5TB Data Leak","Discord Refutes Claims of a Major Data Breach and Leak of Government-Issued IDs","medium","Discord is publicly denying claims that it suffered a major data breach. On October 11, 2025, an unknown group of hackers alleged they had exfiltrated and leaked 1.5 terabytes of user data, including highly sensitive government-issued identification documents. Some reports suggested the breach was linked to Discord's Zendesk customer support portal, an allegation Zendesk also refuted, stating its systems were not vulnerable. Discord maintains that its services were not compromised and that the claims are unverified. The significant discrepancy between the hackers' claims and the company's denial leaves the situation unclear, but the mere allegation of leaked IDs poses a serious concern for users.",[56,27,57,58,59],"Discord","Zendesk","Unconfirmed","Identity Theft",[27,61],"Security Operations",{"id":63,"slug":64,"headline":65,"title":66,"severity":15,"excerpt":67,"tags":68,"categories":76,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"93bd5619-0192-4d37-a9ec-9df0ab9c9711","north-korean-hackers-stole-record-2-billion-in-crypto-in-2025","North Korean Hackers Shatter Records, Stealing $2 Billion in Crypto in 2025","North Korean State-Sponsored Hackers Steal Record-Breaking $2 Billion in Cryptocurrency Assets in 2025","North Korean state-sponsored hacking groups have stolen over $2 billion in cryptocurrency assets in 2025 so far, marking the largest annual total ever recorded for the regime. A report highlighted on October 11, 2025, points to the increasing scale and sophistication of these financially motivated cyber operations. The single largest heist of the year was the February 2025 attack on the Bybit cryptocurrency exchange, which accounted for $1.46 billion of the total losses. These attacks on crypto exchanges and DeFi platforms are a critical source of revenue for North Korea, allowing it to circumvent international sanctions and fund its weapons programs.",[69,70,71,72,73,74,75],"North Korea","Lazarus Group","Cryptocurrency","Cyber Heist","Bybit","DeFi","Sanctions Evasion",[26,77,78],"Cyberattack","Malware",{"id":80,"slug":81,"headline":82,"title":83,"severity":15,"excerpt":84,"tags":85,"categories":91,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"2713fd11-2ed8-4b67-b262-a9ffd39a3224","north-korean-it-worker-fraud-scheme-expands-globally","North Korean IT Worker Fraud Scheme Expands, Targeting 5,000 Companies","Global Alert: North Korean Scheme Using Fake IT Workers Infiltrates Thousands of Companies","A sophisticated North Korean scheme using fraudulent IT worker personas to infiltrate companies has expanded into a massive global operation. According to a report from October 11, 2025, researchers have identified over 130 fake identities used in more than 6,500 job interviews with approximately 5,000 companies over a four-year period. These state-sponsored operatives pose as skilled freelance IT workers to secure remote employment, then use their insider access to conduct espionage, steal intellectual property, and divert funds. The campaign, previously thought to be focused on the U.S., is now confirmed to be global, prompting warnings for businesses to enhance their hiring and verification processes for remote workers.",[69,86,87,88,89,90],"Insider Threat","Espionage","Hiring Fraud","Remote Work","Social Engineering",[26,92,93],"Incident Response","Policy and Compliance",{"id":95,"slug":96,"headline":97,"title":98,"severity":99,"excerpt":100,"tags":101,"categories":108,"createdAt":28,"updatedAt":28,"readingTime":45,"cves":109,"cvssScore":47,"isUpdate":30},"d04251c6-6a5b-4a43-9275-35062e945acd","critical-flaw-in-wordpress-plugin-woocommerce-designer-pro-allows-file-deletion","Critical RCE Flaw in WooCommerce Designer Pro Plugin Puts WordPress Sites at Risk","Critical Path Traversal Vulnerability (CVE-2025-6439) in WooCommerce Designer Pro Allows Unauthenticated File Deletion","critical","A critical vulnerability, CVE-2025-6439, has been disclosed in the WooCommerce Designer Pro WordPress plugin. The flaw, rated 9.8 out of 10 on the CVSS scale, is a path traversal issue that allows an unauthenticated attacker to delete arbitrary files on the web server. This could lead to complete data loss, website destruction, or even remote code execution (RCE) by deleting critical files like wp-config.php and re-running the WordPress installation. The vulnerability affects all versions up to and including 1.9.26 and is also present in the 'Pricom' theme which bundles the plugin. Users are urged to update immediately.",[102,38,103,104,105,106,107],"WordPress","CVE-2025-6439","WooCommerce","Path Traversal","RCE","Critical",[38,43],[103],{"id":111,"slug":112,"headline":113,"title":114,"severity":53,"excerpt":115,"tags":116,"categories":120,"createdAt":28,"updatedAt":28,"readingTime":45,"cves":121,"cvssScore":122,"isUpdate":30},"557850c8-cb3d-4583-be18-5c4f0eb2b613","wordpress-plugin-contest-gallery-vulnerable-to-csv-injection","WordPress Plugin 'Contest Gallery' Vulnerable to CSV Injection Attacks","Medium-Severity CSV Injection Flaw (CVE-2025-11254) Disclosed in Contest Gallery WordPress Plugin","A medium-severity CSV injection vulnerability, CVE-2025-11254, has been disclosed in the 'Contest Gallery' plugin for WordPress. The flaw affects all versions up to and including 27.0.3. It allows an unauthenticated attacker to embed malicious formulas into data fields that are later exported as a CSV file by a site administrator. If the administrator opens the malicious CSV file in a spreadsheet program like Microsoft Excel, the formulas can execute, potentially leading to arbitrary code execution on their local machine. The vulnerability has a CVSS score of 4.3 and has been patched in version 28.0.0 of the plugin.",[102,38,117,118,119],"CSV Injection","CVE-2025-11254","Contest Gallery",[38,43],[118],4.3,1761583932955]