[{"data":1,"prerenderedAt":193},["ShallowReactive",2],{"publication-daily-threat-publications-2026-01-26":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2026-01-26","QuantumLeap Ransomware Halts Global Logistics; Critical Zero-Days in NexusFlow and Mobile OSes Actively Exploited","A tumultuous day in cybersecurity for January 26, 2026, is marked by high-impact ransomware, critical zero-day vulnerabilities, and sophisticated nation-state espionage. The newly identified QuantumLeap ransomware has crippled logistics giant NaviGistics, demanding a $50 million ransom. Concurrently, a wormable RCE zero-day (CVE-2026-12345) in the NexusFlow API Gateway and a zero-click flaw (CVE-2026-23456) in iOS and Android are under active attack. Other major incidents include a supply chain attack on a popular NPM package, an AI-powered phishing campaign bypassing MFA, and continued espionage from threat actors like Volt Typhoon and SteelHydra targeting critical infrastructure and renewable energy sectors.","2026-01-26",11,[10,31,51,65,82,99,115,132,150,168,180],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":24,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"4329c134-99df-49e3-b796-92ad8a2dcc87","quantumleap-ransomware-cripples-global-logistics-giant-navigistics","New QuantumLeap Ransomware Demands $50M, Halts Global Shipments at NaviGistics","QuantumLeap Ransomware Hits Logistics Giant NaviGistics, Disrupting Global Supply Chain with $50 Million Demand","high","The global logistics firm NaviGistics has suffered a catastrophic cyberattack from a new ransomware strain dubbed 'QuantumLeap'. The attack, orchestrated by a group calling itself 'Entropy Collective', has encrypted critical systems and brought the company's worldwide shipping and freight operations to a standstill. The threat actors gained initial access via a compromised VPN account lacking multi-factor authentication, demonstrating a sophisticated lateral movement campaign before deploying the payload. The group is demanding a $50 million ransom and has threatened to leak over 2 terabytes of exfiltrated data, including sensitive customer and financial records. This incident highlights the extreme vulnerability of the global supply chain to targeted cyber-extortion and the devastating operational and financial impact of modern ransomware attacks.",[18,19,20,21,22,23],"ransomware","double extortion","supply chain","logistics","cyber extortion","VPN security",[25,26,27],"Ransomware","Data Breach","Cyberattack","2026-01-26T15:00:00.000Z",6,false,{"id":32,"slug":33,"headline":34,"title":35,"severity":36,"excerpt":37,"tags":38,"categories":46,"createdAt":28,"updatedAt":28,"readingTime":29,"cves":48,"cvssScore":50,"isUpdate":30},"c4a5d1e9-88d0-487c-b1ea-ff108ae79e5c","critical-rce-zero-day-in-nexusflow-api-gateway-actively-exploited","Urgent Patch Required: Critical RCE Zero-Day (CVE-2026-12345) in NexusFlow API Gateway Under Active Attack","Actively Exploited RCE Zero-Day in NexusFlow API Gateway (CVE-2026-12345) Allows Full Server Takeover","critical","A critical pre-authentication remote code execution (RCE) zero-day vulnerability, CVE-2026-12345, is being actively exploited in the wild against the popular NexusFlow API Gateway. The flaw, which carries the maximum CVSS score of 10.0, allows unauthenticated attackers to gain complete control of vulnerable servers by sending a single, specially crafted HTTP request. Security firm Horizon Security Labs discovered the exploitation during a breach investigation. The vulnerability is wormable, creating a risk of rapid, widespread compromise. NexusFlow's parent company, Voltara, has released an emergency patch (version 3.8.1) and is urging all customers to update immediately. CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to patch by February 9, 2026.",[39,40,41,42,43,44,45],"zero-day","RCE","API security","buffer overflow","CISA KEV","vulnerability","patch management",[47,27],"Vulnerability",[49],"CVE-2026-12345",10,{"id":52,"slug":53,"headline":54,"title":55,"severity":15,"excerpt":56,"tags":57,"categories":62,"createdAt":28,"updatedAt":28,"readingTime":64,"isUpdate":30},"e83ab92c-172f-4b61-9157-8616909be3ca","medusa-ransomware-group-escalates-attacks-in-africa","Medusa Ransomware Exploits Cybersecurity Gaps, Escalating Attacks Across Africa","Ransomware Gangs like Medusa Thrive in Africa's Cybersecurity Vacuum, Employing Double Extortion Tactics","Ransomware attacks are a pervasive and highly damaging threat across the African continent, where a significant cybersecurity skills and resources gap creates a fertile ground for cybercriminals. Notorious ransomware groups, including Medusa, are increasingly targeting organizations in the region, leveraging double extortion tactics to maximize pressure on their victims. These attacks involve not only encrypting critical data but also stealing it and threatening public release if the ransom is not paid. Key sectors such as healthcare, finance, and critical infrastructure are prime targets. According to reports, a high percentage of African organizations hit by ransomware end up paying the ransom, perpetuating the cycle of attacks. The situation underscores an urgent need for increased investment in cybersecurity infrastructure, skills development, and awareness across the continent.",[18,58,59,60,19,61],"Medusa","Africa","cybersecurity gap","critical infrastructure",[25,63,27],"Threat Actor",5,{"id":66,"slug":67,"headline":68,"title":69,"severity":15,"excerpt":70,"tags":71,"categories":79,"createdAt":28,"updatedAt":28,"readingTime":81,"isUpdate":30},"d914b04f-d69a-4a88-8bbc-932e75afc162","apt-steelhydra-targets-geothermal-energy-sector-with-novel-ics-malware","Nation-State Actor 'SteelHydra' (APT47) Deploys 'GeoShifter' ICS Malware to Spy on Geothermal Energy Firms","SteelHydra (APT47) Targets Geothermal Energy Sector in North America and Iceland with Novel 'GeoShifter' ICS Malware","The nation-state threat actor 'SteelHydra' (also tracked as APT47) is behind a sophisticated cyber-espionage campaign targeting the geothermal energy sector. According to research from Mandiant, the campaign has impacted firms in the United States, Canada, and Iceland. The attackers are using a novel, custom-built malware framework called 'GeoShifter', which is specifically designed to operate in Industrial Control System (ICS) environments and interface with SCADA/PLC systems from vendors like Siemens and Schneider Electric. The initial infection vector is a spear-phishing campaign that deploys a backdoor named 'PipeDreamer'. The ultimate goal of the campaign appears to be the theft of intellectual property and operational data related to geothermal technology, which could be used for economic advantage or to plan future disruptive attacks.",[72,73,74,75,76,77,78],"APT","nation-state","ICS","SCADA","cyber espionage","geothermal energy","spear-phishing",[63,80,27],"Industrial Control Systems",7,{"id":83,"slug":84,"headline":85,"title":86,"severity":36,"excerpt":87,"tags":88,"categories":94,"createdAt":28,"updatedAt":28,"readingTime":29,"cves":96,"cvssScore":98,"isUpdate":30},"28b22c0b-21bd-4b45-895e-ed05e211f4d1","apple-google-release-emergency-patches-for-ghosttouch-zero-click-flaw","Apple & Google Issue Emergency Patches for 'GhostTouch' Zero-Click RCE Flaw (CVE-2026-23456)","Billions of Devices at Risk: Apple and Google Release Out-of-Band Patches for Actively Exploited 'GhostTouch' Zero-Click Vulnerability","Apple and Google have released coordinated, emergency security updates to fix a critical zero-click remote code execution (RCE) vulnerability, dubbed 'GhostTouch' and tracked as CVE-2026-23456. The flaw exists in a core open-source graphics rendering library used by both iOS and Android, affecting billions of smartphones and tablets worldwide. The vulnerability can be exploited by sending a victim a specially crafted image file via messaging apps or email, requiring no user interaction to achieve code execution. Researchers at The Citizen Lab discovered the flaw being actively used by a commercial surveillance vendor to deploy spyware against high-risk individuals. CISA has added the CVE to its KEV catalog, and all users are urged to update to iOS 19.2.1, iPadOS 19.2.1, or the latest Android security patch immediately.",[89,40,44,90,91,92,93,43],"zero-click","iOS","Android","spyware","mobile security",[47,95,27],"Mobile Security",[97],"CVE-2026-23456",9.8,{"id":100,"slug":101,"headline":102,"title":103,"severity":15,"excerpt":104,"tags":105,"categories":113,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"42619796-8503-45f1-b485-c52b74ec04b5","silentvoice-phishing-campaign-uses-ai-deepfakes-to-bypass-mfa","'SilentVoice' Phishing Campaign Weaponizes AI Deepfake Audio to Bypass MFA","Sophisticated 'SilentVoice' Phishing Campaign Uses AI-Generated Deepfake Audio to Trick Employees into Approving Malicious Logins","A sophisticated social engineering campaign named 'SilentVoice' is successfully bypassing multi-factor authentication (MFA) by using AI-generated deepfake audio of corporate executives. According to researchers at Proofpoint, attackers clone an executive's voice from public audio samples and then use it in a vishing (voice phishing) call to a subordinate employee. The deepfake voice creates a sense of urgency, tricking the employee into entering their credentials on a fake site and then approving the subsequent MFA push notification sent to their device. This highly convincing technique circumvents the protection offered by many common MFA methods, leading to full account takeover. The campaign has already resulted in successful breaches and financial fraud, highlighting the emerging threat of AI-weaponized social engineering.",[106,107,108,109,110,111,112],"phishing","vishing","deepfake","AI","social engineering","MFA bypass","account takeover",[114,63,27],"Phishing",{"id":116,"slug":117,"headline":118,"title":119,"severity":15,"excerpt":120,"tags":121,"categories":129,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"ad2aaa0b-e4cd-4f4c-b593-100138560312","popular-npm-package-js-utility-kit-compromised-in-supply-chain-attack","NPM Package 'js-utility-kit' Hijacked in Supply Chain Attack to Steal Crypto Keys and Credentials","Popular NPM Package 'js-utility-kit' with 5M+ Weekly Downloads Compromised to Distribute Info-Stealing Malware","A significant software supply chain attack has compromised the popular NPM package 'js-utility-kit', which is downloaded over 5 million times per week. Security firm Snyk discovered that malicious versions (2.1.8, 2.1.9, and 2.2.1) were published after the maintainer's account was hijacked via a credential stuffing attack. The compromised packages contained a post-install script that downloaded and executed a sophisticated information stealer. The malware was designed to steal cryptocurrency private keys, browser extension data for crypto wallets, and sensitive credentials such as environment variables and cloud provider CLI configurations from developers' machines and CI/CD pipelines. The NPM security team has removed the malicious versions, but any project that installed them between January 24 and 26 is considered compromised and requires immediate auditing and credential rotation.",[122,123,124,125,126,127,128],"supply chain attack","NPM","infostealer","malware","cryptocurrency","developer security","CI/CD",[130,131,26],"Supply Chain Attack","Malware",{"id":133,"slug":134,"headline":135,"title":136,"severity":15,"excerpt":137,"tags":138,"categories":147,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"4c450777-de3e-4ae7-95f7-f906cafd74f8","fintech-startup-voltpay-exposes-5-million-customer-records-in-cloud-leak","Fintech Startup VoltPay Leaks 5 Million Customer Records via Misconfigured Cloud Database","VoltPay Data Breach: Misconfigured Elasticsearch Database Exposes PII and Financial Data of 5 Million Users","The financial technology startup VoltPay has confirmed a massive data breach affecting approximately 5 million users. The leak was caused by a misconfigured Elasticsearch database that was left publicly accessible on the internet without a password for over three months. A security researcher discovered and reported the exposure. The leaked data includes highly sensitive information: full names, email addresses, phone numbers, physical addresses, dates of birth, hashed passwords, and full transaction histories. The last four digits of credit card and bank account numbers were also exposed. This incident, attributed to 'human error during a server migration', places millions of users at significant risk of identity theft and targeted phishing attacks, and has reportedly triggered investigations by U.S. and European regulators.",[139,140,141,142,143,144,145,146],"data breach","cloud security","misconfiguration","Elasticsearch","fintech","PII","GDPR","CCPA",[26,148,149],"Cloud Security","Regulatory",{"id":151,"slug":152,"headline":153,"title":154,"severity":155,"excerpt":156,"tags":157,"categories":164,"createdAt":28,"updatedAt":28,"readingTime":167,"isUpdate":30},"de88d472-bac0-48af-b682-6dc642281961","operation-echidna-dismantles-crimson-market-dark-web-hub","International Operation 'Echidna' Dismantles 'Crimson Market' Dark Web Hub, 50+ Arrested","'Crimson Market' Dark Web Hub Seized in Global 'Echidna' Law Enforcement Operation","informational","A coordinated international law enforcement action, codenamed 'Operation Echidna', has successfully dismantled 'Crimson Market', one of the largest dark web marketplaces for cybercrime tools and stolen data. The operation, involving the FBI, Europol, and the UK's NCA, resulted in the seizure of the market's server infrastructure and the arrest of over 50 individuals worldwide, including its alleged administrator. Crimson Market was a key hub for selling billions of stolen credentials, malware-as-a-service (including ransomware and info-stealers), and phishing kits. The 18-month investigation involved undercover operations to trace cryptocurrency transactions. The takedown represents a major disruption to the cybercrime economy, and data from the seized servers is expected to lead to further arrests.",[158,159,160,161,162,163],"dark web","takedown","law enforcement","cybercrime","Europol","FBI",[165,166],"Threat Intelligence","Policy and Compliance",4,{"id":169,"slug":170,"headline":171,"title":172,"severity":15,"excerpt":173,"tags":174,"categories":179,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"6e5ef7c0-353d-442a-9fe9-8fc48e040efe","volt-typhoon-linked-to-data-breach-at-us-water-utility","Volt Typhoon Linked to Breach at U.S. Water Utility, Exfiltrating Operational Documents","Chinese State-Sponsored Actor Volt Typhoon Breaches U.S. Water Utility via Edge Device Vulnerability","The Chinese state-sponsored group Volt Typhoon has been attributed to a data breach at the Park County Water District in Colorado. According to a joint advisory from CISA, the FBI, and the NSA, the hackers exploited a known vulnerability in an internet-facing network appliance to gain initial access. Consistent with their known TTPs, Volt Typhoon then used 'living off the land' techniques, leveraging built-in network administration tools to blend in and evade detection. The attackers moved laterally within the IT network and exfiltrated sensitive operational documents, including engineering schematics and maintenance schedules. While officials stated that the operational technology (OT) network and water supply were not affected, the incident highlights the group's continued focus on reconnaissance against U.S. critical infrastructure.",[175,72,73,61,176,177,178],"Volt Typhoon","living off the land","CISA","water utility",[63,27,80],{"id":181,"slug":182,"headline":183,"title":184,"severity":185,"excerpt":186,"tags":187,"categories":192,"createdAt":28,"updatedAt":28,"readingTime":64,"isUpdate":30},"56159813-b99a-49cf-83f8-02fa25273176","researchers-detail-chronostealer-a-new-modular-malware-as-a-service","Researchers Detail 'ChronoStealer', a New Modular Info-Stealing Malware-as-a-Service","Check Point Research Uncovers 'ChronoStealer', a Modular Malware-as-a-Service Lowering the Bar for Cybercrime","medium","Security researchers at Check Point have published a deep-dive analysis of 'ChronoStealer', a new and highly modular information-stealing malware sold on a subscription basis in underground forums. This Malware-as-a-Service (MaaS) model allows low-skilled criminals to rent the sophisticated tool and its infrastructure for as little as $200 per month. ChronoStealer's core function is to steal credentials from over 50 web browsers and other applications. Its capabilities can be expanded with add-on modules for stealing cryptocurrency wallets, logging keystrokes, and capturing session cookies. The malware uses the Telegram API for C2 communications to better blend in with legitimate traffic. The rise of such user-friendly, powerful MaaS platforms represents a significant force multiplier for the cybercrime ecosystem.",[125,124,188,189,161,190,191],"MaaS","Malware-as-a-Service","Telegram","Check Point",[131,165],1769521841704]