[{"data":1,"prerenderedAt":138},["ShallowReactive",2],{"publication-daily-threat-publications-2025-10-29":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-10-29","Urgent WSUS Patch Mandated Amidst Wave of Zero-Day Exploits Targeting Oracle, Chrome, and AI Agents","This cybersecurity brief for October 29, 2025, covers a series of critical threats, led by an urgent CISA directive to patch an actively exploited, wormable RCE vulnerability in Windows Server Update Services (CVE-2025-59287). The threat landscape is further defined by major zero-day attacks, with the FIN11/Clop ransomware group targeting Oracle EBS systems at industrial giants, and the 'Mem3nt0 mori' APT exploiting a Chrome zero-day. New malware strains have also emerged, including 'Airstalk' in a suspected nation-state supply chain attack and 'Herodotus', an Android trojan that mimics human behavior. Additionally, a report highlights the destructive impact of the 'Scattered Spider' group and a massive surge in AI-powered vishing attacks.","2025-10-29",7,[10,33,55,74,88,102,120],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":26,"createdAt":28,"updatedAt":29,"readingTime":8,"isUpdate":30,"updateSummary":31,"updateContent":32},"23c3ba71-cc33-4132-89a7-378c36dbc468","qantas-customer-data-leaked-online-after-ransom-deadline-passes","Qantas Data Breach: 5.7M Customer Records Leaked in Salesforce Supply Chain Attack","Hacker Collective 'Scattered Lapsus$ Hunters' Leaks 5.7 Million Qantas Customer Records Following Ransom Demand","high","The personal data of 5.7 million Qantas Airways customers has been published on the dark web by a group calling itself 'Scattered Lapsus$ Hunters'. The leak, which occurred after a ransom deadline passed on October 11, 2025, is part of a broader supply chain attack that compromised a third-party Salesforce system used by one of the airline's offshore call centers. The compromised data includes names, emails, frequent flyer information, and for some, addresses, phone numbers, and dates of birth. The attack vector involved social engineering, with hackers impersonating Salesforce employees to gain access. Qantas confirmed the breach, stating it is one of 39 companies affected by the campaign and that financial data and passwords were not compromised. The incident has prompted warnings of secondary phishing attacks and a class-action complaint.",[18,19,20,21,22,23,24,25],"Data Breach","Supply Chain Attack","Scattered Lapsus$ Hunters","Salesforce","Qantas","Social Engineering","PII","Dark Web",[18,19,27],"Threat Actor","2025-10-12T15:00:00.000Z","2025-10-29T12:00:00.000Z",true,"Scattered Spider tactics, including vishing and MFA bombing, are surging, causing massive losses for UK retailers and highlighting broader campaign impact.","A new KnowBe4 report details the escalating threat from 'Scattered Spider' (UNC3944), the group involved in the Qantas breach. Their social engineering, vishing (up 449%), MFA fatigue, and deepfake audio tactics have led to hundreds of millions in losses for UK retailers like M&S and Harrods. This confirms the Qantas incident as part of a larger, highly impactful campaign, providing critical new context on the group's evolving methods and broader victim scope. Updated mitigation strategies emphasize phishing-resistant MFA and enhanced help desk verification.",{"id":34,"slug":35,"headline":36,"title":37,"severity":15,"excerpt":38,"tags":39,"categories":47,"createdAt":49,"updatedAt":50,"readingTime":51,"cves":52,"isUpdate":30,"updateSummary":53,"updateContent":54},"c8e50d4d-8c97-4c48-9583-73047a32a21e","clop-ransomware-breaches-american-airlines-subsidiary-via-oracle-ebs-flaw","Clop Ransomware Breaches American Airlines Subsidiary Envoy Air, Exploiting Oracle EBS Flaw","Envoy Air, an American Airlines Subsidiary, Confirms Breach by Clop Ransomware in Oracle EBS Hacking Campaign","Envoy Air, a regional airline owned by American Airlines, has confirmed it was a victim of a hacking campaign orchestrated by the Clop ransomware group. The attackers exploited vulnerabilities in Oracle's E-Business Suite (EBS) to gain access and exfiltrate data. While Envoy Air states that no sensitive customer or personal data was compromised, the breach involved some business information and commercial contacts. Clop has listed American Airlines among more than 60 victims of its recent campaign targeting unpatched Oracle systems, threatening to leak stolen data if ransoms are not paid.",[40,41,42,43,44,45,46,18],"Clop","Ransomware","Envoy Air","American Airlines","Oracle","E-Business Suite","CVE-2023-21931",[41,18,48],"Vulnerability","2025-10-18T15:00:00.000Z","2025-10-29T00:00:00.000Z",5,[46],"FIN11/Clop campaign targeting Oracle EBS expands, hitting industrial giants Schneider Electric & Emerson with a zero-day, exfiltrating terabytes of data.","The Clop ransomware campaign exploiting Oracle E-Business Suite vulnerabilities has expanded, now attributed to the FIN11 threat group and confirmed to leverage a zero-day flaw. New high-profile victims include industrial giants Schneider Electric and Emerson, along with Harvard and Wits Universities. Attackers exfiltrated massive data volumes, including 2.7 terabytes from Emerson and 116 gigabytes from Schneider Electric, indicating a severe and widespread threat to critical infrastructure and supply chains. Envoy Air was also part of this broader zero-day campaign.",{"id":56,"slug":57,"headline":58,"title":59,"severity":15,"excerpt":60,"tags":61,"categories":69,"createdAt":72,"updatedAt":72,"readingTime":51,"isUpdate":73},"59389e45-858f-475d-996f-d07bb531a90a","shadow-escape-zero-click-attack-steals-data-from-ai-agents","\"Shadow Escape\": New Zero-Click Attack Steals Data from ChatGPT, Claude, and Gemini","\"Shadow Escape\" Zero-Click Attack Exploits AI Agents like ChatGPT to Silently Exfiltrate Data","A novel zero-click attack vector named \"Shadow Escape\" has been discovered by researchers at Operant, capable of silently exfiltrating sensitive data from popular AI agents like OpenAI's ChatGPT, Anthropic's Claude, and Google's Gemini. The attack exploits the Model Context Protocol (MCP) by embedding hidden malicious instructions within seemingly benign documents. This allows for the theft of personally identifiable information (PII) without any user interaction, bypassing traditional security tools and posing a significant threat to enterprises adopting agentic AI.",[62,63,64,65,66,67,18,68],"AI Security","Zero-Click","ChatGPT","Gemini","Claude","MCP","Prompt Injection",[70,71,18],"Cyberattack","Cloud Security","2025-10-29T15:00:00.000Z",false,{"id":75,"slug":76,"headline":77,"title":78,"severity":15,"excerpt":79,"tags":80,"categories":86,"createdAt":72,"updatedAt":72,"readingTime":51,"isUpdate":73},"477ad402-77a7-438e-ad7d-a6d0f1f170c1","tata-motors-exposes-70tb-of-data-via-misconfigured-aws-keys","Massive 70TB Data Leak at Tata Motors from Exposed AWS Keys","Tata Motors Data Leak Exposes 70TB of Sensitive Data Due to Misconfigured AWS Credentials","A colossal security failure at Tata Motors has resulted in the exposure of over 70 terabytes of sensitive corporate data, customer information, and infrastructure details. The breach, which was first identified in 2023, stemmed from multiple critical misconfigurations, including plaintext Amazon Web Services (AWS) access keys hardcoded on a customer-facing website. These credentials provided unrestricted access to numerous S3 buckets containing a vast trove of data, including customer PII and financial records.",[81,82,83,84,71,85,24],"Data Leak","AWS","S3 Bucket","Misconfiguration","Tata Motors",[18,71,87],"Policy and Compliance",{"id":89,"slug":90,"headline":91,"title":92,"severity":15,"excerpt":93,"tags":94,"categories":101,"createdAt":72,"updatedAt":72,"readingTime":51,"isUpdate":73},"a8a4cd7d-74c9-427b-aa20-66e8225890ae","airstalk-malware-used-in-suspected-nation-state-supply-chain-attack","New \"Airstalk\" Malware Abuses VMware API in Nation-State Supply Chain Attack","Suspected Nation-State Actor Deploys \"Airstalk\" Malware in Supply Chain Attack, Abusing VMware Workspace ONE API","A newly identified malware strain, \"Airstalk,\" has been deployed in a sophisticated supply chain attack believed to be sponsored by a nation-state actor. The activity, tracked as the cluster CL-STA-1009, is notable for its novel command-and-control (C2) technique: it misuses the API of VMware's Workspace ONE Unified Endpoint Management (UEM), formerly AirWatch, to communicate covertly. The malware is also signed with a likely stolen digital certificate to evade detection, pointing to a well-resourced and stealthy adversary.",[95,19,96,97,98,99,100],"Airstalk","Nation-State","VMware","Workspace ONE","Code Signing","Malware",[19,100,27],{"id":103,"slug":104,"headline":105,"title":106,"severity":107,"excerpt":108,"tags":109,"categories":116,"createdAt":72,"updatedAt":72,"readingTime":119,"isUpdate":73},"181f887c-d8d5-4093-85c7-05b1af205ba1","herodotus-android-malware-mimics-human-typing-to-evade-detection","Herodotus Android Malware Mimics Human Typing to Bypass Biometric Security","New \"Herodotus\" Android Banking Trojan Evades Detection by Mimicking Human Typing","medium","A new Android banking trojan named Herodotus has emerged, offered as a Malware-as-a-Service (MaaS) by a threat actor known as 'K1R0'. The malware is notable for its novel evasion technique: it mimics human typing behavior by introducing random delays during remote control sessions. This method is specifically designed to defeat behavioral biometric security systems that analyze user interaction patterns to detect fraud. Active campaigns have been observed targeting banking and crypto app users in Italy and Brazil.",[110,111,100,112,113,114,115],"Herodotus","Android","Banking Trojan","MaaS","Behavioral Biometrics","SMiShing",[100,117,118],"Mobile Security","Phishing",4,{"id":121,"slug":122,"headline":123,"title":124,"severity":125,"excerpt":126,"tags":127,"categories":136,"createdAt":72,"updatedAt":72,"readingTime":51,"cves":137,"isUpdate":73},"22a73d23-ae9a-410b-a01c-b4280d89a5a1","chrome-zero-day-exploited-in-espionage-campaign-by-mem3nt0-mori","Chrome Zero-Day Exploited by \"Mem3nt0 mori\" APT to Deploy Spyware","\"Mem3nt0 mori\" APT Exploits Chrome Zero-Day (CVE-2025-2783) in \"Operation ForumTroll\" Espionage Campaign","critical","A critical zero-day vulnerability in Google Chrome, CVE-2025-2783, has been actively exploited in a targeted espionage campaign dubbed \"Operation ForumTroll.\" The campaign, which began in March 2025, is attributed to the advanced persistent threat (APT) group known as \"Mem3nt0 mori.\" The attackers used the exploit to deliver a sophisticated backdoor called LeetAgent, a spyware tool developed by the Italian vendor Memento Labs, primarily targeting organizations in Russia and Belarus.",[128,129,130,131,132,133,134,135],"Chrome","Zero-Day","CVE-2025-2783","APT","Mem3nt0 mori","Spyware","Espionage","Memento Labs",[48,27,70],[130],1768928046586]