[{"data":1,"prerenderedAt":156},["ShallowReactive",2],{"publication-daily-threat-publications-2026-02-05":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2026-02-05","APT28 Exploits Office Zero-Day in Hours; Critical N8N Flaw Exposes 100K Servers; ShinyHunters Breaches Harvard","In the period of February 4-5, 2026, the cybersecurity landscape was dominated by rapid state-sponsored exploitation and critical vulnerability disclosures. The Russian APT28 group weaponized a Microsoft Office zero-day (CVE-2026-21509) within 24 hours to target European governments. Concurrently, a CVSS 10.0 RCE flaw (CVE-2026-21858) in the N8N automation platform left over 100,000 servers vulnerable to takeover. Adding to the incidents, the ShinyHunters collective claimed a major data breach at Harvard University, exposing 115,000 donor records through a sophisticated vishing campaign. Other significant events include patches from Cisco and F5, and CISA adding a SolarWinds flaw to its KEV catalog.","2026-02-05",8,[10,36,62,83,101,117,130,142],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":26,"createdAt":30,"updatedAt":31,"readingTime":32,"isUpdate":33,"updateSummary":34,"updateContent":35},"2720dcf8-6ad5-45f8-8bfc-f2c3b7e98701","uk-proposes-cyber-security-and-resilience-bill-to-regulate-msps","UK Advances New Bill to Regulate Managed Service Providers (MSPs)","UK's Cyber Security and Resilience Bill to Impose Security Duties on MSPs to Mitigate Supply-Chain Risk","informational","The United Kingdom government is advancing a new Cyber Security and Resilience Bill aimed at strengthening the nation's digital supply chain. A key provision of the bill is to bring Managed Service Providers (MSPs) under direct regulatory oversight for the first time. Citing the systemic risk demonstrated by attacks like the one on Synnovis that impacted the NHS, the legislation will impose security duties on MSPs similar to those already applied to essential services. The goal is to establish a higher baseline of security across the thousands of organizations that rely on MSPs for their IT and security operations.",[18,19,20,21,22,23,24,25],"UK","Regulation","Policy","Compliance","MSP","Managed Service Provider","Supply Chain Security","NIS Regulations",[27,28,29],"Policy and Compliance","Regulatory","Supply Chain Attack","2026-01-24T15:00:00.000Z","2026-02-05T12:00:00.000Z",5,true,"UK's Cyber Security and Resilience Bill passes second reading; ICO urges clear guidance for SMBs.","The UK's Cyber Security and Resilience Bill has successfully passed its second reading in the House of Commons, marking a significant step towards becoming law. The Information Commissioner's Office (ICO) has expressed support for the bill's objectives but has called for the final regulations to provide clear, practical guidance, especially for small and medium-sized businesses (SMBs). This ensures SMBs can meet new requirements without undue burden, highlighting ongoing considerations for the bill's implementation and scope.",{"id":37,"slug":38,"headline":39,"title":40,"severity":41,"excerpt":42,"tags":43,"categories":51,"createdAt":55,"updatedAt":31,"readingTime":32,"cves":56,"cvssScore":59,"isUpdate":33,"updateSummary":60,"updateContent":61},"74b1f102-f96f-41b3-8034-5c99209cecf4","solarwinds-discloses-five-critical-flaws-in-web-help-desk-platform","SolarWinds Discloses Five Critical RCE & Auth Bypass Flaws in Web Help Desk","SolarWinds Reveals Multiple Critical Vulnerabilities in Web Help Desk Platform, Including RCE and Auth Bypass","critical","SolarWinds has disclosed a set of five critical vulnerabilities in its Web Help Desk (WHD) platform, a tool used by over 300,000 organizations. The flaws include two unauthenticated remote code execution (RCE) vulnerabilities and two authentication bypasses, each with a CVSS score of 9.8. This incident highlights a troubling pattern of recurring patch failures, as one of the new flaws, CVE-2025-40553, is the second bypass of an original deserialization vulnerability (CVE-2024-28986) first patched in 2024. Given the critical nature of the flaws, organizations with internet-facing WHD instances are at extreme risk and must patch immediately.",[44,45,46,47,48,49,50],"SolarWinds","Web Help Desk","RCE","authentication bypass","CVE-2025-40553","deserialization","patch bypass",[52,53,54],"Vulnerability","Patch Management","Cyberattack","2026-01-28T15:00:00.000Z",[48,57,58],"CVE-2024-28986","CVE-2025-26399",9.8,"CISA adds SolarWinds WHD RCE (CVE-2025-40551) to KEV catalog, confirming active exploitation. Federal agencies must patch by Feb 6; all organizations urged to update.","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical remote code execution (RCE) vulnerability, CVE-2025-40551, in SolarWinds Web Help Desk (WHD) to its Known Exploited Vulnerabilities (KEV) catalog. This confirms active, in-the-wild exploitation of the deserialization flaw (CVSS 9.8). CISA has mandated that all Federal Civilian Executive Branch (FCEB) agencies must patch this vulnerability by February 6, 2026. This development significantly increases the urgency for all organizations using SolarWinds WHD to apply the latest security patches immediately to prevent compromise. The vulnerability allows unauthenticated attackers to execute arbitrary code.",{"id":63,"slug":64,"headline":65,"title":66,"severity":67,"excerpt":68,"tags":69,"categories":78,"createdAt":79,"updatedAt":79,"readingTime":80,"cves":81,"isUpdate":82},"7f945439-37c8-4f36-bcbe-20d60f93ba43","cisco-f5-release-patches-for-high-severity-dos-rce-flaws","Cisco and F5 Release Urgent Patches for High-Severity DoS and RCE Vulnerabilities","Cisco and F5 Address Multiple High-Severity Flaws in TelePresence, BIG-IP, and NGINX Products","high","Networking giants Cisco and F5 have released a wave of security updates to address multiple high-severity vulnerabilities across their product lines. Cisco patched five flaws, including a remote DoS bug in TelePresence/RoomOS (CVE-2026-20119) and a root-level command execution flaw in Meeting Management software (CVE-2026-20098). Concurrently, F5 addressed five vulnerabilities in its BIG-IP and NGINX products, two of which are rated high-severity: a DoS flaw in BIG-IP (CVE-2026-22548) and a man-in-the-middle vulnerability in NGINX (CVE-2026-1642). Customers are strongly advised to apply the patches promptly to mitigate risks of service disruption and system compromise.",[70,71,53,52,72,46,73,74,75,76,77],"Cisco","F5","DoS","MitM","CVE-2026-20119","CVE-2026-20098","CVE-2026-22548","CVE-2026-1642",[53,52],"2026-02-05T15:00:00.000Z",4,[74,75,76,77],false,{"id":84,"slug":85,"headline":86,"title":87,"severity":67,"excerpt":88,"tags":89,"categories":98,"createdAt":79,"updatedAt":79,"readingTime":32,"cves":100,"isUpdate":82},"e9e5bfaa-263e-42a9-b122-560aca719c93","china-linked-amaranth-dragon-targets-southeast-asian-governments-with-winrar-exploit","Chinese APT 'Amaranth-Dragon' Hits Southeast Asian Governments with WinRAR Exploit","China-Linked Amaranth-Dragon Exploits WinRAR Flaw CVE-2025-8088 in Espionage Campaigns","A newly identified China-linked APT group, dubbed 'Amaranth-Dragon,' is conducting targeted cyber espionage campaigns against government and law enforcement agencies in Southeast Asia. The group, believed to be affiliated with the broader APT41 ecosystem, is exploiting a known WinRAR vulnerability (CVE-2025-8088) for initial access. Amaranth-Dragon demonstrates a high degree of stealth, using custom tools like 'Amaranth Loader' and a new 'TGAmaranth RAT' that leverages Telegram for command-and-control. The campaigns are tightly scoped, targeting countries like Cambodia, Thailand, and the Philippines, and appear to be motivated by geopolitical intelligence gathering.",[90,91,92,93,94,95,96,97],"Amaranth-Dragon","APT","China","Espionage","CVE-2025-8088","WinRAR","Telegram","Havoc C2",[99,54,52],"Threat Actor",[94],{"id":102,"slug":103,"headline":104,"title":105,"severity":106,"excerpt":107,"tags":108,"categories":114,"createdAt":79,"updatedAt":79,"readingTime":80,"isUpdate":82},"301732e1-9785-49eb-b6f3-aff63a4f3df2","voicemail-themed-phishing-campaign-deploys-remote-access-tools","Voicemail-Themed Phishing Campaign Deploys Legitimate RMM Tools for Backdoor Access","New Phishing Lure Uses Fake Voicemails to Install Remote Management Tools","medium","A widespread social engineering campaign is using convincing voicemail-themed lures to trick victims into installing legitimate remote monitoring and management (RMM) software. The attack begins with an email, often from a bank-themed subdomain, leading to a webpage that prompts the user to 'listen to your message.' Instead of playing a message, the page guides the user through a series of installation steps for a legitimate tool called 'Remotely RMM.' Once installed, the software enrolls the device into an attacker-controlled environment, providing them with persistent remote access for data theft and further malware deployment.",[109,110,111,112,113],"Phishing","Social Engineering","RMM","Backdoor","Living off the Land",[109,115,116],"Malware","Security Operations",{"id":118,"slug":119,"headline":120,"title":121,"severity":15,"excerpt":122,"tags":123,"categories":128,"createdAt":79,"updatedAt":79,"readingTime":129,"isUpdate":82},"c628b0b7-2bab-42e9-a695-2882777be105","microsoft-enforces-tls-1-2-for-azure-blob-storage","Microsoft Mandates TLS 1.2 for Azure Blob Storage, Sunsetting Older Versions","Microsoft Enforces TLS 1.2 as Minimum Standard for Azure Blob Storage","Microsoft has officially deprecated support for Transport Layer Security (TLS) versions 1.0 and 1.1 for its Azure Blob Storage service, effective February 3, 2026. TLS 1.2 is now the minimum required version for all new and existing blob storage accounts across all Azure clouds. This mandatory security enhancement aims to protect data in transit from known cryptographic vulnerabilities present in the older protocols. Customers with applications or clients still relying on TLS 1.0 or 1.1 must update them to ensure continued connectivity and avoid service disruptions.",[124,125,126,20,127],"Microsoft Azure","TLS","Cloud Security","Deprecation",[27,126],3,{"id":131,"slug":132,"headline":133,"title":134,"severity":41,"excerpt":135,"tags":136,"categories":140,"createdAt":79,"updatedAt":79,"readingTime":32,"isUpdate":82},"65c4db93-44e7-4acb-a53d-05756c085aae","shadow-campaign-espionage-activity-uncovered-china-suspected","'Shadow Campaign' Hacks Governments in 37 Countries, China-Linked Group Suspected","'Shadow Campaign' Espionage Operation Compromises Governments and Critical Infrastructure in 37 Countries","Security researchers have uncovered a massive, long-running cyber-espionage operation dubbed 'Shadow Campaign.' The campaign is attributed to a suspected Chinese nation-state group, TGR-STA-1030, and has successfully compromised at least 70 government and critical infrastructure organizations in 37 countries. The group's reconnaissance activities have been even broader, targeting government infrastructure in 155 countries. Targets include high-value entities like national law enforcement, border control, finance ministries, and telecommunications companies. The operational footprint, including tools and timezone activity (GMT+8), strongly points towards a China-based actor.",[137,91,92,93,138,139],"Shadow Campaign","TGR-STA-1030","Critical Infrastructure",[99,54,141],"Industrial Control Systems",{"id":143,"slug":144,"headline":145,"title":146,"severity":106,"excerpt":147,"tags":148,"categories":155,"createdAt":79,"updatedAt":79,"readingTime":80,"isUpdate":82},"3223e5c5-3031-4d9f-a74a-c59966d1421b","nitrogen-ransomware-esxi-encryptor-contains-fatal-coding-error","Futile Ransom: Nitrogen Ransomware Contains Fatal Coding Error, Decryption Impossible","Nitrogen Ransomware's ESXi Encryptor is Fatally Flawed, Rendering Decryption Impossible","In a case of profound operational failure, security researchers have discovered a fatal coding error in the Nitrogen ransomware group's malware that targets VMware ESXi systems. The flaw, found in the encryption routine, causes the malware to use the wrong public key during the encryption process. As a result, the decryptor provided by the gang after a ransom is paid is mathematically incapable of reversing the encryption. This means that any victim who pays the ransom for their encrypted ESXi virtual machines has zero chance of recovering their data, reinforcing law enforcement advice to not pay ransoms.",[149,150,151,152,153,154],"Nitrogen","Ransomware","VMware ESXi","Cryptography","Data Recovery","Operational Failure",[150,115],1770584892499]