[{"data":1,"prerenderedAt":145},["ShallowReactive",2],{"publication-daily-threat-publications-2025-11-16":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-11-16","CISA Warns of Actively Exploited Fortinet Zero-Day; FBI Details Akira Ransomware's $250M Spree","In cybersecurity news for November 15-16, 2025, the landscape is dominated by the active exploitation of a critical zero-day vulnerability (CVE-2025-64446) in Fortinet's FortiWeb WAF, prompting an emergency directive from CISA. Concurrently, the FBI and CISA issued a stark warning about the Akira ransomware gang, which has extorted nearly $250 million from critical infrastructure sectors by exploiting VPNs. Other major developments include the discovery of an APT using two zero-days against Cisco and Citrix systems, a proposed overhaul of UK cybersecurity law, and a documented 30% surge in ransomware attacks in October, highlighting the rise of new groups like Qilin and Sinobi.","2025-11-16",7,[10,33,59,79,98,118,130],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":25,"createdAt":27,"updatedAt":28,"readingTime":29,"isUpdate":30,"updateSummary":31,"updateContent":32},"64168166-52f3-4bb3-81ed-6417726386ea","ransomware-attacks-skyrocket-50-percent-in-2025-qilin-emerges-as-leader","Ransomware Attacks Surge 50% in 2025; Qilin Group Takes the Lead","Ransomware Landscape Shifts as Attacks Increase 50% in 2025, with Qilin and The Gentlemen Emerging as Dominant Threats","high","Cybersecurity researchers report a staggering 50% increase in ransomware attacks in 2025, with over 5,000 incidents claimed on dark web leak sites by late October. This surge occurs amidst a significant realignment in the ransomware ecosystem, with formerly dominant groups fading while new and resurgent actors like Qilin take their place. The Qilin group has been particularly prolific, leading in victim counts for most of the past six months. The United States remains the most targeted nation, and the industrial sector is the most heavily impacted industry. PowerShell has become the primary tool for attackers, used in nearly 78% of observed campaigns.",[18,19,20,21,22,23,24],"Ransomware","Qilin","The Gentlemen","PowerShell","Industrial Sector","Threat Intelligence","RaaS",[18,26,23],"Threat Actor","2025-10-25T15:00:00.000Z","2025-11-16T00:00:00.000Z",5,true,"Ransomware attacks surged 30% in October 2025, hitting near-record levels (623 incidents). Qilin remains dominant, with new TTPs exploiting CVE-2025-61882 in Oracle E-Business Suite.","Ransomware activity saw a significant 30% increase in October 2025, reaching 623 incidents, marking the second-highest monthly total on record. The year-to-date total now exceeds 5,194 incidents, a 50% rise from 2024. The Qilin group continues to lead, claiming 210 victims in October, while Sinobi rose to third place with 69 victims. Threat actors are increasingly exploiting critical vulnerabilities like CVE-2025-61882 in Oracle E-Business Suite for initial access, alongside external remote services and compromised valid accounts. This highlights the ecosystem's resilience and adaptability, with the overall threat level remaining high.",{"id":34,"slug":35,"headline":36,"title":37,"severity":38,"excerpt":39,"tags":40,"categories":50,"createdAt":53,"updatedAt":54,"readingTime":55,"cves":56,"isUpdate":30,"updateSummary":57,"updateContent":58},"b4aeb90a-043a-47a8-8176-801d1c5440e9","amazon-uncovers-apt-exploiting-cisco-and-citrix-zero-day-flaws","APT Caught Exploiting Cisco & Citrix Zero-Days in Sophisticated Attack","Amazon Threat Intelligence Uncovers Advanced Persistent Threat Exploiting Undisclosed Zero-Days in Cisco ISE and Citrix NetScaler","critical","Amazon's threat intelligence team has discovered a sophisticated advanced persistent threat (APT) campaign that exploited two separate zero-day vulnerabilities in Cisco Identity Service Engine (CVE-2025-20337) and Citrix products (CVE-2025-5777) before they were publicly known. The attackers used the flaws to gain pre-authentication remote code execution and deployed custom, in-memory malware designed to evade detection. This discovery highlights a growing trend of targeting identity and access management systems at the network edge and underscores the capabilities of highly-resourced threat actors.",[41,42,43,44,45,46,47,48,49],"APT","Zero-Day","CVE-2025-20337","CVE-2025-5777","Cisco ISE","Citrix","Amazon","Web Shell","In-Memory Malware",[51,26,52],"Vulnerability","Cyberattack","2025-11-13T15:00:00.000Z","2025-11-16T12:00:00.000Z",6,[43,44],"New technical details on Cisco ISE vulnerability, Citrix flaw nickname, and MITRE ATT&CK techniques provided.","The Citrix vulnerability, CVE-2025-5777, has been dubbed 'CitrixBleed 2'. Further technical analysis of CVE-2025-20337 in Cisco ISE reveals it is a deserialization flaw in an undocumented API endpoint, exploited via an anomalous payload. The attack chain aligns with MITRE ATT&CK techniques T1190 (Exploit Public-Facing Application), T1210 (Exploitation of Remote Services), and T1068 (Exploitation for Privilege Escalation).",{"id":60,"slug":61,"headline":62,"title":63,"severity":15,"excerpt":64,"tags":65,"categories":72,"createdAt":75,"updatedAt":28,"readingTime":76,"isUpdate":30,"updateSummary":77,"updateContent":78},"14b72146-a348-4383-83a8-3f04b0ca0c2d","checkout-com-breached-by-shinyhunters-rejects-ransom","Checkout.com Rejects Ransom After ShinyHunters Breach, Donates to Research","Payment Processor Checkout.com Breached by ShinyHunters via Legacy Cloud Storage; Refuses Ransom and Donates to Cybersecurity Research","The global payment processor Checkout.com has disclosed a data breach orchestrated by the ShinyHunters cybercrime group. The attackers exploited a legacy third-party cloud file storage system that was improperly decommissioned. After being contacted with a ransom demand, Checkout.com refused to pay. In a bold move, the company announced it will instead donate the equivalent ransom amount to cybersecurity research institutions, including Carnegie Mellon University and the University of Oxford. The breach did not impact the core payment platform or cardholder data.",[66,67,68,69,70,71],"ShinyHunters","data breach","Checkout.com","cloud security","ransom","asset management",[73,26,74],"Data Breach","Cloud Security","2025-11-14T15:00:00.000Z",4,"Checkout.com reiterates breach details, confirms refusal to pay extortion, and emphasizes no sensitive financial data was compromised.","Further reports confirm Checkout.com's data breach and subsequent extortion attempt. The company continues to assert that no sensitive cardholder or financial data was compromised, reinforcing its initial statements. Checkout.com maintained its refusal to engage with the extortionists, reporting the incident to law enforcement. While the specific threat actor was not named in these follow-up reports, the tactics align with data extortion groups. Technical analysis suggests potential initial access via public-facing application exploits or compromised credentials, leading to data exfiltration from cloud storage. The incident underscores the persistent threat of data theft for extortion against fintech companies, even when core financial systems remain secure.",{"id":80,"slug":81,"headline":82,"title":83,"severity":38,"excerpt":84,"tags":85,"categories":92,"createdAt":94,"updatedAt":28,"readingTime":76,"cves":95,"isUpdate":30,"updateSummary":96,"updateContent":97},"fd6eb024-99e4-4dd0-8d34-01245077a695","fortinet-patches-exploited-fortiweb-path-traversal-zero-day","Fortinet Patches Actively Exploited FortiWeb Zero-Day (CVE-2025-64446)","Fortinet Quietly Patches Critical, Actively Exploited Path Traversal Zero-Day in FortiWeb WAF","Fortinet has released a patch for a critical, actively exploited zero-day vulnerability in its FortiWeb web application firewall (WAF). The flaw, tracked as CVE-2025-64446, is a relative path traversal vulnerability that allows an unauthenticated remote attacker to execute arbitrary administrative commands by sending specially crafted HTTP/S requests. Due to evidence of active exploitation, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating that federal agencies patch it immediately. The flaw affects a wide range of FortiWeb versions, making immediate patching a top priority for all customers.",[86,87,42,51,88,89,90,91],"Fortinet","FortiWeb","CVE-2025-64446","Path Traversal","CISA","KEV",[51,93,52],"Patch Management","2025-11-15T15:00:00.000Z",[88],"Attackers creating rogue admin accounts for persistence; CISA issues emergency directive with Nov 22 deadline.","New intelligence reveals attackers exploiting CVE-2025-64446 are creating unauthorized administrator accounts on compromised FortiWeb devices to establish persistence. This critical development escalates the threat, as it ensures continued access even after initial exploitation. Furthermore, CISA has issued an emergency directive, mandating federal agencies to apply patches by November 22, 2025, underscoring the urgency of mitigation. Security researchers at watchTowr and Defused observed exploitation dating back to early October 2025.",{"id":99,"slug":100,"headline":101,"title":102,"severity":38,"excerpt":103,"tags":104,"categories":114,"createdAt":116,"updatedAt":116,"readingTime":55,"isUpdate":117},"816a7a0e-b79b-4d7d-8b86-7b2347102318","critical-rce-flaws-in-ai-inference-engines-expose-major-tech-frameworks","Critical RCE Flaws in AI Engines From Meta, NVIDIA, Microsoft Discovered","Critical RCE Flaws in AI Inference Engines Expose Major Tech Frameworks","Security researchers have discovered critical remote code execution (RCE) vulnerabilities in widely used AI inference servers from major tech companies, including Meta, NVIDIA, and Microsoft, as well as open-source projects like vLLM. The vulnerabilities stem from the unsafe use of Python's 'pickle' module for data deserialization and exposed ZeroMQ (ZMQ) messaging endpoints. Exploitation could allow attackers to take full control of AI models and servers, posing a significant risk to enterprise AI infrastructure. Some flaws, termed 'Shadow Vulnerabilities,' remain unpatched in production environments.",[105,106,107,108,109,110,111,112,113],"AI","Machine Learning","RCE","Insecure Deserialization","pickle","vLLM","NVIDIA","Meta","Microsoft",[51,74,115],"Other","2025-11-16T15:00:00.000Z",false,{"id":119,"slug":120,"headline":121,"title":122,"severity":15,"excerpt":123,"tags":124,"categories":129,"createdAt":116,"updatedAt":116,"readingTime":29,"isUpdate":117},"54046944-aa59-4b54-b680-c34ef9841b97","ransomhouse-group-hits-fashion-supplier-fulgar-in-supply-chain-attack","RansomHouse Hits H&M and Adidas Supplier in Major Fashion Supply Chain Attack","RansomHouse Group Hits Fashion Supplier Fulgar in Supply Chain Attack","The RansomHouse ransomware group has attacked Fulgar S.p.A., a major Italian textile manufacturer and a key supplier for global fashion brands like H&M and Adidas. The attack, confirmed on November 3, 2025, resulted in the exfiltration and leak of sensitive corporate data. This incident highlights the significant and growing risk of supply chain attacks in the fashion industry, where a compromise at a single supplier can have cascading impacts on major international retailers.",[125,18,126,127,73,128],"RansomHouse","Supply Chain Attack","Fashion Industry","Fulgar",[126,18,73],{"id":131,"slug":132,"headline":133,"title":134,"severity":135,"excerpt":136,"tags":137,"categories":143,"createdAt":116,"updatedAt":116,"readingTime":55,"isUpdate":117},"ea269980-eb24-4628-afce-2c215353c7c4","pig-butchering-scams-evolve-into-major-global-cybercrime-threat","Pig Butchering Scams Evolve into Global Cybercrime Menace, FBI Warns","Pig Butchering Scams Evolve into Major Global Cybercrime Threat","medium","A new threat intelligence report, supported by warnings from the FBI, details the rapid evolution of \"Pig Butchering\" scams into one of the most economically damaging forms of global cybercrime. These sophisticated, long-con investment schemes leverage social engineering, emotional grooming, and fraudulent cryptocurrency trading platforms to defraud victims of massive sums. The scam involves building a relationship of trust over weeks or months before convincing the victim to invest in a fake, high-yield opportunity.",[138,139,140,141,142],"Pig Butchering","Investment Fraud","Social Engineering","Cryptocurrency Scam","FBI",[144,115,23],"Phishing",1769440018605]