[{"data":1,"prerenderedAt":72},["ShallowReactive",2],{"publication-daily-threat-publications-2026-01-01":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2026-01-01","Iranian APTs Evolve with Telegram C2, Ransomware Industrializes, and Critical Flaws Threaten Global Servers to Kick Off 2026","This cybersecurity brief for January 1, 2026, covers a significant escalation in threat actor sophistication and critical infrastructure risks. Key developments include the Iranian APT 'Prince of Persia' adopting Telegram for command-and-control, the industrialization of Ransomware-as-a-Service (RaaS) into cartel-like operations, and the active exploitation of critical vulnerabilities like 'MongoBleed' (CVE-2025-14847) in MongoDB and 'React2Shell' (CVE-2025-55182) in Next.js servers. State-sponsored groups from China (Mustang Panda) and South America (BlindEagle) have also deployed advanced stealth techniques, while major data breaches at organizations like the University of Phoenix highlight the severe impact of these evolving threats.","2026-01-01",3,[10,33,56],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":25,"createdAt":27,"updatedAt":28,"readingTime":29,"isUpdate":30,"updateSummary":31,"updateContent":32},"3618ea27-26c5-4b70-b35d-e92a651eac40","hp-report-cybercriminals-using-sophisticated-social-engineering-lures","Hackers Use Animated Lures and Fake Legal Warnings to Spread Malware","HP Report: Cybercriminals Evolve Social Engineering with Animated Lures and Abuse of Trusted Platforms like Discord","high","HP's latest Threat Insights Report reveals a significant evolution in social engineering tactics, with cybercriminals using highly convincing lures such as professional animations and fake legal warnings to trick users into downloading malware. The report highlights a campaign impersonating the Colombian Prosecutor's Office to deliver PureRAT. It also details the abuse of trusted platforms like Discord for hosting malicious payloads like the Phantom Stealer and notes the rising threat of session cookie hijacking.",[18,19,20,21,22,23,24],"Social Engineering","Phishing","PureRAT","Phantom Stealer","InfoStealer","HP","Threat Intelligence",[19,26,24],"Malware","2025-12-11T15:00:00.000Z","2026-01-01T00:00:00.000Z",4,true,"BlindEagle APT breached a Colombian government agency via compromised email, deploying DCRAT RAT. This confirms and details sophisticated social engineering tactics.","The previously reported trend of sophisticated social engineering and legal threat impersonation against Colombian entities has been concretely attributed to the BlindEagle APT (APT-C-36). This update details their successful breach of a Colombian government agency (MCIT) via a compromised internal email account. The attack used an SVG attachment disguised as a legal notice, leading to a multi-stage, file-less infection chain involving obfuscated PowerShell executed via WMI. Payloads were retrieved from legitimate services like Internet Archive and Discord, culminating in the injection of the DCRAT RAT into MSBuild.exe using Process Hollowing. This provides specific TTPs and attribution for the general threats discussed.",{"id":34,"slug":35,"headline":36,"title":37,"severity":38,"excerpt":39,"tags":40,"categories":51,"createdAt":53,"updatedAt":53,"readingTime":54,"isUpdate":55},"e76d2afd-7e13-49f7-832a-f29ac758b3c2","2025-year-end-analysis-industrialized-ransomware-and-edge-device-crisis","Year-End Report: Ransomware Industrializes into Cartels, Edge Devices Become Top Target","2025 Cybersecurity Review: The Industrialization of Ransomware and the Crisis in Edge Device Security","informational","A year-end analysis of the 2025 threat landscape highlights two dominant and transformative trends for enterprises. First, Ransomware-as-a-Service (RaaS) has 'industrialized,' with threat groups operating like sophisticated cartels and employing 'Extortion 2.0' tactics that involve both data encryption and theft. Second, network edge devices such as VPNs, firewalls, and routers have become the primary target for state-sponsored actors seeking initial access. Experts recommend 'industrial defenses,' including immutable backups and aggressive patch management, and a strategic shift towards Secure Access Service Edge (SASE) architecture to counter these evolving threats.",[41,42,43,44,45,46,47,48,49,50],"Ransomware","RaaS","Edge Security","VPN","Firewall","SASE","WORM","Immutable Backups","Threat Landscape","2025 Review",[24,41,52],"Security Operations","2026-01-01T15:00:00.000Z",5,false,{"id":57,"slug":58,"headline":59,"title":60,"severity":38,"excerpt":61,"tags":62,"categories":69,"createdAt":53,"updatedAt":53,"readingTime":71,"isUpdate":55},"103f6ad3-bee2-467f-8b8f-7af7c19bf6dd","2025-threat-report-highlights-ai-social-engineering-and-identity-attacks","Report: AI-Powered Social Engineering and Identity Attacks Dominated 2025","Tidal Cyber's 2025 Report: AI-Powered Social Engineering and Identity-Driven Attacks Reshape Threat Landscape","The 2025 Threat-Led Defense Report from Tidal Cyber reveals a significant shift in the threat landscape, where attackers are adapting faster than security defenses. Key trends from 2025 include the widespread adoption of AI to automate and scale highly convincing social engineering campaigns, and a strategic pivot towards identity-driven attacks. Adversaries are increasingly targeting SaaS platforms, cloud administration accounts, and single sign-on (SSO) services to gain broad access without deploying traditional malware. The report also notes that zero-day exploits are now being leveraged by a wider range of criminal and hybrid actors, not just elite state-sponsored groups.",[49,63,18,64,65,66,67,68,50],"AI","Identity Attack","SaaS","Cloud Security","SSO","Tidal Cyber",[24,70,66],"Policy and Compliance",6,1770132084868]