[{"data":1,"prerenderedAt":74},["ShallowReactive",2],{"publication-daily-threat-publications-2025-12-12":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-12-12","Microsoft and Google Patch Actively Exploited Zero-Days Amidst Major Healthcare Breaches and Sophisticated Supply Chain Attacks","In the 24-hour period ending December 12, 2025, the cybersecurity landscape was dominated by the urgent patching of actively exploited zero-day vulnerabilities by both Microsoft and Google. Microsoft's December Patch Tuesday addressed a critical privilege escalation flaw (CVE-2025-62221) already in use by attackers, while Google rushed out an emergency fix for its eighth Chrome zero-day this year. The healthcare sector remains under siege, with massive data breaches at Conduent and TriZetto Provider Solutions coming to light, affecting millions. Concurrently, new intelligence revealed sophisticated threats, including the \"Shai-Hulud 2.0\" supply chain worm, an espionage campaign by the Hamas-affiliated \"Ashen Lepus\" group, and a novel hardware attack named \"Battering RAM\" capable of breaking CPU security protections.","2025-12-12",4,[10,31,48,59],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":24,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"7c569ef4-8107-4059-9d6f-1f26e6cb1faf","conduent-data-breach-impacts-10-million-in-major-healthcare-incident","Conduent Breach Exposes 10.5M Patients, Ranks as 8th Largest US Healthcare Breach","Conduent Faces Class-Action Lawsuits After Massive Data Breach Affects Over 10.5 Million Individuals","high","Business services giant Conduent has disclosed a massive data breach that exposed the personal and medical information of over 10.5 million people, making it the 8th largest healthcare data breach in U.S. history. The breach, which was active for months between October 2024 and January 2025, has already cost the company $25 million in response efforts. The compromised data includes names, Social Security numbers, and health information, leading to multiple class-action lawsuits against the company.",[18,19,20,21,22,23],"Healthcare Breach","PII","PHI","Class Action","Conduent","HIPAA",[25,26,27],"Data Breach","Regulatory","Incident Response","2025-12-12T15:00:00.000Z",5,false,{"id":32,"slug":33,"headline":34,"title":35,"severity":15,"excerpt":36,"tags":37,"categories":45,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"9bad771a-fdb2-4255-9994-5e767e7e27da","battering-ram-hardware-attack-defeats-intel-sgx-amd-sev","\"Battering RAM\": $50 Hardware Attack Cracks Intel and AMD Secure CPU Enclaves","Researchers Unveil \"Battering RAM,\" a Low-Cost Hardware Attack that Bypasses Intel SGX and AMD SEV Memory Encryption","At the Black Hat Europe 2025 conference, researchers from KU Leuven University demonstrated \"Battering RAM,\" a novel hardware attack that completely undermines modern confidential computing technologies. Using a custom-built DDR4 interposer costing just $50, the attack can bypass the memory encryption of secure enclaves like Intel SGX and AMD SEV. This allows an attacker with physical access to read encrypted memory at runtime, extract secret keys, and defeat protections previously thought to be secure against physical threats.",[38,39,40,41,42,43,44],"Hardware Attack","Confidential Computing","Intel SGX","AMD SEV","Side-channel Attack","Supply Chain Attack","Black Hat",[46,47,43],"Cyberattack","Threat Intelligence",{"id":49,"slug":50,"headline":51,"title":52,"severity":15,"excerpt":53,"tags":54,"categories":58,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"0d417ea9-8611-40c1-8130-14f533e36b7f","trizetto-discloses-year-long-data-breach-exposing-patient-phi","TriZetto Discloses Year-Long Data Breach Exposing Patient PHI","Cognizant-Owned TriZetto Provider Solutions Reveals Data Breach with Nearly Year-Long Attacker Dwell Time","TriZetto Provider Solutions, a healthcare revenue management company owned by Cognizant, has started notifying clients about a major data breach. An unauthorized party had access to patient data for nearly a full year, from November 2024 until the breach was detected on October 2, 2025. The attackers accessed historical reports containing sensitive Protected Health Information (PHI), including patient names, Social Security numbers, dates of birth, and health insurance details. The cybersecurity firm Mandiant was brought in to investigate the long-running intrusion.",[18,20,55,56,57,23],"Dwell Time","TriZetto","Cognizant",[25,27,26],{"id":60,"slug":61,"headline":62,"title":63,"severity":64,"excerpt":65,"tags":66,"categories":72,"createdAt":28,"updatedAt":28,"readingTime":29,"isUpdate":30},"9b5b79ec-720d-4e0a-8eae-1a5466cae5dc","ransomware-expands-to-new-regions-and-industries-report-finds","Ransomware Goes Global, Targeting New Regions and Industries with Weaker Defenses","CyberCube Report Finds Ransomware Expanding to New Territories, LockBit Group Remains Highly Active","informational","Ransomware is becoming a more globalized and unpredictable threat, according to the H2 2025 Global Threat Briefing from cyber analytics firm CyberCube. The report warns that ransomware groups are actively expanding into new geographic regions and industry sectors that have historically seen fewer attacks, often targeting those with less mature cyber defenses. The highly active LockBit ransomware-as-a-service (RaaS) group is a key driver of this trend. The findings suggest that traditional risk models based on geography or industry are becoming less reliable predictors of attack likelihood.",[67,68,69,70,71,47],"Ransomware Trends","CyberCube","LockBit","RaaS","Global Threat",[47,73],"Ransomware",1770399059840]