[{"data":1,"prerenderedAt":107},["ShallowReactive",2],{"publication-daily-threat-publications-2025-11-18":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-11-18","AI-Orchestrated Cyber Espionage Uncovered; Logitech Breached by Clop; Google Patches Actively Exploited Chrome Zero-Day","This intelligence brief for November 18, 2025, covers a landmark AI-driven espionage campaign by a Chinese state actor, a major data breach at Logitech by the Clop ransomware gang exploiting an Oracle zero-day, and an emergency patch from Google for an actively exploited Chrome vulnerability. Additional reports detail critical flaws in WordPress plugins, a defacement attack on Kenyan government websites, and a massive DDoS attack on critical infrastructure.","2025-11-18",6,[10,37,54,69,81,93],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":26,"createdAt":30,"updatedAt":31,"readingTime":32,"cves":33,"isUpdate":34,"updateSummary":35,"updateContent":36},"c9028f28-44c4-411c-b737-544c16b27b17","cl0p-ransomware-breaches-logitech-via-oracle-e-business-suite-zero-day","Cl0p Gang Exploits Oracle Zero-Day to Breach Logitech, Washington Post, and More","Cl0p Ransomware Gang Breaches Logitech, The Washington Post, and Others via Oracle E-Business Suite Zero-Day (CVE-2025-61882)","critical","The notorious Cl0p cyber extortion gang has orchestrated a massive data breach campaign by exploiting a zero-day vulnerability in Oracle's E-Business Suite (EBS), tracked as CVE-2025-61882. Swiss electronics giant Logitech has confirmed it was a victim, filing a data breach notification with the SEC. The campaign has also compromised other major organizations, including The Washington Post, Allianz UK, and GlobalLogic. Cl0p is known for exploiting vulnerabilities in widely-used enterprise software to simultaneously hit a large number of high-value targets, exfiltrating data for double extortion.",[18,19,20,21,22,23,24,25],"Cl0p","ransomware","data breach","zero day","CVE-2025-61882","Oracle","Logitech","The Washington Post",[27,28,29],"Data Breach","Vulnerability","Ransomware","2025-11-17T15:00:00.000Z","2025-11-18T12:00:00.000Z",5,[22],true,"Logitech confirms 1.8 TB data exfiltration; Harvard University added as new victim in Cl0p Oracle EBS campaign.","Logitech has officially confirmed the exfiltration of approximately 1.8 TB of data from its systems by the Cl0p ransomware group, following the exploitation of CVE-2025-61882 in Oracle E-Business Suite. The company filed a disclosure with the SEC, stating that while data on employees, consumers, and suppliers was accessed, highly sensitive personal data was not affected, and business operations remain stable. Additionally, Harvard University has been identified as another victim in this widespread Cl0p campaign, which continues to leverage the Oracle EBS zero-day for mass data theft.",{"id":38,"slug":39,"headline":40,"title":41,"severity":15,"excerpt":42,"tags":43,"categories":49,"createdAt":50,"updatedAt":50,"readingTime":32,"cves":51,"cvssScore":52,"isUpdate":53},"b3160616-c0d9-411c-b319-b42db74d6904","critical-rce-flaw-in-w3-total-cache-wordpress-plugin-endangers-1-million-sites","Urgent Patch Required: Critical RCE Flaw in W3 Total Cache WordPress Plugin","Critical Unauthenticated RCE Vulnerability (CVE-2025-9501) in W3 Total Cache Puts Over 1 Million WordPress Sites at Risk","A critical command injection vulnerability, CVE-2025-9501, with a CVSS score of 9.0, has been found in the W3 Total Cache WordPress plugin, which is active on over one million websites. The flaw allows unauthenticated attackers to achieve remote code execution (RCE) by simply submitting a malicious comment. This enables a complete site takeover. All versions prior to 2.8.13 are affected, and administrators are urged to update immediately.",[44,28,45,46,47,48],"WordPress","RCE","CVE-2025-9501","W3 Total Cache","Patch Management",[28,48],"2025-11-18T15:00:00.000Z",[46],9,false,{"id":55,"slug":56,"headline":57,"title":58,"severity":59,"excerpt":60,"tags":61,"categories":67,"createdAt":50,"updatedAt":50,"readingTime":32,"isUpdate":53},"f007621c-2335-49c4-b9d5-726dc2ea1a15","kenyan-government-websites-knocked-offline-in-defacement-attack","Kenyan Government Websites Defaced in Coordinated Cyberattack","Multiple Kenyan Government Websites, Including Ministry of Interior, Taken Offline and Defaced with Hate Symbols","high","On November 17, 2025, a coordinated cyberattack targeted and temporarily disabled numerous Kenyan government websites. The Ministry of Interior and National Administration confirmed the breach, which impacted the websites of the State House and ministries of Health, Education, and Energy, among others. Reports indicate several of the compromised sites were defaced with white supremacist slogans and symbols. The Kenyan government has since restored services and vowed to bring the perpetrators to justice.",[62,63,64,65,66],"Defacement","Cyberattack","Kenya","Government","Hacktivism",[63,68],"Regulatory",{"id":70,"slug":71,"headline":72,"title":73,"severity":59,"excerpt":74,"tags":75,"categories":80,"createdAt":50,"updatedAt":50,"readingTime":32,"isUpdate":53},"aef79832-fadd-4b5a-8ee0-7224dfe6f706","merck-discloses-employee-data-breach-from-third-party-vendor-incident","Merck Employee Data Breached in Third-Party Vendor Incident","Merck Discloses Data Breach Affecting Employees After Vendor Graebel Companies Suffers Security Incident","Pharmaceutical giant Merck has confirmed a data breach impacting its current and former employees due to a cybersecurity incident at a third-party service provider, Graebel Companies. The breach, which occurred in September 2025, was disclosed on November 17. Exposed data includes sensitive PII such as names, Social Security numbers, and financial account information. Merck is offering 24 months of complimentary credit monitoring services to affected individuals.",[27,76,77,78,79],"Supply Chain Attack","Third-Party Risk","Merck","PII",[27,76],{"id":82,"slug":83,"headline":84,"title":85,"severity":15,"excerpt":86,"tags":87,"categories":91,"createdAt":50,"updatedAt":50,"readingTime":32,"cves":92,"isUpdate":53},"7e6249e2-54bf-44cf-8e3d-bb49759a6ac6","wordpress-security-plugin-anti-malware-security-has-critical-file-read-flaw","WordPress Security Plugin Ironically Contains Critical File-Read Flaw","Critical Arbitrary File Read Vulnerability (CVE-2025-11705) in 'Anti-Malware Security' WordPress Plugin Affects 100,000+ Sites","A critical vulnerability, CVE-2025-11705, has been discovered in the 'Anti-Malware Security and Brute-Force Firewall' WordPress plugin, which is active on over 100,000 sites. The flaw allows any authenticated user, including low-privilege subscribers, to read arbitrary files from the server. This can be exploited to access the sensitive wp-config.php file, leading to a full database compromise and site takeover. Users are urged to update the plugin immediately.",[44,28,88,89,48,90],"CVE-2025-11705","Arbitrary File Read","GOTMLS",[28,48],[88],{"id":94,"slug":95,"headline":96,"title":97,"severity":59,"excerpt":98,"tags":99,"categories":105,"createdAt":50,"updatedAt":50,"readingTime":32,"isUpdate":53},"8c1373a4-256c-4e69-bbfc-090fcdb2fdac","nsfocus-details-mitigation-of-massive-800-gbps-ddos-attack-on-critical-infrastructure","NSFOCUS Mitigates Massive 843 Gbps DDoS Attack on Critical Infrastructure","NSFOCUS Details Successful Mitigation of 843.4 Gbps Multi-Vector DDoS Attack Targeting Critical Infrastructure Operator","Security vendor NSFOCUS has detailed its successful effort to mitigate a massive multi-vector DDoS attack that targeted a critical infrastructure operator in October 2025. The attack peaked at an enormous 843.4 Gbps and 73.6 million packets per second, sustaining high volumes for over 30 minutes. The assault was dominated by a UDP flood, accounting for over 600 Gbps of the traffic. NSFOCUS's Cloud DDoS Protection Service successfully filtered over 99.9% of the malicious traffic, keeping the operator's services online.",[100,63,101,102,103,104],"DDoS","Critical Infrastructure","NSFOCUS","UDP Flood","Threat Intelligence",[63,106,104],"Industrial Control Systems",1768668801656]