[{"data":1,"prerenderedAt":172},["ShallowReactive",2],{"publication-daily-threat-publications-2025-10-07":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-10-07","Clop Exploits Oracle Zero-Day; CISA Catalogs Multiple Actively Exploited Flaws","This cybersecurity advisory for October 7, 2025, covers a critical period marked by the active exploitation of a zero-day vulnerability (CVE-2025-61882) in Oracle E-Business Suite by the Clop ransomware group, prompting urgent international warnings. Concurrently, CISA has added several other flaws to its KEV catalog, including vulnerabilities in Microsoft Windows and Zimbra. Other major developments include a new extortion campaign by the 'Scattered Lapsus$ Hunters' collective targeting Salesforce customers, a critical RCE flaw in Redis, and Signal's threat to exit the EU over the proposed 'Chat Control' surveillance bill.","2025-10-07",10,[10,34,54,71,87,101,114,129,143,157],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":25,"createdAt":28,"updatedAt":29,"readingTime":30,"isUpdate":31,"updateSummary":32,"updateContent":33},"4e038bfd-2ffc-4a59-a536-063a672dbc35","cisa-issues-advisories-for-widespread-industrial-control-system-flaws","CISA Warns of Widespread Flaws in Industrial Control Systems from Major Vendors","CISA Issues Multiple Advisories for Vulnerabilities in Rockwell, Hitachi, and Mitsubishi ICS Products","high","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has released a series of advisories warning of numerous vulnerabilities in Industrial Control Systems (ICS) from prominent vendors, including Rockwell Automation, Hitachi Energy, Mitsubishi Electric, and Delta Electronics. These flaws affect products widely deployed in the energy sector and other critical infrastructure domains. CISA is urging administrators to review the advisories and apply patches and mitigations immediately to prevent potential exploitation that could lead to operational disruptions or cyberattacks against critical national infrastructure.",[18,19,20,21,22,23,24],"ICS","OT Security","CISA","Vulnerability","Critical Infrastructure","Rockwell Automation","Hitachi Energy",[26,21,27],"Industrial Control Systems","Regulatory","2025-10-06T15:00:00.000Z","2025-10-07T00:00:00.000Z",4,true,"CISA released specific advisories for Delta Electronics DIAScreen and Rockwell Automation ControlLogix modules, detailing ICSA-25-280-01 and ICSA-25-226-31 (Update B).","CISA has issued specific advisories for vulnerabilities previously mentioned in a broader warning. Advisory ICSA-25-280-01 details flaws in Delta Electronics DIAScreen HMI software, potentially leading to remote code execution or denial of service. Additionally, ICSA-25-226-31 (Update B) provides updated information on vulnerabilities in Rockwell Automation's 1756-EN4TR and 1756-EN4TRXT ControlLogix communication modules, which could allow attackers to intercept or manipulate communications, causing physical disruption. These updates provide more granular technical details for asset owners to prioritize mitigations.",{"id":35,"slug":36,"headline":37,"title":38,"severity":39,"excerpt":40,"tags":41,"categories":48,"createdAt":28,"updatedAt":29,"readingTime":49,"cves":50,"isUpdate":31,"updateSummary":52,"updateContent":53},"255dbbaf-45ad-423c-9033-df19bd7f0c20","cl0p-ransomware-exploits-oracle-e-business-suite-zero-day-in-mass-attack","Cl0p Ransomware Exploits Oracle E-Business Suite Zero-Day in Mass Attack","Cl0p Ransomware Gang Exploits Unauthenticated RCE Zero-Day (CVE-2025-61882) in Oracle E-Business Suite","critical","The notorious Cl0p ransomware gang is conducting a widespread extortion campaign by exploiting a critical, unauthenticated remote code execution (RCE) zero-day vulnerability (CVE-2025-61882) in Oracle E-Business Suite. The campaign, active since at least August, involves Cl0p breaching vulnerable systems to steal data and then sending extortion emails to thousands of accounts. Oracle has released an emergency patch for the flaw, which affects versions 12.2.3 through 12.2.14, and is urging customers to update immediately. This attack follows Cl0p's established pattern of leveraging high-impact zero-days in enterprise software for mass compromise.",[42,43,44,45,46,47],"Cl0p","Ransomware","Zero-Day","Oracle","Data Breach","Extortion",[43,21,46],5,[51],"CVE-2025-61882","CISA, NCSC issue urgent warnings for Clop's Oracle EBS zero-day (CVE-2025-61882), adding it to KEV catalog with a 9.8 CVSS score.","International cybersecurity agencies, including CISA and NCSC, have issued urgent warnings regarding the Clop ransomware group's active exploitation of CVE-2025-61882 in Oracle E-Business Suite. The vulnerability, now confirmed with a CVSS score of 9.8, has been added to CISA's Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to patch by October 28, 2025. Reports indicate public exploit code became available on October 6, significantly increasing the threat. Mandiant has officially attributed the campaign to Clop, which is now sending extortion emails directly to victim executives, employing a double-extortion tactic after data exfiltration.",{"id":55,"slug":56,"headline":57,"title":58,"severity":15,"excerpt":59,"tags":60,"categories":67,"createdAt":69,"updatedAt":69,"readingTime":49,"isUpdate":70},"7cb110e1-0712-454f-bee4-308175f8c70e","scattered-lapsus-hunters-launches-extortion-site-targeting-salesforce-customers","New 'Scattered Lapsus$ Hunters' Gang Extorts 39 Salesforce Customers on Leak Site","Scattered Lapsus$ Hunters Collective Launches Leak Site, Extorting Salesforce and 39 High-Profile Customers","A new cybercriminal collective calling itself 'Scattered Lapsus$ Hunters' has emerged, claiming to be a merger of members from Scattered Spider, Lapsus$, and ShinyHunters. The group launched a dark web data leak site over the weekend of October 4-5, listing 39 major companies, including Cisco, Toyota, and Marriott, as victims of a massive data breach affecting their Salesforce instances. The actors claim to have exfiltrated nearly one billion records and have set an October 10 deadline for ransoms to be paid. In an unusual tactic, they have also demanded that Salesforce pay a ransom to spare the listed victims, threatening to release documents proving alleged security negligence. The breaches are suspected to have originated from vishing attacks targeting IT help desks.",[47,61,62,63,64,65,66],"Data Leak","Salesforce","Scattered Spider","Lapsus$","Vishing","Social Engineering",[68,46,43],"Threat Actor","2025-10-07T15:00:00.000Z",false,{"id":72,"slug":73,"headline":74,"title":75,"severity":76,"excerpt":77,"tags":78,"categories":85,"createdAt":69,"updatedAt":69,"readingTime":30,"isUpdate":70},"ae8fc38d-51b2-416f-ab66-c8faf8eef973","signal-threatens-eu-exit-over-chat-control-mass-surveillance-bill","Signal Threatens to Exit EU Market if \"Chat Control\" Mass Surveillance Bill Passes","Signal Vows to Cease Operations in European Union Over Proposed \"Chat Control\" Encryption-Breaking Law","informational","Meredith Whittaker, the president of the Signal Foundation, has declared that the encrypted messaging service will withdraw from the European Union if the controversial 'Chat Control' legislation is enacted. The proposed law, which faces a critical vote on October 14, would mandate that communication platforms like Signal and WhatsApp scan all user content, including private messages and photos, for illicit material before it is encrypted. Critics, including Signal, argue this would create a backdoor for mass surveillance, fundamentally break end-to-end encryption, and create a dangerous cybersecurity precedent. The statement is a direct appeal to EU member states, particularly Germany, to vote against the measure.",[79,80,81,82,83,84],"Encryption","Privacy","EU","Regulation","Chat Control","Signal",[86,27],"Policy and Compliance",{"id":88,"slug":89,"headline":90,"title":91,"severity":15,"excerpt":92,"tags":93,"categories":98,"createdAt":69,"updatedAt":69,"readingTime":30,"cves":99,"isUpdate":70},"91f680ec-de23-440b-b4a5-1cabef88eaf6","cisa-adds-actively-exploited-windows-clfs-privilege-escalation-flaw-to-kev","CISA Warns of Actively Exploited Windows Privilege Escalation Flaw (CVE-2021-43226)","CISA Adds Windows CLFS Driver Privilege Escalation Vulnerability (CVE-2021-43226) to KEV Catalog","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added CVE-2021-43226, a high-severity privilege escalation vulnerability in the Microsoft Windows Common Log File System (CLFS) Driver, to its Known Exploited Vulnerabilities (KEV) catalog. The action, taken on October 6, 2025, confirms the flaw is being actively exploited in the wild. The vulnerability allows a local, authenticated attacker to execute code with SYSTEM-level privileges by leveraging a buffer overflow. The flaw affects a wide range of Windows versions, including Windows 10, 11, and Server editions. Federal agencies have been directed to patch the vulnerability by October 27, 2025.",[94,95,20,96,97],"Privilege Escalation","Windows","KEV","Patch Management",[21,97],[100],"CVE-2021-43226",{"id":102,"slug":103,"headline":104,"title":105,"severity":15,"excerpt":106,"tags":107,"categories":113,"createdAt":69,"updatedAt":69,"readingTime":49,"isUpdate":70},"c8f13620-2aa7-4dd5-ac5d-611ab72be216","jaguar-land-rover-begins-phased-production-restart-after-cyberattack","Jaguar Land Rover Begins Phased Restart a Month After Crippling Cyberattack","Jaguar Land Rover Initiates Phased Production Restart Following Month-Long Shutdown from Cyberattack","On October 7, 2025, Jaguar Land Rover (JLR) announced it is beginning a phased restart of its manufacturing plants, more than a month after a major cyberattack on August 31 halted its global operations. The attack disrupted everything from production lines and parts flow to retail systems. The restart is beginning cautiously, with engine plants and stamping operations coming online first, and full production is hoped for by the end of October. The incident has caused a significant financial blow, with sales dropping sharply in all markets. In response to the crisis, JLR has also launched a new financing program to support its struggling suppliers who have lost weeks of orders.",[108,109,110,111,43,112],"Cyberattack","Incident Response","Manufacturing","JLR","Supply Chain",[108,109,26],{"id":115,"slug":116,"headline":117,"title":118,"severity":15,"excerpt":119,"tags":120,"categories":124,"createdAt":69,"updatedAt":69,"readingTime":30,"cves":126,"cvssScore":128,"isUpdate":70},"eeb00ca1-e027-47fe-ba40-a655d4f16796","cisa-adds-actively-exploited-zimbra-xss-zero-day-to-kev-catalog","CISA Adds Actively Exploited Zimbra XSS Zero-Day (CVE-2025-27915) to KEV Catalog","Actively Exploited Zero-Day XSS Vulnerability in Zimbra Collaboration Suite (CVE-2025-27915) Added to CISA KEV","On October 7, 2025, CISA added CVE-2025-27915, a high-severity zero-day vulnerability in the Zimbra Collaboration Suite (ZCS), to its Known Exploited Vulnerabilities (KEV) catalog. The flaw is a stored cross-site scripting (XSS) issue in the ZCS Classic Web Client that can be triggered with no user interaction beyond viewing a malicious email. An attacker can craft a malicious iCalendar invitation that, when processed, executes arbitrary JavaScript in the victim's authenticated session. This allows for account takeover, data exfiltration, and redirection of sensitive emails. Federal agencies are mandated to apply mitigations by October 28, 2025.",[44,121,122,20,96,123],"XSS","Zimbra","Email Security",[21,125],"Phishing",[127],"CVE-2025-27915",7.5,{"id":130,"slug":131,"headline":132,"title":133,"severity":76,"excerpt":134,"tags":135,"categories":141,"createdAt":69,"updatedAt":69,"readingTime":30,"isUpdate":70},"5deb3b2c-0b53-475f-9f65-d138552736d7","ai-risk-disclosures-surge-among-sp-500-companies-report","AI Risk Disclosures Skyrocket Among S&P 500, Cybersecurity a Top Concern","Report: Over 70% of S&P 500 Companies Now Cite AI as a Material Risk, Up from 12% in 2023","A new report from The Conference Board, released on October 7, 2025, reveals a dramatic shift in corporate risk perception, with over 70% of S&P 500 companies now formally disclosing AI-related risks in their public filings. This is a massive jump from just 12% in 2023. Reputational damage is the most cited concern (38%), followed closely by cybersecurity risks (20%). Companies are increasingly worried about how AI expands the attack surface, introduces new vulnerabilities through third-party tools, and creates new legal and regulatory challenges. The findings highlight that while AI adoption is accelerating, corporate governance and oversight are still struggling to keep pace.",[136,137,138,139,140],"AI","Artificial Intelligence","Risk Management","Corporate Governance","Compliance",[86,142],"Cloud Security",{"id":144,"slug":145,"headline":146,"title":147,"severity":39,"excerpt":148,"tags":149,"categories":154,"createdAt":69,"updatedAt":69,"readingTime":49,"cves":155,"isUpdate":70},"37be1090-7bdb-4c1f-bc59-2f57c0131285","redis-patches-critical-redishell-rce-vulnerability-cve-2025-49844","Redis Patches Critical \"RediShell\" RCE Flaw (CVE-2025-49844) in Lua Sandbox","Critical \"RediShell\" RCE Vulnerability (CVE-2025-49844) in Redis Allows Sandbox Escape","Redis has released patches for CVE-2025-49844, a critical use-after-free vulnerability nicknamed \"RediShell\" by the Wiz researchers who discovered it. The flaw, announced on October 7, 2025, allows an authenticated attacker to escape the Lua sandbox and achieve remote code execution (RCE) on the underlying server. The risk is especially high for the estimated 330,000 internet-exposed Redis instances, around 60,000 of which are believed to have no authentication enabled. Because official Redis container images disable authentication by default, these instances are vulnerable to unauthenticated RCE. Security agencies like Germany's BSI are warning of imminent exploitation.",[150,151,152,21,153,142],"RCE","Redis","Sandbox Escape","Wiz",[21,142],[156],"CVE-2025-49844",{"id":158,"slug":159,"headline":160,"title":161,"severity":76,"excerpt":162,"tags":163,"categories":169,"createdAt":69,"updatedAt":69,"readingTime":171,"isUpdate":70},"0b155f34-525b-474b-b706-67d6d4f0f6c8","digicloud-africa-partners-with-google-to-distribute-secops-platform","Digicloud Africa to Distribute Google's AI-Powered SecOps Platform Across Continent","Digicloud Africa Becomes Official Distributor for Google Security Operations in Africa","Digicloud Africa, a major Google Cloud distributor, announced on October 6, 2025, that it has partnered with Google Security Operations. This collaboration will make Google's advanced, AI-driven cybersecurity solutions, including its cloud-native SIEM and SOAR platform, available to enterprises and organizations across the African continent. The partnership aims to help African businesses modernize their security posture, moving from reactive to proactive, intelligence-driven defense strategies to combat the growing complexity of cyber threats in the region.",[164,165,166,167,168,142],"Google","SecOps","SIEM","SOAR","Africa",[170,142],"Security Operations",3,1768928046335]