[{"data":1,"prerenderedAt":122},["ShallowReactive",2],{"publication-daily-threat-publications-2025-10-14":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-10-14","Microsoft's Massive October Patch Tuesday Fixes 175 Flaws and 3 Zero-Days; F5 Discloses Nation-State Breach","This cybersecurity advisory for October 14, 2025, covers a record-breaking Microsoft Patch Tuesday addressing 175 vulnerabilities, including three actively exploited zero-days. Additionally, F5 disclosed a major breach by a nation-state actor, resulting in the theft of BIG-IP source code and a CISA emergency directive. Other significant events include new campaigns by Chinese APTs Flax Typhoon and Jewelbug, a novel phishing attack abusing NPM infrastructure, and ongoing ransomware activity from the Qilin group.","2025-10-14",7,[10,33,53,66,79,97,110],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":24,"createdAt":27,"updatedAt":28,"readingTime":29,"isUpdate":30,"updateSummary":31,"updateContent":32},"d9d55e9c-df2a-4761-8f83-e869c01eae67","qilin-ransomware-claims-attack-on-japanese-beverage-giant-asahi","Qilin Ransomware Hits Japanese Beer Giant Asahi, Steals 27GB of Data","Qilin Ransomware Group Claims Responsibility for Cyberattack on Asahi Group Holdings","high","The Russia-based Qilin ransomware group has claimed responsibility for a cyberattack that disrupted operations at Asahi Group Holdings, Japan's largest brewing company. The attack, confirmed by Asahi on October 6, impacted order and shipment systems. On its dark web leak site, the Qilin gang stated it exfiltrated 27 gigabytes of sensitive corporate data, including contracts, financial documents, and employee information. The group has posted samples of the stolen data to pressure Asahi into paying the ransom, highlighting the severe risk ransomware poses to manufacturing and supply chain operations.",[18,19,20,21,22,23],"Qilin","Ransomware","Double Extortion","Manufacturing","Supply Chain","Japan",[19,25,26],"Cyberattack","Data Breach","2025-10-09T15:00:00.000Z","2025-10-14T12:00:00.000Z",4,true,"Qilin ransomware group continues operations, adding new victims Beta Dyne and Middlesex Appraisal Associates, leveraging bulletproof hosting.","The Qilin ransomware group has added U.S.-based electrical equipment manufacturer Beta Dyne and Middlesex Appraisal Associates to its leak site, indicating continued active operations. Research from Resecurity highlights the group's resilience, attributing it to the use of a global network of bulletproof hosting providers, which complicates disruption efforts. This update confirms Qilin's ongoing double-extortion campaign, posing a persistent threat across various sectors. New detection and mitigation strategies include monitoring for reconnaissance tools and credential dumping, and emphasizing robust backup and network segmentation.",{"id":34,"slug":35,"headline":36,"title":37,"severity":38,"excerpt":39,"tags":40,"categories":47,"createdAt":50,"updatedAt":50,"readingTime":51,"isUpdate":52},"e4671433-87a5-4e0e-888e-4068118b7aa4","f5-discloses-nation-state-breach-cisa-issues-emergency-directive","F5 Breached by Nation-State Actor; BIG-IP Source Code Stolen, CISA Issues Emergency Directive","F5 Discloses Major Breach by Nation-State Actor; CISA Issues Emergency Directive After BIG-IP Source Code and Vulnerability Data Exfiltrated","critical","Application security vendor F5 has disclosed a major security breach attributed to a 'highly sophisticated nation-state threat actor.' The attackers maintained long-term access to F5's internal development environments, exfiltrating portions of the BIG-IP source code, information on undisclosed vulnerabilities, and some customer configuration data. While F5 states there is no evidence of software supply chain modification, the incident poses a significant future risk. In response, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued Emergency Directive 26-01, mandating all federal civilian agencies to immediately patch F5 products, inventory devices, and remove end-of-life systems from their networks.",[41,42,43,44,45,46],"Nation-State","APT","Source Code Leak","CISA","Emergency Directive","BIG-IP",[48,26,49],"Supply Chain Attack","Threat Actor","2025-10-14T15:00:00.000Z",5,false,{"id":54,"slug":55,"headline":56,"title":57,"severity":15,"excerpt":58,"tags":59,"categories":65,"createdAt":50,"updatedAt":50,"readingTime":51,"isUpdate":52},"09cf6221-51e9-4bc7-b5d4-c7cbd2a04e6c","chinese-apt-jewelbug-infiltrates-russian-it-provider-in-espionage-campaign","Chinese APT 'Jewelbug' Breaches Russian IT Firm in Supply Chain Threat","Chinese APT Jewelbug Targets Russian IT Provider in Five-Month Espionage Campaign, Raising Supply Chain Attack Concerns","In a rare instance of Chinese cyber-espionage targeting a Russian entity, the APT group known as Jewelbug compromised a Russian IT service provider for five months in early 2025. According to Symantec, the attackers gained access to the firm's code repositories and software build systems, creating a significant risk of a software supply chain attack. The group used the powerful ShadowPad backdoor and exfiltrated data to Yandex Cloud to evade detection. This campaign highlights the expanding target scope of Chinese APTs and their focus on compromising trusted providers to enable downstream attacks.",[42,60,61,48,62,63,64],"Jewelbug","Cyber-espionage","ShadowPad","Yandex Cloud","Russia",[49,48,25],{"id":67,"slug":68,"headline":69,"title":70,"severity":71,"excerpt":72,"tags":73,"categories":78,"createdAt":50,"updatedAt":50,"readingTime":29,"isUpdate":52},"c0a0cfd8-a661-4c15-ae9f-fcd30e083b88","mango-discloses-data-breach-via-third-party-marketing-vendor","Fashion Retailer MANGO Discloses Data Breach from Third-Party Vendor","Spanish Retailer MANGO Confirms Data Breach via Compromised Third-Party Marketing Vendor","medium","Global fashion retailer MANGO has notified customers of a data breach that originated from a compromise at an external marketing service provider. The incident, disclosed on October 14, 2025, resulted in the unauthorized access of customer contact information, including names, country, postal codes, email addresses, and phone numbers. MANGO has confirmed that its internal systems were not affected and that no sensitive financial data or account credentials were exposed. The company has reported the breach to the Spanish Data Protection Agency (AEPD) and is advising customers to be wary of potential phishing attacks.",[26,74,48,75,76,77],"Third-Party Breach","Retail","PII","Customer Data",[26,48],{"id":80,"slug":81,"headline":82,"title":83,"severity":15,"excerpt":84,"tags":85,"categories":92,"createdAt":50,"updatedAt":50,"readingTime":29,"cves":94,"cvssScore":96,"isUpdate":52},"e3664f94-6aa3-43b5-abab-1ed0d88efb94","adobe-october-2025-patch-tuesday-fixes-critical-connect-flaw","Adobe Patches 35+ Flaws, Including Critical RCE Bug in Connect","Adobe's October 2025 Security Updates Address Over 35 Vulnerabilities, Including Critical Code Execution Flaw in Adobe Connect","As part of its October 2025 security updates, Adobe has released patches for more than 35 vulnerabilities across a dozen products. The most severe of these is a critical cross-site scripting (XSS) vulnerability in Adobe Connect, tracked as CVE-2025-49553, which could lead to arbitrary code execution. The flaw holds a CVSS score of 9.3. Other high-severity flaws were addressed in Adobe Commerce and Magento Open Source. Adobe has assigned a lower priority rating to most updates but recommends that users of Commerce and Magento patch promptly due to a historically elevated risk of attack.",[86,87,88,89,90,91],"Adobe","Patch Tuesday","Vulnerability","RCE","XSS","Adobe Connect",[93,88],"Patch Management",[95],"CVE-2025-49553",9.3,{"id":98,"slug":99,"headline":100,"title":101,"severity":15,"excerpt":102,"tags":103,"categories":108,"createdAt":50,"updatedAt":50,"readingTime":51,"isUpdate":52},"d163096b-d644-4c0e-baa7-c10e7b28f055","large-scale-botnet-targets-rdp-services-in-us","Massive Botnet of 100k+ IPs Targets U.S. RDP Services","Coordinated Botnet with Over 100,000 IPs Targets U.S. Remote Desktop Protocol (RDP) Services","Security researchers at GreyNoise have identified a massive, coordinated botnet campaign targeting Remote Desktop Protocol (RDP) services across the United States. The operation, which began on October 8, 2025, involves over 100,000 unique IP addresses from more than 100 countries. The botnet is using enumeration and timing attacks against RD Web Access and RDP web clients to identify valid user credentials. The widespread and centrally controlled nature of the campaign poses a significant threat to any organization exposing RDP to the internet, as a successful compromise can quickly lead to ransomware deployment or data theft.",[104,105,106,107,25],"Botnet","RDP","Brute Force","Credential Stuffing",[25,109],"Threat Intelligence",{"id":111,"slug":112,"headline":113,"title":114,"severity":71,"excerpt":115,"tags":116,"categories":121,"createdAt":50,"updatedAt":50,"readingTime":51,"isUpdate":52},"d740524d-7930-40a4-b514-744c6f7ef440","mysterious-elephant-apt-deploys-custom-tools-against-south-asian-governments","'Mysterious Elephant' APT Evolves, Deploys Custom Tools in Espionage Campaign","'Mysterious Elephant' APT Shifts to Custom Malware in Cyber-Espionage Campaign Targeting South Asian Governments","The cyber-espionage group known as 'Mysterious Elephant' has demonstrated a significant evolution in its capabilities, moving away from recycled malware to deploying its own custom-developed tools. Since early 2025, the APT group has been targeting government and diplomatic entities in South Asia. This strategic shift indicates an increased level of sophistication and investment, allowing the group to create more effective and evasive malware for its intelligence-gathering operations. The campaign poses a notable threat to the targeted governments and may have indirect implications for European nations with interests in the region.",[42,117,61,118,119,120],"Mysterious Elephant","Custom Malware","South Asia","Government",[49,109],1768321938212]