[{"data":1,"prerenderedAt":125},["ShallowReactive",2],{"publication-daily-threat-publications-2025-11-15":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-11-15","Akira Ransomware Escalates Attacks as Flurry of Zero-Days Hits Microsoft, Fortinet, and Cisco","For the period of November 14-15, 2025, the cybersecurity landscape was dominated by the escalating threat of the Akira ransomware group, which has now extorted over $244 million and is actively targeting critical infrastructure with new exploits. Simultaneously, a wave of critical, actively exploited zero-day vulnerabilities impacted major enterprise vendors including Microsoft, Fortinet, and Cisco, prompting urgent patching directives from CISA. Other significant developments include a state-sponsored campaign weaponizing AI for espionage, an unverified but high-impact claim by the Clop gang against the UK's NHS, and a massive supply chain attack flooding the NPM registry with over 150,000 malicious packages for a novel token-farming scheme.","2025-11-15",6,[10,32,51,72,90,108],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":25,"createdAt":27,"updatedAt":28,"readingTime":8,"isUpdate":29,"updateSummary":30,"updateContent":31},"abea1fbd-51c7-4ab3-bad5-d84ca955caf3","aws-us-east-1-outage-causes-global-service-disruption","AWS Outage in us-east-1 Knocks Major Global Services Offline","Widespread Internet Outage Linked to AWS us-east-1 Infrastructure Failure","high","A significant infrastructure fault within Amazon Web Services' (AWS) us-east-1 region in North Virginia on October 20, 2025, triggered a global outage affecting numerous major online services. Platforms including Snapchat, Fortnite, Disney Plus, and various banking applications experienced widespread disruptions. The incident, caused by issues with core services like DynamoDB and EC2, highlights the critical dependency of the digital economy on a few major cloud providers and underscores the importance of robust architectural resilience.",[18,19,20,21,22,23,24],"AWS","Outage","Cloud Security","Resilience","Business Continuity","us-east-1","Disaster Recovery",[20,26],"Incident Response","2025-10-20T15:00:00.000Z","2025-11-15T00:00:00.000Z",true,"New economic impact figures and policy debate on systemic risk emerge from AWS outage, with AWS disclaiming liability.","New analysis reveals the October 20, 2025, AWS outage caused an estimated $75 million per hour in losses, totaling tens of billions, significantly increasing the perceived economic impact. The incident has sparked a fierce debate among policymakers about the systemic risk posed by concentrated cloud infrastructure, leading to calls for new regulatory oversight, resilience funds, and mandated multi-cloud strategies. Furthermore, AWS has reportedly disclaimed liability for the losses, a new development not covered in the initial report, shifting the financial burden to affected businesses and highlighting a critical policy gap.",{"id":33,"slug":34,"headline":35,"title":36,"severity":37,"excerpt":38,"tags":39,"categories":46,"createdAt":48,"updatedAt":48,"readingTime":49,"isUpdate":50},"bcd8f174-4048-43b4-a567-e92cb1bc5afa","massive-token-farming-campaign-abuses-npm-registry-150k-packages","150,000+ Malicious NPM Packages Flood Registry in Crypto Token Farming Scheme","Researchers Uncover Massive Supply Chain Attack on NPM Targeting tea.xyz Cryptocurrency Protocol","medium","Security researchers from Amazon have uncovered one of the largest package flooding incidents in the history of the npm open-source registry, involving over 150,000 malicious packages. In a novel twist, the campaign was not designed for traditional malicious activities like stealing credentials or deploying ransomware. Instead, the attackers aimed to conduct a large-scale token farming operation by exploiting the incentive system of tea.xyz, a decentralized protocol that rewards open-source developers with 'TEA tokens'. The self-replicating packages automatically generated and published new junk packages, each linked to the attackers' blockchain wallets, polluting the ecosystem and abusing the reward mechanism.",[40,41,42,43,44,45,18],"NPM","Supply Chain Attack","Open Source","Cryptocurrency","Token Farming","tea.xyz",[41,47,20],"Malware","2025-11-15T15:00:00.000Z",4,false,{"id":52,"slug":53,"headline":54,"title":55,"severity":56,"excerpt":57,"tags":58,"categories":67,"createdAt":48,"updatedAt":48,"readingTime":49,"cves":69,"cvssScore":71,"isUpdate":50},"4da4f2f4-5cfe-4039-a832-4a32e48077f3","zdi-discloses-critical-nvidia-aistore-authentication-bypass-flaw","Critical 9.8 CVSS Auth Bypass Flaw in NVIDIA AIStore Disclosed","ZDI Discloses Critical Hard-Coded Credential Vulnerability (CVE-2025-33186) in NVIDIA AIStore","critical","The Zero Day Initiative (ZDI) has publicly disclosed a critical authentication bypass vulnerability in NVIDIA's AIStore, an open-source object storage platform for AI applications. The flaw, tracked as CVE-2025-33186, carries a CVSS score of 9.8 and is caused by hard-coded credentials within the platform's authentication component. A remote, unauthenticated attacker could exploit this vulnerability to completely bypass authentication and gain unauthorized access to the system, compromising the confidentiality and integrity of AI models and data. A second, high-severity information disclosure flaw (CVE-2025-33185) was also disclosed.",[59,60,61,62,63,64,65,66],"NVIDIA","AIStore","Vulnerability","ZDI","CVE-2025-33186","Authentication Bypass","Hard-coded Credentials","AI Security",[61,20,68],"Other",[63,70],"CVE-2025-33185",9.8,{"id":73,"slug":74,"headline":75,"title":76,"severity":56,"excerpt":77,"tags":78,"categories":86,"createdAt":48,"updatedAt":48,"readingTime":49,"cves":89,"isUpdate":50},"fd6eb024-99e4-4dd0-8d34-01245077a695","fortinet-patches-exploited-fortiweb-path-traversal-zero-day","Fortinet Patches Actively Exploited FortiWeb Zero-Day (CVE-2025-64446)","Fortinet Quietly Patches Critical, Actively Exploited Path Traversal Zero-Day in FortiWeb WAF","Fortinet has released a patch for a critical, actively exploited zero-day vulnerability in its FortiWeb web application firewall (WAF). The flaw, tracked as CVE-2025-64446, is a relative path traversal vulnerability that allows an unauthenticated remote attacker to execute arbitrary administrative commands by sending specially crafted HTTP/S requests. Due to evidence of active exploitation, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating that federal agencies patch it immediately. The flaw affects a wide range of FortiWeb versions, making immediate patching a top priority for all customers.",[79,80,81,61,82,83,84,85],"Fortinet","FortiWeb","Zero-Day","CVE-2025-64446","Path Traversal","CISA","KEV",[61,87,88],"Patch Management","Cyberattack",[82],{"id":91,"slug":92,"headline":93,"title":94,"severity":56,"excerpt":95,"tags":96,"categories":103,"createdAt":48,"updatedAt":48,"readingTime":49,"cves":106,"cvssScore":107,"isUpdate":50},"1af43455-00d8-464d-ad91-fbc72928cd61","cisa-issues-new-guidance-for-exploited-cisco-asa-vulnerabilities","CISA Warns Cisco ASA Devices Still Under Attack, Issues New Patch Guidance","CISA Releases Follow-Up Guidance for Exploited Cisco ASA Flaws (CVE-2025-20333, CVE-2025-20362) Amid Continued Attacks","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued follow-up implementation guidance for its September Emergency Directive 25-03, which addresses two critical, actively exploited vulnerabilities in Cisco ASA and Firepower devices. The flaws, a remote code execution bug (CVE-2025-20333) and a privilege escalation bug (CVE-2025-20362), are still being targeted by threat actors, including the China-linked group Storm-1849 (ArcaneDoor). CISA warns that many organizations incorrectly applied patches, leaving them vulnerable. The new guidance provides corrective actions and recommends further mitigation for devices that were not updated properly.",[84,97,98,61,81,99,100,101,102,85],"Cisco","Cisco ASA","CVE-2025-20333","CVE-2025-20362","Storm-1849","ArcaneDoor",[61,104,105],"Policy and Compliance","Threat Actor",[99,100],9.9,{"id":109,"slug":110,"headline":111,"title":112,"severity":37,"excerpt":113,"tags":114,"categories":120,"createdAt":48,"updatedAt":48,"readingTime":123,"cves":124,"cvssScore":8,"isUpdate":50},"57324841-553d-4be9-9778-d770f812c674","search-guard-flx-vulnerability-exposes-protected-documents-dls-bypass","Search Guard FLX Vulnerability (CVE-2025-12149) Allows DLS Bypass","Information Disclosure Flaw in Search Guard FLX Allows Bypass of Document-Level Security","A medium-severity information disclosure vulnerability, CVE-2025-12149, has been disclosed in floragunn's Search Guard FLX, a security plugin for Elasticsearch. The flaw, affecting versions up to 3.1.2, allows an attacker to bypass Document-Level Security (DLS) rules. This occurs specifically when a search is triggered from a Signals watch, an alerting component of the plugin. A low-privileged user who can create or trigger a watch could exploit this to access all documents in queried indices, exposing sensitive data that should be protected by DLS permissions.",[115,116,61,117,118,119],"Search Guard","Elasticsearch","CVE-2025-12149","DLS Bypass","Information Disclosure",[61,121,122],"Data Breach","Security Operations",3,[117],1768334604264]