[{"data":1,"prerenderedAt":135},["ShallowReactive",2],{"publication-daily-threat-publications-2025-12-30":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-12-30","CISA Orders Emergency Patch for Actively Exploited 'MongoBleed' Flaw as Insider Threats and Supply Chain Attacks Rattle Industries","This cybersecurity brief for December 30, 2025, covers a series of critical incidents. The most prominent is the active exploitation of 'MongoBleed' (CVE-2025-14847), a severe memory leak vulnerability in MongoDB, which prompted an emergency directive from CISA. Other major events include the disclosure of a 10.0 CVSS RCE flaw in SmarterMail (CVE-2025-52691), the guilty pleas of two cybersecurity insiders who deployed ALPHV/BlackCat ransomware, and a massive data breach at the University of Phoenix affecting nearly 3.5 million individuals due to a Clop ransomware attack exploiting an Oracle zero-day. These events highlight escalating threats from unpatched vulnerabilities, insider risks, and sophisticated ransomware operations.","2025-12-30",7,[10,35,54,75,88,105,120],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":26,"createdAt":29,"updatedAt":30,"readingTime":31,"isUpdate":32,"updateSummary":33,"updateContent":34},"bd2eb783-3a86-4464-98fe-61a17bdbfb2f","clop-suspected-in-oracle-zero-day-attacks-on-upenn-and-university-of-phoenix","Cl0p Implicated in Oracle Zero-Day Attacks, Breaching UPenn and University of Phoenix","Universities of Pennsylvania and Phoenix Disclose Data Breaches After Oracle E-Business Suite Zero-Day Exploitation, Cl0p Ransomware Gang Suspected","high","The University of Pennsylvania and the University of Phoenix have both reported data breaches resulting from the exploitation of zero-day vulnerabilities in their Oracle E-Business Suite servers. The attacks have compromised the personal information of at least 1,488 individuals at UPenn and a much larger, unspecified number of students, alumni, and staff at the University of Phoenix. Security researchers suspect the notorious Cl0p ransomware gang is behind the campaign, continuing their pattern of exploiting vulnerabilities in widely used enterprise software for large-scale data theft and extortion. Both institutions are currently notifying affected individuals.",[18,19,20,21,22,23,24,25],"Cl0p","Data Breach","Zero-Day","Oracle","Oracle E-Business Suite","Education","University","Extortion",[19,27,28],"Threat Actor","Vulnerability","2025-12-08T15:00:00.000Z","2025-12-30T00:00:00.000Z",5,true,"University of Phoenix breach confirmed to affect nearly 3.5 million individuals; SSNs and bank details exposed via CVE-2025-61882 in Oracle EBS.","The University of Phoenix has confirmed its data breach, previously reported as affecting an unspecified large number, now impacts 3,489,274 individuals. The attack, attributed to the Clop gang, exploited CVE-2025-61882 in Oracle E-Business Suite between August 13-22, 2025. Compromised data includes highly sensitive information such as Social Security numbers and bank account details. The breach went undetected for three months until November 2025, significantly increasing the severity and scope of the incident.",{"id":36,"slug":37,"headline":38,"title":39,"severity":15,"excerpt":40,"tags":41,"categories":49,"createdAt":50,"updatedAt":30,"readingTime":51,"isUpdate":32,"updateSummary":52,"updateContent":53},"e428c998-fb73-422e-8e3e-dcc35178102d","hypervisor-ransomware-attacks-surge-over-700-percent-led-by-akira","Hyperjacking: Ransomware Attacks on Hypervisors Skyrocket by 700%","Hypervisor Ransomware Attacks Surge Over 700%, Akira Gang Leads the Charge","Security vendor Huntress reports a staggering 700% increase in ransomware attacks directly targeting virtualization hypervisors like VMware ESXi and Microsoft Hyper-V in the latter half of 2025. This marks a significant strategic shift by threat actors, with the Akira ransomware group being a primary driver. By compromising the hypervisor, attackers can bypass traditional endpoint security and encrypt dozens or hundreds of virtual machines simultaneously, causing catastrophic operational disruption. The typical attack vector involves exploiting weak or stolen credentials for internet-facing services, such as VPNs without MFA, to gain initial access before moving laterally to the virtualization infrastructure. This trend underscores the critical need for organizations to harden and secure their core virtualization platforms.",[42,43,44,45,46,47,48],"Ransomware","Akira","Hypervisor","VMware","ESXi","Huntress","Cyberattack",[42,48,27],"2025-12-10T15:00:00.000Z",6,"RansomHouse group evolves with new 'Mario' ransomware, featuring complex dual-key encryption and continued targeting of VMware ESXi hypervisors.","The RansomHouse group (Jolly Scorpius) has upgraded its capabilities, deploying a new ransomware variant named 'Mario' with a sophisticated dual-key encryption scheme. This makes data recovery significantly harder without paying the ransom. RansomHouse continues its double-extortion model and frequently targets VMware ESXi hypervisors, reinforcing the trend of hypervisor-focused attacks. This evolution increases the overall threat level and complexity for defenders.",{"id":55,"slug":56,"headline":57,"title":58,"severity":59,"excerpt":60,"tags":61,"categories":69,"createdAt":70,"updatedAt":70,"readingTime":31,"cves":71,"cvssScore":73,"isUpdate":74},"f5e5f63c-164d-4cca-bc36-50498afd3b56","critical-rce-flaw-in-smartermail-threatens-mail-servers","Maximum Severity RCE Flaw in SmarterMail Puts Mail Servers at Risk","Critical Unauthenticated RCE Vulnerability (CVE-2025-52691) in SmarterMail Receives 10.0 CVSS Score","critical","A critical, unauthenticated arbitrary file upload vulnerability in SmarterMail, tracked as CVE-2025-52691, has been disclosed, earning the maximum possible CVSS score of 10.0. The flaw allows a remote attacker to upload malicious files, such as a web shell, to any location on an affected server without needing credentials. This can lead to remote code execution (RCE), enabling a complete takeover of the mail server. The vulnerability affects SmarterMail builds 9406 and earlier. Although a patch was released in October 2025 (Build 9413), the public disclosure was delayed until late December. The Cyber Security Agency of Singapore (CSA) has issued an alert, urging administrators to update immediately due to the high risk of exploitation, especially for internet-facing mail servers.",[62,63,64,65,66,67,68],"SmarterMail","RCE","Arbitrary File Upload","Unauthenticated","CVSS 10.0","Web Shell","Mail Server",[28,48],"2025-12-30T15:00:00.000Z",[72],"CVE-2025-52691",10,false,{"id":76,"slug":77,"headline":78,"title":79,"severity":15,"excerpt":80,"tags":81,"categories":87,"createdAt":70,"updatedAt":70,"readingTime":31,"isUpdate":74},"0e5b483d-8764-468e-aaac-cc36d7eeaa52","cybersecurity-insiders-plead-guilty-to-alphv-blackcat-ransomware-attacks","Insider Threat: Cybersecurity Pros Plead Guilty to ALPHV/BlackCat Ransomware Attacks","Two U.S. Cybersecurity Professionals Plead Guilty to Deploying ALPHV/BlackCat Ransomware Against American Companies","In a significant insider threat case, two American cybersecurity professionals, Ryan Goldberg and Kevin Martin, have pleaded guilty to conspiracy to commit extortion. The pair admitted to using their expert knowledge and access gained from their roles in incident response and ransomware negotiation to conduct ransomware attacks against U.S. companies using the ALPHV/BlackCat ransomware variant. Operating as affiliates for the Ransomware-as-a-Service (RaaS) group, they targeted organizations in the healthcare, engineering, and technology sectors, extorting $1.2 million in one case. The Department of Justice announced the pleas on December 30, 2025, highlighting the danger of trusted insiders turning to cybercrime. Both individuals face up to 20 years in prison.",[82,83,84,42,25,85,86],"Insider Threat","ALPHV","BlackCat","Department of Justice","RaaS",[27,42,48],{"id":89,"slug":90,"headline":91,"title":92,"severity":15,"excerpt":93,"tags":94,"categories":100,"createdAt":70,"updatedAt":70,"readingTime":51,"cves":102,"cvssScore":104,"isUpdate":74},"cd939d0c-e65c-4f24-832f-4ee484bd8e27","ubisoft-rainbow-six-siege-hacked-in-game-economy-disrupted","Rainbow Six Siege Hacked: Attackers Flood Game with $13M in Currency, Disrupting Economy","Ubisoft's Rainbow Six Siege Suffers Major Breach; Hackers Distribute Billions in Premium Currency and Hijack Moderation Tools","Over the weekend of December 27-28, 2025, Ubisoft's popular online shooter, Rainbow Six Siege, was hit by a major security breach. Attackers infiltrated the game's backend systems, distributing approximately 2 billion 'R6 Credits'—the game's premium currency, valued at over $13 million—to every player. The hackers also took control of moderation systems, issuing random bans and unbans, causing widespread chaos. In response, Ubisoft was forced to take the game completely offline to perform a full data rollback. While unconfirmed, some hacker groups have claimed responsibility, alleging they used the recently disclosed 'MongoBleed' exploit to gain access and may have stolen over 900GB of development data.",[95,96,97,48,98,19,99],"Ubisoft","Rainbow Six Siege","Gaming","In-Game Economy","MongoBleed",[48,19,101],"Threat Intelligence",[103],"CVE-2025-14847",8.7,{"id":106,"slug":107,"headline":108,"title":109,"severity":15,"excerpt":110,"tags":111,"categories":118,"createdAt":70,"updatedAt":70,"readingTime":51,"isUpdate":74},"0e4267a3-edad-4f72-bc17-b7bcd7bd9033","crypto-worth-over-35m-stolen-using-data-from-2022-lastpass-breach","Fallout from 2022 LastPass Breach Continues: Over $35M in Crypto Stolen","LastPass 2022 Breach: Stolen Vaults Lead to $35 Million in Cryptocurrency Theft Through 2025","The 2022 data breach at password manager LastPass is continuing to enable widespread financial theft, with researchers tracing over $35 million in stolen cryptocurrency to the incident. A report by blockchain intelligence firm TRM Labs reveals that threat actors are systematically cracking the encrypted password vaults stolen in the breach, with thefts observed as recently as October 2025. By brute-forcing weak master passwords, attackers gain access to stored crypto private keys and seed phrases. The stolen funds are being laundered through a sophisticated network involving privacy mixers and high-risk Russian exchanges, pointing to an organized cybercriminal operation. This long-tail exploitation highlights the severe and prolonged risks associated with password manager breaches.",[112,19,113,114,115,116,117],"LastPass","Cryptocurrency","Password Manager","Brute Force","Money Laundering","TRM Labs",[19,27,119],"Malware",{"id":121,"slug":122,"headline":123,"title":124,"severity":15,"excerpt":125,"tags":126,"categories":134,"createdAt":70,"updatedAt":70,"readingTime":31,"isUpdate":74},"7b4da649-8c6b-4207-9fd0-2cde3a87c899","hacker-leaks-2-3-million-wired-subscriber-records-threatens-more","Hacker Leaks 2.3M WIRED Subscriber Records, Threatens 40M More from Condé Nast","WIRED Magazine Suffers Data Leak of 2.3 Million Subscribers; Hacker Blames Ignored Vulnerability Reports","A threat actor named 'Lovely' has leaked a database containing over 2.3 million records of WIRED magazine subscribers on a hacking forum. The leaked data includes email addresses, internal IDs, and in some cases, full names, phone numbers, and physical addresses. The hacker claims the leak is retaliation against WIRED's parent company, Condé Nast, for ignoring vulnerability disclosure reports for a month. 'Lovely' has threatened to release a much larger dataset of 40 million records from other Condé Nast brands like The New Yorker and Vogue. The data, which has been added to Have I Been Pwned, appears to have been exfiltrated by exploiting web application vulnerabilities such as IDOR or broken access control.",[127,128,129,130,131,132,133],"Data Leak","Hacker","WIRED","Condé Nast","Vulnerability Disclosure","IDOR","PII",[19,27,28],1770392347006]