{
  "lastUpdated": "2026-01-15T16:13:11.709Z",
  "runDate": "2026-01-15",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-15",
      "type": "publication-daily",
      "headline": "Microsoft Patches Actively Exploited Zero-Day; Massive Data Breaches Impact Millions in France and US Healthcare",
      "articleCount": 12,
      "articles": [
        {
          "slug": "cisa-warns-of-vulnerabilities-in-rockwell-automation-and-yosmart-ics-products",
          "headline": "CISA Issues Advisories for Flaws in Rockwell Automation and YoSmart ICS Devices",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has released several advisories for vulnerabilities in Industrial Control Systems (ICS). The warnings highlight flaws in products from Rockwell Automation and YoSmart used in the critical manufacturing sector. The most severe vulnerability, CVE-2025-9368 (CVSS 7.5), affects Rockwell Automation 432ES-IG3 devices and could allow an attacker to cause a denial-of-service condition requiring a manual reboot. CISA has urged users to review the advisories and apply mitigations, emphasizing network segmentation and secure remote access.",
          "categories": [
            "Industrial Control Systems",
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "CVE-2025-9368",
            "Critical Manufacturing",
            "Denial of Service",
            "ICS",
            "OT Security",
            "Rockwell Automation",
            "Vulnerability"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z",
          "cves": [
            "CVE-2025-9368"
          ]
        },
        {
          "slug": "microsoft-copilot-vulnerable-to-reprompt-attack-for-data-theft",
          "headline": "Microsoft Copilot Flaw Allowed Data Theft via \"Reprompt\" Session Hijacking Attack",
          "summary": "Researchers discovered a significant vulnerability in Microsoft's Copilot AI assistant that allowed for a \"Reprompt\" attack, enabling threat actors to bypass safety features, hijack user sessions, and exfiltrate data. The flaw, which has been patched in the January 2026 security update, abused URL parameters to inject hidden, follow-up prompts that executed within the victim's authenticated session. This allowed attackers to chain commands and steal information without the user's knowledge, highlighting the security risks of AI assistants processing untrusted input.",
          "categories": [
            "Vulnerability",
            "Cloud Security",
            "Other"
          ],
          "tags": [
            "AI Security",
            "HiddenLayer",
            "Microsoft Copilot",
            "Prompt Injection",
            "Session Hijacking",
            "Vulnerability"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z"
        },
        {
          "slug": "pax8-cloud-marketplace-accidentally-leaks-partner-and-customer-data",
          "headline": "Pax8 Cloud Marketplace Accidentally Leaks Sensitive Partner and Customer Data",
          "summary": "Cloud commerce marketplace Pax8 has confirmed an accidental data leak after an employee mistakenly emailed a spreadsheet with sensitive business information to a small number of its partners. The file exposed data related to approximately 1,800 Managed Service Provider (MSP) partners, including their customer names, Microsoft licensing details, gross bookings, and NCE renewal dates. While no PII was reportedly included, the exposed commercial data is highly valuable and could be abused by competitors or threat actors to target customers.",
          "categories": [
            "Data Breach",
            "Cloud Security"
          ],
          "tags": [
            "Cloud",
            "Data Breach",
            "Data Leak",
            "Human Error",
            "MSP",
            "Pax8"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z"
        },
        {
          "slug": "central-maine-healthcare-discloses-data-breach-affecting-145000",
          "headline": "Central Maine Healthcare Breach Exposes Data of Over 145,000 Patients and Employees",
          "summary": "Central Maine Healthcare (CMH) has disclosed a major data breach affecting 145,381 patients and employees. The incident involved an unauthorized third party maintaining access to its network for over two months, from March to June 2025. The compromised data includes highly sensitive personal, medical, and financial information, such as Social Security numbers and treatment details. CMH is offering complimentary credit monitoring services to those affected and has stated it is enhancing its security monitoring to prevent future incidents.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Regulatory"
          ],
          "tags": [
            "Cyberattack",
            "Data Breach",
            "HIPAA",
            "Healthcare",
            "Maine",
            "PHI",
            "PII"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z"
        },
        {
          "slug": "active-campaign-uses-dll-side-loading-to-deploy-rats-and-info-stealers",
          "headline": "Hackers Abuse Signed GitKraken Binary in DLL Side-Loading Campaign to Distribute RATs and Stealers",
          "summary": "A new malware campaign detailed by Trellix is leveraging a DLL side-loading vulnerability in a legitimate, signed executable ('ahost.exe') from the c-ares library, distributed with GitKraken's Desktop app. By placing a malicious 'libcares-2.dll' in the same directory, attackers trick the signed binary into loading their code, bypassing security defenses. This technique is being used to deliver a wide range of commodity malware, including Agent Tesla, Vidar Stealer, Remcos RAT, and Quasar RAT, primarily targeting industrial and commercial sectors with invoice-themed lures.",
          "categories": [
            "Malware",
            "Threat Actor",
            "Phishing"
          ],
          "tags": [
            "Agent Tesla",
            "DLL Side-Loading",
            "Defense Evasion",
            "GitKraken",
            "Malware",
            "Remcos RAT",
            "Trellix",
            "Vidar Stealer"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z",
          "malware": [
            "Agent Tesla",
            "CryptBot",
            "DCRat",
            "Formbook",
            "Lumma Stealer",
            "Quasar RAT",
            "Remcos RAT",
            "Vidar Stealer",
            "XWorm"
          ]
        },
        {
          "slug": "ju-teng-international-probes-data-breach-after-client-info-leaked-on-dark-web",
          "headline": "Manufacturing Giant Ju Teng Probes Breach After Incransom Leaks Client Data from Dell, HP, BMW",
          "summary": "Manufacturing giant Ju Teng International Holdings is investigating a data breach after the Incransom ransomware group claimed to have stolen 200GB of sensitive data and posted it for sale on the dark web. The compromised information allegedly includes confidential project details, product drawings, and financial records belonging to Ju Teng and its high-profile clients, including Dell, HP, BMW, and Mercedes-Benz. The incident underscores the significant supply chain risk posed by attacks on manufacturers with access to sensitive partner data.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Supply Chain Attack"
          ],
          "tags": [
            "BMW",
            "Data Breach",
            "Dell",
            "HP",
            "Incransom",
            "Manufacturing",
            "Ransomware",
            "Supply Chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z"
        },
        {
          "slug": "monroe-university-discloses-data-breach-affecting-over-320000",
          "headline": "Monroe University Data Breach Exposes SSNs and Passport Numbers of Over 320,000 People",
          "summary": "New York-based Monroe University has reported a data breach that compromised the personal information of 320,973 people. The incident, which took place over a two-week period in December 2024, involved an unauthorized third party accessing and exfiltrating files from the university's computer systems. The compromised data is extensive, potentially including Social Security numbers, driver's license and passport numbers, financial account details, and medical information. The university began notifying affected individuals in January 2026, over a year after the breach occurred.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Regulatory"
          ],
          "tags": [
            "Class Action",
            "Data Breach",
            "Education",
            "Higher Education",
            "PII",
            "Passport",
            "SSN"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z"
        },
        {
          "slug": "industrialized-credential-driven-npm-supply-chain-attacks-on-the-rise",
          "headline": "NPM Supply Chain Attacks Evolve into Industrialized, Credential-Driven Campaigns",
          "summary": "A new analysis reveals a significant evolution in software supply chain attacks targeting the npm ecosystem. Threat actors have moved beyond simple typosquatting to industrialized campaigns focused on compromising developer accounts and CI/CD pipelines. By stealing credentials through phishing, attackers are injecting malware into legitimate, popular packages, as seen in the 'Shai-Hulud' campaign. These attacks are often 'CI-aware,' activating only within automated build environments to steal secrets and inject malicious code, posing a severe threat to the software development lifecycle.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "CI/CD",
            "Credential Theft",
            "Malware",
            "Phishing",
            "Shai-Hulud",
            "Supply Chain Attack",
            "npm"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z",
          "malware": [
            "Shai-Hulud"
          ]
        },
        {
          "slug": "new-zealand-manage-my-health-breach-timeline-and-fallout",
          "headline": "New Zealand's Manage My Health Breach: Timeline Emerges After Hacker Demands Ransom",
          "summary": "Details have emerged about the late December 2025 cyberattack on Manage My Health, New Zealand's largest patient portal. A hacker using the alias 'Kazu' claimed to have stolen 108GB of data, including medical records for up to 126,000 users, and demanded a US$60,000 ransom. The New Zealand government has launched a review into the breach, and the company has obtained a court injunction to prevent the publication of the stolen data. The incident has put the cybersecurity of the nation's healthcare sector under intense scrutiny.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Regulatory"
          ],
          "tags": [
            "Data Breach",
            "Extortion",
            "Healthcare",
            "New Zealand",
            "PHI",
            "Ransom"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z"
        },
        {
          "slug": "voidlink-new-modular-linux-malware-targets-cloud-environments",
          "headline": "VoidLink: New Modular Linux Malware Framework Discovered Targeting Cloud and Container Environments",
          "summary": "Security researchers at Check Point have discovered 'VoidLink,' a highly sophisticated and modular Linux malware framework. Written in the modern Zig programming language, VoidLink is purpose-built for espionage in cloud and containerized environments. It can detect if it's running in AWS, GCP, Azure, Kubernetes, or Docker and adapt its behavior. With a plugin-based architecture inspired by Cobalt Strike, it features advanced rootkit capabilities, an in-memory plugin system, and tools for credential theft from cloud services and Git repositories. Though not yet seen in the wild, its advanced design poses a significant future threat.",
          "categories": [
            "Malware",
            "Cloud Security",
            "Threat Actor"
          ],
          "tags": [
            "Check Point",
            "Cloud Security",
            "Espionage",
            "Linux",
            "Malware",
            "Rootkit",
            "VoidLink",
            "Zig",
            "eBPF"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z",
          "malware": [
            "Cobalt Strike",
            "VoidLink"
          ]
        },
        {
          "slug": "massive-data-leak-exposes-records-of-45-million-french-citizens",
          "headline": "Massive Unsecured Database Leaks Personal, Health, and Financial Data of 45 Million French Citizens",
          "summary": "Security researchers have discovered a massive, unprotected database on a cloud server containing the sensitive records of approximately 45 million French citizens. The data, which has since been secured, appears to be an aggregation from at least five separate breaches, compiled by a data broker or cybercriminal. The exposed archive included voter registration data, healthcare records, IBANs, and CRM contact information, creating comprehensive and dangerous profiles on a significant portion of the French population.",
          "categories": [
            "Data Breach",
            "Regulatory",
            "Cloud Security"
          ],
          "tags": [
            "Cloud Security",
            "Cybernews",
            "Data Breach",
            "Data Leak",
            "France",
            "IBAN",
            "Misconfiguration",
            "PII"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z"
        },
        {
          "slug": "microsoft-january-2026-patch-tuesday-fixes-actively-exploited-zero-day",
          "headline": "Microsoft Patches Actively Exploited Zero-Day in January 2026 Patch Tuesday Update",
          "summary": "Microsoft's first Patch Tuesday of 2026 delivered fixes for over 110 vulnerabilities, including a critical zero-day in the Windows Desktop Window Manager (CVE-2026-20805) that is being actively exploited in the wild for information disclosure. The update, which also patches eight critical flaws, addresses vulnerabilities across Windows, Office, Azure, and SharePoint. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the exploited zero-day to its Known Exploited Vulnerabilities (KEV) catalog, mandating urgent patching for federal agencies.",
          "categories": [
            "Patch Management",
            "Vulnerability"
          ],
          "tags": [
            "ASLR Bypass",
            "CISA KEV",
            "CVE-2026-20805",
            "Information Disclosure",
            "Microsoft",
            "Patch Tuesday",
            "Windows",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-15T15:00:00.000Z",
          "cves": [
            "CVE-2023-31096",
            "CVE-2026-20805",
            "CVE-2026-20822",
            "CVE-2026-20944",
            "CVE-2026-20955",
            "CVE-2026-20957",
            "CVE-2026-21265"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-14",
      "type": "publication-daily",
      "headline": "CISA Mandates Patches for Exploited Windows & Gogs Zero-Days; Ransomware Cripples Hospital & Energy Giant Breached",
      "articleCount": 12,
      "articles": [
        {
          "slug": "pax8-data-leak-exposes-msp-and-customer-data",
          "headline": "Pax8 Data Leak Exposes Sensitive MSP and Customer Info via Accidental Email",
          "summary": "Cloud commerce marketplace Pax8 has confirmed a data exposure incident caused by human error. On January 13, an employee mistakenly sent an email containing a CSV file with sensitive, non-PII business data for approximately 1,800 Managed Service Provider (MSP) partners. The email, sent to fewer than 40 UK-based partners, exposed valuable information such as customer names, Microsoft license counts, pricing, and contract renewal dates, creating a significant risk of targeted phishing and competitive poaching.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Cloud Security"
          ],
          "tags": [
            "Data Exposure",
            "Data Leak",
            "Human Error",
            "MSP",
            "Pax8",
            "Supply Chain"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "encryptionless-extortion-becomes-dominant-ransomware-tactic",
          "headline": "Ransomware Evolves: Data Theft Now Favored Over Encryption in Extortion-Only Attacks",
          "summary": "Security analysis reveals a fundamental shift in the ransomware business model, with threat actors increasingly favoring \"extortion-only\" attacks that forgo data encryption entirely. This evolved tactic focuses on silent, long-term data exfiltration followed by threats to leak the stolen information publicly. This approach is stealthier than traditional encryption and effectively bypasses backup-based recovery strategies, turning every attack into a data breach crisis. Groups like Cl0p and ShinyHunters have pioneered this model, which accounted for a significant portion of the 6,182 extortion incidents in 2025.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Data Breach"
          ],
          "tags": [
            "Cybercrime",
            "Data Breach",
            "Data Exfiltration",
            "Extortion",
            "Ransomware",
            "Threat Trend"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z",
          "malware": [
            "Akira",
            "Cl0p",
            "Qilin",
            "Safepay"
          ]
        },
        {
          "slug": "cisa-mandates-patch-for-actively-exploited-windows-zero-day-cve-2026-20805",
          "headline": "CISA Mandates Patch for Exploited Windows Zero-Day Used in Attack Chains",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has ordered federal agencies to patch a zero-day vulnerability in the Windows Desktop Window Manager (CVE-2026-20805) by February 3, 2026. The medium-severity information disclosure flaw is being actively exploited in the wild as a crucial component in multi-stage attack chains, allowing attackers to bypass Address Space Layout Randomization (ASLR) and enable more severe exploits like remote code execution. The flaw was addressed in Microsoft's January 2026 Patch Tuesday update.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Threat Intelligence"
          ],
          "tags": [
            "ASLR Bypass",
            "CISA",
            "CVE-2026-20805",
            "DWM",
            "KEV",
            "Patch Tuesday",
            "Windows",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z",
          "cves": [
            "CVE-2026-20805"
          ]
        },
        {
          "slug": "cisa-warns-of-critical-flaws-in-rockwell-automation-and-yosmart-ics-equipment",
          "headline": "CISA Warns of Critical Flaws in Rockwell & YoSmart ICS Equipment",
          "summary": "CISA has released several Industrial Control Systems (ICS) advisories, warning of significant vulnerabilities in widely deployed equipment from Rockwell Automation and YoSmart. A high-severity SQL injection flaw (CVE-2025-12807) in Rockwell's FactoryTalk platform could allow for database takeover, while another flaw (CVE-2025-9368) can cause a denial-of-service condition. Separately, multiple flaws in YoSmart smart home hubs could permit remote device control and data interception, posing risks to both manufacturing and communications sectors.",
          "categories": [
            "Industrial Control Systems",
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "DoS",
            "ICS",
            "Rockwell Automation",
            "SCADA",
            "SQL Injection",
            "Vulnerability",
            "YoSmart"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z",
          "cves": [
            "CVE-2025-12807",
            "CVE-2025-59448",
            "CVE-2025-59449",
            "CVE-2025-59451",
            "CVE-2025-59452",
            "CVE-2025-9368"
          ]
        },
        {
          "slug": "microsoft-january-2026-patch-tuesday-fixes-114-vulnerabilities",
          "headline": "Microsoft's January 2026 Patch Tuesday Fixes 114 Flaws, Including One Exploited Zero-Day",
          "summary": "Microsoft has released its first Patch Tuesday of 2026, a substantial update that addresses 114 security vulnerabilities across a wide range of its products, including Windows, Office, Azure, and SharePoint. The release includes fixes for eight critical remote code execution (RCE) vulnerabilities and, most notably, one moderate-severity information disclosure zero-day (CVE-2026-20805) that is confirmed to be actively exploited in the wild. This makes it the third-largest January update on record, urging administrators to prioritize deployment.",
          "categories": [
            "Patch Management",
            "Vulnerability"
          ],
          "tags": [
            "CVE-2026-20805",
            "Microsoft",
            "Patch Tuesday",
            "RCE",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z",
          "cves": [
            "CVE-2026-20805"
          ]
        },
        {
          "slug": "gru-linked-hackers-bluedelta-apt28-evolve-credential-harvesting-tactics",
          "headline": "Russian GRU Hackers (APT28) Evolve Credential-Harvesting Tactics",
          "summary": "The Russian GRU-linked threat group BlueDelta, also known as APT28 or Fancy Bear, has been observed refining its credential-harvesting operations. According to research from Recorded Future, campaigns between February and September 2025 targeted energy, defense, and policy organizations in Europe and Eurasia. The group uses tailored spear-phishing emails, multi-stage redirection, and abuses low-cost, disposable infrastructure like ngrok and other free hosting services to enhance stealth and complicate attribution.",
          "categories": [
            "Threat Actor",
            "Phishing",
            "Threat Intelligence"
          ],
          "tags": [
            "APT28",
            "BlueDelta",
            "Credential Harvesting",
            "Fancy Bear",
            "GRU",
            "Phishing",
            "Russia",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "kremlin-hackers-target-ukrainian-military-with-pluggyape-malware",
          "headline": "Russian Hackers Target Ukrainian Military with \"PluggyApe\" Malware",
          "summary": "A Russian-linked hacking group, Void Blizzard (also known as UAC-0190), has been targeting the Ukrainian Defense Forces with a new cyber-espionage campaign. According to CERT-UA, the attacks, which occurred between October and December 2025, use a novel malware strain called PluggyApe. The campaign employs sophisticated social engineering, with attackers making direct contact with targets on secure messaging apps like Signal and WhatsApp, using charity-themed lures to build trust and deliver the malware.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "CERT-UA",
            "Cyber Espionage",
            "Malware",
            "PluggyApe",
            "Russia",
            "Ukraine",
            "Void Blizzard"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "spanish-energy-giant-endesa-suffers-major-data-breach",
          "headline": "Spanish Energy Giant Endesa Hit by Massive Data Breach, 20M Records Allegedly For Sale",
          "summary": "Spain's largest electric utility, Endesa, has confirmed a data breach after detecting unauthorized access to a commercial platform. The company admitted that customer PII, contact details, and bank account IBANs were potentially exposed. The situation is amplified by a threat actor on a cybercrime forum who claims to have stolen a 1.05 TB database containing the data of over 20 million people, which is now up for sale. Endesa, which serves over 10 million customers, is urging vigilance against phishing and fraud.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Industrial Control Systems"
          ],
          "tags": [
            "Cybercrime",
            "Data Breach",
            "Endesa",
            "Energy Sector",
            "IBAN",
            "PII",
            "Spain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "malicious-npm-packages-target-n8n-workflow-automation-platform",
          "headline": "Supply Chain Attack Hits n8n Workflow Automation Platform, Steals OAuth Tokens",
          "summary": "A sophisticated supply chain attack has targeted the n8n workflow automation ecosystem, as reported by researchers at Endor Labs. Attackers published at least eight malicious packages on the npm registry, masquerading as legitimate community-built integrations. These packages were designed to trick developers into entering OAuth credentials, which were then decrypted using n8n's master key and exfiltrated to an attacker-controlled server. This marks the first known supply chain attack specifically targeting the n8n platform.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "Credential Theft",
            "Malware",
            "OAuth",
            "Supply Chain Attack",
            "n8n",
            "npm"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "cisa-warns-of-actively-exploited-rce-flaw-in-gogs-git-service",
          "headline": "CISA Warns of Actively Exploited RCE Flaw in Gogs Git Service, 700+ Instances Compromised",
          "summary": "CISA has added a high-severity path traversal vulnerability (CVE-2025-8110) in the Gogs self-hosted Git service to its Known Exploited Vulnerabilities (KEV) catalog, warning of active exploitation in the wild. The flaw, rated CVSS 8.7, allows an authenticated attacker to achieve remote code execution (RCE). Security firm Wiz reported that over 700 Gogs instances have already been compromised. With no official patch available at the time of the alert, CISA has mandated federal agencies apply mitigations by February 2, 2026.",
          "categories": [
            "Vulnerability",
            "Supply Chain Attack",
            "Threat Intelligence"
          ],
          "tags": [
            "CISA",
            "Git",
            "Gogs",
            "KEV",
            "Path Traversal",
            "RCE",
            "Supply Chain Attack",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z",
          "cves": [
            "CVE-2024-55947",
            "CVE-2025-8110"
          ]
        },
        {
          "slug": "connectpos-exposed-admin-github-token-for-four-years",
          "headline": "ConnectPOS Exposed Admin GitHub Token for Over Four Years, Creating Massive Supply Chain Risk",
          "summary": "Point-of-sale vendor ConnectPOS exposed a GitHub Personal Access Token (PAT) with full administrative privileges in its public documentation for over four years, from September 2021 until its discovery in January 2026. The blunder, found by security firm Sansec, put the vendor's entire software supply chain at risk. An attacker could have used the token to inject malicious code, such as a payment card skimmer, into the POS software, which would then be distributed to its 12,000+ customers, including major brands like Asus and Indiana University.",
          "categories": [
            "Supply Chain Attack",
            "Vulnerability",
            "Data Breach"
          ],
          "tags": [
            "ConnectPOS",
            "GitHub",
            "Magecart",
            "PAT",
            "Secret Leak",
            "Supply Chain Attack",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "ransomware-attack-cripples-belgian-hospital-forces-patient-transfers",
          "headline": "Ransomware Cripples Belgian Hospital, Critical Patients Transferred",
          "summary": "A major cyberattack, widely reported as ransomware, has crippled the AZ Monica hospital network in Antwerp, Belgium. The incident on January 13, 2026, forced a complete IT shutdown across two campuses to contain the threat. This drastic measure led to the cancellation of at least 70 surgeries and, most critically, required the emergency transfer of seven intensive care patients to other facilities. The attack highlights the severe, life-threatening consequences of cyberattacks on the healthcare sector.",
          "categories": [
            "Ransomware",
            "Cyberattack",
            "Industrial Control Systems"
          ],
          "tags": [
            "Belgium",
            "Cyberattack",
            "Healthcare",
            "Incident Response",
            "Patient Safety",
            "Ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "ransomware-tactics-evolve-amid-declining-profits-2026",
        "originalHeadline": "Ransomware Evolves: Groups Recruit Insiders, Add DDoS as Profits Fall",
        "updateTitle": "Update: Ransomware Evolves: Groups Recruit Insiders, Add DDoS as Profits Fall",
        "updateSummary": "Ransomware groups increasingly favor 'extortion-only' attacks, abandoning encryption for silent data theft, bypassing traditional backups.",
        "categories": [
          "Threat Intelligence",
          "Ransomware",
          "Threat Actor"
        ],
        "tags": [
          "Cybercrime",
          "DDoS",
          "Insider Threat",
          "RaaS",
          "Ransomware",
          "Threat Intelligence"
        ],
        "severity": "informational",
        "publishedAt": "2026-01-05T15:00:00.000Z",
        "updatedAt": "2026-01-14T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}