{
  "lastUpdated": "2026-01-30T16:29:45.140Z",
  "runDate": "2026-01-30",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-30",
      "type": "publication-daily",
      "headline": "Active Exploits Target Ivanti & Microsoft Office; Sandworm Deploys New Wiper in Poland",
      "articleCount": 12,
      "articles": [
        {
          "slug": "widespread-phishing-campaign-uses-fake-job-offers-to-steal-credentials",
          "headline": "Global Phishing Campaign Lures Victims with Fake Job Offers",
          "summary": "A multi-lingual phishing campaign is targeting job seekers across the United States, United Kingdom, France, Italy, and Spain. According to research from Bitdefender, attackers are impersonating well-known employers and staffing companies, sending emails with fake job offers that promise easy work and fast interviews. The messages are tailored to the recipient's language and location. When a victim clicks a link in the email, they are taken to a credential harvesting webpage designed to steal personal data and login information. This campaign capitalizes on social engineering tactics that prey on individuals' career aspirations.",
          "categories": [
            "Phishing"
          ],
          "tags": [
            "Credential Harvesting",
            "Identity Theft",
            "Phishing",
            "Recruitment",
            "Social Engineering"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z"
        },
        {
          "slug": "phishing-campaign-uses-vercel-domains-and-telegram-to-deliver-rat",
          "headline": "Novel Phishing Attack Abuses Vercel and Telegram to Deliver RATs",
          "summary": "A novel phishing campaign, observed between November 2025 and January 2026, is abusing trusted `*.vercel.app` domains to bypass email security filters and deliver malware. The attack, detailed by Cloudflare, uses financial lures like fake invoices to trick victims into clicking. A unique feature is its Telegram-gated payload delivery, which requires interaction with a Telegram bot to receive the final payload. This technique effectively filters out automated sandboxes and security researchers, ensuring the malware is only delivered to genuine targets. The campaign's ultimate goal is to install GoTo Resolve, a legitimate remote access tool, which is then abused by attackers for persistent access and control.",
          "categories": [
            "Phishing",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "Evasion",
            "GoTo Resolve",
            "Living off the Land",
            "Phishing",
            "RAT",
            "Telegram",
            "Vercel"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z"
        },
        {
          "slug": "apple-enhances-location-privacy-in-ios-26-3-update",
          "headline": "Apple Boosts Privacy in iOS 26.3 with 'Limit Precise Location' Feature",
          "summary": "Apple has introduced a new privacy feature called 'limit precise location' in its iOS 26.3 update. This setting is designed to give users more control over their data by reducing the precision of location information shared with cellular networks. While carriers still receive location data for operational purposes, the feature prevents them from obtaining a user's exact, fine-grained location, making it more difficult to track their precise movements. This update is part of a broader industry trend toward providing users with more granular privacy controls and addressing concerns about location tracking by mobile carriers.",
          "categories": [
            "Mobile Security",
            "Policy and Compliance"
          ],
          "tags": [
            "Apple",
            "Data Minimization",
            "Location Tracking",
            "Mobile Security",
            "Privacy",
            "iOS"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z"
        },
        {
          "slug": "cisa-publishes-guidance-to-aid-federal-agencies-in-pqc-migration",
          "headline": "CISA Releases Roadmap for Post-Quantum Cryptography (PQC) Migration",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has released initial guidance to help federal agencies and other organizations prepare for the transition to post-quantum cryptography (PQC). The document includes a list of hardware and software product categories that are expected to support the new quantum-resistant cryptographic standards. The guidance is a key part of the U.S. government's strategy to harden digital infrastructure against the future threat of quantum computers, which will be capable of breaking current public-key cryptography. The roadmap covers areas like cloud services, endpoint security, and networking hardware, aiming to streamline the complex migration process.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "CISA",
            "Compliance",
            "Cryptography",
            "NIST",
            "PQC",
            "Post-Quantum Cryptography",
            "Quantum Computing"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z"
        },
        {
          "slug": "security-vendors-launch-new-products-for-supply-chain-ai-and-malware-analysis",
          "headline": "Industry Responds to Threats with New Tools for Supply Chain, AI, and Malware Analysis",
          "summary": "In response to the evolving threat landscape, several cybersecurity firms have launched new products in January 2026. SpyCloud has released its Supply Chain Threat Protection solution to address identity threats within vendor ecosystems. Vectra AI has enhanced its platform to specifically counter attacks that leverage AI, focusing on the AI attack lifecycle. Additionally, Booz Allen Hamilton has made its Vellox Reverser tool generally available, aiming to accelerate malware reverse engineering and threat intelligence analysis for cyber defenders. These releases highlight key areas of focus for the industry: securing the supply chain, defending against AI-powered threats, and speeding up incident analysis.",
          "categories": [
            "Threat Intelligence",
            "Security Operations",
            "Supply Chain Attack"
          ],
          "tags": [
            "AI Security",
            "Cybersecurity Products",
            "Malware Analysis",
            "Reverse Engineering",
            "Supply Chain Security",
            "Threat Intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z"
        },
        {
          "slug": "surge-in-ddos-attacks-driven-by-kimwolf-aisuru-and-mirai-botnets",
          "headline": "DDoS Chaos: Kimwolf, Aisuru, and Mirai Botnets Fuel Surge in Automated Attacks",
          "summary": "Security researchers are observing a significant increase in highly automated Distributed Denial-of-Service (DDoS) attacks, powered by three major botnets: Kimwolf, Aisuru, and new variants of the notorious Mirai botnet. These campaigns leverage adaptive attack patterns and are fueled by the mass exploitation of insecure Internet of Things (IoT) devices. Attackers are particularly targeting consumer-grade gadgets, including unauthorized Android TV streaming boxes, which often have weak default credentials and outdated firmware. The global supply chain for these low-cost devices is creating a vast and easily exploitable pool of resources for botnet operators, posing a continuous threat to online service availability.",
          "categories": [
            "Cyberattack",
            "IoT Security",
            "Malware"
          ],
          "tags": [
            "Aisuru",
            "Android TV",
            "Botnet",
            "DDoS",
            "IoT Security",
            "Kimwolf",
            "Mirai"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z",
          "malware": [
            "Aisuru",
            "Kimwolf",
            "Mirai"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-office-zero-day-cve-2026-21509",
          "headline": "Microsoft Patches Actively Exploited Office Zero-Day Flaw Added to CISA's KEV List",
          "summary": "Microsoft has released an out-of-band security update for an 'Important' security feature bypass vulnerability, CVE-2026-21509, in Microsoft Office. The flaw, which has a CVSS score of 7.8, is being actively exploited in the wild and allows an attacker to bypass Object Linking and Embedding (OLE) mitigations by tricking a user into opening a malicious file. This could expose users to vulnerable COM/OLE controls. In response to the active exploitation, CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating patching for federal agencies. The vulnerability affects a wide range of products, including Microsoft 365 Apps and perpetual versions like Office 2019 and LTSC 2021.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "KEV",
            "Microsoft Office",
            "OLE",
            "Security Feature Bypass",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z",
          "cves": [
            "CVE-2026-21509"
          ]
        },
        {
          "slug": "new-sicarii-ransomware-raas-operation-identified-in-the-wild",
          "headline": "New 'Sicarii Ransomware' RaaS Emerges, Targeting U.S. Manufacturing",
          "summary": "A new ransomware-as-a-service (RaaS) operation named 'Sicarii Ransomware' has been discovered by researchers at CYFIRMA. Active since late 2025, the group is targeting the manufacturing sector in the United States. The malware encrypts victim files using AES-GCM and appends a '.sicarii' extension to them. In addition to encryption, the malware is capable of collecting system information and credentials from infected hosts, suggesting a double-extortion tactic may be part of their playbook. Tactical recommendations to defend against this threat include enhanced monitoring, maintaining offline backups, and strengthening network segmentation.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "AES-GCM",
            "Double Extortion",
            "Manufacturing",
            "RaaS",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z",
          "malware": [
            "Sicarii Ransomware"
          ]
        },
        {
          "slug": "shinyhunters-linked-group-targets-100-plus-firms-in-okta-sso-phishing-campaign",
          "headline": "SLSH Alliance Hits 100+ Firms in Sophisticated Okta SSO Voice Phishing Blitz",
          "summary": "A highly organized, human-led phishing campaign is targeting the Okta Single Sign-On (SSO) credentials of over 100 high-profile enterprises across technology, finance, and healthcare. The attack, attributed to the SLSH cybercrime alliance (linked to Scattered Spider and ShinyHunters), uses interactive voice phishing (vishing) to manipulate victims into approving multi-factor authentication (MFA) prompts. The attackers employ a live phishing panel to intercept credentials and MFA tokens in real-time, enabling them to bypass security controls and gain unauthorized access to corporate networks. The widespread campaign has prepared infrastructure to target major companies like Atlassian, Moderna, Zillow, and Halliburton, posing a significant identity-based threat.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Credential Harvesting",
            "Identity Theft",
            "MFA Bypass",
            "SSO",
            "Social Engineering",
            "Vishing",
            "Voice Phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z"
        },
        {
          "slug": "report-450000-malicious-open-source-packages-targeted-developers-in-2025",
          "headline": "Software Supply Chain Under Siege: 450,000+ Malicious Packages Hit Open-Source in 2025",
          "summary": "A new report from Sonatype reveals a massive surge in software supply chain attacks, with over 450,000 new malicious open-source components discovered in 2025. The attacks show a strategic shift, with threat actors focusing their efforts on executing code directly within developer environments and CI/CD pipelines, rather than targeting end-users. The npm registry was the primary battleground for these automated, high-volume campaigns, which often involved publishing large batches of similarly named malicious packages. These packages would frequently reappear shortly after being removed, highlighting the persistent and automated nature of the threat to the software development lifecycle.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "CI/CD Security",
            "Dependency Confusion",
            "Developer Security",
            "NPM",
            "Open Source Security",
            "PyPI",
            "Typosquatting"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z"
        },
        {
          "slug": "ivanti-patches-two-critical-actively-exploited-rce-flaws-in-epmm",
          "headline": "CRITICAL: Ivanti Patches Two Actively Exploited RCE Zero-Days in EPMM",
          "summary": "Ivanti has released urgent security patches for two critical remote code execution (RCE) vulnerabilities, CVE-2026-1281 and CVE-2026-1340, affecting its Endpoint Manager Mobile (EPMM) solution, formerly MobileIron Core. Both flaws are rated 9.8 out of 10 on the CVSS scale and are confirmed to be actively exploited in the wild as zero-days. An unauthenticated attacker can exploit these vulnerabilities to execute arbitrary code on an affected appliance, granting them access to sensitive mobile device management data. Given the active exploitation, administrators are urged to apply the temporary RPM script patches immediately while awaiting a permanent fix in the upcoming version 12.8.0.0.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "Active Exploit",
            "KEV",
            "MDM",
            "MobileIron",
            "RCE",
            "Remote Code Execution",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z",
          "cves": [
            "CVE-2026-1281",
            "CVE-2026-1340"
          ]
        },
        {
          "slug": "sandworm-deploys-dynowiper-malware-in-attack-on-polish-energy-sector",
          "headline": "Sandworm Unleashes New 'DynoWiper' Malware in Destructive Attack on Polish Energy Sector",
          "summary": "The Russia-aligned threat actor Sandworm is believed to be behind a destructive cyberattack that targeted an energy company in Poland in late 2025. Researchers from ESET analyzed the new data-wiping malware, dubbed 'DynoWiper,' and attributed the attack to Sandworm with medium confidence. The TTPs observed in the incident closely mirror those from a previous attack using the ZOV wiper against targets in Ukraine. The attack was reportedly thwarted by an EDR/XDR solution that blocked the wiper's execution, limiting the damage. This event marks a significant escalation, representing a rare deployment of destructive malware by a Russia-aligned group against Poland's critical energy infrastructure.",
          "categories": [
            "Malware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Critical Infrastructure",
            "Data Destruction",
            "Energy Sector",
            "Geopolitics",
            "Ukraine",
            "Wiper Malware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-30T15:00:00.000Z",
          "malware": [
            "DynoWiper",
            "Prestige ransomware",
            "ZOV wiper"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-29",
      "type": "publication-daily",
      "headline": "Actively Exploited Zero-Days in Microsoft Office & Fortinet; Major Brands Hit by Cyberattacks",
      "articleCount": 12,
      "articles": [
        {
          "slug": "check-point-2026-cyber-security-report-ai-drives-attack-surge",
          "headline": "AI-Fueled Cyberattacks Surge by 70%, Check Point's 2026 Report Reveals",
          "summary": "Check Point's 14th annual Cyber Security Report highlights a dramatic escalation in the global threat landscape, revealing a 70% increase in cyberattacks since 2023. The 2026 report, analyzing trends from 2025, found that organizations faced an average of 1,968 attacks per week. A primary driver of this surge is the weaponization of Artificial Intelligence (AI), which attackers are using to enhance social engineering, accelerate malware development, and automate reconnaissance. The report also notes a shift in ransomware tactics towards data-only extortion and an increase in attacks targeting network edge devices like VPNs and IoT.",
          "categories": [
            "Threat Intelligence",
            "Ransomware",
            "Policy and Compliance"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "cybersecurity report",
            "edge security",
            "ransomware",
            "threat landscape"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "canadian-cyber-centre-warns-of-ai-fueled-ransomware-threat",
          "headline": "Canada's Cyber Security Centre Warns of AI-Fueled Ransomware Evolution",
          "summary": "The Canadian Centre for Cyber Security has issued a new 'Ransomware Threat Outlook,' warning that the ransomware threat to Canadian organizations is growing and evolving rapidly. The report highlights that criminals are increasingly leveraging artificial intelligence (AI) to make their attacks more sophisticated, easier to execute, and harder to detect. A key trend identified is the shift towards 'multi-extortion' tactics, where attackers steal data and threaten to leak it in addition to encrypting it. The report stresses that despite the advanced tactics, strong cyber hygiene remains a primary defense.",
          "categories": [
            "Threat Intelligence",
            "Ransomware",
            "Regulatory"
          ],
          "tags": [
            "AI",
            "CCCS",
            "Canada",
            "multi-extortion",
            "ransomware",
            "threat outlook"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "netwrix-report-identity-and-data-security-convergence-threats",
          "headline": "Convergence of Identity and Data Security Creates New Attack Vectors, Netwrix Warns",
          "summary": "A new report from Netwrix warns that the next wave of cyber threats will arise from the convergence of identity and data security. As organizations increasingly rely on automated workflows to manage data access, attackers are shifting their focus from stealing individual credentials to exploiting misconfigured identity orchestration and automation. The report predicts that failures in identity automation will directly lead to data exposure. With the rise of agentic AI, which can autonomously perform actions, securing the identity of these non-human agents becomes paramount. Netwrix concludes that unified visibility across both identity management and data security is now essential to mitigate these emerging risks.",
          "categories": [
            "Threat Intelligence",
            "Policy and Compliance",
            "Cloud Security"
          ],
          "tags": [
            "AI",
            "IAM",
            "Netwrix",
            "automation",
            "data security",
            "identity security"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "sonatype-2026-report-open-source-malware-surges-75-percent",
          "headline": "Open-Source Malware Skyrockets by 75%, Sonatype's 2026 Report Warns",
          "summary": "Sonatype's 2026 'State of the Software Supply Chain' report reveals an alarming 75% increase in malicious open-source packages, with over 1.233 million identified. The report connects this surge to the rapid adoption of AI and automation in software development, which has accelerated open-source consumption to 9.8 trillion downloads across major registries. This increased velocity expands the attack surface, making it easier for attackers to inject malware into the software supply chain. The report also notes that 86% of traffic from Maven Central, a key Java repository, now comes from automated cloud services, amplifying the risk of widespread compromise from a single malicious package.",
          "categories": [
            "Supply Chain Attack",
            "Threat Intelligence",
            "Malware"
          ],
          "tags": [
            "AI",
            "DevSecOps",
            "Sonatype",
            "malware",
            "open source",
            "supply chain security"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "clop-ransomware-claims-attack-on-canadian-company-cmhheli",
          "headline": "Clop Ransomware Group Claims Attack on Canadian Helicopter Company",
          "summary": "The notorious Clop ransomware group has claimed responsibility for a cyberattack against CMHHELI.COM, a Canadian company. On January 29, 2026, the group added the company to its dark web leak site, threatening to publish stolen data if a ransom is not paid. This incident highlights the persistent and indiscriminate nature of major ransomware gangs, who continue to target organizations of all sizes. Security experts advise victims to initiate incident response, validate backups, and engage professionals before considering any communication with the attackers.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Clop",
            "TA505",
            "data leak",
            "double extortion",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "malicious-python-spellchecker-packages-on-pypi-deliver-rat",
          "headline": "Fake Python Spellchecker Packages on PyPI Deploy Remote Access Trojan",
          "summary": "Two malicious packages, `spellcheckerpy` and `spellcheckpy`, were discovered and removed from the Python Package Index (PyPI). Masquerading as legitimate spell-checking utilities, these packages were downloaded over 1,000 times and were designed to install a full-featured remote access trojan (RAT) on developers' systems. The attacker used a novel technique, hiding a Base64-encoded payload within a Basque language dictionary file (`eu.json.gz`) and activating it only in a later version of the package. This supply chain attack highlights the growing threat of malware in open-source repositories.",
          "categories": [
            "Malware",
            "Supply Chain Attack",
            "Threat Intelligence"
          ],
          "tags": [
            "PyPI",
            "Python",
            "RAT",
            "dependency confusion",
            "open-source security",
            "typosquatting"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z",
          "malware": [
            "Remote Access Trojan (RAT)"
          ]
        },
        {
          "slug": "illinois-dhs-data-breach-exposes-700k-records",
          "headline": "Illinois Department of Human Services Breach Exposes Data of 700,000",
          "summary": "The Illinois Department of Human Services (IDHS) has disclosed a massive data breach that exposed the sensitive records of approximately 700,000 state residents. The incident, one of the largest public-sector breaches of 2026, impacted recipients of various state aid programs. Exposed data for over 672,000 Medicaid and Medicare Savings Program recipients includes addresses, case numbers, and medical plan names. A separate set of 32,000 records belonging to customers of the Division of Rehabilitation Services was also compromised, exposing names, addresses, and case details. The investigation is ongoing to determine the cause and full scope of the breach.",
          "categories": [
            "Data Breach",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "Medicaid",
            "PHI",
            "PII",
            "data breach",
            "government",
            "healthcare"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "shinyhunters-claims-attacks-on-bumble-panera-match-crunchbase",
          "headline": "ShinyHunters Claims Cyberattacks on Bumble, Panera, Match, and Crunchbase",
          "summary": "Several high-profile US companies, including Bumble, Panera Bread, Match Group, and Crunchbase, have been targeted in a series of cyberattacks. A group calling itself 'ShinyHunters' has claimed responsibility, with evidence pointing towards a coordinated social engineering campaign. The impact varies across the companies: Bumble reported a contractor's account was phished, leading to brief network access but no user data compromise. Match Group confirmed a limited amount of user data was affected, while Panera and Crunchbase also reported incidents involving contact information and corporate documents, respectively. The attacks highlight a trend towards leveraging compromised contact data for further malicious activities.",
          "categories": [
            "Cyberattack",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "contractor compromise",
            "phishing",
            "social engineering",
            "third-party risk"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "soundcloud-data-breach-exposes-29-million-users",
          "headline": "SoundCloud Breach Exposes Private Emails of 29.8 Million Users",
          "summary": "A significant data breach at the music streaming service SoundCloud has resulted in the public release of a database containing the personal details of 29.8 million users. The data was leaked in January 2026 after the company reportedly refused to pay a ransom demand. The primary risk from this breach stems from the linking of users' private email addresses with their public profile metadata. This combination provides a rich source of data for attackers to launch targeted phishing, credential stuffing, and social engineering campaigns. The breach has been indexed by the notification service HaveIBeenPwned.",
          "categories": [
            "Data Breach",
            "Threat Intelligence"
          ],
          "tags": [
            "PII",
            "SoundCloud",
            "credential stuffing",
            "data breach",
            "email leak",
            "phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "critical-rce-flaw-cve-2025-12556-in-idis-cloud-manager-viewer",
          "headline": "Critical 1-Click RCE Flaw in IDIS Cloud Manager Puts Users at Risk",
          "summary": "A critical remote code execution (RCE) vulnerability, CVE-2025-12556, has been discovered in the IDIS Cloud Manager (ICM) viewer by researchers at Claroty's Team82. The flaw, which has a CVSS v4 score of 8.7, allows an attacker to execute arbitrary code on a user's machine by convincing them to click a specially crafted link. This '1-click RCE' vulnerability bypasses the browser sandbox, making it a potent weapon for spear-phishing campaigns. IDIS has released version 1.7.1 to address the issue and urges users to upgrade or uninstall the software immediately.",
          "categories": [
            "Vulnerability",
            "Phishing",
            "Industrial Control Systems"
          ],
          "tags": [
            "1-click exploit",
            "RCE",
            "URL handler",
            "argument injection",
            "spear-phishing"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z",
          "cves": [
            "CVE-2025-12556"
          ]
        },
        {
          "slug": "fortinet-forticloud-sso-flaw-cve-2026-24858-actively-exploited",
          "headline": "Critical FortiCloud SSO Flaw Under Active Attack, CISA Issues Urgent Warning",
          "summary": "A critical authentication bypass vulnerability, CVE-2026-24858, in Fortinet's FortiCloud single sign-on (SSO) service is under active exploitation. The flaw allows an attacker with a registered FortiCloud account to gain unauthorized access to devices belonging to other accounts. Fortinet has observed malicious activity, including unauthorized configuration changes and account creation on FortiGate devices. CISA has added the vulnerability to its KEV catalog, urging immediate action. Fortinet temporarily disabled the SSO service to implement mitigations and is working on permanent patches for affected products like FortiOS, FortiManager, and FortiWeb.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Cloud Security"
          ],
          "tags": [
            "KEV",
            "SSO",
            "authentication bypass",
            "cloud security",
            "firewall"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z",
          "cves": [
            "CVE-2025-59718",
            "CVE-2025-59719",
            "CVE-2026-24858"
          ]
        },
        {
          "slug": "microsoft-office-zero-day-cve-2026-21509-actively-exploited",
          "headline": "Microsoft Office Zero-Day Under Active Attack Bypasses Security Features",
          "summary": "Microsoft has issued an emergency out-of-band patch for a high-severity zero-day vulnerability in Microsoft Office, CVE-2026-21509. The flaw, a security feature bypass with a CVSS score of 7.8, is being actively exploited in the wild through malicious documents. It allows attackers to circumvent Object Linking and Embedding (OLE) protections, leading to code execution if a user opens a specially crafted file. The vulnerability affects a wide range of Office products, including Office 2016 through LTSC 2024 and Microsoft 365 Apps. CISA has added the flaw to its Known Exploited Vulnerabilities (KEV) catalog, mandating urgent patching for federal agencies and signaling a significant risk to all organizations.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "KEV",
            "OLE",
            "out-of-band patch",
            "security feature bypass",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z",
          "cves": [
            "CVE-2026-21509"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "shinyhunters-claims-breaches-of-crunchbase-betterment-via-okta-vishing",
        "originalHeadline": "ShinyHunters Claims Breach of Crunchbase, Betterment via Okta Vishing Attacks",
        "updateTitle": "Update: ShinyHunters Claims Breach of Crunchbase, Betterment via Okta Vishing Attacks",
        "updateSummary": "ShinyHunters campaign expands, now impacting Bumble, Panera Bread, and Match Group. Crunchbase confirms corporate document compromise, adding to the scope of social engineering attacks.",
        "categories": [
          "Phishing",
          "Data Breach",
          "Threat Actor"
        ],
        "tags": [
          "Betterment",
          "Crunchbase",
          "MFA bypass",
          "Okta",
          "ShinyHunters",
          "social engineering",
          "vishing"
        ],
        "severity": "high",
        "publishedAt": "2026-01-25T15:00:00.000Z",
        "updatedAt": "2026-01-29T12:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}