{
  "lastUpdated": "2025-11-26T14:43:04.105Z",
  "runDate": "2025-11-26",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-26",
      "type": "publication-daily",
      "headline": "CodeRED Emergency Alerts Downed by Ransomware; Major Banks Hit in Supply Chain Breach; Russia & North Korea APTs Collaborate",
      "articleCount": 10,
      "articles": [
        {
          "slug": "us-cyber-policy-shifts-amid-cisa-budget-cuts-and-staffing-concerns",
          "headline": "US Cyber Strategy Shifts to APTs as CISA Faces 17% Budget Cut, Staffing Crisis",
          "summary": "The U.S. federal cybersecurity strategy is undergoing a major recalibration, shifting its focus toward high-end threats from state actors and APTs. However, this strategic pivot is overshadowed by a draft 2026 budget that proposes a severe 17% cut for CISA, amounting to nearly $495 million and the elimination of over 1,000 positions. This reduction threatens to weaken state and local cyber capacity and vital programs like MS-ISAC. The news comes as CISA already struggles with a reported 40% vacancy rate in key mission areas, raising concerns about the nation's ability to defend against both sophisticated intrusions and common cyber threats like ransomware.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Security Operations"
          ],
          "tags": [
            "Budget",
            "CISA",
            "CISA 2015",
            "Cybersecurity Policy",
            "MS-ISAC",
            "National Security",
            "US Government"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-26T15:00:00.000Z"
        },
        {
          "slug": "cisa-warns-of-spyware-targeting-signal-and-whatsapp-users",
          "headline": "CISA Warns: Spyware Actively Hijacking Signal and WhatsApp Accounts of High-Value Targets",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued an alert about active campaigns targeting high-value individuals through the Signal and WhatsApp messaging apps. Threat actors, including state-aligned groups, are using commercial spyware and Remote Access Trojans (RATs) to gain full access to victims' devices and communications. Attack vectors include sophisticated phishing, malicious QR codes for device linking, spoofed application downloads, and even zero-click exploits. The targets primarily consist of government officials, military personnel, and civil society organizations in the U.S., Europe, and the Middle East, prompting CISA to urge heightened mobile security awareness.",
          "categories": [
            "Malware",
            "Threat Intelligence",
            "Mobile Security"
          ],
          "tags": [
            "CISA",
            "Mobile Security",
            "RAT",
            "Signal",
            "Spyware",
            "Threat Intelligence",
            "WhatsApp",
            "Zero-Click Exploit"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-26T15:00:00.000Z",
          "malware": [
            "LANDFALL"
          ]
        },
        {
          "slug": "us-emergency-alert-system-codered-crippled-by-inc-ransom-attack",
          "headline": "CodeRED Emergency Alert System Crippled by 'Inc Ransom' Attack, Disrupting US Public Safety",
          "summary": "The OnSolve CodeRED emergency alert system, a critical communication tool for hundreds of U.S. municipalities, has been taken offline following a ransomware attack claimed by the 'Inc Ransom' group. The attack, which began on November 1, 2025, resulted in the encryption of systems and the exfiltration of user data, including names, addresses, and contact information. After failed ransom negotiations, the vendor was forced to decommission the legacy platform, causing significant service disruptions for local governments in numerous states and leaving them unable to issue vital public safety notifications.",
          "categories": [
            "Ransomware",
            "Cyberattack",
            "Data Breach"
          ],
          "tags": [
            "CodeRED",
            "Data Breach",
            "Double Extortion",
            "Emergency Alert System",
            "Inc Ransom",
            "OnSolve",
            "Public Safety",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-26T15:00:00.000Z"
        },
        {
          "slug": "unprecedented-collaboration-found-between-russian-gamaredon-and-north-korean-lazarus-apts",
          "headline": "Geopolitical Shift: Russian and North Korean State Hackers Found Sharing Attack Infrastructure",
          "summary": "In a rare and alarming discovery, security researchers have found evidence of operational collaboration between two of the world's most prolific state-sponsored hacking groups: Russia's Gamaredon (Pitty Tiger) and North Korea's Lazarus. The evidence centers on a shared command-and-control (C2) server IP address that was used by both groups within days of each other to deliver their respective malware payloads. This convergence of TTPs and infrastructure signals a potential new phase of cyber operations where geopolitical alliances between Moscow and Pyongyang are extending into direct, cooperative attacks, potentially amplifying the threat level for defenders globally.",
          "categories": [
            "Threat Actor",
            "Threat Intelligence",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "C2",
            "Gamaredon",
            "Lazarus",
            "North Korea",
            "Russia",
            "Threat Actor",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-26T15:00:00.000Z",
          "malware": [
            "InvisibleFerret"
          ]
        },
        {
          "slug": "situsamc-supply-chain-breach-exposes-major-us-banks",
          "headline": "Major Wall Street Banks Exposed in SitusAMC Supply Chain Data Breach",
          "summary": "SitusAMC, a key technology vendor for the real-estate finance industry, has suffered a significant data breach, exposing sensitive data belonging to some of America's largest banks. The attack, which occurred on November 12, 2025, compromised corporate data such as accounting records and legal agreements. Breach notifications have reportedly been sent to major financial institutions including JPMorgan Chase, Citi, and Morgan Stanley. The incident was a data theft attack, with no ransomware deployed, highlighting the severe supply-chain risks facing the financial sector. An investigation is underway to determine the full extent of the breach, which may also include customer data from the affected banks.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Cloud Security"
          ],
          "tags": [
            "Banking",
            "Citi",
            "Data Breach",
            "Finance",
            "JPMorgan Chase",
            "Morgan Stanley",
            "SitusAMC",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-26T15:00:00.000Z"
        },
        {
          "slug": "nvidia-and-wordpress-plugins-hit-with-ssrf-and-xss-vulnerabilities",
          "headline": "NVIDIA AI Toolkit and WordPress Plugins Hit with High-Severity Flaws",
          "summary": "On November 25, 2025, several new software vulnerabilities were disclosed, including a high-severity Server-Side Request Forgery (SSRF) flaw in NVIDIA's NeMo Agent Toolkit (CVE-2025-33203) used for AI development. This flaw could lead to information disclosure and denial of service. Concurrently, vulnerabilities were found in popular WordPress plugins. The 'Just Highlight' plugin is affected by a stored Cross-Site Scripting (XSS) bug (CVE-2025-13311), while the 'Locker Content' plugin has a sensitive information exposure flaw (CVE-2025-12525) that could allow unauthenticated attackers to bypass content restrictions.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cloud Security"
          ],
          "tags": [
            "CVE-2025-12525",
            "CVE-2025-13311",
            "CVE-2025-33203",
            "NVIDIA",
            "SSRF",
            "Vulnerability",
            "WordPress",
            "XSS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-26T15:00:00.000Z",
          "cves": [
            "CVE-2025-12525",
            "CVE-2025-13311",
            "CVE-2025-33203"
          ]
        },
        {
          "slug": "shinysp1d3r-raas-emerges-from-shinyhunters-and-scattered-spider-alliance",
          "headline": "New 'ShinySp1d3r' RaaS Emerges from Alliance of ShinyHunters and Scattered Spider",
          "summary": "A new Ransomware-as-a-Service (RaaS) operation named 'ShinySp1d3r' is being developed by 'SLSH,' a new cybercrime collective formed by members of the infamous ShinyHunters, Scattered Spider, and Lapsus$ groups. An early Windows build of the ransomware has been analyzed, revealing capabilities like ChaCha20 encryption, service termination, and shadow copy deletion. The group also plans to create Linux and ESXi versions, signaling an intent to target high-value enterprise environments. This development marks a significant shift, as these historically distinct extortion groups are now pooling their resources to create their own ransomware weapon.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "ESXi",
            "Lapsus$",
            "RaaS",
            "Ransomware",
            "SLSH",
            "Scattered Spider",
            "ShinyHunters",
            "ShinySp1d3r"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-26T15:00:00.000Z",
          "malware": [
            "ShinySp1d3r"
          ]
        },
        {
          "slug": "water-gamayun-apt-exploits-windows-msc-eviltwin-vulnerability",
          "headline": "Water Gamayun APT Exploits Novel 'MSC EvilTwin' Windows Flaw in Stealthy Attacks",
          "summary": "The Russia-aligned APT group Water Gamayun is actively exploiting a novel vulnerability in the Windows Microsoft Management Console (MMC), tracked as CVE-2025-26633. The attack, analyzed by Zscaler and dubbed 'MSC EvilTwin,' uses a malicious .msc file to proxy code execution through the trusted mmc.exe binary, making it difficult to detect. The multi-stage campaign begins with a malicious download and uses embedded commands to execute hidden PowerShell payloads. This technique allows the attackers to install backdoors and information stealers while evading traditional security measures, showcasing the group's continued sophistication in developing stealthy intrusion methods.",
          "categories": [
            "Threat Actor",
            "Vulnerability",
            "Malware"
          ],
          "tags": [
            "APT",
            "CVE-2025-26633",
            "Defense Evasion",
            "MSC EvilTwin",
            "Microsoft Management Console",
            "PowerShell",
            "Water Gamayun",
            "Zscaler"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-26T15:00:00.000Z",
          "cves": [
            "CVE-2025-26633"
          ],
          "malware": [
            "DarkWisp",
            "EncryptHub",
            "Rhadamanthys",
            "SilentPrism"
          ]
        },
        {
          "slug": "cisa-issues-seven-advisories-for-critical-ics-vulnerabilities",
          "headline": "CISA Warns of Critical Flaws in Industrial Control Systems, Including CVSS 10.0 Bug",
          "summary": "On November 25, 2025, CISA issued seven new advisories for vulnerabilities in Industrial Control Systems (ICS) from multiple vendors, including Rockwell Automation, Opto 22, and Zenitel. The flaws affect equipment used globally in critical manufacturing and communications sectors. The most severe vulnerability, CVE-2025-64130, is a critical OS command injection flaw in Zenitel communications equipment with a CVSS score of 10.0, which could allow for remote code execution. Other advisories cover flaws leading to denial-of-service and information exposure, prompting CISA to urge immediate review and mitigation by asset owners.",
          "categories": [
            "Industrial Control Systems",
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "CVE-2025-64130",
            "Critical Infrastructure",
            "ICS",
            "OT",
            "Rockwell Automation",
            "Vulnerability",
            "Zenitel"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-26T15:00:00.000Z",
          "cves": [
            "CVE-2025-64130"
          ]
        },
        {
          "slug": "shai-hulud-2-npm-attack-intensifies-with-destructive-capabilities",
          "headline": "Shai-Hulud 2.0: Destructive NPM Worm Compromises 25K+ GitHub Repos, Wipes Dev Systems",
          "summary": "A second, more aggressive wave of the 'Shai-Hulud' supply chain attack is devastating the npm ecosystem. Dubbed 'Shai-Hulud 2.0,' this variant has already compromised hundreds of npm packages, including those from major organizations like Zapier and Postman, and led to the creation of over 25,000 malicious GitHub repositories containing stolen developer secrets. The new version executes during the 'preinstall' phase, bypassing some scanners, and introduces a dangerous destructive capability: if it fails to exfiltrate stolen credentials, it attempts to wipe the user's entire home directory, escalating the threat from espionage to outright sabotage.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "Credential Theft",
            "Data Destruction",
            "GitHub",
            "Open Source Security",
            "Shai-Hulud",
            "Supply Chain Attack",
            "Worm",
            "npm"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-26T15:00:00.000Z",
          "malware": [
            "Shai-Hulud 2.0"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-25",
      "type": "publication-daily",
      "headline": "Massive 'Sha1-Hulud' Supply Chain Attack Compromises 25,000+ GitHub Repos; CISA Warns of Multiple Actively Exploited Zero-Days",
      "articleCount": 10,
      "articles": [
        {
          "slug": "uk-introduces-cyber-security-and-resilience-bill-to-regulate-critical-suppliers",
          "headline": "UK Bill to Regulate Critical Infrastructure Supply Chain for First Time",
          "summary": "The United Kingdom has introduced the Cyber Security and Resilience Bill, a new law that will, for the first time, regulate the cybersecurity practices of suppliers to the nation's critical infrastructure. The bill aims to prevent supply chain attacks by legally requiring companies deemed 'critical suppliers'—such as IT management firms and data centers serving entities like the NHS and energy companies—to meet minimum security standards. These suppliers will also be mandated to report significant breaches to the government and the National Cyber Security Centre (NCSC) and demonstrate robust incident response capabilities.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "NCSC",
            "UK",
            "compliance",
            "critical infrastructure",
            "policy",
            "regulation",
            "supply chain"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "akira-ransomware-exploits-unpatched-sonicwall-devices-during-ma",
          "headline": "Akira Ransomware Targets M&A Blind Spots, Breaching Firms via Inherited SonicWall Devices",
          "summary": "The Akira ransomware group is exploiting security blind spots created during corporate mergers and acquisitions (M&A). According to research by ReliaQuest, Akira affiliates are gaining initial access to acquiring companies by compromising vulnerable SonicWall SSL VPN appliances inherited from smaller, acquired firms. Attackers leverage the fact that the acquiring organizations are often unaware of these unpatched, legacy devices on their new network. Once inside, they use zombie credentials and move laterally, with the time from lateral movement to ransomware deployment averaging less than one hour, highlighting a rapid and effective attack chain.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Akira",
            "M&A",
            "ReliaQuest",
            "SonicWall",
            "ransomware",
            "supply chain",
            "vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "black-friday-phishing-attacks-skyrocket-620-percent-amazon-impersonated",
          "headline": "Black Friday Phishing Attacks Surge Over 600%; Amazon is Top Impersonated Brand",
          "summary": "As the Black Friday shopping season approaches, a new analysis from Darktrace reveals a massive 620% increase in phishing attacks since the beginning of November 2025. Attacks impersonating major retailers like Walmart and Macy's have jumped 54% in the last week alone. Amazon is the most abused brand, featuring in 80% of all major brand impersonation phishing attempts. Researchers warn that attack volumes are expected to climb another 20-30% during the peak shopping week, with cybercriminals using fake 'deal' websites and social engineering to lure victims into giving up personal data and payment information.",
          "categories": [
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "Amazon",
            "Black Friday",
            "Darktrace",
            "brand impersonation",
            "phishing",
            "social engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "cisa-warns-commercial-spyware-targets-signal-whatsapp-users",
          "headline": "CISA: Commercial Spyware Hijacking Signal & WhatsApp via Zero-Clicks",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued a critical alert regarding active campaigns using commercial spyware to compromise the Signal and WhatsApp accounts of high-value targets. Attackers are employing sophisticated methods including social engineering, malicious QR codes for device linking, and zero-click exploits that require no user interaction. The campaigns are reportedly targeting current and former government officials, military personnel, and civil society organizations across the U.S., Europe, and the Middle East. CISA warns that initial access to messaging apps is often used as a beachhead to deploy further malware and achieve full device compromise.",
          "categories": [
            "Malware",
            "Mobile Security",
            "Threat Intelligence"
          ],
          "tags": [
            "CISA",
            "Signal",
            "WhatsApp",
            "mobile security",
            "phishing",
            "social engineering",
            "spyware",
            "zero-click"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "remote-disabling-flaw-in-chinese-electric-buses-sparks-european-security-probes",
          "headline": "Flaw in Chinese Electric Buses Allowing Remote Disabling Sparks European Security Probes",
          "summary": "A software vulnerability discovered in Chinese-made electric buses operating in Oslo, Norway, has raised significant security alarms across Europe. The flaw could reportedly allow the vehicles to be remotely disabled, prompting authorities in the UK and Denmark to launch their own investigations into similar bus fleets. This incident has intensified concerns about potential backdoors and kill switches in Chinese technology embedded in critical public infrastructure. The finding comes amid heightened warnings from security agencies about pre-positioned threats in Western networks, such as the 'Volt Typhoon' campaign.",
          "categories": [
            "Industrial Control Systems",
            "Vulnerability",
            "Threat Intelligence"
          ],
          "tags": [
            "China",
            "ICS",
            "SCADA",
            "Volt Typhoon",
            "backdoor",
            "critical infrastructure",
            "transportation",
            "vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "banking-vendor-situsamc-hit-by-supply-chain-attack-client-data-stolen",
          "headline": "Supply Chain Breach at Banking Vendor SitusAMC Exposes Client Financial Data",
          "summary": "SitusAMC, a major third-party technology and services provider for the banking and real estate finance industry, has disclosed a cyberattack that occurred on November 12, 2025. The attackers breached SitusAMC's systems and exfiltrated sensitive data belonging to its banking clients, including accounting records and legal agreements. Personal data of the banks' customers was also compromised. The incident, which did not involve ransomware, is being investigated with the assistance of the FBI. It serves as a stark reminder of the significant supply chain risks within the heavily regulated financial services sector.",
          "categories": [
            "Supply Chain Attack",
            "Data Breach",
            "Regulatory"
          ],
          "tags": [
            "FBI",
            "SitusAMC",
            "banking",
            "data breach",
            "financial services",
            "supply chain attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "fortinet-warns-of-actively-exploited-fortiweb-zero-day-cve-2025-58034",
          "headline": "Fortinet Warns of Actively Exploited Zero-Day in FortiWeb WAF Appliances",
          "summary": "Fortinet has revealed that a command injection vulnerability in its FortiWeb web application firewall (WAF), CVE-2025-58034, was exploited as a zero-day before a patch was available. The flaw, rated medium severity (CVSS 6.7), allows an authenticated attacker to execute arbitrary code. However, its risk is significantly elevated as it can be chained with another recently disclosed path-traversal zero-day (CVE-2025-64446). This combination allows a remote, unauthenticated attacker to bypass authentication, create an admin account, and achieve full remote code execution. Patches are available and should be applied immediately.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-58034",
            "CVE-2025-64446",
            "FortiWeb",
            "Fortinet",
            "RCE",
            "WAF",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z",
          "cves": [
            "CVE-2025-58034",
            "CVE-2025-64446"
          ]
        },
        {
          "slug": "google-patches-actively-exploited-chrome-v8-zero-day-cve-2025-13223",
          "headline": "Google Patches Actively Exploited Chrome Zero-Day in V8 Engine",
          "summary": "Google has released an emergency security update for its Chrome web browser to fix a high-severity zero-day vulnerability, CVE-2025-13223, that is being actively exploited. The flaw is a type confusion vulnerability in the V8 JavaScript engine, which could allow a remote attacker to achieve arbitrary code execution by tricking a user into visiting a malicious website. The patch has been released for Chrome version 142.0.7444.175 on Windows, macOS, and Linux. Users of other Chromium-based browsers like Microsoft Edge and Brave are also urged to update immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-13223",
            "Google Chrome",
            "RCE",
            "V8",
            "patch management",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z",
          "cves": [
            "CVE-2025-13223"
          ]
        },
        {
          "slug": "cisa-orders-patch-for-critical-oracle-identity-manager-rce-flaw-cve-2025-61757",
          "headline": "Patch Now: Critical 9.8 RCE Flaw in Oracle Identity Manager Under Active Attack",
          "summary": "A critical remote code execution (RCE) vulnerability, CVE-2025-61757, in Oracle Identity Manager is being actively exploited by threat actors. The flaw, which has a CVSS score of 9.8, allows an unauthenticated, remote attacker to gain complete control over vulnerable systems via a specially crafted HTTP request. The vulnerability stems from a missing authentication check in the product's REST WebServices component. Due to evidence of in-the-wild exploitation, CISA has added the bug to its Known Exploited Vulnerabilities (KEV) catalog and mandated that all U.S. federal agencies apply the patch by December 12, 2025.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA",
            "CVE-2025-61757",
            "KEV",
            "Oracle",
            "Oracle Identity Manager",
            "RCE",
            "patch management",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z",
          "cves": [
            "CVE-2025-61757"
          ]
        },
        {
          "slug": "sha1-hulud-supply-chain-attack-compromises-25000-github-repos-via-npm",
          "headline": "Sha1-Hulud: Destructive Supply Chain Attack Hits 25,000+ Repos via npm",
          "summary": "A sophisticated and self-propagating software supply chain attack, dubbed 'Sha1-Hulud,' has compromised over 25,000 GitHub repositories since November 21, 2025. The attack leverages hundreds of malicious npm packages that execute code during the `preinstall` phase to steal developer credentials, GitHub tokens, and cloud secrets. The malware exfiltrates stolen data to public GitHub repositories and includes a destructive 'scorched earth' component that wipes the victim's home directory if data theft fails, turning it into a denial-of-service attack. The campaign has impacted packages from major organizations like Zapier, Postman, and ENS Domains, highlighting a severe threat to the open-source ecosystem.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "GitHub",
            "Sha1-Hulud",
            "credential theft",
            "data destruction",
            "malware",
            "npm",
            "supply chain attack"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z",
          "malware": [
            "Sha1-Hulud"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "us-homeland-security-warns-of-rising-cyber-threats-amid-shutdown",
        "originalHeadline": "Homeland Security Warns Gov't Shutdown and Lapsed Law Cripple U.S. Cyber Defenses",
        "updateTitle": "Update: Homeland Security Warns Gov't Shutdown and Lapsed Law Cripple U.S. Cyber Defenses",
        "updateSummary": "CISA faces proposed 17% budget cut and staffing crisis, while CISA 2015 gets short extension, intensifying U.S. cyber defense concerns.",
        "categories": [
          "Policy and Compliance",
          "Regulatory",
          "Threat Intelligence"
        ],
        "tags": [
          "CISA",
          "Homeland Security",
          "critical infrastructure",
          "government shutdown",
          "information sharing",
          "nation-state",
          "policy"
        ],
        "severity": "high",
        "publishedAt": "2025-11-04T15:00:00.000Z",
        "updatedAt": "2025-11-26T00:00:00.000Z"
      },
      {
        "slug": "cisa-mandates-7-day-patch-for-actively-exploited-fortinet-fortiweb-zero-day-cve-2025-58034",
        "originalHeadline": "URGENT: CISA Orders 7-Day Patch for Actively Exploited FortiWeb Zero-Day",
        "updateTitle": "Update: URGENT: CISA Orders 7-Day Patch for Actively Exploited FortiWeb Zero-Day",
        "updateSummary": "Fortinet confirms CVE-2025-58034 (medium severity) chains with CVE-2025-64446 (path traversal) for unauthenticated RCE. Patched versions released.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Cyberattack"
        ],
        "tags": [
          "CISA",
          "Command Injection",
          "FortiWeb",
          "Fortinet",
          "KEV",
          "WAF",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-58034",
          "CVE-2025-64446"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-20T15:00:00.000Z",
        "updatedAt": "2025-11-25T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}