{
  "lastUpdated": "2026-01-29T21:05:53.548Z",
  "runDate": "2026-01-29",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-29",
      "type": "publication-daily",
      "headline": "Actively Exploited Zero-Days in Microsoft Office & Fortinet; Major Brands Hit by Cyberattacks",
      "articleCount": 12,
      "articles": [
        {
          "slug": "check-point-2026-cyber-security-report-ai-drives-attack-surge",
          "headline": "AI-Fueled Cyberattacks Surge by 70%, Check Point's 2026 Report Reveals",
          "summary": "Check Point's 14th annual Cyber Security Report highlights a dramatic escalation in the global threat landscape, revealing a 70% increase in cyberattacks since 2023. The 2026 report, analyzing trends from 2025, found that organizations faced an average of 1,968 attacks per week. A primary driver of this surge is the weaponization of Artificial Intelligence (AI), which attackers are using to enhance social engineering, accelerate malware development, and automate reconnaissance. The report also notes a shift in ransomware tactics towards data-only extortion and an increase in attacks targeting network edge devices like VPNs and IoT.",
          "categories": [
            "Threat Intelligence",
            "Ransomware",
            "Policy and Compliance"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "cybersecurity report",
            "edge security",
            "ransomware",
            "threat landscape"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "canadian-cyber-centre-warns-of-ai-fueled-ransomware-threat",
          "headline": "Canada's Cyber Security Centre Warns of AI-Fueled Ransomware Evolution",
          "summary": "The Canadian Centre for Cyber Security has issued a new 'Ransomware Threat Outlook,' warning that the ransomware threat to Canadian organizations is growing and evolving rapidly. The report highlights that criminals are increasingly leveraging artificial intelligence (AI) to make their attacks more sophisticated, easier to execute, and harder to detect. A key trend identified is the shift towards 'multi-extortion' tactics, where attackers steal data and threaten to leak it in addition to encrypting it. The report stresses that despite the advanced tactics, strong cyber hygiene remains a primary defense.",
          "categories": [
            "Threat Intelligence",
            "Ransomware",
            "Regulatory"
          ],
          "tags": [
            "AI",
            "CCCS",
            "Canada",
            "multi-extortion",
            "ransomware",
            "threat outlook"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "netwrix-report-identity-and-data-security-convergence-threats",
          "headline": "Convergence of Identity and Data Security Creates New Attack Vectors, Netwrix Warns",
          "summary": "A new report from Netwrix warns that the next wave of cyber threats will arise from the convergence of identity and data security. As organizations increasingly rely on automated workflows to manage data access, attackers are shifting their focus from stealing individual credentials to exploiting misconfigured identity orchestration and automation. The report predicts that failures in identity automation will directly lead to data exposure. With the rise of agentic AI, which can autonomously perform actions, securing the identity of these non-human agents becomes paramount. Netwrix concludes that unified visibility across both identity management and data security is now essential to mitigate these emerging risks.",
          "categories": [
            "Threat Intelligence",
            "Policy and Compliance",
            "Cloud Security"
          ],
          "tags": [
            "AI",
            "IAM",
            "Netwrix",
            "automation",
            "data security",
            "identity security"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "sonatype-2026-report-open-source-malware-surges-75-percent",
          "headline": "Open-Source Malware Skyrockets by 75%, Sonatype's 2026 Report Warns",
          "summary": "Sonatype's 2026 'State of the Software Supply Chain' report reveals an alarming 75% increase in malicious open-source packages, with over 1.233 million identified. The report connects this surge to the rapid adoption of AI and automation in software development, which has accelerated open-source consumption to 9.8 trillion downloads across major registries. This increased velocity expands the attack surface, making it easier for attackers to inject malware into the software supply chain. The report also notes that 86% of traffic from Maven Central, a key Java repository, now comes from automated cloud services, amplifying the risk of widespread compromise from a single malicious package.",
          "categories": [
            "Supply Chain Attack",
            "Threat Intelligence",
            "Malware"
          ],
          "tags": [
            "AI",
            "DevSecOps",
            "Sonatype",
            "malware",
            "open source",
            "supply chain security"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "clop-ransomware-claims-attack-on-canadian-company-cmhheli",
          "headline": "Clop Ransomware Group Claims Attack on Canadian Helicopter Company",
          "summary": "The notorious Clop ransomware group has claimed responsibility for a cyberattack against CMHHELI.COM, a Canadian company. On January 29, 2026, the group added the company to its dark web leak site, threatening to publish stolen data if a ransom is not paid. This incident highlights the persistent and indiscriminate nature of major ransomware gangs, who continue to target organizations of all sizes. Security experts advise victims to initiate incident response, validate backups, and engage professionals before considering any communication with the attackers.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Clop",
            "TA505",
            "data leak",
            "double extortion",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "malicious-python-spellchecker-packages-on-pypi-deliver-rat",
          "headline": "Fake Python Spellchecker Packages on PyPI Deploy Remote Access Trojan",
          "summary": "Two malicious packages, `spellcheckerpy` and `spellcheckpy`, were discovered and removed from the Python Package Index (PyPI). Masquerading as legitimate spell-checking utilities, these packages were downloaded over 1,000 times and were designed to install a full-featured remote access trojan (RAT) on developers' systems. The attacker used a novel technique, hiding a Base64-encoded payload within a Basque language dictionary file (`eu.json.gz`) and activating it only in a later version of the package. This supply chain attack highlights the growing threat of malware in open-source repositories.",
          "categories": [
            "Malware",
            "Supply Chain Attack",
            "Threat Intelligence"
          ],
          "tags": [
            "PyPI",
            "Python",
            "RAT",
            "dependency confusion",
            "open-source security",
            "typosquatting"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z",
          "malware": [
            "Remote Access Trojan (RAT)"
          ]
        },
        {
          "slug": "illinois-dhs-data-breach-exposes-700k-records",
          "headline": "Illinois Department of Human Services Breach Exposes Data of 700,000",
          "summary": "The Illinois Department of Human Services (IDHS) has disclosed a massive data breach that exposed the sensitive records of approximately 700,000 state residents. The incident, one of the largest public-sector breaches of 2026, impacted recipients of various state aid programs. Exposed data for over 672,000 Medicaid and Medicare Savings Program recipients includes addresses, case numbers, and medical plan names. A separate set of 32,000 records belonging to customers of the Division of Rehabilitation Services was also compromised, exposing names, addresses, and case details. The investigation is ongoing to determine the cause and full scope of the breach.",
          "categories": [
            "Data Breach",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "Medicaid",
            "PHI",
            "PII",
            "data breach",
            "government",
            "healthcare"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "shinyhunters-claims-attacks-on-bumble-panera-match-crunchbase",
          "headline": "ShinyHunters Claims Cyberattacks on Bumble, Panera, Match, and Crunchbase",
          "summary": "Several high-profile US companies, including Bumble, Panera Bread, Match Group, and Crunchbase, have been targeted in a series of cyberattacks. A group calling itself 'ShinyHunters' has claimed responsibility, with evidence pointing towards a coordinated social engineering campaign. The impact varies across the companies: Bumble reported a contractor's account was phished, leading to brief network access but no user data compromise. Match Group confirmed a limited amount of user data was affected, while Panera and Crunchbase also reported incidents involving contact information and corporate documents, respectively. The attacks highlight a trend towards leveraging compromised contact data for further malicious activities.",
          "categories": [
            "Cyberattack",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "contractor compromise",
            "phishing",
            "social engineering",
            "third-party risk"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "soundcloud-data-breach-exposes-29-million-users",
          "headline": "SoundCloud Breach Exposes Private Emails of 29.8 Million Users",
          "summary": "A significant data breach at the music streaming service SoundCloud has resulted in the public release of a database containing the personal details of 29.8 million users. The data was leaked in January 2026 after the company reportedly refused to pay a ransom demand. The primary risk from this breach stems from the linking of users' private email addresses with their public profile metadata. This combination provides a rich source of data for attackers to launch targeted phishing, credential stuffing, and social engineering campaigns. The breach has been indexed by the notification service HaveIBeenPwned.",
          "categories": [
            "Data Breach",
            "Threat Intelligence"
          ],
          "tags": [
            "PII",
            "SoundCloud",
            "credential stuffing",
            "data breach",
            "email leak",
            "phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z"
        },
        {
          "slug": "critical-rce-flaw-cve-2025-12556-in-idis-cloud-manager-viewer",
          "headline": "Critical 1-Click RCE Flaw in IDIS Cloud Manager Puts Users at Risk",
          "summary": "A critical remote code execution (RCE) vulnerability, CVE-2025-12556, has been discovered in the IDIS Cloud Manager (ICM) viewer by researchers at Claroty's Team82. The flaw, which has a CVSS v4 score of 8.7, allows an attacker to execute arbitrary code on a user's machine by convincing them to click a specially crafted link. This '1-click RCE' vulnerability bypasses the browser sandbox, making it a potent weapon for spear-phishing campaigns. IDIS has released version 1.7.1 to address the issue and urges users to upgrade or uninstall the software immediately.",
          "categories": [
            "Vulnerability",
            "Phishing",
            "Industrial Control Systems"
          ],
          "tags": [
            "1-click exploit",
            "RCE",
            "URL handler",
            "argument injection",
            "spear-phishing"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z",
          "cves": [
            "CVE-2025-12556"
          ]
        },
        {
          "slug": "fortinet-forticloud-sso-flaw-cve-2026-24858-actively-exploited",
          "headline": "Critical FortiCloud SSO Flaw Under Active Attack, CISA Issues Urgent Warning",
          "summary": "A critical authentication bypass vulnerability, CVE-2026-24858, in Fortinet's FortiCloud single sign-on (SSO) service is under active exploitation. The flaw allows an attacker with a registered FortiCloud account to gain unauthorized access to devices belonging to other accounts. Fortinet has observed malicious activity, including unauthorized configuration changes and account creation on FortiGate devices. CISA has added the vulnerability to its KEV catalog, urging immediate action. Fortinet temporarily disabled the SSO service to implement mitigations and is working on permanent patches for affected products like FortiOS, FortiManager, and FortiWeb.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Cloud Security"
          ],
          "tags": [
            "KEV",
            "SSO",
            "authentication bypass",
            "cloud security",
            "firewall"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z",
          "cves": [
            "CVE-2025-59718",
            "CVE-2025-59719",
            "CVE-2026-24858"
          ]
        },
        {
          "slug": "microsoft-office-zero-day-cve-2026-21509-actively-exploited",
          "headline": "Microsoft Office Zero-Day Under Active Attack Bypasses Security Features",
          "summary": "Microsoft has issued an emergency out-of-band patch for a high-severity zero-day vulnerability in Microsoft Office, CVE-2026-21509. The flaw, a security feature bypass with a CVSS score of 7.8, is being actively exploited in the wild through malicious documents. It allows attackers to circumvent Object Linking and Embedding (OLE) protections, leading to code execution if a user opens a specially crafted file. The vulnerability affects a wide range of Office products, including Office 2016 through LTSC 2024 and Microsoft 365 Apps. CISA has added the flaw to its Known Exploited Vulnerabilities (KEV) catalog, mandating urgent patching for federal agencies and signaling a significant risk to all organizations.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "KEV",
            "OLE",
            "out-of-band patch",
            "security feature bypass",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-29T15:00:00.000Z",
          "cves": [
            "CVE-2026-21509"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-28",
      "type": "publication-daily",
      "headline": "Microsoft and Fortinet Race to Patch Actively Exploited Zero-Days as ShinyHunters Claims Massive Match Group Breach",
      "articleCount": 12,
      "articles": [
        {
          "slug": "stanley-malware-as-a-service-for-malicious-chrome-extensions-emerges",
          "headline": "'Stanley' MaaS Sells Malicious Chrome Extensions Guaranteed for Web Store Publication",
          "summary": "A new Malware-as-a-Service (MaaS) platform named 'Stanley' has appeared on Russian-language cybercrime forums, specializing in the sale of malicious Google Chrome extensions. A key feature of the service is a guarantee that the malicious extensions will be successfully published to the official Chrome Web Store, lending them an air of legitimacy. The primary purpose of these extensions is to facilitate phishing and credential theft by spoofing legitimate websites. The emergence of 'as-a-service' models like Stanley significantly lowers the barrier to entry for less sophisticated cybercriminals to launch effective attacks.",
          "categories": [
            "Malware",
            "Phishing",
            "Threat Intelligence"
          ],
          "tags": [
            "Chrome extension",
            "MaaS",
            "Malware-as-a-Service",
            "Stanley",
            "cybercrime",
            "phishing"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z",
          "malware": [
            "Stanley"
          ]
        },
        {
          "slug": "us-indicts-31-more-in-international-atm-jackpotting-scheme",
          "headline": "US Indicts 31 More in ATM Jackpotting Ring Linked to Tren de Aragua Gang",
          "summary": "A U.S. federal grand jury has indicted an additional 31 individuals for their participation in a widespread 'ATM jackpotting' conspiracy, bringing the total number of defendants to 87. The sophisticated scheme involved using malware to force ATMs to dispense large sums of cash. Many of the newly charged individuals are Venezuelan and Colombian nationals, including several identified members of the transnational criminal gang Tren de Aragua (TdA) who are in the U.S. illegally. The case highlights the growing convergence of organized crime and specialized cybercrime tactics.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "ATM jackpotting",
            "Tren de Aragua",
            "bank fraud",
            "cybercrime",
            "indictment",
            "malware"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z",
          "malware": [
            "Ploutus"
          ]
        },
        {
          "slug": "european-commission-proposes-revisions-to-strengthen-eu-cybersecurity-act",
          "headline": "EU Proposes Revised Cybersecurity Act to Bolster Supply Chain Security & ENISA's Role",
          "summary": "The European Commission has introduced a new cybersecurity package that includes a proposal for a revised Cybersecurity Act (CSA) and targeted amendments to the NIS2 Directive. The initiative aims to strengthen the EU's collective resilience against cyber threats by establishing a framework for ICT supply chain security, promoting 'cyber-secure by design' principles through certification, and enhancing the role of ENISA, the EU's cybersecurity agency. The amendments to NIS2 seek to clarify rules on jurisdiction and streamline ransomware incident data collection. Once adopted, member states will have one year to transpose the new provisions into national law.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "Cybersecurity Act",
            "ENISA",
            "EU",
            "NIS2",
            "compliance",
            "regulation",
            "supply chain"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z"
        },
        {
          "slug": "honeymyte-apt-group-deploys-advanced-data-stealers-in-new-campaign",
          "headline": "HoneyMyte APT (Mustang Panda) Targets Asian Governments with New Data Stealers and Rootkits",
          "summary": "The China-aligned advanced persistent threat (APT) group known as HoneyMyte (also tracked as Mustang Panda or Bronze President) has been observed conducting a new espionage campaign targeting government and military organizations in Southeast and East Asia. The campaign features an updated version of the group's 'CoolClient' backdoor, multiple new browser data stealers, and the use of kernel-mode rootkits to achieve stealth and persistence. The group's typical TTPs include spear-phishing and infected USB drives for initial access, followed by DLL side-loading to execute its payloads. The operation is focused on long-term intelligence gathering in geopolitically sensitive regions like Myanmar and Thailand.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "APT",
            "China",
            "DLL side-loading",
            "HoneyMyte",
            "Mustang Panda",
            "cyber-espionage",
            "rootkit"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z",
          "malware": [
            "CoolClient"
          ]
        },
        {
          "slug": "illinois-human-services-department-breach-exposes-700k-records",
          "headline": "Illinois DHS Data Breach Exposes Sensitive Records of 700,000 People",
          "summary": "The Illinois Department of Human Services (IDHS) has confirmed a significant data breach that exposed the sensitive records of approximately 700,000 individuals, making it one of the largest public-sector breaches of 2026. The compromised data includes personal and program-related information for over 672,000 recipients of Medicaid and the Medicare Savings Program. Exposed details include names, addresses, demographic information, and case numbers. The incident highlights the increasing targeting of social service and healthcare agencies by cybercriminals, who use the stolen data for fraud, phishing, and identity theft.",
          "categories": [
            "Data Breach",
            "Regulatory",
            "Phishing"
          ],
          "tags": [
            "IDHS",
            "Illinois",
            "Medicaid",
            "PII",
            "data breach",
            "government",
            "healthcare"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z"
        },
        {
          "slug": "malicious-python-packages-on-pypi-deliver-rat",
          "headline": "Malicious PyPI Packages `spellcheckerpy` & `spellcheckpy` Deliver RAT via Hidden Payload",
          "summary": "A software supply chain attack has been uncovered on the Python Package Index (PyPI), involving two malicious packages named `spellcheckerpy` and `spellcheckpy`. Downloaded over 1,000 times, the packages contained a hidden, dormant payload. A later version update activated the malware, which was designed to fingerprint the compromised developer's system and deploy a Remote Access Trojan (RAT). The attack was cleverly concealed, with the malicious code base64-encoded and hidden inside a Basque language dictionary file. The C2 domain used has been linked to a hosting provider known to service nation-state actors, suggesting a potentially sophisticated adversary.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "PyPI",
            "Python",
            "RAT",
            "malware",
            "supply chain attack",
            "typosquatting"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z"
        },
        {
          "slug": "nova-ransomware-group-claims-attack-on-kpmg-netherlands",
          "headline": "Nova Ransomware Group Claims Cyberattack on KPMG Netherlands, Sets 10-Day Deadline",
          "summary": "The Nova ransomware group has claimed responsibility for a cyberattack against the Netherlands division of global professional services firm KPMG. The claim, which appeared on ransomware monitoring services on January 23, 2026, alleges that the group successfully breached KPMG's systems and exfiltrated sensitive data. In a classic double-extortion tactic, the Nova group has reportedly set a ten-day deadline for KPMG Netherlands to enter into ransom negotiations before they potentially leak the stolen data. KPMG has not yet publicly confirmed the attack.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Data Breach"
          ],
          "tags": [
            "KPMG",
            "Nova ransomware",
            "data breach",
            "double extortion",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z",
          "malware": [
            "Nova ransomware"
          ]
        },
        {
          "slug": "shinyhunters-claims-massive-data-breach-of-match-group-dating-apps",
          "headline": "ShinyHunters Claims Breach of 10M Match Group Users from Hinge & OkCupid",
          "summary": "The notorious cybercrime group ShinyHunters has claimed responsibility for a major data breach impacting Match Group, the parent company of popular dating apps like Hinge, OkCupid, and Match.com. The group posted on a dark web forum that it has stolen over 10 million user records, and released a 1.7GB sample as proof. The data allegedly includes sensitive user information such as names, phone numbers, IP addresses, and match logs, as well as internal corporate documents. ShinyHunters asserts the data was exfiltrated from a third-party analytics provider, AppsFlyer, highlighting a potential supply chain attack vector.",
          "categories": [
            "Data Breach",
            "Threat Actor",
            "Supply Chain Attack"
          ],
          "tags": [
            "AppsFlyer",
            "Hinge",
            "Match Group",
            "OkCupid",
            "ShinyHunters",
            "data breach",
            "supply chain attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z"
        },
        {
          "slug": "high-severity-flaws-in-n8n-workflow-platform-allow-rce",
          "headline": "Critical RCE Flaws in n8n Workflow Platform Put Thousands of Instances at Risk",
          "summary": "Two new high-severity vulnerabilities have been discovered in the n8n workflow automation platform, a tool that often holds credentials to critical corporate systems. The most severe flaw, CVE-2026-1470, is a critical eval injection vulnerability (CVSS 9.9) that allows an authenticated attacker to bypass the expression sandbox and achieve full remote code execution. A second flaw, CVE-2026-0863 (CVSS 8.5), allows for a similar sandbox escape in the Python execution environment. A compromise could provide an attacker with a 'skeleton key' to an organization's infrastructure. This news is compounded by data showing over 39,000 n8n instances remain unpatched for a previous critical flaw.",
          "categories": [
            "Vulnerability",
            "Cloud Security",
            "Patch Management"
          ],
          "tags": [
            "CVE-2026-0863",
            "CVE-2026-1470",
            "RCE",
            "n8n",
            "sandbox escape",
            "vulnerability",
            "workflow automation"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z",
          "cves": [
            "CVE-2026-0863",
            "CVE-2026-1470",
            "CVE-2026-21858"
          ]
        },
        {
          "slug": "fortinet-fixes-actively-exploited-sso-authentication-bypass-flaw",
          "headline": "Fortinet Scrambles to Fix Actively Exploited SSO Auth Bypass (CVE-2026-24858) Hijacking Devices",
          "summary": "Fortinet has disclosed and patched a critical authentication bypass vulnerability, CVE-2026-24858, in its FortiCloud Single Sign-On (SSO) feature. The flaw is being actively exploited, allowing attackers with a FortiCloud account to log into devices registered to other users, leading to unauthorized configuration changes and account creation. The vulnerability affects a wide range of products, including FortiOS, FortiManager, and FortiAnalyzer. Due to the active exploitation and severity, CISA has added CVE-2026-24858 to its Known Exploited Vulnerabilities (KEV) catalog, urging users to patch and hunt for signs of compromise immediately.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "CISA KEV",
            "CVE-2026-24858",
            "FortiCloud",
            "Fortinet",
            "SSO",
            "authentication bypass",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z",
          "cves": [
            "CVE-2025-59718",
            "CVE-2025-59719",
            "CVE-2026-24858"
          ]
        },
        {
          "slug": "microsoft-issues-emergency-patch-for-actively-exploited-office-zero-day",
          "headline": "Microsoft Patches Actively Exploited Office Zero-Day (CVE-2026-21509) Under Targeted Attack",
          "summary": "Microsoft has released an emergency out-of-band security update for CVE-2026-21509, a high-severity security feature bypass vulnerability in Microsoft Office. The flaw, which has a CVSS score of 7.8, is being actively exploited in targeted attacks, allowing attackers to bypass Object Linking and Embedding (OLE) protections by tricking users into opening malicious documents. In response to the in-the-wild exploitation, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to apply the patch by February 16, 2026. The update applies to Office 2016, Office 2019, and Office LTSC, while Microsoft 365 Apps customers will receive a service-side update.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA KEV",
            "CVE-2026-21509",
            "Microsoft Office",
            "OLE",
            "out-of-band patch",
            "security feature bypass",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z",
          "cves": [
            "CVE-2026-20805",
            "CVE-2026-21509"
          ]
        },
        {
          "slug": "solarwinds-discloses-five-critical-flaws-in-web-help-desk-platform",
          "headline": "SolarWinds Discloses Five Critical RCE & Auth Bypass Flaws in Web Help Desk",
          "summary": "SolarWinds has disclosed a set of five critical vulnerabilities in its Web Help Desk (WHD) platform, a tool used by over 300,000 organizations. The flaws include two unauthenticated remote code execution (RCE) vulnerabilities and two authentication bypasses, each with a CVSS score of 9.8. This incident highlights a troubling pattern of recurring patch failures, as one of the new flaws, CVE-2025-40553, is the second bypass of an original deserialization vulnerability (CVE-2024-28986) first patched in 2024. Given the critical nature of the flaws, organizations with internet-facing WHD instances are at extreme risk and must patch immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CVE-2025-40553",
            "RCE",
            "SolarWinds",
            "Web Help Desk",
            "authentication bypass",
            "deserialization",
            "patch bypass"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-28T15:00:00.000Z",
          "cves": [
            "CVE-2024-28986",
            "CVE-2025-26399",
            "CVE-2025-40553"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "shinyhunters-claims-breaches-of-crunchbase-betterment-via-okta-vishing",
        "originalHeadline": "ShinyHunters Claims Breach of Crunchbase, Betterment via Okta Vishing Attacks",
        "updateTitle": "Update: ShinyHunters Claims Breach of Crunchbase, Betterment via Okta Vishing Attacks",
        "updateSummary": "ShinyHunters campaign expands, now impacting Bumble, Panera Bread, and Match Group. Crunchbase confirms corporate document compromise, adding to the scope of social engineering attacks.",
        "categories": [
          "Phishing",
          "Data Breach",
          "Threat Actor"
        ],
        "tags": [
          "Betterment",
          "Crunchbase",
          "MFA bypass",
          "Okta",
          "ShinyHunters",
          "social engineering",
          "vishing"
        ],
        "severity": "high",
        "publishedAt": "2026-01-25T15:00:00.000Z",
        "updatedAt": "2026-01-29T12:00:00.000Z"
      },
      {
        "slug": "mustang-panda-apt-enhances-stealth-with-signed-kernel-mode-rootkit",
        "originalHeadline": "Mustang Panda APT Deploys Signed Kernel-Mode Rootkit to Hide Backdoor",
        "updateTitle": "Update: Mustang Panda APT Deploys Signed Kernel-Mode Rootkit to Hide Backdoor",
        "updateSummary": "Mustang Panda (HoneyMyte) expands campaign with updated CoolClient backdoor, new browser data stealers, and continued use of kernel-mode rootkits targeting Asian governments.",
        "categories": [
          "Threat Actor",
          "Malware",
          "Cyberattack"
        ],
        "tags": [
          "APT",
          "China",
          "Espionage",
          "Kaspersky",
          "Kernel-mode",
          "Mustang Panda",
          "Rootkit",
          "TONESHELL"
        ],
        "malware": [
          "TONESHELL"
        ],
        "severity": "high",
        "publishedAt": "2026-01-01T15:00:00.000Z",
        "updatedAt": "2026-01-28T10:00:00.000Z"
      },
      {
        "slug": "illinois-dhs-data-breach-exposes-700000-residents",
        "originalHeadline": "Illinois DHS Exposes Data of 700,000 Residents in Massive Misconfiguration Breach",
        "updateTitle": "Update: Illinois DHS Exposes Data of 700,000 Residents in Massive Misconfiguration Breach",
        "updateSummary": "New details reveal full names were exposed for Medicaid recipients, contradicting initial reports. The cause is now unclear, implying potential malicious activity, increasing severity.",
        "categories": [
          "Data Breach",
          "Regulatory",
          "Policy and Compliance"
        ],
        "tags": [
          "Data Breach",
          "Government",
          "HIPAA",
          "IDHS",
          "Illinois",
          "Misconfiguration",
          "PHI",
          "PII"
        ],
        "severity": "high",
        "publishedAt": "2026-01-10T15:00:00.000Z",
        "updatedAt": "2026-01-28T00:00:00.000Z"
      },
      {
        "slug": "fortinet-confirms-active-exploitation-of-forticloud-sso-bypass",
        "originalHeadline": "Fortinet Confirms Active Exploitation of FortiCloud SSO Bypass on Fully Patched FortiGate Firewalls",
        "updateTitle": "Update: Fortinet Confirms Active Exploitation of FortiCloud SSO Bypass on Fully Patched FortiGate Firewalls",
        "updateSummary": "Fortinet disclosed and patched CVE-2026-24858, a critical FortiCloud SSO bypass actively exploited to hijack devices, bypassing previous patches. CISA added it to KEV.",
        "categories": [
          "Vulnerability",
          "Cyberattack",
          "Patch Management"
        ],
        "tags": [
          "Authentication Bypass",
          "FortiGate",
          "Fortinet",
          "SAML",
          "SSO",
          "Vulnerability",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-59718",
          "CVE-2025-59719"
        ],
        "severity": "critical",
        "publishedAt": "2026-01-27T15:00:00.000Z",
        "updatedAt": "2026-01-28T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}