{
  "lastUpdated": "2026-01-14T16:43:11.507Z",
  "runDate": "2026-01-14",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-14",
      "type": "publication-daily",
      "headline": "CISA Mandates Patches for Exploited Windows & Gogs Zero-Days; Ransomware Cripples Hospital & Energy Giant Breached",
      "articleCount": 12,
      "articles": [
        {
          "slug": "pax8-data-leak-exposes-msp-and-customer-data",
          "headline": "Pax8 Data Leak Exposes Sensitive MSP and Customer Info via Accidental Email",
          "summary": "Cloud commerce marketplace Pax8 has confirmed a data exposure incident caused by human error. On January 13, an employee mistakenly sent an email containing a CSV file with sensitive, non-PII business data for approximately 1,800 Managed Service Provider (MSP) partners. The email, sent to fewer than 40 UK-based partners, exposed valuable information such as customer names, Microsoft license counts, pricing, and contract renewal dates, creating a significant risk of targeted phishing and competitive poaching.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Cloud Security"
          ],
          "tags": [
            "Data Exposure",
            "Data Leak",
            "Human Error",
            "MSP",
            "Pax8",
            "Supply Chain"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "encryptionless-extortion-becomes-dominant-ransomware-tactic",
          "headline": "Ransomware Evolves: Data Theft Now Favored Over Encryption in Extortion-Only Attacks",
          "summary": "Security analysis reveals a fundamental shift in the ransomware business model, with threat actors increasingly favoring \"extortion-only\" attacks that forgo data encryption entirely. This evolved tactic focuses on silent, long-term data exfiltration followed by threats to leak the stolen information publicly. This approach is stealthier than traditional encryption and effectively bypasses backup-based recovery strategies, turning every attack into a data breach crisis. Groups like Cl0p and ShinyHunters have pioneered this model, which accounted for a significant portion of the 6,182 extortion incidents in 2025.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Data Breach"
          ],
          "tags": [
            "Cybercrime",
            "Data Breach",
            "Data Exfiltration",
            "Extortion",
            "Ransomware",
            "Threat Trend"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z",
          "malware": [
            "Akira",
            "Cl0p",
            "Qilin",
            "Safepay"
          ]
        },
        {
          "slug": "cisa-mandates-patch-for-actively-exploited-windows-zero-day-cve-2026-20805",
          "headline": "CISA Mandates Patch for Exploited Windows Zero-Day Used in Attack Chains",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has ordered federal agencies to patch a zero-day vulnerability in the Windows Desktop Window Manager (CVE-2026-20805) by February 3, 2026. The medium-severity information disclosure flaw is being actively exploited in the wild as a crucial component in multi-stage attack chains, allowing attackers to bypass Address Space Layout Randomization (ASLR) and enable more severe exploits like remote code execution. The flaw was addressed in Microsoft's January 2026 Patch Tuesday update.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Threat Intelligence"
          ],
          "tags": [
            "ASLR Bypass",
            "CISA",
            "CVE-2026-20805",
            "DWM",
            "KEV",
            "Patch Tuesday",
            "Windows",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z",
          "cves": [
            "CVE-2026-20805"
          ]
        },
        {
          "slug": "cisa-warns-of-critical-flaws-in-rockwell-automation-and-yosmart-ics-equipment",
          "headline": "CISA Warns of Critical Flaws in Rockwell & YoSmart ICS Equipment",
          "summary": "CISA has released several Industrial Control Systems (ICS) advisories, warning of significant vulnerabilities in widely deployed equipment from Rockwell Automation and YoSmart. A high-severity SQL injection flaw (CVE-2025-12807) in Rockwell's FactoryTalk platform could allow for database takeover, while another flaw (CVE-2025-9368) can cause a denial-of-service condition. Separately, multiple flaws in YoSmart smart home hubs could permit remote device control and data interception, posing risks to both manufacturing and communications sectors.",
          "categories": [
            "Industrial Control Systems",
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "DoS",
            "ICS",
            "Rockwell Automation",
            "SCADA",
            "SQL Injection",
            "Vulnerability",
            "YoSmart"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z",
          "cves": [
            "CVE-2025-12807",
            "CVE-2025-59448",
            "CVE-2025-59449",
            "CVE-2025-59451",
            "CVE-2025-59452",
            "CVE-2025-9368"
          ]
        },
        {
          "slug": "microsoft-january-2026-patch-tuesday-fixes-114-vulnerabilities",
          "headline": "Microsoft's January 2026 Patch Tuesday Fixes 114 Flaws, Including One Exploited Zero-Day",
          "summary": "Microsoft has released its first Patch Tuesday of 2026, a substantial update that addresses 114 security vulnerabilities across a wide range of its products, including Windows, Office, Azure, and SharePoint. The release includes fixes for eight critical remote code execution (RCE) vulnerabilities and, most notably, one moderate-severity information disclosure zero-day (CVE-2026-20805) that is confirmed to be actively exploited in the wild. This makes it the third-largest January update on record, urging administrators to prioritize deployment.",
          "categories": [
            "Patch Management",
            "Vulnerability"
          ],
          "tags": [
            "CVE-2026-20805",
            "Microsoft",
            "Patch Tuesday",
            "RCE",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z",
          "cves": [
            "CVE-2026-20805"
          ]
        },
        {
          "slug": "gru-linked-hackers-bluedelta-apt28-evolve-credential-harvesting-tactics",
          "headline": "Russian GRU Hackers (APT28) Evolve Credential-Harvesting Tactics",
          "summary": "The Russian GRU-linked threat group BlueDelta, also known as APT28 or Fancy Bear, has been observed refining its credential-harvesting operations. According to research from Recorded Future, campaigns between February and September 2025 targeted energy, defense, and policy organizations in Europe and Eurasia. The group uses tailored spear-phishing emails, multi-stage redirection, and abuses low-cost, disposable infrastructure like ngrok and other free hosting services to enhance stealth and complicate attribution.",
          "categories": [
            "Threat Actor",
            "Phishing",
            "Threat Intelligence"
          ],
          "tags": [
            "APT28",
            "BlueDelta",
            "Credential Harvesting",
            "Fancy Bear",
            "GRU",
            "Phishing",
            "Russia",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "kremlin-hackers-target-ukrainian-military-with-pluggyape-malware",
          "headline": "Russian Hackers Target Ukrainian Military with \"PluggyApe\" Malware",
          "summary": "A Russian-linked hacking group, Void Blizzard (also known as UAC-0190), has been targeting the Ukrainian Defense Forces with a new cyber-espionage campaign. According to CERT-UA, the attacks, which occurred between October and December 2025, use a novel malware strain called PluggyApe. The campaign employs sophisticated social engineering, with attackers making direct contact with targets on secure messaging apps like Signal and WhatsApp, using charity-themed lures to build trust and deliver the malware.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "CERT-UA",
            "Cyber Espionage",
            "Malware",
            "PluggyApe",
            "Russia",
            "Ukraine",
            "Void Blizzard"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "spanish-energy-giant-endesa-suffers-major-data-breach",
          "headline": "Spanish Energy Giant Endesa Hit by Massive Data Breach, 20M Records Allegedly For Sale",
          "summary": "Spain's largest electric utility, Endesa, has confirmed a data breach after detecting unauthorized access to a commercial platform. The company admitted that customer PII, contact details, and bank account IBANs were potentially exposed. The situation is amplified by a threat actor on a cybercrime forum who claims to have stolen a 1.05 TB database containing the data of over 20 million people, which is now up for sale. Endesa, which serves over 10 million customers, is urging vigilance against phishing and fraud.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Industrial Control Systems"
          ],
          "tags": [
            "Cybercrime",
            "Data Breach",
            "Endesa",
            "Energy Sector",
            "IBAN",
            "PII",
            "Spain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "malicious-npm-packages-target-n8n-workflow-automation-platform",
          "headline": "Supply Chain Attack Hits n8n Workflow Automation Platform, Steals OAuth Tokens",
          "summary": "A sophisticated supply chain attack has targeted the n8n workflow automation ecosystem, as reported by researchers at Endor Labs. Attackers published at least eight malicious packages on the npm registry, masquerading as legitimate community-built integrations. These packages were designed to trick developers into entering OAuth credentials, which were then decrypted using n8n's master key and exfiltrated to an attacker-controlled server. This marks the first known supply chain attack specifically targeting the n8n platform.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "Credential Theft",
            "Malware",
            "OAuth",
            "Supply Chain Attack",
            "n8n",
            "npm"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "cisa-warns-of-actively-exploited-rce-flaw-in-gogs-git-service",
          "headline": "CISA Warns of Actively Exploited RCE Flaw in Gogs Git Service, 700+ Instances Compromised",
          "summary": "CISA has added a high-severity path traversal vulnerability (CVE-2025-8110) in the Gogs self-hosted Git service to its Known Exploited Vulnerabilities (KEV) catalog, warning of active exploitation in the wild. The flaw, rated CVSS 8.7, allows an authenticated attacker to achieve remote code execution (RCE). Security firm Wiz reported that over 700 Gogs instances have already been compromised. With no official patch available at the time of the alert, CISA has mandated federal agencies apply mitigations by February 2, 2026.",
          "categories": [
            "Vulnerability",
            "Supply Chain Attack",
            "Threat Intelligence"
          ],
          "tags": [
            "CISA",
            "Git",
            "Gogs",
            "KEV",
            "Path Traversal",
            "RCE",
            "Supply Chain Attack",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z",
          "cves": [
            "CVE-2024-55947",
            "CVE-2025-8110"
          ]
        },
        {
          "slug": "connectpos-exposed-admin-github-token-for-four-years",
          "headline": "ConnectPOS Exposed Admin GitHub Token for Over Four Years, Creating Massive Supply Chain Risk",
          "summary": "Point-of-sale vendor ConnectPOS exposed a GitHub Personal Access Token (PAT) with full administrative privileges in its public documentation for over four years, from September 2021 until its discovery in January 2026. The blunder, found by security firm Sansec, put the vendor's entire software supply chain at risk. An attacker could have used the token to inject malicious code, such as a payment card skimmer, into the POS software, which would then be distributed to its 12,000+ customers, including major brands like Asus and Indiana University.",
          "categories": [
            "Supply Chain Attack",
            "Vulnerability",
            "Data Breach"
          ],
          "tags": [
            "ConnectPOS",
            "GitHub",
            "Magecart",
            "PAT",
            "Secret Leak",
            "Supply Chain Attack",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        },
        {
          "slug": "ransomware-attack-cripples-belgian-hospital-forces-patient-transfers",
          "headline": "Ransomware Cripples Belgian Hospital, Critical Patients Transferred",
          "summary": "A major cyberattack, widely reported as ransomware, has crippled the AZ Monica hospital network in Antwerp, Belgium. The incident on January 13, 2026, forced a complete IT shutdown across two campuses to contain the threat. This drastic measure led to the cancellation of at least 70 surgeries and, most critically, required the emergency transfer of seven intensive care patients to other facilities. The attack highlights the severe, life-threatening consequences of cyberattacks on the healthcare sector.",
          "categories": [
            "Ransomware",
            "Cyberattack",
            "Industrial Control Systems"
          ],
          "tags": [
            "Belgium",
            "Cyberattack",
            "Healthcare",
            "Incident Response",
            "Patient Safety",
            "Ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-14T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-13",
      "type": "publication-daily",
      "headline": "CISA KEV Alert for Gogs RCE Flaw; BreachForums Database Leaked; AI Threats Forecasted to Rise",
      "articleCount": 12,
      "articles": [
        {
          "slug": "experian-forecasts-ai-agents-to-become-top-cause-of-data-breaches",
          "headline": "AI to Overtake Human Error as Top Cause of Breaches, Experian Predicts",
          "summary": "In its 13th Annual Data Breach Industry Forecast, Experian predicts a paradigm shift in cybersecurity for 2026, with autonomous AI agents potentially surpassing human error as the leading cause of data breaches. The report warns that threat actors are weaponizing AI to create sophisticated polymorphic malware, execute highly personalized attacks, and generate 'pristine synthetic identities' at scale from stolen data. This new wave of AI-driven threats, combined with the looming risk of quantum computing, is expected to fuel a massive spike in identity theft and fundamentally change the nature of cyberattacks.",
          "categories": [
            "Threat Intelligence",
            "Policy and Compliance"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "Polymorphic Malware",
            "Quantum Computing",
            "Synthetic Identity",
            "Threat Forecast"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z",
          "malware": [
            "Metamorphic malware",
            "Polymorphic malware"
          ]
        },
        {
          "slug": "g7-unveils-roadmap-for-post-quantum-cryptography-in-finance-sector",
          "headline": "G7 Unveils Roadmap for Financial Sector's Transition to Post-Quantum Cryptography",
          "summary": "The G7 Cyber Expert Group (CEG), co-chaired by the U.S. Treasury and the Bank of England, has released a strategic roadmap to guide the global financial sector's transition to quantum-resilient technology. Published on January 12, 2026, the guidance addresses the existential threat that future quantum computers pose to current cryptographic standards like RSA and ECC. The non-prescriptive roadmap recommends a phased approach, urging firms to begin inventorying cryptographic assets by 2027 and aim for a full transition to Post-Quantum Cryptography (PQC) by 2035 to mitigate 'harvest now, decrypt later' risks.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "Banking",
            "Cryptography",
            "Finance",
            "G7",
            "PQC",
            "Post-Quantum Cryptography",
            "Quantum Computing"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "crazyhunter-ransomware-escalates-attacks-on-taiwanese-healthcare",
          "headline": "'CrazyHunter' Ransomware Targets Taiwanese Hospitals with Advanced Tactics",
          "summary": "A sophisticated Go-based ransomware variant named CrazyHunter is escalating attacks, primarily targeting the healthcare sector in Taiwan with at least six confirmed victims. According to research from Trellix, CrazyHunter is a fork of the open-source 'Prince Ransomware' but incorporates significant enhancements. The attackers use weak Active Directory passwords for initial access, leverage the SharpGPOAbuse tool for rapid network-wide deployment, and employ Bring Your Own Vulnerable Driver (BYOVD) techniques to disable security software. The ransomware uses a hybrid ChaCha20 and ECIES encryption scheme and appends the `.Hunter` extension to files.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "BYOVD",
            "GPO",
            "Go",
            "Healthcare",
            "Ransomware",
            "Taiwan"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z",
          "malware": [
            "Prince Ransomware"
          ]
        },
        {
          "slug": "brightspeed-investigates-data-breach-claim-from-crimson-collective-affecting-1m-customers",
          "headline": "Brightspeed Probes Breach Claim by 'Crimson Collective' Affecting Over 1M Customers",
          "summary": "U.S. broadband provider Brightspeed is actively investigating a significant cybersecurity event following a claim by the 'Crimson Collective' extortion group. The group alleges it breached Brightspeed's systems and stole the personally identifiable information (PII) of over one million residential customers, including names, addresses, and partial payment details. Crimson Collective, a group known for targeting AWS cloud environments, posted its claim on Telegram and threatened to leak the data if its demands are not met. Brightspeed, which serves 20 states, has acknowledged the threat and is working with authorities.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "AWS",
            "Cloud Security",
            "Extortion",
            "PII",
            "Telecommunications"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "french-immigration-agency-data-leaked-via-third-party-contractor-breach",
          "headline": "French Immigration Agency Data Leaked via Third-Party Breach",
          "summary": "France's Office for Immigration and Integration (OFII) has confirmed a data breach originating from a compromised third-party service provider. In early January 2026, a hacker claimed to be selling a database of up to 2.1 million records of foreign residents on BreachForums, posting samples that included names, contact details, and nationalities. OFII clarified that its own systems were not breached, but that the attack targeted a private training provider responsible for mandatory integration courses. The incident highlights the significant risks of supply chain attacks for government agencies and could lead to GDPR penalties for OFII as the data controller.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Regulatory"
          ],
          "tags": [
            "France",
            "GDPR",
            "Government",
            "PII",
            "Supply Chain Attack",
            "Third Party Breach"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "gobuteforcer-botnet-exploits-weak-passwords-in-linux-servers-fueled-by-ai-defaults",
          "headline": "GoBruteforcer Botnet Targets Linux Servers with Weak Passwords and AI-Generated Defaults",
          "summary": "A modular, Go-based botnet named GoBruteforcer is actively targeting Linux servers by brute-forcing weak passwords for exposed services like phpMyAdmin, MySQL, and FTP. According to Check Point Research, the campaign's success is fueled by two trends: the continued use of insecure legacy web stacks and the proliferation of insecure default configurations suggested by AI tools. The botnet turns compromised machines into scanners to find more victims. The financially motivated attackers also deploy tools to scan for and drain cryptocurrency wallets on compromised servers, with a focus on TRON and Binance Smart Chain.",
          "categories": [
            "Malware",
            "Cyberattack",
            "Cloud Security"
          ],
          "tags": [
            "AI",
            "Botnet",
            "Brute Force",
            "Cryptocurrency",
            "Linux",
            "MySQL",
            "phpMyAdmin"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z",
          "malware": [
            "GoBruteforcer"
          ]
        },
        {
          "slug": "logistics-cyberattacks-expected-to-double-in-2026-targeting-supply-chains",
          "headline": "Logistics Cyberattacks to Double in 2026 as Hackers Target Supply Chain Networks",
          "summary": "A new report from supply chain risk management firm Everstream Analytics predicts that cyberattacks targeting the logistics sector will double in 2026. The report highlights a staggering 965% increase in such incidents since 2021, with a 61% jump in 2025 alone. Threat actors, including state-sponsored groups from Russia, China, and Iran, are strategically shifting their focus from individual companies to shared transportation networks like ports and 3PLs to cause widespread, cascading disruption across the global supply chain. This trend has elevated logistics cyberattacks to a top-four supply chain risk for the coming year.",
          "categories": [
            "Supply Chain Attack",
            "Threat Intelligence",
            "Industrial Control Systems"
          ],
          "tags": [
            "ICS",
            "Logistics",
            "Maritime",
            "OT Security",
            "Supply Chain",
            "Transportation"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "new-zealand-patient-portal-manage-my-health-hit-by-ransomware",
          "headline": "New Zealand's 'Manage My Health' Portal Breached; Data of 120,000 Patients Held for Ransom",
          "summary": "New Zealand's largest patient portal, Manage My Health, is responding to a significant data breach that occurred in late December 2025. An attacker using the alias 'Kazu' claims to have stolen over 400,000 files, including sensitive medical records like lab results and clinical notes, affecting up to 126,000 individuals. The attacker has demanded a $60,000 ransom. The breach originated from a vulnerability in the 'Health Documents' module of the application. Manage My Health has since closed the security gap and is working with New Zealand authorities, while the government has launched an urgent review of the incident.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Cyberattack"
          ],
          "tags": [
            "Healthcare",
            "New Zealand",
            "PHI",
            "Patient Data",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "oregon-deq-data-breach-of-4800-people-kept-secret-for-nine-months",
          "headline": "Oregon DEQ Kept Data Breach of 4,800 People Secret for Nine Months",
          "summary": "The Oregon Department of Environmental Quality (DEQ) confirmed on January 13, 2026, that a cyberattack in April 2025 exposed the personal data of approximately 4,800 people. The agency opted not to issue a broad public disclosure, citing that Oregon law did not require it, and instead began sending notification letters to affected individuals in late December 2025, over eight months after the incident. The initial attack, which the Rhysida ransomware gang later claimed, caused significant operational disruption. The delay in notification has drawn criticism and raises questions about the agency's transparency and incident response process.",
          "categories": [
            "Data Breach",
            "Incident Response",
            "Regulatory"
          ],
          "tags": [
            "Data Breach Notification",
            "Government",
            "Incident Response",
            "Ransomware",
            "Transparency"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "breachforums-user-database-leaked-exposing-324000-cybercriminals",
          "headline": "Poetic Justice: BreachForums Hacked, Database of 324,000 Cybercriminals Leaked",
          "summary": "In a significant turn of events for the cybercrime community, the user database for the notorious hacking marketplace BreachForums was leaked online on January 9, 2026. The dump contains sensitive records for 323,986 users, including usernames, email addresses, IP addresses, private messages, and Argon2-hashed passwords. The breach, allegedly occurring in August 2025 and claimed by an individual named \"James,\" represents a major operational security failure and provides a trove of intelligence for law enforcement agencies seeking to identify and prosecute threat actors like 'IntelBroker' and 'ShinyHunters' who were active on the forum.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "Cybercrime",
            "Database Leak",
            "Hacking Forum",
            "Law Enforcement",
            "OPSEC",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "critical-unauthenticated-rce-flaw-ni8mare-in-n8n-automation-platform",
          "headline": "CVSS 10.0 'Ni8mare' Bug in n8n Allows Unauthenticated RCE",
          "summary": "A critical unauthenticated remote code execution (RCE) vulnerability, dubbed 'Ni8mare' and tracked as CVE-2026-21858, has been disclosed in the n8n workflow automation platform. The flaw, rated a maximum 10.0 on the CVSS scale, stems from a content-type confusion bug in the Form Webhook node. It allows an unauthenticated attacker to read arbitrary files, expose sensitive credentials, and ultimately achieve full RCE on vulnerable instances. The flaw affects n8n versions prior to 1.121.0, and with tens of thousands of instances exposed online, administrators are urged to patch immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVSS 10",
            "Ni8mare",
            "RCE",
            "Unauthenticated",
            "Workflow Automation",
            "n8n"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z",
          "cves": [
            "CVE-2026-21858"
          ]
        },
        {
          "slug": "cisa-adds-actively-exploited-gogs-rce-vulnerability-to-kev-catalog",
          "headline": "Urgent Patch: CISA Adds Actively Exploited Gogs RCE Flaw to KEV Catalog",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical path traversal vulnerability, CVE-2025-8110, in the Gogs self-hosted Git service to its Known Exploited Vulnerabilities (KEV) catalog. This flaw, which allows for remote code execution (RCE) via symlink manipulation, is confirmed to be actively exploited in the wild. With a CVSS score of 8.7, it bypasses a previous patch for CVE-2024-55947. Federal agencies are mandated to remediate by February 2, 2026. The vulnerability affects an estimated 1,600 internet-exposed Gogs servers, posing a significant risk to organizations using the platform for source code management.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "Git",
            "KEV",
            "Path Traversal",
            "RCE",
            "Source Code Management",
            "Symlink"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z",
          "cves": [
            "CVE-2024-55947",
            "CVE-2025-8110"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "ransomware-tactics-evolve-amid-declining-profits-2026",
        "originalHeadline": "Ransomware Evolves: Groups Recruit Insiders, Add DDoS as Profits Fall",
        "updateTitle": "Update: Ransomware Evolves: Groups Recruit Insiders, Add DDoS as Profits Fall",
        "updateSummary": "Ransomware groups increasingly favor 'extortion-only' attacks, abandoning encryption for silent data theft, bypassing traditional backups.",
        "categories": [
          "Threat Intelligence",
          "Ransomware",
          "Threat Actor"
        ],
        "tags": [
          "Cybercrime",
          "DDoS",
          "Insider Threat",
          "RaaS",
          "Ransomware",
          "Threat Intelligence"
        ],
        "severity": "informational",
        "publishedAt": "2026-01-05T15:00:00.000Z",
        "updatedAt": "2026-01-14T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}