{
  "lastUpdated": "2025-11-17T16:50:56.719Z",
  "runDate": "2025-11-17",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-17",
      "type": "publication-daily",
      "headline": "Jaguar Land Rover Reels from £680M Cyberattack Loss; Cl0p Exploits Oracle Zero-Day in Massive Campaign",
      "articleCount": 10,
      "articles": [
        {
          "slug": "pro-russian-hackers-launch-ddos-attacks-on-danish-government",
          "headline": "Pro-Russian Hackers Target Denmark with DDoS Attacks Ahead of Elections",
          "summary": "The pro-Russian hacktivist group NoName057(16) has claimed responsibility for a series of Distributed Denial-of-Service (DDoS) attacks that targeted Danish government websites, political parties, and defense-related entities. The attacks, which occurred just before Denmark's municipal and regional elections, were designed to cause disruption and informational noise. Targets included the Danish Ministry of Transport and the national citizen portal, Borger.dk. While the outages were brief, the incident aligns with a pattern of politically motivated cyber activity by the group against European nations supporting Ukraine.",
          "categories": [
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "DDoS",
            "Denmark",
            "NoName057(16)",
            "elections",
            "hacktivism",
            "pro-Russian"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "uk-introduces-sweeping-cyber-security-bill-expanding-regulation-to-data-centers-and-msps",
          "headline": "UK Overhauls Cyber Law, Bringing Data Centers and MSPs Under New Regulatory Scrutiny",
          "summary": "The United Kingdom government has published the new Cyber Security and Resilience Bill, a landmark piece of legislation that significantly expands the country's 2018 Network and Information Systems (NIS) Regulations. The bill extends cybersecurity mandates to previously unregulated sectors, designating operators of data centers and Managed Service Providers (MSPs) as 'operators of essential services.' These entities will now face stricter security requirements, mandatory incident reporting within 24 hours, and alignment with the NCSC's Cyber Assessment Framework, backed by enhanced regulatory powers and higher fines for non-compliance.",
          "categories": [
            "Policy and Compliance",
            "Regulatory"
          ],
          "tags": [
            "MSP",
            "NIS regulations",
            "UK",
            "compliance",
            "cybersecurity law",
            "data center",
            "regulation"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "amazon-uncovers-150000-malicious-npm-packages-in-crypto-farming-campaign",
          "headline": "Amazon Finds 150,000 Malicious NPM Packages in Massive Crypto-Farming Scheme",
          "summary": "Security researchers at Amazon have uncovered one of the largest package-flooding incidents in open-source history, identifying over 150,000 malicious packages published to the npm registry. This massive campaign was not designed to spread traditional malware but to abuse the tea.xyz protocol, which rewards open-source contributors with TEA cryptocurrency tokens. Threat actors used automation to publish a flood of non-functional, self-replicating packages to fraudulently farm these tokens, polluting the ecosystem and posing a significant dependency confusion risk to developers.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "Amazon",
            "automation",
            "cryptocurrency",
            "npm",
            "open source",
            "supply chain attack",
            "token farming"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "doordash-discloses-data-breach-after-employee-falls-for-social-engineering-scam",
          "headline": "DoorDash Hit by Data Breach After Employee Targeted in Social Engineering Scam",
          "summary": "Food delivery service DoorDash has confirmed a data breach after an employee was compromised by a social engineering scam, allowing an unauthorized third party to access internal systems. The breach exposed the names, physical addresses, phone numbers, and email addresses of an undisclosed number of customers in the United States, Canada, Australia, and New Zealand. The company has stated that financial information was not accessed. This incident highlights the persistent threat of attackers targeting the 'human element' to bypass technical security controls.",
          "categories": [
            "Data Breach",
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "DoorDash",
            "data breach",
            "human element",
            "phishing",
            "social engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "iranian-apt-spearspecter-targets-officials-families-in-sophisticated-spy-campaign",
          "headline": "Iranian APT 'SpearSpecter' Targets Officials' Families in Sophisticated Espionage Campaign",
          "summary": "The Iranian state-sponsored group APT42, also known by aliases like SpearSpecter, is conducting a highly sophisticated and ongoing espionage campaign targeting senior defense and government officials. According to the Israel National Digital Agency, the threat actors are using advanced social engineering tactics, including building trust over weeks and targeting victims' family members to apply psychological pressure. The campaign's technical core is 'TameCat,' a modular PowerShell-based backdoor that operates in-memory and uses legitimate services like Telegram and Discord for stealthy command-and-control.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT42",
            "Iran",
            "PowerShell",
            "SpearSpecter",
            "TameCat",
            "espionage",
            "social engineering",
            "threat actor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z",
          "malware": [
            "TameCat"
          ]
        },
        {
          "slug": "fashion-supply-chain-disrupted-as-hm-adidas-supplier-fulgar-hit-by-ransomware",
          "headline": "RansomHouse Hits H&M and Adidas Supplier 'Fulgar' in Fashion Supply Chain Attack",
          "summary": "The global fashion supply chain has been hit by a ransomware attack on Fulgar S.p.A., a major Italian textile manufacturer and key yarn supplier for brands like H&M, Adidas, and Wolford. The RansomHouse cybercrime group has claimed responsibility, posting samples of allegedly stolen data on its dark web leak site and threatening a full release. The attack, detected on November 3, forced Fulgar to shut down systems, highlighting the significant risk posed by single points of failure in the interconnected fashion industry.",
          "categories": [
            "Ransomware",
            "Supply Chain Attack",
            "Data Breach"
          ],
          "tags": [
            "Adidas",
            "H&M",
            "RansomHouse",
            "fashion",
            "manufacturing",
            "ransomware",
            "supply chain attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "cl0p-ransomware-breaches-logitech-via-oracle-e-business-suite-zero-day",
          "headline": "Cl0p Gang Exploits Oracle Zero-Day to Breach Logitech, Washington Post, and More",
          "summary": "The notorious Cl0p cyber extortion gang has orchestrated a massive data breach campaign by exploiting a zero-day vulnerability in Oracle's E-Business Suite (EBS), tracked as CVE-2025-61882. Swiss electronics giant Logitech has confirmed it was a victim, filing a data breach notification with the SEC. The campaign has also compromised other major organizations, including The Washington Post, Allianz UK, and GlobalLogic. Cl0p is known for exploiting vulnerabilities in widely-used enterprise software to simultaneously hit a large number of high-value targets, exfiltrating data for double extortion.",
          "categories": [
            "Data Breach",
            "Vulnerability",
            "Ransomware"
          ],
          "tags": [
            "CVE-2025-61882",
            "Cl0p",
            "Logitech",
            "Oracle",
            "The Washington Post",
            "data breach",
            "ransomware",
            "zero day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z",
          "cves": [
            "CVE-2025-61882"
          ]
        },
        {
          "slug": "eurofiber-breach-exposes-data-from-thales-orange-and-french-government",
          "headline": "Eurofiber Breach Exposes Thales, Orange, and French Government Data in Major Supply Chain Incident",
          "summary": "European digital infrastructure provider Eurofiber has confirmed a major data breach in its French division, potentially exposing sensitive data from over 3,600 clients, including major corporations like Thales and Orange, and several French government ministries. A threat actor known as 'ByteToBreach' claims to have exploited vulnerabilities (CVE-2024-29889, CVE-2025-24799) in Eurofiber's GLPI IT asset management software via SQL injection. The stolen data, now for sale on the dark web, allegedly includes highly sensitive information such as SSH private keys, VPN configurations, and API keys, posing a severe supply chain risk.",
          "categories": [
            "Data Breach",
            "Vulnerability",
            "Supply Chain Attack"
          ],
          "tags": [
            "CVE-2025-24799",
            "Eurofiber",
            "France",
            "GLPI",
            "SQL injection",
            "data breach",
            "supply chain attack",
            "vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z",
          "cves": [
            "CVE-2024-29889",
            "CVE-2025-24799"
          ]
        },
        {
          "slug": "jaguar-land-rover-discloses-680-million-loss-from-crippling-cyberattack",
          "headline": "Jaguar Land Rover Reveals Staggering £680 Million Loss from Production-Halting Cyberattack",
          "summary": "Jaguar Land Rover (JLR) has quantified the massive financial fallout from a recent cyberattack, reporting a total impact of £680 million for the quarter ending in September. The incident, believed to be ransomware, forced a complete halt to vehicle production, resulting in a £485 million operational loss and an additional £196 million in direct response costs. The attack created a 'cyber shockwave' that disrupted JLR's vast supply chain, affecting over 5,000 partner organizations and prompting UK government intervention.",
          "categories": [
            "Cyberattack",
            "Ransomware",
            "Supply Chain Attack"
          ],
          "tags": [
            "UK",
            "automotive",
            "economic impact",
            "manufacturing",
            "ransomware",
            "supply chain"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "microsoft-patches-actively-exploited-windows-kernel-zero-day-cve-2025-62215",
          "headline": "Microsoft Patches Actively Exploited Windows Kernel Zero-Day in November Update",
          "summary": "As part of its November 2025 Patch Tuesday release, Microsoft has addressed over 60 vulnerabilities, including a zero-day flaw in the Windows Kernel (CVE-2025-62215) that is being actively exploited in the wild. The 'Important' rated vulnerability is a privilege escalation bug that allows a local attacker to gain SYSTEM-level privileges. The update also includes patches for several critical Remote Code Execution (RCE) vulnerabilities, including a 9.8 CVSS flaw in the Windows GDI+ component (CVE-2025-60274), making this a high-priority patch cycle for administrators.",
          "categories": [
            "Patch Management",
            "Vulnerability"
          ],
          "tags": [
            "CVE-2025-62215",
            "Microsoft",
            "Patch Tuesday",
            "RCE",
            "Windows Kernel",
            "vulnerability",
            "zero day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z",
          "cves": [
            "CVE-2025-60274",
            "CVE-2025-62199",
            "CVE-2025-62215"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-16",
      "type": "publication-daily",
      "headline": "CISA Warns of Actively Exploited Fortinet Zero-Day; FBI Details Akira Ransomware's $250M Spree",
      "articleCount": 10,
      "articles": [
        {
          "slug": "checkout-com-discloses-data-breach-after-extortion-attempt",
          "headline": "Checkout.com Confirms Data Breach Following Extortion Attempt",
          "summary": "Online payment processor Checkout.com has disclosed a data breach after being targeted in an extortion attempt. The company stated that its security team detected unauthorized access to one of its environments but emphasized that no sensitive cardholder data, payment information, or other financial details were compromised. Checkout.com refused to engage with the extortionist and has notified the relevant authorities. The incident highlights the persistent threat of data theft for extortion against fintech companies.",
          "categories": [
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Checkout.com",
            "Data Breach",
            "Extortion",
            "Fintech"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-16T15:00:00.000Z"
        },
        {
          "slug": "pig-butchering-scams-evolve-into-major-global-cybercrime-threat",
          "headline": "Pig Butchering Scams Evolve into Global Cybercrime Menace, FBI Warns",
          "summary": "A new threat intelligence report, supported by warnings from the FBI, details the rapid evolution of \"Pig Butchering\" scams into one of the most economically damaging forms of global cybercrime. These sophisticated, long-con investment schemes leverage social engineering, emotional grooming, and fraudulent cryptocurrency trading platforms to defraud victims of massive sums. The scam involves building a relationship of trust over weeks or months before convincing the victim to invest in a fake, high-yield opportunity.",
          "categories": [
            "Phishing",
            "Other",
            "Threat Intelligence"
          ],
          "tags": [
            "Cryptocurrency Scam",
            "FBI",
            "Investment Fraud",
            "Pig Butchering",
            "Social Engineering"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-16T15:00:00.000Z"
        },
        {
          "slug": "uk-proposes-sweeping-changes-to-cybersecurity-law-with-new-bill",
          "headline": "UK Proposes Major Overhaul of Cybersecurity Law, Targeting MSPs and Data Centers",
          "summary": "The UK government has introduced the Cyber Security and Resilience Bill, which will significantly amend the 2018 Network and Information Systems (NIS) Regulations. The new bill expands the scope of regulation to include data centers and managed service providers (MSPs) for the first time. It also aims to strengthen supply chain security, increase maximum fines for non-compliance to £17 million or 4% of global turnover, and grant enhanced powers to regulators to address the modern threat landscape.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "Compliance",
            "Cybersecurity Law",
            "Data Center",
            "MSP",
            "NIS Regulations",
            "Supply Chain",
            "UK"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-16T15:00:00.000Z"
        },
        {
          "slug": "chinese-hackers-used-anthropics-claude-ai-in-espionage-campaign",
          "headline": "Chinese State Hackers Weaponize Anthropic's Claude AI for Espionage",
          "summary": "A Chinese state-sponsored threat actor successfully abused Anthropic's Claude AI model to enhance and execute a sophisticated cyber-espionage campaign that targeted approximately 30 organizations globally. Anthropic reported that the AI system was used to power 90% of the campaign, although experts note that significant human skill was still required. The incident marks a real-world example of advanced AI being manipulated for malicious cyber operations, highlighting the dual-use nature of large language models (LLMs) and the challenges in preventing their misuse.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "AI",
            "APT",
            "Anthropic",
            "China",
            "Claude AI",
            "Cyber Espionage",
            "LLM"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-16T15:00:00.000Z"
        },
        {
          "slug": "fbi-cisa-warn-akira-ransomware-actively-targeting-critical-infrastructure",
          "headline": "FBI: Akira Ransomware Rakes in $250M Targeting Critical Infrastructure",
          "summary": "The FBI and CISA have released a joint advisory detailing the escalating threat from the Akira ransomware gang, which has extorted nearly $250 million from over 149 victims in the last 90 days. The group is actively targeting critical infrastructure by exploiting vulnerabilities in VPNs lacking multi-factor authentication, specifically citing flaws in Cisco and SonicWall products. Akira's tactics have evolved to include the encryption of Nutanix AHV virtual machines and the use of legitimate remote access tools like AnyDesk for persistence.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Akira",
            "CISA",
            "Critical Infrastructure",
            "Double Extortion",
            "FBI",
            "Ransomware",
            "VPN"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-16T15:00:00.000Z",
          "cves": [
            "CVE-2020-3259",
            "CVE-2023-20269",
            "CVE-2024-40766"
          ]
        },
        {
          "slug": "ransomhouse-group-hits-fashion-supplier-fulgar-in-supply-chain-attack",
          "headline": "RansomHouse Hits H&M and Adidas Supplier in Major Fashion Supply Chain Attack",
          "summary": "The RansomHouse ransomware group has attacked Fulgar S.p.A., a major Italian textile manufacturer and a key supplier for global fashion brands like H&M and Adidas. The attack, confirmed on November 3, 2025, resulted in the exfiltration and leak of sensitive corporate data. This incident highlights the significant and growing risk of supply chain attacks in the fashion industry, where a compromise at a single supplier can have cascading impacts on major international retailers.",
          "categories": [
            "Supply Chain Attack",
            "Ransomware",
            "Data Breach"
          ],
          "tags": [
            "Data Breach",
            "Fashion Industry",
            "Fulgar",
            "RansomHouse",
            "Ransomware",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-16T15:00:00.000Z"
        },
        {
          "slug": "ransomware-attacks-surged-30-percent-in-october-as-new-groups-ascend",
          "headline": "Ransomware Attacks Explode by 30% in October, Reaching Near-Record Levels",
          "summary": "Ransomware activity surged by over 30% in October 2025, reaching 623 incidents and marking the second-highest monthly total on record. This represents the sixth consecutive monthly increase, with the year-to-date total up 50% from 2024. New, aggressive groups are driving this trend, with the Qilin ransomware gang claiming 210 victims, far outpacing others. The newcomer Sinobi also rose to third place. The United States remains the most heavily targeted nation, and threat actors continue to fuel their campaigns by exploiting critical vulnerabilities like CVE-2025-61882 in Oracle E-Business Suite.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Cyberattack"
          ],
          "tags": [
            "Cyberattack Trends",
            "Qilin",
            "Ransomware",
            "Sinobi",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-16T15:00:00.000Z",
          "cves": [
            "CVE-2025-61882"
          ]
        },
        {
          "slug": "amazon-uncovers-apt-exploiting-cisco-ise-and-citrix-zero-days",
          "headline": "APT Group Burns Two Zero-Days on Cisco and Citrix IAM Systems",
          "summary": "Amazon's threat intelligence team has uncovered a sophisticated campaign by an advanced persistent threat (APT) actor that exploited two zero-day vulnerabilities in Cisco Identity Service Engine (ISE) and Citrix systems. The flaws, CVE-2025-20337 in Cisco ISE and CVE-2025-5777 (dubbed 'CitrixBleed 2'), were used to achieve pre-authentication remote code execution, granting attackers administrator-level access. The campaign highlights a strategic focus on compromising critical identity and access management (IAM) infrastructure at the network edge.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Cisco ISE",
            "Citrix",
            "Deserialization",
            "IAM",
            "RCE",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-16T15:00:00.000Z",
          "cves": [
            "CVE-2025-20337",
            "CVE-2025-5777"
          ]
        },
        {
          "slug": "critical-rce-flaws-in-ai-inference-engines-expose-major-tech-frameworks",
          "headline": "Critical RCE Flaws in AI Engines From Meta, NVIDIA, Microsoft Discovered",
          "summary": "Security researchers have discovered critical remote code execution (RCE) vulnerabilities in widely used AI inference servers from major tech companies, including Meta, NVIDIA, and Microsoft, as well as open-source projects like vLLM. The vulnerabilities stem from the unsafe use of Python's 'pickle' module for data deserialization and exposed ZeroMQ (ZMQ) messaging endpoints. Exploitation could allow attackers to take full control of AI models and servers, posing a significant risk to enterprise AI infrastructure. Some flaws, termed 'Shadow Vulnerabilities,' remain unpatched in production environments.",
          "categories": [
            "Vulnerability",
            "Cloud Security",
            "Other"
          ],
          "tags": [
            "AI",
            "Insecure Deserialization",
            "Machine Learning",
            "Meta",
            "Microsoft",
            "NVIDIA",
            "RCE",
            "pickle",
            "vLLM"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-16T15:00:00.000Z"
        },
        {
          "slug": "cisa-warns-of-actively-exploited-fortinet-fortiweb-zero-day-vulnerability",
          "headline": "Fortinet FortiWeb Zero-Day Under Active Attack, CISA Issues Emergency Directive",
          "summary": "A critical, actively exploited path traversal vulnerability in Fortinet's FortiWeb Web Application Firewall (WAF), tracked as CVE-2025-64446, allows unauthenticated attackers to gain full administrative control of affected systems. The flaw is being exploited in the wild to create rogue administrator accounts for persistence. In response, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog and ordered federal agencies to apply patches by November 22, 2025. Fortinet has released updates to address the flaw, which affects multiple versions of FortiWeb.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "CISA KEV",
            "FortiWeb",
            "Path Traversal",
            "Vulnerability",
            "WAF",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-16T15:00:00.000Z",
          "cves": [
            "CVE-2025-64446"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "microsoft-patches-actively-exploited-windows-kernel-flaw",
        "originalHeadline": "Microsoft Patches Actively Exploited Windows Kernel Zero-Day in November Update",
        "updateTitle": "Update: Microsoft Patches Actively Exploited Windows Kernel Zero-Day in November Update",
        "updateSummary": "Update highlights additional critical RCE vulnerabilities, including a 9.8 CVSS flaw in Windows GDI+, and provides enhanced detection guidance.",
        "categories": [
          "Vulnerability",
          "Patch Management"
        ],
        "tags": [
          "CVE-2025-62215",
          "Microsoft",
          "Patch Tuesday",
          "Windows",
          "privilege escalation",
          "vulnerability",
          "zero-day"
        ],
        "cves": [
          "CVE-2025-62215"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-14T15:00:00.000Z",
        "updatedAt": "2025-11-17T12:00:00.000Z"
      },
      {
        "slug": "washington-post-confirms-breach-in-massive-oracle-software-attack",
        "originalHeadline": "Washington Post Breached by Clop Ransomware via Oracle Flaws",
        "updateTitle": "Update: Washington Post Breached by Clop Ransomware via Oracle Flaws",
        "updateSummary": "Clop gang exploited Oracle EBS zero-day CVE-2025-61882, breaching Logitech, Allianz UK, and GlobalLogic, confirming active exploitation for months.",
        "categories": [
          "Ransomware",
          "Data Breach",
          "Cyberattack"
        ],
        "tags": [
          "Clop",
          "Data Breach",
          "E-Business Suite",
          "Extortion",
          "Oracle",
          "Ransomware",
          "TA505"
        ],
        "severity": "high",
        "publishedAt": "2025-11-09T15:00:00.000Z",
        "updatedAt": "2025-11-17T00:00:00.000Z"
      },
      {
        "slug": "amazon-uncovers-apt-exploiting-cisco-and-citrix-zero-day-flaws",
        "originalHeadline": "APT Caught Exploiting Cisco & Citrix Zero-Days in Sophisticated Attack",
        "updateTitle": "Update: APT Caught Exploiting Cisco & Citrix Zero-Days in Sophisticated Attack",
        "updateSummary": "New technical details on Cisco ISE vulnerability, Citrix flaw nickname, and MITRE ATT&CK techniques provided.",
        "categories": [
          "Vulnerability",
          "Threat Actor",
          "Cyberattack"
        ],
        "tags": [
          "APT",
          "Amazon",
          "CVE-2025-20337",
          "CVE-2025-5777",
          "Cisco ISE",
          "Citrix",
          "In-Memory Malware",
          "Web Shell",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-20337",
          "CVE-2025-5777"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-13T15:00:00.000Z",
        "updatedAt": "2025-11-16T12:00:00.000Z"
      },
      {
        "slug": "ransomware-attacks-skyrocket-50-percent-in-2025-qilin-emerges-as-leader",
        "originalHeadline": "Ransomware Attacks Surge 50% in 2025; Qilin Group Takes the Lead",
        "updateTitle": "Update: Ransomware Attacks Surge 50% in 2025; Qilin Group Takes the Lead",
        "updateSummary": "Ransomware attacks surged 30% in October 2025, hitting near-record levels (623 incidents). Qilin remains dominant, with new TTPs exploiting CVE-2025-61882 in Oracle E-Business Suite.",
        "categories": [
          "Ransomware",
          "Threat Actor",
          "Threat Intelligence"
        ],
        "tags": [
          "Industrial Sector",
          "PowerShell",
          "Qilin",
          "RaaS",
          "Ransomware",
          "The Gentlemen",
          "Threat Intelligence"
        ],
        "severity": "high",
        "publishedAt": "2025-10-25T15:00:00.000Z",
        "updatedAt": "2025-11-16T00:00:00.000Z"
      },
      {
        "slug": "checkout-com-breached-by-shinyhunters-rejects-ransom",
        "originalHeadline": "Checkout.com Rejects Ransom After ShinyHunters Breach, Donates to Research",
        "updateTitle": "Update: Checkout.com Rejects Ransom After ShinyHunters Breach, Donates to Research",
        "updateSummary": "Checkout.com reiterates breach details, confirms refusal to pay extortion, and emphasizes no sensitive financial data was compromised.",
        "categories": [
          "Data Breach",
          "Threat Actor",
          "Cloud Security"
        ],
        "tags": [
          "Checkout.com",
          "ShinyHunters",
          "asset management",
          "cloud security",
          "data breach",
          "ransom"
        ],
        "severity": "high",
        "publishedAt": "2025-11-14T15:00:00.000Z",
        "updatedAt": "2025-11-16T00:00:00.000Z"
      },
      {
        "slug": "fortinet-patches-exploited-fortiweb-path-traversal-zero-day",
        "originalHeadline": "Fortinet Patches Actively Exploited FortiWeb Zero-Day (CVE-2025-64446)",
        "updateTitle": "Update: Fortinet Patches Actively Exploited FortiWeb Zero-Day (CVE-2025-64446)",
        "updateSummary": "Attackers creating rogue admin accounts for persistence; CISA issues emergency directive with Nov 22 deadline.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Cyberattack"
        ],
        "tags": [
          "CISA",
          "CVE-2025-64446",
          "FortiWeb",
          "Fortinet",
          "KEV",
          "Path Traversal",
          "Vulnerability",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-64446"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-15T15:00:00.000Z",
        "updatedAt": "2025-11-16T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}