{
  "lastUpdated": "2025-12-16T14:01:30.323Z",
  "runDate": "2025-12-16",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-12-16",
      "type": "publication-daily",
      "headline": "Massive Financial Breaches Expose 18M+; Apple & Google Patch Actively Exploited Zero-Days",
      "articleCount": 10,
      "articles": [
        {
          "slug": "financial-data-breaches-at-700credit-and-prosper-expose-18-million",
          "headline": "18 Million+ Records Exposed in Massive Breaches at 700Credit and Prosper Marketplace",
          "summary": "Two severe data breaches in the financial and automotive sectors have compromised the personal and financial data of over 18 million people. Fintech company Prosper Marketplace reported a breach affecting 13 million individuals, exposing Social Security numbers, bank details, and passport information after attackers accessed its databases between June and August 2025. Separately, auto-dealership service provider 700Credit disclosed that a supply-chain attack via a third-party partner exposed names, addresses, and Social Security numbers of 5.8 million people. The 700Credit breach stemmed from a vulnerable API that was exploited over a two-week period. Both companies are now notifying affected individuals and offering credit monitoring services.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Regulatory"
          ],
          "tags": [
            "API Security",
            "Data Breach",
            "Financial Services",
            "Identity Theft",
            "PII",
            "SSN",
            "Supply Chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-16T15:00:00.000Z"
        },
        {
          "slug": "akira-ransomware-hits-fieldtex-exposing-data-of-238k",
          "headline": "Akira Ransomware Claims Attack on Medical Supplier Fieldtex, Breaching Data of 238,000",
          "summary": "U.S. medical supply company Fieldtex Products has reported a data breach impacting 238,615 individuals after its network was compromised in August 2025. The notorious Akira ransomware group has claimed responsibility for the attack, asserting it stole 14 GB of sensitive corporate data, including employee, customer, and financial records. The exposed personal information includes names, dates of birth, health insurance member IDs, and health plan details. The incident, reported to the U.S. Department of Health and Human Services, underscores the persistent threat of ransomware targeting the healthcare sector and its supply chain.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Akira",
            "Data Breach",
            "Double Extortion",
            "HIPAA",
            "Healthcare",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-16T15:00:00.000Z",
          "malware": [
            "Mimikatz"
          ]
        },
        {
          "slug": "pystorerat-malware-targets-developers-via-fake-github-repos",
          "headline": "New 'PyStoreRAT' Malware Spreads Via Fake OSINT and AI Tools on GitHub",
          "summary": "A new malware campaign is distributing an information-stealing Remote Access Trojan (RAT) called 'PyStoreRAT' through fake GitHub repositories. Threat actors create repositories for what appear to be legitimate OSINT, AI, or DeFi tools, artificially inflating their popularity with fake stars and forks. After gaining a user's trust, the attackers push a malicious update containing PyStoreRAT. The malware is designed to evade detection, establish persistence, and steal sensitive data, with a particular focus on cryptocurrency wallets. It can also download secondary payloads like the Rhadamanthys infostealer and propagates via USB drives, posing a significant threat to developers and security researchers.",
          "categories": [
            "Malware",
            "Supply Chain Attack",
            "Threat Intelligence"
          ],
          "tags": [
            "Cryptocurrency",
            "Developer",
            "GitHub",
            "InfoStealer",
            "Malware",
            "PyStoreRAT",
            "Rhadamanthys",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-16T15:00:00.000Z",
          "malware": [
            "PyStoreRAT",
            "Rhadamanthys"
          ]
        },
        {
          "slug": "pro-russian-hacktivist-group-noname05716-intensifies-ddos-attacks",
          "headline": "Pro-Russian Hacktivists NoName057(16) Escalate DDoS Attacks Against NATO-Aligned Nations",
          "summary": "The pro-Russian hacktivist group NoName057(16) is escalating its distributed denial-of-service (DDoS) campaign against organizations in European countries that support Ukraine. The group targets government, logistics, and telecommunications sectors. Their operations are powered by the 'DDoSia Project,' a crowdsourced botnet of volunteers who are paid in cryptocurrency for participating in attacks. The group, believed to have links to Russian state entities, uses a resilient two-tiered command-and-control infrastructure, making it difficult to disrupt. Despite law enforcement efforts, NoName057(16) remains a persistent threat, conducting politically motivated cyber operations to support Russian interests.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "DDoS",
            "DDoSia",
            "Hacktivism",
            "NATO",
            "NoName057(16)",
            "Russia",
            "Threat Actor",
            "Ukraine"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-16T15:00:00.000Z",
          "malware": [
            "DDoSia"
          ]
        },
        {
          "slug": "new-dos-and-info-leak-vulnerabilities-in-react-server-components",
          "headline": "React Server Components Hit with New DoS and Information Leak Flaws After 'React2Shell' Patch",
          "summary": "Following the recent patch for the critical 'React2Shell' RCE flaw, three new vulnerabilities have been discovered in React Server Components (RSC). Two of the flaws, CVE-2025-55184 and CVE-2025-67779, are high-severity Denial-of-Service (DoS) vulnerabilities (CVSS 7.5) that can crash a server with a single malicious HTTP request. The third, CVE-2025-55183, is a medium-severity information disclosure flaw (CVSS 5.3) that could allow an attacker to retrieve server-side source code, potentially exposing hardcoded secrets. The React team has released new updates to address these issues, urging developers to upgrade their packages immediately amidst heightened scrutiny of the RSC architecture.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cloud Security"
          ],
          "tags": [
            "CVE-2025-55183",
            "CVE-2025-55184",
            "DoS",
            "Information Disclosure",
            "React",
            "React Server Components",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-16T15:00:00.000Z",
          "cves": [
            "CVE-2025-55183",
            "CVE-2025-55184",
            "CVE-2025-67779"
          ]
        },
        {
          "slug": "soundcloud-and-pornhub-disclose-user-data-breaches",
          "headline": "SoundCloud and Pornhub Confirm User Data Exposure in Separate Breaches, One Via Third-Party",
          "summary": "Both SoundCloud and Pornhub have confirmed security incidents exposing user data. SoundCloud suffered a direct breach of an ancillary service dashboard, resulting in the exfiltration of email addresses and public profile information for up to 28 million users (20% of its user base). The company states passwords and financial data were not affected. Separately, Pornhub announced that historical analytics data of some Premium members was exposed due to a breach at its former third-party analytics vendor, Mixpanel. The notorious hacking group ShinyHunters has claimed the Mixpanel breach and is attempting to extort Pornhub, alleging they stole a massive database of user search and watch history.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Threat Actor"
          ],
          "tags": [
            "DDoS",
            "Data Breach",
            "Extortion",
            "Mixpanel",
            "Pornhub",
            "ShinyHunters",
            "SoundCloud",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-16T15:00:00.000Z"
        },
        {
          "slug": "fortinet-sso-bypass-vulnerabilities-under-active-attack",
          "headline": "Active Attacks Exploit Critical Fortinet SSO Bypass Flaws to Gain Admin Access",
          "summary": "Security firm Arctic Wolf has observed active exploitation of two critical authentication bypass vulnerabilities in Fortinet products, CVE-2025-59718 and CVE-2025-59719. Both flaws, rated 9.1 in severity, allow an unauthenticated attacker to bypass FortiCloud single sign-on (SSO) by forging a SAML message, granting them administrative access to affected devices. The attacks, observed since December 12, 2025, target the default 'admin' account. The vulnerability is present if the FortiCloud SSO feature is enabled, which can be activated automatically when registering a device. Patches are available, and administrators are urged to upgrade immediately or disable the vulnerable SSO feature.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "Active Exploitation",
            "Authentication Bypass",
            "CVE-2025-59718",
            "CVE-2025-59719",
            "Cyberattack",
            "Fortinet",
            "SAML",
            "SSO"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-16T15:00:00.000Z",
          "cves": [
            "CVE-2025-59718",
            "CVE-2025-59719"
          ]
        },
        {
          "slug": "cisa-orders-patch-for-actively-exploited-geoserver-xxe-vulnerability",
          "headline": "CISA Orders Federal Agencies to Patch Actively Exploited Critical GeoServer XXE Flaw",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical XML External Entity (XXE) injection vulnerability in OSGeo GeoServer, CVE-2025-58360, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, which has a CVSS score up to 9.8, allows an unauthenticated remote attacker to read arbitrary files, perform Server-Side Request Forgery (SSRF) attacks, or cause a denial-of-service. Due to evidence of active exploitation, CISA has mandated that all Federal Civilian Executive Branch agencies patch the vulnerability by January 1, 2026. All organizations using the popular open-source geospatial data server are strongly urged to apply the available updates immediately.",
          "categories": [
            "Vulnerability",
            "Threat Intelligence",
            "Regulatory"
          ],
          "tags": [
            "CISA",
            "CVE-2025-58360",
            "GeoServer",
            "KEV",
            "Patch Management",
            "SSRF",
            "Vulnerability",
            "XXE"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-16T15:00:00.000Z",
          "cves": [
            "CVE-2025-58360"
          ]
        },
        {
          "slug": "critical-authentication-bypass-and-rce-flaws-patched-in-freepbx",
          "headline": "FreePBX Patches Critical Auth Bypass and RCE Flaws; Update VoIP Platforms Immediately",
          "summary": "The popular open-source VoIP platform FreePBX has been updated to fix several serious security vulnerabilities, including a critical authentication bypass (CVE-2025-66039) with a 9.3 CVSS score. This flaw, present in a non-default configuration, allows an attacker to bypass the admin login and potentially achieve remote code execution. Other patched high-severity issues include multiple authenticated SQL injection flaws (CVE-2025-61675) and an arbitrary file upload bug (CVE-2025-61678). These could be chained to upload a web shell and take full control of the server. Administrators are urged to update their FreePBX instances to the latest versions to mitigate these risks.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Industrial Control Systems"
          ],
          "tags": [
            "Authentication Bypass",
            "CVE-2025-66039",
            "FreePBX",
            "RCE",
            "SQL Injection",
            "VoIP",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-16T15:00:00.000Z",
          "cves": [
            "CVE-2025-61675",
            "CVE-2025-61678",
            "CVE-2025-66039"
          ]
        },
        {
          "slug": "apple-google-patch-actively-exploited-webkit-zero-day-flaws",
          "headline": "URGENT: Apple and Google Patch Actively Exploited WebKit Zero-Days Used in Sophisticated Attacks",
          "summary": "Apple and Google have issued urgent security updates to address two critical zero-day vulnerabilities in the WebKit browser engine, identified as CVE-2025-43529 and CVE-2025-14174. Both flaws are being actively exploited in the wild, with Apple describing the attacks as \"extremely sophisticated\" and targeting specific individuals. The vulnerabilities, which include a use-after-free and a memory corruption issue, could allow attackers to achieve arbitrary code execution simply by tricking a user into visiting a malicious website. The flaws affect a vast range of products, including iPhones, iPads, Macs, and Google Chrome on Mac. CISA has added CVE-2025-14174 to its Known Exploited Vulnerabilities (KEV) catalog, mandating immediate patching for federal agencies.",
          "categories": [
            "Vulnerability",
            "Mobile Security",
            "Patch Management"
          ],
          "tags": [
            "Apple",
            "CVE-2025-14174",
            "CVE-2025-43529",
            "Google",
            "KEV",
            "RCE",
            "Spyware",
            "WebKit",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-16T15:00:00.000Z",
          "cves": [
            "CVE-2025-14174",
            "CVE-2025-43529"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-12-15",
      "type": "publication-daily",
      "headline": "Massive Data Breaches Expose Billions, as Critical Zero-Days in Apple and Google Products See Active Exploitation",
      "articleCount": 10,
      "articles": [
        {
          "slug": "uk-regulator-fines-lastpass-1-2-million-for-2022-data-breach",
          "headline": "LastPass Fined £1.2M by UK Regulator Over 2022 Security Failures",
          "summary": "The UK's Information Commissioner's Office (ICO) has fined password manager provider LastPass £1.2 million (approximately $1.6 million) for significant security failures that led to a major data breach in 2022. The regulator found that LastPass failed to implement adequate technical and security measures to protect its users' data. The 2022 incident resulted in a threat actor gaining unauthorized access to a backup database, which contained the data of 1.6 million UK users, including encrypted password vaults. The fine highlights the serious regulatory consequences for security companies that do not meet their data protection obligations.",
          "categories": [
            "Regulatory",
            "Data Breach",
            "Policy and Compliance"
          ],
          "tags": [
            "Data Breach",
            "Fine",
            "GDPR",
            "ICO",
            "LastPass",
            "Regulatory"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-15T15:00:00.000Z"
        },
        {
          "slug": "fintech-firm-700credit-discloses-data-breach-affecting-5-6-million",
          "headline": "700Credit Data Breach Exposes PII of 5.6 Million Individuals",
          "summary": "The U.S. fintech company 700Credit, a major provider of credit reports and data services to the automotive industry, has disclosed a data breach affecting at least 5.6 million individuals. The incident, which occurred in October 2025, resulted in an unauthorized actor gaining access to and stealing a significant amount of personally identifiable information (PII). The compromised data includes names, addresses, dates of birth, and Social Security numbers. 700Credit serves approximately 18,000 auto dealerships, and the breach involved data collected between May and October 2025. The company is providing credit monitoring services to affected individuals, and authorities are urging victims to consider credit freezes to prevent identity theft and fraud.",
          "categories": [
            "Data Breach",
            "Phishing",
            "Regulatory"
          ],
          "tags": [
            "700Credit",
            "Automotive",
            "Data Breach",
            "Fintech",
            "PII",
            "Social Security Number"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-15T15:00:00.000Z"
        },
        {
          "slug": "massive-16tb-mongodb-database-exposes-4-3-billion-professional-records",
          "headline": "Data Catastrophe: Unsecured 16TB Database Leaks 4.3 Billion Professional Records",
          "summary": "A monumental data exposure event was uncovered involving a 16-terabyte unsecured MongoDB database containing approximately 4.3 billion professional records. Discovered by security researcher Bob Diachenko, the database is believed to belong to a lead generation company and exposed a vast trove of personally identifiable information (PII), including names, emails, phone numbers, and detailed employment history scraped from sources like LinkedIn. The exposure, which was secured on November 25, 2025, presents a severe risk for global, large-scale social engineering, phishing, and credential-stuffing campaigns. The incident highlights the persistent danger of misconfigured cloud databases and the immense value such datasets provide to malicious actors for crafting highly sophisticated attacks.",
          "categories": [
            "Data Breach",
            "Cloud Security"
          ],
          "tags": [
            "Cloud Security",
            "Data Leak",
            "Lead Generation",
            "Misconfiguration",
            "MongoDB",
            "PII"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-15T15:00:00.000Z"
        },
        {
          "slug": "indian-government-confirms-gps-spoofing-at-major-airports",
          "headline": "India Confirms GPS Spoofing Attacks Targeted Seven Major Airports",
          "summary": "The Indian government has officially confirmed that a series of cyber incidents involving GPS spoofing have occurred at seven of the nation's major airports. The attacks, which targeted airports in Delhi, Mumbai, Kolkata, and Bengaluru among others, disrupted navigation data for aircraft utilizing GPS-based landing procedures. Despite the signal manipulation, government officials reported that no flights were canceled or diverted. The successful handling of the incidents was attributed to the implementation of contingency measures and robust safeguards by Air Traffic Control, which allowed for safe operations using alternative navigation aids. The events underscore the growing vulnerability of critical transportation infrastructure to cyberattacks.",
          "categories": [
            "Cyberattack",
            "Industrial Control Systems",
            "Threat Intelligence"
          ],
          "tags": [
            "ATC",
            "Aviation Security",
            "Critical Infrastructure",
            "Cyberattack",
            "GPS Spoofing",
            "India"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-15T15:00:00.000Z"
        },
        {
          "slug": "new-cross-platform-01flip-ransomware-in-rust-targets-critical-infrastructure",
          "headline": "New '01flip' Ransomware, Written in Rust, Targets Critical Infrastructure in APAC",
          "summary": "A new and stealthy cross-platform ransomware strain named \"01flip\" has been discovered targeting critical infrastructure organizations in the Asia-Pacific region. The malware is written in the Rust programming language, enabling it to be compiled for both Windows and Linux systems and enhancing its ability to evade detection. Attackers have been observed exploiting exposed services for initial access, then deploying the open-source Sliver command-and-control (C2) framework for reconnaissance and lateral movement before executing the 01flip ransomware. The campaign highlights a growing trend of threat actors using modern, memory-safe languages like Rust to develop more sophisticated and evasive malware.",
          "categories": [
            "Ransomware",
            "Malware",
            "Industrial Control Systems"
          ],
          "tags": [
            "01flip",
            "APAC",
            "Critical Infrastructure",
            "Cross-Platform",
            "Ransomware",
            "Rust",
            "Sliver C2"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-15T15:00:00.000Z",
          "malware": [
            "01flip",
            "Sliver"
          ]
        },
        {
          "slug": "new-gentlemen-ransomware-group-emerges-with-double-extortion-tactics",
          "headline": "New 'Gentlemen' Ransomware Group Deploys Advanced GPO and BYOVD Attacks",
          "summary": "A new ransomware operation, identifying itself as the \"Gentlemen\" group, has been observed conducting double-extortion attacks against corporate networks. The group employs sophisticated techniques to achieve its objectives, including the manipulation of Group Policy Objects (GPOs) for wide-scale ransomware deployment across victim networks. Additionally, the threat actor leverages the 'Bring Your Own Vulnerable Driver' (BYOVD) technique to escalate privileges and disable or bypass endpoint security solutions. The emergence of the Gentlemen group highlights the continued evolution in ransomware tactics, combining data theft with advanced defense evasion and lateral movement strategies.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "BYOVD",
            "Double Extortion",
            "GPO",
            "Gentlemen",
            "Ransomware",
            "Threat Actor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-15T15:00:00.000Z",
          "malware": [
            "Gentlemen Ransomware"
          ]
        },
        {
          "slug": "xhunt-cyber-espionage-group-resurfaces-targeting-kuwaiti-organizations",
          "headline": "xHunt Espionage Group Returns, Targeting Kuwait with New PowerShell Backdoors",
          "summary": "The cyber-espionage threat actor known as xHunt has resumed operations with a new campaign targeting organizations in Kuwait. Active since at least 2018, the group is focusing its latest attacks on the shipping, transportation, and government sectors. Researchers have observed xHunt infiltrating networks by targeting Microsoft Exchange and IIS web servers. Once inside, the group deploys a family of custom PowerShell-based backdoors, with tool names like 'Hisoka' and 'Netero' derived from the anime 'Hunter x Hunter'. The campaign's objective appears to be long-term intelligence collection and espionage, leveraging stealthy techniques to maintain persistence.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "Cyber Espionage",
            "IIS",
            "Kuwait",
            "Microsoft Exchange",
            "PowerShell",
            "Threat Actor",
            "xHunt"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-15T15:00:00.000Z",
          "malware": [
            "Hisoka",
            "Killua",
            "Netero",
            "Sakabota",
            "Snugy",
            "TriFive"
          ]
        },
        {
          "slug": "cisa-warns-of-actively-exploited-sierra-wireless-router-flaw",
          "headline": "CISA KEV Alert: Actively Exploited RCE Flaw in Sierra Wireless Routers",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a high-severity vulnerability, CVE-2018-4063, affecting Sierra Wireless AirLink routers to its Known Exploited Vulnerabilities (KEV) catalog, indicating it is under active attack. The flaw, with a CVSS score up to 9.9, is an unrestricted file upload vulnerability in the device's ACEManager interface that can be exploited by an authenticated attacker to achieve remote code execution (RCE) with root privileges. The affected devices, specifically the AirLink ES450 model, have reached end-of-support, making them a significant risk. CISA has directed federal agencies to either upgrade or decommission the vulnerable products by January 2, 2026.",
          "categories": [
            "Vulnerability",
            "Industrial Control Systems",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "CVE-2018-4063",
            "EndOfLife",
            "ICS",
            "KEV",
            "OT",
            "RCE",
            "Router",
            "Sierra Wireless"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-15T15:00:00.000Z",
          "cves": [
            "CVE-2018-4063"
          ]
        },
        {
          "slug": "atlassian-patches-critical-cvss-10-flaw-in-apache-tika-dependency",
          "headline": "CVSS 10.0: Atlassian Patches Critical RCE Flaw in Apache Tika Dependency",
          "summary": "Atlassian has issued security updates for a critical vulnerability, CVE-2025-66516, in the Apache Tika parser library, a third-party dependency used in many of its products. The flaw, which carries a perfect CVSS score of 10.0, is an XML External Entity (XXE) injection vulnerability. It can be exploited by uploading a specially crafted file, such as a PDF containing a malicious XFA, potentially leading to information disclosure, server-side request forgery (SSRF), or even remote code execution (RCE). The vulnerability affects a wide range of Atlassian's server and data center products, including Jira, Confluence, and Bamboo. Customers are urged to apply the patches immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "Apache Tika",
            "Atlassian",
            "CVE-2025-66516",
            "CVSS 10",
            "RCE",
            "Vulnerability",
            "XXE"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-15T15:00:00.000Z",
          "cves": [
            "CVE-2021-39227",
            "CVE-2022-37601",
            "CVE-2025-66516"
          ]
        },
        {
          "slug": "apple-and-google-patch-actively-exploited-webkit-and-chrome-zero-day-vulnerabilities",
          "headline": "ZERO-DAY ALERT: Apple and Google Scramble to Patch Actively Exploited Flaws",
          "summary": "Apple and Google have issued urgent security updates to address multiple zero-day vulnerabilities being actively exploited in the wild. Apple patched two flaws, CVE-2025-43529 and CVE-2025-14174, both affecting the WebKit browser engine used in iOS, macOS, and Safari. The vulnerabilities were reportedly used in highly targeted spyware attacks. Concurrently, Google patched CVE-2025-14174 in its Chrome browser, a high-severity out-of-bounds memory access flaw in the ANGLE graphics library that could lead to remote code execution. Due to evidence of active exploitation, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added CVE-2025-14174 to its Known Exploited Vulnerabilities (KEV) catalog, mandating immediate patching for federal agencies.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "Apple",
            "CISA",
            "Chrome",
            "Google",
            "KEV",
            "RCE",
            "Vulnerability",
            "WebKit",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-15T15:00:00.000Z",
          "cves": [
            "CVE-2025-14174",
            "CVE-2025-43529"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": []
  },
  "pages": {
    "updated": []
  }
}