{
  "lastUpdated": "2025-10-28T16:41:31.617Z",
  "runDate": "2025-10-28",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-10-28",
      "type": "publication-daily",
      "headline": "Actively Exploited WSUS Flaw Triggers Emergency Patch; Qilin Ransomware Becomes 2025's Top Threat",
      "articleCount": 12,
      "articles": [
        {
          "slug": "ransomware-payments-hit-historic-low-of-23-percent-in-q3-2025",
          "headline": "Ransomware Victim Payments Plummet to Record Low of 23% in Q3 2025",
          "summary": "The rate of ransomware victims paying ransoms fell to a record low of 23% in the third quarter of 2025, according to a report from Coveware. This decline is driven by two key factors: large enterprises are increasingly refusing to pay, recognizing the low utility of doing so in data exfiltration cases, and major RaaS groups like Akira and Qilin are shifting their focus to high-volume attacks on mid-market firms with smaller ransom demands. Despite the lower payment rate, the overall volume of ransomware incidents remains at an all-time high.",
          "categories": [
            "Threat Intelligence",
            "Ransomware",
            "Cyberattack"
          ],
          "tags": [
            "Akira",
            "Coveware",
            "Cybercrime",
            "Qilin",
            "Ransomware",
            "Statistics",
            "Threat Intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "us-coast-guard-receives-billions-in-funding-for-maritime-cybersecurity-overhaul",
          "headline": "U.S. Coast Guard Poised for 'Generational Change' in Maritime Cybersecurity with $25B Funding",
          "summary": "The U.S. Coast Guard (USCG) is set for a 'generational change' in maritime cybersecurity, according to an analysis by the Center for Strategic and International Studies (CSIS). Nearly $25 billion in new funding, combined with expanded regulatory authorities, will allow the USCG to comprehensively modernize its systems, implement a zero-trust architecture, and enforce new cybersecurity standards across the entire U.S. Marine Transportation System. The move signals a major strategic shift, elevating cyberspace to an operational domain on par with air, land, and sea.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Industrial Control Systems"
          ],
          "tags": [
            "CSIS",
            "Critical Infrastructure",
            "Maritime Security",
            "Policy",
            "Regulation",
            "US Coast Guard",
            "Zero Trust"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "183-million-email-credentials-exposed-through-infostealer-malware",
          "headline": "183 Million Email Credentials Exposed in Massive Infostealer Malware Leak",
          "summary": "A massive dataset containing 183 million unique email addresses and their corresponding plaintext passwords has been discovered circulating on the dark web and added to the Have I Been Pwned database. The data, dubbed the \"Synthient Stealer Log Threat Data,\" was not sourced from a breach of any single provider like Gmail, but was compiled from logs harvested by infostealer malware from millions of compromised user devices worldwide. The leak highlights the pervasive threat of infostealers and poses a severe risk of credential stuffing attacks across the internet.",
          "categories": [
            "Data Breach",
            "Malware",
            "Phishing"
          ],
          "tags": [
            "Credential Stuffing",
            "Data Leak",
            "Have I Been Pwned",
            "Infostealer",
            "MFA",
            "Password Security"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "critical-apache-tomcat-flaws-expose-servers-to-rce-and-console-manipulation",
          "headline": "Critical Apache Tomcat Flaws Expose Servers to RCE and Console Hijacking",
          "summary": "The Apache Software Foundation has released patches for two critical vulnerabilities, CVE-2025-55752 and CVE-2025-55754, affecting Apache Tomcat versions 9, 10, and 11. The most severe flaw, CVE-2025-55752, is a directory traversal bug that can be escalated to remote code execution (RCE) if non-default settings like PUT requests are enabled. The second flaw could allow for console manipulation on Windows systems. Administrators are urged to upgrade to the latest versions immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "Apache Tomcat",
            "Directory Traversal",
            "Java",
            "Patch Management",
            "RCE",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z",
          "cves": [
            "CVE-2025-55752",
            "CVE-2025-55754"
          ]
        },
        {
          "slug": "swedish-power-grid-operator-svenska-kraftnat-hit-by-everest-ransomware",
          "headline": "Everest Ransomware Hits Swedish Power Grid Operator, Steals 280GB of Data",
          "summary": "Sweden's national electricity operator, Svenska kraftnät, has confirmed a data breach following a claim by the Everest ransomware group. The attackers alleged on their dark web leak site that they had stolen 280 GB of internal data. Svenska kraftnät stated that the attack was confined to an external file transfer system and that the nation's core power grid operations and electricity supply were not affected. An investigation is underway to determine the scope of the compromised data.",
          "categories": [
            "Cyberattack",
            "Data Breach",
            "Industrial Control Systems"
          ],
          "tags": [
            "Critical Infrastructure",
            "Data Breach",
            "Energy Sector",
            "Everest",
            "ICS",
            "Ransomware",
            "Sweden"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "north-koreas-bluenoroff-apt-deploys-new-macos-malware-in-sophisticated-campaigns",
          "headline": "North Korea's BlueNoroff APT Targets macOS Users with New 'GhostCall' Malware",
          "summary": "The North Korean advanced persistent threat (APT) group BlueNoroff has been linked to two new sophisticated campaigns, 'GhostCall' and 'GhostHire,' which specifically target macOS users. According to Kaspersky, the financially motivated group, a subset of the Lazarus Group, is targeting venture capitalists and Web3 developers with fake Zoom and Microsoft Teams clients, AI-enhanced social engineering, and a new suite of malware designed to steal cryptocurrency. Victims have been identified globally, including in Japan, Italy, France, and Singapore.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Phishing"
          ],
          "tags": [
            "APT38",
            "BlueNoroff",
            "Cryptocurrency",
            "Kaspersky",
            "Lazarus Group",
            "Malware",
            "Social Engineering",
            "macOS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "active-directory-at-risk-from-over-privileged-domain-join-accounts",
          "headline": "Over-Privileged Active Directory Domain-Join Accounts Create Major Security Risk",
          "summary": "A new security analysis reveals that Active Directory (AD) domain-join accounts, even when configured according to official guidance, often inherit excessive privileges that create a reliable pathway for attackers to achieve full domain compromise. These specialized accounts, used for automated machine provisioning, can have their credentials exposed during deployment. Attackers can then abuse the account's powerful default permissions, such as object ownership and rights related to Resource-Based Constrained Delegation (RBCD), to escalate privileges and take over computer objects.",
          "categories": [
            "Security Operations",
            "Vulnerability",
            "Threat Intelligence"
          ],
          "tags": [
            "Active Directory",
            "Kerberos",
            "Misconfiguration",
            "Privilege Escalation",
            "RBCD",
            "Security Operations"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "qilin-ransomware-surges-to-become-most-prolific-threat-of-2025",
          "headline": "Qilin Ransomware Claims 700 Victims in 2025, Becoming Top Global Threat",
          "summary": "The Qilin ransomware group has dramatically escalated its activities in 2025, claiming over 700 attacks to become the year's most prolific ransomware operation. Operating a Ransomware-as-a-Service (RaaS) model, the Russia-based group has far surpassed the activity of 2024's leader, RansomHub. A significant surge in Qilin's attacks followed the shutdown of the RansomHub operation in April 2025, suggesting a migration of affiliates. Qilin aggressively targets critical infrastructure sectors worldwide, including healthcare, finance, and government, using double-extortion tactics.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Agenda",
            "AnyDesk",
            "Double Extortion",
            "Qilin",
            "RaaS",
            "Ransomware",
            "Threat Actor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z",
          "malware": [
            "RansomHub"
          ]
        },
        {
          "slug": "critical-microsoft-wsus-rce-flaw-actively-exploited-after-botched-patch",
          "headline": "Actively Exploited WSUS RCE Gets Emergency Patch After Initial Fix Fails",
          "summary": "A critical remote code execution vulnerability in Microsoft's Windows Server Update Services (WSUS), tracked as CVE-2025-59287 with a 9.8 CVSS score, is being actively exploited in the wild. The situation was exacerbated by a failed initial patch, which prompted Microsoft to release an emergency out-of-band update. The flaw allows unauthenticated attackers to achieve SYSTEM-level privileges on vulnerable servers. Due to confirmed in-the-wild attacks, CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating swift action from federal agencies.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "Deserialization",
            "KEV",
            "Patch Management",
            "RCE",
            "WSUS",
            "Windows Server",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ]
        },
        {
          "slug": "cisa-adds-critical-motex-lanscope-vulnerability-to-kev-catalog",
          "headline": "CISA Adds Actively Exploited Motex LANSCOPE RCE Flaw to KEV Catalog",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical vulnerability in Motex's LANSCOPE Endpoint Manager, CVE-2025-61932, to its Known Exploited Vulnerabilities (KEV) catalog following confirmation of active attacks. The flaw, rated 9.3 CVSS, allows for unauthenticated remote code execution on affected endpoints. Attackers have reportedly been weaponizing the vulnerability to install backdoors on victim systems, primarily observed in Japan. Federal agencies are now mandated to patch by November 12, 2025.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA",
            "Endpoint Security",
            "KEV",
            "LANSCOPE",
            "Motex",
            "RCE",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z",
          "cves": [
            "CVE-2025-61932"
          ]
        },
        {
          "slug": "cisa-issues-alert-for-critical-flaws-in-veeder-root-fuel-gauge-systems",
          "headline": "CISA Warns of Critical Flaws in Global Fuel Gauge Systems, Risking Infrastructure Disruption",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued a critical advisory for two vulnerabilities in Veeder-Root's TLS4B Automatic Tank Gauge (ATG) systems, which are used globally to monitor fuel levels. The most severe flaw, CVE-2025-58428, has a CVSS score of 9.9 and could allow a remote, authenticated attacker to execute system-level commands, potentially causing widespread disruption to fuel infrastructure. A second flaw, CVE-2025-55067, relates to the 'Year 2038' problem and could cause denial-of-service conditions.",
          "categories": [
            "Industrial Control Systems",
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "Command Injection",
            "Critical Infrastructure",
            "Energy Sector",
            "ICS",
            "OT",
            "Veeder-Root",
            "Y2038"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z",
          "cves": [
            "CVE-2025-55067",
            "CVE-2025-58428"
          ]
        },
        {
          "slug": "massive-data-breach-at-kenyan-health-platform-m-tiba-hits-millions",
          "headline": "Massive Breach at Kenyan Health Platform M-TIBA Exposes 4.8 Million Patients",
          "summary": "A threat actor named 'Kazu' has claimed responsibility for a catastrophic data breach against M-TIBA, a major mobile health platform in Kenya backed by Safaricom. The hacker alleges the theft of 2.15 terabytes of data, impacting up to 4.8 million users. The compromised information reportedly includes a vast trove of personally identifiable information (PII) and highly sensitive protected health information (PHI), such as patient diagnoses and treatment records from nearly 700 healthcare facilities. A 2GB data sample has already been leaked to substantiate the claim.",
          "categories": [
            "Data Breach",
            "Threat Actor",
            "Cloud Security"
          ],
          "tags": [
            "Dark Web",
            "Data Breach",
            "Healthcare",
            "Kazu",
            "Kenya",
            "M-TIBA",
            "PHI",
            "PII"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-10-27",
      "type": "publication-daily",
      "headline": "Microsoft Scrambles to Patch Actively Exploited WSUS Flaw as Qilin Ransomware Surges",
      "articleCount": 10,
      "articles": [
        {
          "slug": "chatgpt-atlas-browser-vulnerability-allows-memory-poisoning",
          "headline": "ChatGPT Flaw Allows 'Memory Poisoning' via CSRF Attack",
          "summary": "A novel vulnerability discovered in OpenAI's ChatGPT Atlas web browser allows attackers to perform 'memory poisoning' through a Cross-Site Request Forgery (CSRF) attack. Researchers at LayerX Security found that this flaw can be used to invisibly inject malicious instructions into ChatGPT's persistent 'Memory' feature. These instructions survive across sessions and devices, and can be triggered by a user's normal prompts to execute malicious code, potentially leading to account takeover or malware deployment.",
          "categories": [
            "Vulnerability",
            "Cloud Security"
          ],
          "tags": [
            "AI Security",
            "CSRF",
            "ChatGPT",
            "Memory Poisoning",
            "OpenAI",
            "Vulnerability"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z"
        },
        {
          "slug": "apt-c-60-intensifies-cyber-espionage-campaign-against-japan",
          "headline": "APT-C-60 Escalates 'SpyGlace' Campaign Against Japan",
          "summary": "The South Korea-aligned cyber-espionage group APT-C-60 has significantly intensified its campaign against Japanese organizations in the third quarter of 2025. According to JPCERT/CC and Cyble, the group has deployed at least three new versions of its custom 'SpyGlace' backdoor. The attackers have evolved their tactics, now attaching malicious VHDX files directly to phishing emails and abusing legitimate services like GitHub and StatCounter for stealthy command-and-control communications and malware delivery, making detection more challenging.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "APT-C-60",
            "Cyber-Espionage",
            "Japan",
            "Living off the Land",
            "SpyGlace",
            "VHDX"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z",
          "malware": [
            "SpyGlace"
          ]
        },
        {
          "slug": "data-breaches-hit-toys-r-us-askul-verisure",
          "headline": "Data Breaches Hit Toys 'R' Us Canada, Askul, and Verisure",
          "summary": "A wave of data breaches has impacted several consumer-facing companies globally. Toys \"R\" Us Canada has had customer records leaked on the dark web. Japanese retailer Askul suffered a disruptive ransomware attack that halted operations and may have resulted in a data leak. Additionally, Swedish security firm Verisure disclosed a breach affecting 35,000 customers via a third-party vendor, and U.S.-based Jewett-Cameron Trading reported the theft of financial documents.",
          "categories": [
            "Data Breach",
            "Ransomware"
          ],
          "tags": [
            "Data Breach",
            "PII",
            "Ransomware",
            "Retail",
            "Supply Chain Attack",
            "Vendor Breach"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z"
        },
        {
          "slug": "healthcare-data-breaches-affect-modmed-lifebridge-right-at-home",
          "headline": "Healthcare Sector Rocked by Breaches at ModMed, LifeBridge, and Right at Home",
          "summary": "The healthcare sector continues to be a prime target for cyberattacks, with recent data breaches announced by Electronic Health Record (EHR) provider Modernizing Medicine (ModMed), home healthcare provider Right at Home, and Baltimore-based LifeBridge Health. The incidents, which include a ransomware attack claimed by the Sinobi group and a third-party breach via Oracle Health, have exposed a vast range of sensitive Protected Health Information (PHI), including Social Security numbers, medical diagnoses, and financial data.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Regulatory"
          ],
          "tags": [
            "Data Breach",
            "HIPAA",
            "Healthcare",
            "PHI",
            "Ransomware",
            "Supply Chain Attack",
            "Vendor Breach"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z"
        },
        {
          "slug": "north-korean-lazarus-group-targets-european-defense-firms-with-new-rat",
          "headline": "Lazarus Group Targets European Defense Firms with New 'ScoringMathTea' RAT",
          "summary": "The North Korean state-sponsored threat actor, Lazarus Group, is behind a sophisticated cyber-espionage campaign targeting European defense manufacturers, with a specific focus on companies producing Unmanned Aerial Vehicles (UAVs). The attackers used social engineering tactics, including fake job offers and trojanized GitHub projects, to gain initial access. Once inside, they deployed a previously unknown Remote Access Trojan (RAT) named 'ScoringMathTea' to exfiltrate sensitive intellectual property, including proprietary drone designs.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Industrial Control Systems"
          ],
          "tags": [
            "APT",
            "Cyber-Espionage",
            "Defense Industry",
            "Lazarus",
            "North Korea",
            "RAT",
            "UAV"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z",
          "malware": [
            "ScoringMathTea"
          ]
        },
        {
          "slug": "china-linked-smishing-campaign-used-194000-domains",
          "headline": "Massive 'Smishing Triad' Campaign Used 194,000+ Domains to Harvest Data",
          "summary": "A massive smishing (SMS phishing) campaign attributed to the China-linked 'Smishing Triad' threat group has used over 194,000 malicious domains since the beginning of 2024. The operation, which escalated significantly in April, impersonates trusted entities like the US Postal Service, the IRS, banks, and toll services to trick victims into divulging sensitive personal information, including Social Security numbers. The campaign's infrastructure is designed for rapid turnover to evade detection, with many domains active for less than two days.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "China",
            "Impersonation",
            "PII",
            "SMS Phishing",
            "Smishing",
            "Social Engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z"
        },
        {
          "slug": "qilin-ransomware-attacks-skyrocket-to-700-in-2025",
          "headline": "Qilin Ransomware Attacks Skyrocket, Becoming 2025's Most Prolific Group",
          "summary": "The Russia-based Qilin ransomware group has become the most active ransomware operation of 2025, claiming 701 victims as of late October. This dramatic surge, representing a 280% increase since April, is largely attributed to the group absorbing affiliates from the defunct RansomHub operation. Qilin employs a double-extortion model, targeting critical infrastructure sectors such as manufacturing, healthcare, finance, and government, with the United States being the most heavily impacted nation. High-profile attacks have resulted in massive data theft and significant financial damages, cementing Qilin's status as a top-tier cyber threat.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Critical Infrastructure",
            "Data Leak",
            "Double Extortion",
            "RaaS",
            "Threat Actor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z"
        },
        {
          "slug": "critical-adobe-commerce-flaw-cve-2025-54236-under-active-exploitation",
          "headline": "Critical Adobe Commerce Flaw Under Active Exploitation, CISA Warns",
          "summary": "A critical improper input validation vulnerability in Adobe Commerce and Magento, tracked as CVE-2025-54236, is being actively exploited in the wild. Dubbed 'SessionReaper,' the flaw allows an unauthenticated remote attacker to hijack user sessions via the REST API, leading to potential web shell deployment and complete store takeover. CISA has added the vulnerability to its KEV catalog, and with reports suggesting over 60% of Magento stores remain unpatched, immediate action is urged for all administrators.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Data Breach"
          ],
          "tags": [
            "Adobe",
            "Improper Input Validation",
            "KEV",
            "Magento",
            "REST API",
            "Session Hijacking",
            "Web Shell"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z",
          "cves": [
            "CVE-2025-54236"
          ]
        },
        {
          "slug": "critical-google-chrome-v8-vulnerability-cve-2025-12036-allows-rce",
          "headline": "Google Rushes Patch for Critical Chrome V8 RCE Flaw",
          "summary": "Google has released an emergency security update for Google Chrome to address a critical vulnerability, CVE-2025-12036, in its V8 JavaScript engine. The flaw, described as an 'inappropriate implementation,' could allow a remote attacker to execute arbitrary code on a victim's system by convincing them to visit a malicious website. The vulnerability was discovered by Google's own AI-driven research project, leading to a rapid patch release. All users of Chrome and other Chromium-based browsers are urged to update immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "Browser Security",
            "Chrome",
            "Google",
            "RCE",
            "V8",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z",
          "cves": [
            "CVE-2025-12036"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-critical-wsus-flaw-cve-2025-59287",
          "headline": "Microsoft Scrambles to Patch Actively Exploited Critical WSUS Flaw",
          "summary": "Microsoft has released an urgent, out-of-band security update for a critical remote code execution (RCE) vulnerability in Windows Server Update Services (WSUS), tracked as CVE-2025-59287. The flaw, which has a CVSS score of 9.8, is being actively exploited in the wild, allowing unauthenticated attackers to achieve complete system control with SYSTEM privileges. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating immediate patching for federal agencies and strongly urging all organizations to apply the update without delay.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "BinaryFormatter",
            "Deserialization",
            "KEV",
            "Out-of-Band Patch",
            "RCE",
            "WSUS",
            "Windows Server"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "ai-powered-phishing-emails-prove-4-5-times-more-effective-microsoft-report-finds",
        "originalHeadline": "Microsoft Report: AI-Generated Phishing Now 4.5x More Effective, Bypassing Traditional Defenses",
        "updateTitle": "Update: Microsoft Report: AI-Generated Phishing Now 4.5x More Effective, Bypassing Traditional Defenses",
        "updateSummary": "Massive leak of 183M email credentials from infostealer malware logs, now on HIBP, increasing credential stuffing risk.",
        "categories": [
          "Phishing",
          "Threat Intelligence",
          "Malware"
        ],
        "tags": [
          "AI",
          "ClickFix",
          "Identity Attack",
          "Infostealer",
          "MFA",
          "Microsoft",
          "Phishing",
          "Threat Intelligence"
        ],
        "malware": [
          "Infostealer malware"
        ],
        "severity": "high",
        "publishedAt": "2025-10-18T15:00:00.000Z",
        "updatedAt": "2025-10-28T00:00:00.000Z"
      },
      {
        "slug": "ransomware-automation-cuts-attack-timelines-to-18-minutes",
        "originalHeadline": "18 Minutes to Mayhem: Ransomware Attacks Now Fully Automated, Slashing Defender Response Time",
        "updateTitle": "Update: 18 Minutes to Mayhem: Ransomware Attacks Now Fully Automated, Slashing Defender Response Time",
        "updateSummary": "Ransomware victim payments hit record low of 23% in Q3 2025, as major RaaS groups shift to high-volume attacks on mid-market firms.",
        "categories": [
          "Ransomware",
          "Threat Actor",
          "Threat Intelligence"
        ],
        "tags": [
          "AI",
          "Automation",
          "Breakout Time",
          "Incident Response",
          "LockBit",
          "Qilin",
          "Ransomware",
          "SOAR"
        ],
        "malware": [
          "LockBit 5.0"
        ],
        "severity": "critical",
        "publishedAt": "2025-10-23T15:00:00.000Z",
        "updatedAt": "2025-10-28T00:00:00.000Z"
      },
      {
        "slug": "ransomware-attacks-skyrocket-50-percent-in-2025-qilin-emerges-as-leader",
        "originalHeadline": "Ransomware Attacks Surge 50% in 2025; Qilin Group Takes the Lead",
        "updateTitle": "Update: Ransomware Attacks Surge 50% in 2025; Qilin Group Takes the Lead",
        "updateSummary": "Qilin ransomware victim count surges to 701, fueled by RansomHub affiliates, becoming 2025's most prolific group with significant high-profile impacts.",
        "categories": [
          "Ransomware",
          "Threat Actor",
          "Threat Intelligence"
        ],
        "tags": [
          "Industrial Sector",
          "PowerShell",
          "Qilin",
          "RaaS",
          "Ransomware",
          "The Gentlemen",
          "Threat Intelligence"
        ],
        "severity": "high",
        "publishedAt": "2025-10-25T15:00:00.000Z",
        "updatedAt": "2025-10-27T12:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}