{
  "lastUpdated": "2025-10-23T17:10:16.401Z",
  "runDate": "2025-10-23",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-10-23",
      "type": "publication-daily",
      "headline": "Ransomware Automation Slashes Attack Times to Minutes; Supply Chain Overconfidence Creates Massive Risk",
      "articleCount": 10,
      "articles": [
        {
          "slug": "september-healthcare-breaches-decline-but-data-incomplete-due-to-shutdown",
          "headline": "Healthcare Breaches Seem to Drop, But Government Shutdown Hides True Numbers",
          "summary": "Official data for September 2025 shows only 26 major healthcare data breaches, the lowest monthly total since 2018. However, The HIPAA Journal cautions that this apparent decline is misleading. A US government shutdown has largely halted the HHS's Office for Civil Rights (OCR) from processing and updating its public breach portal. The 26 reported breaches affected over 1.29 million individuals, with hacking incidents accounting for 98.8% of the exposed records. Experts believe the true number of breaches for September is significantly higher and will be reflected in a surge of reports once the OCR resumes normal operations.",
          "categories": [
            "Data Breach",
            "Regulatory",
            "Policy and Compliance"
          ],
          "tags": [
            "Compliance",
            "Data Breach",
            "Government Shutdown",
            "HHS",
            "HIPAA",
            "Healthcare",
            "OCR"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "ny-dfs-issues-guidance-on-third-party-cybersecurity-risks",
          "headline": "NY Regulator Puts Financial Firms on Notice: You Are Accountable for Your Vendors' Security",
          "summary": "The New York State Department of Financial Services (DFS) has issued new guidance for financial institutions, emphasizing their ultimate accountability for managing cybersecurity risks originating from third-party service providers (TPSPs). The regulator warned that as firms increasingly rely on cloud computing, AI, and fintech solutions from vendors, their exposure to threats grows. The guidance explicitly states that boards of directors and senior officers must possess sufficient cybersecurity knowledge to oversee and challenge management's third-party risk strategies. DFS Acting Superintendent Kaitlin Asrow stressed that regulated entities cannot outsource their responsibility for protecting consumer data and ensuring operational security.",
          "categories": [
            "Regulatory",
            "Policy and Compliance",
            "Supply Chain Attack"
          ],
          "tags": [
            "Compliance",
            "Financial Services",
            "NYDFS",
            "Regulation",
            "Supply Chain",
            "Third-Party Risk Management"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "palo-alto-networks-uncovers-smishing-and-gift-card-fraud-campaigns",
          "headline": "Unit 42 Exposes 'Smishing Deluge' from China and 'Jingle Thief' Gift Card Fraud",
          "summary": "Researchers at Palo Alto Networks' Unit 42 have detailed two distinct and significant cybercrime operations. The first, a massive smishing campaign dubbed 'The Smishing Deluge,' is attributed to a China-based threat actor and is flooding mobile users globally with malicious SMS messages. The second campaign, named 'Jingle Thief,' is a sophisticated cloud-based operation focused on automating the theft and monetization of gift cards. These findings, highlighted in Unit 42's October Threat Bulletin, showcase the diverse tactics of modern criminals, from large-scale social engineering to highly targeted financial fraud.",
          "categories": [
            "Phishing",
            "Threat Intelligence",
            "Cloud Security"
          ],
          "tags": [
            "China",
            "Cloud Security",
            "Fraud",
            "Gift Card",
            "Phishing",
            "Smishing",
            "Unit 42"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "ai-powered-ransomware-surges-in-asia-pacific-australia-is-2-target",
          "headline": "AI-Fueled Ransomware Pummels Asia-Pacific; Australia Ranks as #2 Target",
          "summary": "A new report from CrowdStrike reveals that Australia is the second-most targeted nation for eCrime in the Asia-Pacific and Japan (APJ) region, trailing only India. The '2025 APJ eCrime Landscape Report' highlights a surge in ransomware attacks fueled by AI-developed malware and the industrialization of cybercrime through underground markets. From January 2024 to April 2025, 763 organizations in the APJ region were named on data leak sites. The manufacturing, technology, and financial services sectors are the most frequent victims. Emerging RaaS providers like KillSec and Funklocker are leveraging AI to launch high-velocity attacks, contributing to over 120 incidents against these high-value targets.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Threat Actor"
          ],
          "tags": [
            "AI",
            "APJ",
            "Australia",
            "CrowdStrike",
            "Funklocker",
            "KillSec",
            "Ransomware",
            "eCrime"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "cisa-adds-new-actively-exploited-vulnerability-to-kev-catalog",
          "headline": "CISA Orders Federal Agencies to Patch New Actively Exploited Vulnerability",
          "summary": "On October 22, 2025, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) added a new, unspecified vulnerability to its Known Exploited Vulnerabilities (KEV) catalog. This action confirms that the flaw is being actively exploited in the wild by malicious actors. Under Binding Operational Directive (BOD) 22-01, all Federal Civilian Executive Branch (FCEB) agencies are now required to remediate this vulnerability by a specific deadline to protect federal networks. While the CVE identifier was not immediately released, the alert serves as a critical warning to all organizations to prioritize its patching.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Regulatory"
          ],
          "tags": [
            "BOD 22-01",
            "CISA",
            "KEV",
            "Patch Management",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "overconfidence-in-supply-chain-security-poses-major-risk-ncc-group-report",
          "headline": "False Confidence: 94% of Firms Claim Supply Chain Resilience, But a Third Neglect Basic Risk Assessments",
          "summary": "A new report from NCC Group highlights a critical disconnect in enterprise security: while 94% of businesses are confident in their ability to handle a supply chain attack, 34% do not perform regular supplier risk assessments. This widespread overconfidence creates significant vulnerabilities as threat actors increasingly target less secure third-party vendors to compromise larger organizations. The research, which surveyed over 1,000 cybersecurity leaders, comes as ransomware attacks hit record highs and UK authorities report a 130% increase in nationally significant cyber incidents, many originating from the supply chain. Experts warn this misplaced trust is a primary driver of risk, enabling invoice redirection fraud, credential theft, and widespread disruption across entire business ecosystems.",
          "categories": [
            "Supply Chain Attack",
            "Policy and Compliance",
            "Threat Intelligence"
          ],
          "tags": [
            "Cyber Risk",
            "NCC Group",
            "Overconfidence",
            "Supply Chain Security",
            "Third-Party Risk Management",
            "Vendor Management"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "palomar-health-medical-group-discloses-data-breach-affecting-patients",
          "headline": "Palomar Health Breach Exposes Highly Sensitive Patient Data, Including Biometrics",
          "summary": "Palomar Health Medical Group (PHMG), a California-based healthcare provider, has announced it was the victim of a cybersecurity incident that exposed sensitive patient data. The compromised information includes not only names and personal identifiers but also highly sensitive data types such as biometric data, U.S. alien registration numbers, and financial account information. The full scope of the breach, including the number of affected patients, has not yet been disclosed. The national class action law firm Lynch Carpenter is now investigating claims against PHMG, signaling significant legal and financial fallout for the provider.",
          "categories": [
            "Data Breach",
            "Regulatory"
          ],
          "tags": [
            "Biometric Data",
            "California",
            "Data Breach",
            "HIPAA",
            "Healthcare",
            "Palomar Health"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "ransomware-automation-cuts-attack-timelines-to-18-minutes",
          "headline": "18 Minutes to Mayhem: Ransomware Attacks Now Fully Automated, Slashing Defender Response Time",
          "summary": "A new report from ReliaQuest reveals a dramatic acceleration in ransomware attacks, with the average time from initial access to lateral movement ('breakout time') plummeting to just 18 minutes. This is a significant decrease from 48 minutes in 2024, driven by the adoption of automation and AI by 80% of Ransomware-as-a-Service (RaaS) groups. The report highlights the Qilin ransomware gang as a prime example, whose platform automates key attack phases like discovery, backup deletion, and encryption. Other groups like LockBit are also integrating AI to enhance their operations, creating a hyper-competitive landscape where speed and automation are paramount. This shrinking response window poses a monumental challenge for security teams, demanding automated detection and response capabilities to counter the threat.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Threat Intelligence"
          ],
          "tags": [
            "AI",
            "Automation",
            "Breakout Time",
            "Incident Response",
            "LockBit",
            "Qilin",
            "Ransomware",
            "SOAR"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z",
          "malware": [
            "LockBit 5.0"
          ]
        },
        {
          "slug": "critical-industries-face-escalating-ransomware-threat-kela-report",
          "headline": "50% of Ransomware Attacks in 2025 Hit Critical Infrastructure, KELA Reports",
          "summary": "A new report from threat intelligence firm KELA reveals a stark trend: 50% of all ransomware attacks between January and September 2025 have targeted critical infrastructure. Sectors such as manufacturing, healthcare, energy, and transportation are bearing the brunt of a 34% year-over-year increase in attacks. The report, 'Escalating Ransomware Threats to National Security,' documented 4,701 total ransomware incidents globally in the first nine months of the year, with 2,332 of those hitting critical sectors. The United States remains the most-targeted nation, accounting for 21% of all incidents. The findings have prompted calls to treat cyber resilience as a matter of national defense.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Industrial Control Systems"
          ],
          "tags": [
            "Critical Infrastructure",
            "ICS",
            "KELA",
            "National Security",
            "OT",
            "Ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "jaguar-land-rover-hack-costs-uk-economy-1-9-billion",
          "headline": "UK's Most Costly Cyberattack: Jaguar Land Rover Hack Inflicts £1.9 Billion Economic Damage",
          "summary": "A report from the Cyber Monitoring Centre (CMC) estimates that the late August 2025 cyberattack on Jaguar Land Rover (JLR) has cost the UK economy £1.9 billion, potentially making it the most expensive cyber incident in the nation's history. The attack forced a complete shutdown of JLR's factories and offices, with full production not expected to resume until January 2026. The economic devastation cascaded through the automotive giant's supply chain, impacting an estimated 5,000 organizations and forcing smaller suppliers to lay off workers. Former NCSC head Ciaran Martin described the incident as a stark reminder of the systemic risk posed by disruptions to critical networks and supply chains.",
          "categories": [
            "Cyberattack",
            "Supply Chain Attack",
            "Industrial Control Systems"
          ],
          "tags": [
            "Cyberattack",
            "Economic Impact",
            "Jaguar Land Rover",
            "Manufacturing",
            "Supply Chain",
            "Systemic Risk",
            "UK"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-10-22",
      "type": "publication-daily",
      "headline": "Ransomware Surges, JLR Hack Costs UK £1.9B, and 'GlassWorm' Hits Developers in Widespread Attacks",
      "articleCount": 10,
      "articles": [
        {
          "slug": "76-percent-of-orgs-cant-match-speed-of-ai-powered-attacks",
          "headline": "Over 75% of Orgs Can't Keep Pace with AI-Powered Attacks, Survey Finds",
          "summary": "A new survey from CrowdStrike reveals a stark reality: 76% of global organizations admit they cannot match the speed and sophistication of AI-powered cyberattacks. The 2025 State of Ransomware Survey highlights a dangerous 'confidence illusion,' where leaders believe they are prepared, yet 78% of their organizations were attacked in the past year. With adversaries using AI to accelerate attacks, 89% of security leaders now agree that AI-powered protection is essential to close the widening security gap and defend against modern threats.",
          "categories": [
            "Threat Intelligence",
            "Ransomware",
            "Policy and Compliance"
          ],
          "tags": [
            "AI",
            "CrowdStrike",
            "artificial intelligence",
            "cybersecurity survey",
            "ransomware",
            "threat landscape"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-22T15:00:00.000Z"
        },
        {
          "slug": "uk-government-and-ncsc-urge-businesses-to-bolster-cyber-defenses",
          "headline": "UK Gov & NCSC Issue Urgent Warning to FTSE 350 Boards on Cyber Resilience",
          "summary": "The UK's National Cyber Security Centre (NCSC) and government ministers have sent a formal letter to the leaders of all FTSE 350 companies, demanding that cyber resilience be treated as a top board-level priority. The call to action follows the NCSC's latest annual review, which revealed a 50% increase in significant cyber incidents. The letter outlines three practical steps: adopt the government's Cyber Governance Code, enroll in the NCSC's Early Warning service, and mandate Cyber Essentials certification throughout supply chains.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Security Operations"
          ],
          "tags": [
            "FTSE 350",
            "NCSC",
            "UK",
            "board responsibility",
            "cyber resilience",
            "governance",
            "supply chain security"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-22T15:00:00.000Z"
        },
        {
          "slug": "ransomware-attacks-on-critical-infrastructure-surge-34-percent-in-2025",
          "headline": "Critical Infrastructure Under Siege: Ransomware Attacks Surge 34%",
          "summary": "A new report from cyber intelligence firm KELA reveals a staggering 34% year-over-year increase in ransomware attacks targeting critical industries between January and September 2025. These vital sectors, including manufacturing, healthcare, and energy, accounted for half of the 4,701 global ransomware incidents recorded. The United States was the most targeted nation, bearing the brunt of 21% of all attacks. The report identifies a handful of highly active groups, including Qilin, Clop, and Akira, as responsible for a significant portion of the incidents, highlighting a trend towards professionalization in the cybercriminal ecosystem and framing cyber resilience as a national security imperative.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Cyberattack"
          ],
          "tags": [
            "KELA",
            "critical infrastructure",
            "double extortion",
            "national security",
            "ransomware",
            "threat report"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-22T15:00:00.000Z"
        },
        {
          "slug": "iran-linked-muddywater-apt-targets-governments-with-phoenix-backdoor",
          "headline": "Iran's MuddyWater APT Targets 100+ Governments with Phoenix Backdoor",
          "summary": "The Iranian state-sponsored threat group MuddyWater is conducting a large-scale cyber-espionage campaign targeting over 100 government entities, primarily in the Middle East and North Africa (MENA). According to Group-IB, the attackers are using phishing emails sent from a compromised mailbox, leveraging the NordVPN service for anonymity. The emails contain malicious Word documents that use macros to deploy version 4 of the 'Phoenix' backdoor, a payload designed for foreign intelligence gathering. The campaign highlights the group's return to classic macro-based attack vectors.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Phishing"
          ],
          "tags": [
            "APT",
            "Iran",
            "MENA",
            "MuddyWater",
            "Phoenix",
            "cyber-espionage",
            "macros",
            "phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-22T15:00:00.000Z",
          "malware": [
            "Phoenix"
          ]
        },
        {
          "slug": "pwn2own-ireland-day-1-hackers-earn-522k-for-34-zero-days",
          "headline": "Pwn2Own Day 1: Hackers Net $522K for 34 Zero-Days in SOHO Devices",
          "summary": "The first day of Trend Micro's Pwn2Own Ireland 2025 competition was a resounding success for security researchers, who earned a total of $522,500 for demonstrating 34 unique zero-day vulnerabilities. In a stunning display, every single one of the 17 scheduled attempts against popular SOHO devices—including printers, NAS devices, and smart home products from brands like QNAP, Synology, Canon, and HP—was successful. The highlight was a complex 'SOHO Smashup' that chained eight bugs to compromise a router and a NAS device.",
          "categories": [
            "Vulnerability",
            "IoT Security",
            "Threat Intelligence"
          ],
          "tags": [
            "IoT",
            "Pwn2Own",
            "SOHO",
            "ZDI",
            "hacking",
            "vulnerability",
            "zero-day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-22T15:00:00.000Z"
        },
        {
          "slug": "major-aws-outage-in-us-east-1-disrupts-global-internet-services",
          "headline": "Widespread Chaos: AWS US-EAST-1 Outage Takes Down Global Services",
          "summary": "A major Amazon Web Services (AWS) outage originating in its largest region, US-EAST-1, caused widespread global service disruptions on October 20, 2025. The 15-hour event was triggered by a DNS resolution issue affecting the DynamoDB service, which led to a cascading failure impacting at least 113 other AWS services. The incident affected thousands of companies, including Slack, Roblox, and Venmo, generating over 16 million user outage reports and serving as a stark reminder of the risks associated with cloud service concentration and hidden dependencies.",
          "categories": [
            "Cloud Security",
            "Incident Response",
            "Security Operations"
          ],
          "tags": [
            "AWS",
            "DynamoDB",
            "US-EAST-1",
            "cloud security",
            "disaster recovery",
            "outage",
            "resilience"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-22T15:00:00.000Z"
        },
        {
          "slug": "glassworm-worm-hits-vs-code-extensions-in-sophisticated-supply-chain-attack",
          "headline": "'GlassWorm' Strikes: Novel Worm Spreads via VS Code Extensions Using Invisible Code",
          "summary": "A highly sophisticated, self-propagating worm named 'GlassWorm' is actively targeting developers through the Microsoft Visual Studio Code and OpenVSX marketplaces. Discovered by Koi Security, the malware has already compromised over 35,800 developer systems. GlassWorm uses a novel technique of hiding malicious code with invisible Unicode characters, making it undetectable in code reviews. Upon infection, it steals credentials like NPM and GitHub tokens to propagate itself to other software packages, drains cryptocurrency wallets, and establishes a resilient, decentralized command-and-control (C2) infrastructure using the Solana blockchain.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "GlassWorm",
            "Solana",
            "Unicode",
            "VS Code",
            "developer security",
            "malware",
            "supply chain attack"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-22T15:00:00.000Z",
          "malware": [
            "GlassWorm",
            "ZOMBI"
          ]
        },
        {
          "slug": "critical-zero-day-in-netty-library-allows-email-auth-bypass",
          "headline": "Critical Netty Zero-Day Bypasses All Major Email Authentication",
          "summary": "A critical zero-day vulnerability, CVE-2025-59419, has been discovered in the widely used Netty Java library, affecting countless applications that handle email. The flaw allows an unauthenticated attacker to perform SMTP injection by embedding carriage return and line feed characters into email commands. This enables them to bypass standard email authentication defenses like SPF, DKIM, and DMARC, making it possible to send highly convincing spoofed emails that appear to originate from trusted domains. A patch is available and should be applied immediately.",
          "categories": [
            "Vulnerability",
            "Phishing",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-59419",
            "Java",
            "Netty",
            "SMTP injection",
            "email security",
            "phishing",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-22T15:00:00.000Z",
          "cves": [
            "CVE-2025-59419"
          ]
        },
        {
          "slug": "jaguar-land-rover-hack-costs-uk-economy-1-9-billion",
          "headline": "JLR Hack's Staggering Cost: £1.9 Billion Hit to UK Economy",
          "summary": "The late August 2025 cyberattack on Jaguar Land Rover (JLR) is now estimated to have cost the UK economy a staggering £1.9 billion ($2.55 billion), potentially making it the most financially damaging cyber incident in the nation's history. According to the Cyber Monitoring Centre (CMC), the attack forced a near-total shutdown of JLR's production for six weeks, with the disruption cascading through its supply chain and impacting as many as 5,000 other organizations. The British government has since provided a £1.5 billion loan guarantee to support the automaker and its beleaguered suppliers.",
          "categories": [
            "Cyberattack",
            "Supply Chain Attack",
            "Industrial Control Systems"
          ],
          "tags": [
            "JLR",
            "UK",
            "cyberattack",
            "economic impact",
            "manufacturing",
            "supply chain"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-22T15:00:00.000Z"
        },
        {
          "slug": "oracle-e-business-suite-hit-by-critical-marketing-module-flaws",
          "headline": "Patch Now: Critical RCE Flaws in Oracle E-Business Suite Marketing Module",
          "summary": "Oracle has issued urgent patches for two critical, unauthenticated remote code execution (RCE) vulnerabilities in its E-Business Suite. The flaws, CVE-2025-53072 and CVE-2025-62481, both carry a CVSS score of 9.8 and affect the Oracle Marketing module. An attacker with network access can exploit these vulnerabilities via a simple HTTP request, without any user interaction, to achieve a full takeover of the marketing component. Oracle urges customers using affected versions (12.2.3 through 12.2.14) to apply the October 2025 Critical Patch Update immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Data Breach"
          ],
          "tags": [
            "CVE-2025-53072",
            "CVE-2025-62481",
            "E-Business Suite",
            "Oracle",
            "RCE",
            "patch management",
            "vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-22T15:00:00.000Z",
          "cves": [
            "CVE-2025-53072",
            "CVE-2025-62481"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "ai-powered-ransomware-outpacing-defenses-crowdstrike-warns",
        "originalHeadline": "CrowdStrike: 76% of Organizations Can't Keep Pace with AI-Powered Ransomware",
        "updateTitle": "Update: CrowdStrike: 76% of Organizations Can't Keep Pace with AI-Powered Ransomware",
        "updateSummary": "Ransomware breakout time plummets to 18 minutes due to AI/automation, challenging human-speed defense.",
        "categories": [
          "Threat Intelligence",
          "Ransomware",
          "Other"
        ],
        "tags": [
          "AI",
          "CrowdStrike",
          "CybersecuritySurvey",
          "Deepfakes",
          "Ransomware",
          "ThreatIntelligence"
        ],
        "severity": "informational",
        "publishedAt": "2025-10-21T15:00:00.000Z",
        "updatedAt": "2025-10-23T10:00:00.000Z"
      },
      {
        "slug": "g7-experts-warn-of-ai-risks-in-financial-cybersecurity",
        "originalHeadline": "G7 Warns Financial Sector of AI's Double-Edged Sword in Cybersecurity",
        "updateTitle": "Update: G7 Warns Financial Sector of AI's Double-Edged Sword in Cybersecurity",
        "updateSummary": "NYDFS issues guidance on financial firms' accountability for third-party cyber risks, emphasizing board oversight.",
        "categories": [
          "Policy and Compliance",
          "Regulatory",
          "Cloud Security"
        ],
        "tags": [
          "AI Security",
          "Artificial Intelligence",
          "Financial Sector",
          "G7",
          "Policy",
          "Regulation"
        ],
        "severity": "informational",
        "publishedAt": "2025-10-09T15:00:00.000Z",
        "updatedAt": "2025-10-23T00:00:00.000Z"
      },
      {
        "slug": "uk-ncsc-warns-of-rising-supply-chain-attacks-as-significant-incidents-double",
        "originalHeadline": "UK's NCSC Warns of Doubling 'Nationally Significant' Cyberattacks, Cites Supply Chain Risk",
        "updateTitle": "Update: UK's NCSC Warns of Doubling 'Nationally Significant' Cyberattacks, Cites Supply Chain Risk",
        "updateSummary": "NCC Group report reveals widespread overconfidence in supply chain security, with 34% of firms neglecting risk assessments despite rising NCSC warnings.",
        "categories": [
          "Supply Chain Attack",
          "Policy and Compliance",
          "Cyberattack"
        ],
        "tags": [
          "Cybersecurity",
          "NCSC",
          "Supply Chain Attack",
          "Threat Intelligence",
          "UK",
          "Vendor Risk Management"
        ],
        "severity": "high",
        "publishedAt": "2025-10-18T15:00:00.000Z",
        "updatedAt": "2025-10-23T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}