{
  "lastUpdated": "2025-11-24T14:50:09.780Z",
  "runDate": "2025-11-24",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-24",
      "type": "publication-daily",
      "headline": "Supply Chain Attacks Cripple NPM and Salesforce; FCC Rolls Back ISP Security Rules",
      "articleCount": 10,
      "articles": [
        {
          "slug": "fcc-rescinds-isp-cybersecurity-rules-amidst-ongoing-threats",
          "headline": "FCC Rolls Back ISP Cybersecurity Rules Despite China-Linked Hacking Threats",
          "summary": "In a controversial decision, the U.S. Federal Communications Commission (FCC) has rescinded cybersecurity regulations for internet service providers (ISPs). These rules were implemented by the Biden Administration following the discovery that the Chinese state-sponsored hacking group Salt Typhoon had breached major U.S. carriers. The revoked rules mandated minimum security standards and compliance certifications. The FCC claimed the original ruling was based on a \"flawed legal analysis,\" but the move has drawn sharp criticism, with Commissioner Anna M. Gomez stating it leaves the country \"less secure\" against increasing nation-state threats.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Actor"
          ],
          "tags": [
            "CALEA",
            "Cybersecurity Policy",
            "FCC",
            "Government",
            "ISP",
            "National Security",
            "Regulation",
            "Salt Typhoon"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "ransomware-attacks-peak-on-holidays-and-weekends-study-shows",
          "headline": "Ransomware Attacks Peak on Holidays and Weekends, Exploiting Low Staffing",
          "summary": "A new global study by Semperis, the \"2025 Holiday Ransomware Risk Report,\" confirms that threat actors strategically launch attacks during holidays and weekends to exploit reduced security staffing. The report found that 52% of organizations were targeted during these off-hour periods. Alarmingly, 78% of companies cut their Security Operation Center (SOC) staffing by 50% or more during these times. The study also revealed that 60% of attacks follow major corporate events like mergers or layoffs, when organizations are most distracted.",
          "categories": [
            "Security Operations",
            "Ransomware",
            "Incident Response"
          ],
          "tags": [
            "Cybersecurity Report",
            "Holiday Security",
            "Incident Response",
            "Ransomware",
            "SOC",
            "Security Operations",
            "Semperis"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "supply-chain-breaches-rise-despite-increased-defense-efforts-report-finds",
          "headline": "Supply Chain Breaches Escalate Despite Maturing Defenses, Report Finds",
          "summary": "A new 2025 report from cybersecurity firm BlueVoyant reveals a troubling trend: despite most organizations maturing their third-party risk management (TPRM) programs, the number of supply chain breaches is escalating. The study found that 97% of surveyed organizations experienced a supplier-related security incident in the past year, a significant jump from 81% in 2024. The report identifies ineffective tool integration and internal organizational silos as key barriers, with the manufacturing sector being particularly hard-hit, averaging 3.8 breaches per organization.",
          "categories": [
            "Security Operations",
            "Policy and Compliance",
            "Supply Chain Attack"
          ],
          "tags": [
            "BlueVoyant",
            "Cybersecurity Report",
            "Manufacturing",
            "Risk Management",
            "Supply Chain Security",
            "TPRM",
            "Third-Party Risk Management"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "akira-ransomware-hits-lg-energy-solution-claims-1-7tb-data-theft",
          "headline": "Akira Ransomware Gang Hits LG Energy Solution, Claims 1.7TB Data Theft",
          "summary": "South Korean battery manufacturing giant LG Energy Solution has confirmed it was the victim of a ransomware attack at one of its overseas facilities. The notorious Akira ransomware gang has claimed responsibility for the breach, alleging on its dark web leak site that it stole 1.7 terabytes of data from the company's network. While LG Energy Solution reports that the affected systems have been restored and its headquarters was not impacted, the incident highlights the continued threat of double-extortion ransomware attacks against the manufacturing sector. The Akira gang has been highly active, often gaining initial access via compromised VPN credentials.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Akira",
            "Data Breach",
            "Double Extortion",
            "LG Energy Solution",
            "Manufacturing",
            "Ransomware",
            "VPN"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z",
          "malware": [
            "Akira Ransomware"
          ]
        },
        {
          "slug": "italian-it-firm-almaviva-hit-by-cyberattack-2-3tb-of-data-leaked",
          "headline": "Italian IT Firm Almaviva Hit by Cyberattack, 2.3TB of Data Leaked",
          "summary": "The prominent Italian IT services provider Almaviva has confirmed it was hit by a major cyberattack, resulting in the theft and leaking of nearly 2.3 terabytes of sensitive data. The breach has exposed information from several of Almaviva's clients, most notably Italy's national railway operator, Ferrovie dello Stato Italiane. The leaked files reportedly include highly sensitive data such as passenger passport details, employee records, financial documents, and defense-related contracts. The identity of the attackers has not yet been disclosed.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Supply Chain Attack"
          ],
          "tags": [
            "Almaviva",
            "Cyberattack",
            "Data Breach",
            "Data Leak",
            "Ferrovie dello Stato Italiane",
            "IT Services",
            "Italy"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "autumn-dragon-espionage-campaign-targets-southeast-asian-nations",
          "headline": "New \"Autumn Dragon\" Espionage Campaign Targets Southeast Asia",
          "summary": "A newly identified cyber-espionage campaign named \"Autumn Dragon\" has been targeting government and media organizations across Southeast Asia since early 2025. The operation, attributed with medium confidence to a China-nexus Advanced Persistent Threat (APT) group, aims to gather intelligence related to the South China Sea. The attackers use spearphishing emails with malicious WinRAR archives that exploit the vulnerability CVE-2025-8088. Upon execution, a dropper script masquerading as a Windows Defender update retrieves and runs additional payloads to establish a foothold for intelligence gathering.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Vulnerability"
          ],
          "tags": [
            "APT",
            "Autumn Dragon",
            "CVE-2025-8088",
            "China",
            "Cyber Espionage",
            "Southeast Asia",
            "Spearphishing",
            "WinRAR"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z",
          "cves": [
            "CVE-2025-8088"
          ]
        },
        {
          "slug": "salesforce-data-exposed-in-gainsight-supply-chain-attack",
          "headline": "Salesforce Data of 200+ Firms Exposed in Gainsight Supply Chain Breach",
          "summary": "A sophisticated supply chain attack has compromised the sensitive data of over 200 corporate clients using Salesforce. The breach did not originate within Salesforce but through a third-party application from Gainsight. The threat actor group \"Scattered Lapsus$ Hunters,\" reportedly linked to ShinyHunters, claimed responsibility, stating they used stolen authentication tokens to access Gainsight and pivot to connected Salesforce instances. High-profile companies like Atlassian, CrowdStrike, and Verizon were named as victims, though several have denied impact. As a precaution, Salesforce has revoked all active access tokens for Gainsight integrations.",
          "categories": [
            "Supply Chain Attack",
            "Data Breach",
            "Cloud Security"
          ],
          "tags": [
            "Cloud Security",
            "Data Breach",
            "Gainsight",
            "Salesforce",
            "Scattered Lapsus$ Hunters",
            "ShinyHunters",
            "Stolen Tokens",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "wall-street-banks-hit-by-breach-at-mortgage-tech-vendor-situsamc",
          "headline": "Wall Street Banks Hit by Data Breach at Mortgage Technology Vendor SitusAMC",
          "summary": "A significant cyberattack on SitusAMC, a key technology and service provider for the U.S. real estate finance industry, has exposed sensitive data belonging to major Wall Street banks, including JPMorgan Chase, Citi, and Morgan Stanley. The breach, first detected on November 12th, compromised both corporate data and customer information related to residential mortgages. SitusAMC, which serves most leading firms in the $13.5 trillion mortgage market, confirmed the incident but stated it did not involve ransomware. The attack highlights the systemic risk posed by third-party vendors in the critical financial supply chain.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Cyberattack"
          ],
          "tags": [
            "Citi",
            "Data Breach",
            "Finance",
            "JPMorgan Chase",
            "Morgan Stanley",
            "Mortgage",
            "SitusAMC",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "massive-npm-supply-chain-attack-spreads-shai-hulud-worm",
          "headline": "Massive NPM Supply Chain Attack Spreads Self-Replicating \"Shai-Hulud\" Worm",
          "summary": "A significant, ongoing supply chain attack is targeting the NPM JavaScript ecosystem, where a self-replicating worm dubbed \"Shai-Hulud\" has infected over 400 software packages. The attack has a substantial impact on the cryptocurrency sector, compromising at least 10 widely used libraries crucial for the Ethereum Name Service (ENS), including 'content-hash' and 'address-encoder'. The malware functions as a general-purpose credential stealer, exfiltrating secrets like wallet keys from infected developer environments. The scale is vast, with researchers at Wiz observing over 25,000 affected repositories, highlighting a critical threat to developer infrastructure worldwide.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "Credential Stealing",
            "Cryptocurrency",
            "ENS",
            "JavaScript",
            "NPM",
            "Shai-Hulud",
            "Supply Chain Attack",
            "Worm"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z",
          "malware": [
            "Shai-Hulud"
          ]
        },
        {
          "slug": "shadowpad-backdoor-deployed-exploiting-windows-server-vulnerability",
          "headline": "ShadowPad Backdoor Deployed via Critical WSUS Server Vulnerability",
          "summary": "An active intrusion campaign is exploiting a critical remote code execution (RCE) vulnerability, CVE-2025-59287, in Microsoft's Windows Server Update Services (WSUS). Attackers, believed to be Chinese state-sponsored APTs, are leveraging the flaw to gain system-level access and deploy the sophisticated ShadowPad backdoor. The attack chain involves using PowerShell and legitimate system utilities like 'certutil' and 'curl' to download the malware, which is then executed using a DLL sideloading technique for stealth and persistence. The campaign highlights the rapid weaponization of newly disclosed vulnerabilities for espionage purposes.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "CVE-2025-59287",
            "China",
            "DLL Side-Loading",
            "Patch Management",
            "RCE",
            "ShadowPad",
            "WSUS"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ],
          "malware": [
            "ShadowPad"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-23",
      "type": "publication-daily",
      "headline": "Zero-Day Exploits Rock Oracle and Chrome; APTs Uncovered in Multi-Year Espionage Campaigns",
      "articleCount": 10,
      "articles": [
        {
          "slug": "crowdstrike-fires-employee-for-leaking-internal-data-to-hackers",
          "headline": "CrowdStrike Fires Employee for Leaking Internal System Details to Hacking Group",
          "summary": "Cybersecurity leader CrowdStrike has terminated an employee who was caught providing sensitive internal system information to an external hacking group. The company confirmed the insider threat incident on November 22, 2025, stating that its internal security protocols successfully detected and contained the threat. CrowdStrike reassured its customers that the incident was isolated and that no customer data or environments were accessed or compromised. The event serves as a powerful reminder that even the most security-focused organizations are susceptible to insider threats.",
          "categories": [
            "Data Breach",
            "Threat Intelligence",
            "Security Operations"
          ],
          "tags": [
            "CrowdStrike",
            "cybersecurity",
            "data leak",
            "insider threat",
            "security operations"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-23T15:00:00.000Z"
        },
        {
          "slug": "harvard-university-discloses-data-breach-from-phone-phishing-attack",
          "headline": "Harvard University Data Breach Exposes Donor Information After Phone Phishing Attack",
          "summary": "Harvard University has disclosed a data breach affecting its Alumni Affairs and Development Office, discovered on November 18, 2025. The incident originated from a phone-based phishing (vishing) attack that gave an unauthorized party access to systems containing personal information and donation records of university affiliates and donors. While highly sensitive data like Social Security numbers were reportedly not compromised, the breach exposed names, contact details, and donation histories. This attack follows a similar pattern seen in recent incidents at Princeton University and the University of Pennsylvania, indicating a targeted campaign against the development departments of major educational institutions.",
          "categories": [
            "Data Breach",
            "Phishing",
            "Threat Intelligence"
          ],
          "tags": [
            "PII",
            "data breach",
            "donor data",
            "education sector",
            "social engineering",
            "vishing"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-23T15:00:00.000Z"
        },
        {
          "slug": "apt24-badaudio-malware-campaign-exposed-after-three-years-of-espionage",
          "headline": "APT24's Three-Year \"BadAudio\" Cyberespionage Campaign Uncovered by Google",
          "summary": "Google's Threat Analysis Group (GTIG) has detailed a sophisticated, nearly three-year-long cyberespionage campaign attributed to the China-linked threat actor APT24. Active since at least November 2022, the operation used a custom C++ downloader called \"BadAudio\" to deploy payloads like Cobalt Strike. APT24's tactics evolved from broad strategic web compromises to a highly targeted supply chain attack in July 2024, where they compromised a Taiwanese digital marketing firm to distribute their malware. The campaign showcases the actor's persistence, adaptability, and use of advanced obfuscation and social engineering techniques.",
          "categories": [
            "Threat Actor",
            "Supply Chain Attack",
            "Malware"
          ],
          "tags": [
            "APT24",
            "BadAudio",
            "Cobalt Strike",
            "Taiwan",
            "cyberespionage",
            "supply chain attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-23T15:00:00.000Z",
          "malware": [
            "BadAudio",
            "Cobalt Strike"
          ]
        },
        {
          "slug": "china-linked-apt31-targets-russian-it-sector-with-cloud-based-attacks",
          "headline": "Chinese APT31 Group Infiltrates Russian IT Firms Using Yandex and OneDrive for C2",
          "summary": "The China-linked threat group APT31 (also known as Zirconium or Violet Typhoon) has been conducting a prolonged cyber espionage campaign against the Russian IT sector, primarily targeting contractors for government agencies. According to Positive Technologies, the attacks, which took place between 2024 and 2025, were notable for their stealth. The group leveraged legitimate cloud services, including Yandex Cloud and Microsoft OneDrive, for command and control (C2) and data exfiltration. This tactic allowed their malicious traffic to blend in with normal network activity, enabling them to remain undetected in victim networks for years.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "APT31",
            "Cobalt Strike",
            "Russia",
            "Zirconium",
            "cloud C2",
            "cyberespionage"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-23T15:00:00.000Z",
          "malware": [
            "Cobalt Strike"
          ]
        },
        {
          "slug": "cox-enterprises-discloses-data-breach-from-clop-exploit-of-oracle-zero-day",
          "headline": "Cl0p Ransomware Exploits Oracle Zero-Day to Breach Cox Enterprises, Hitting 9,500 Individuals",
          "summary": "Cox Enterprises, a $23 billion American conglomerate, has confirmed a data breach affecting nearly 9,500 individuals due to the exploitation of a zero-day vulnerability (CVE-2025-61882) in Oracle's E-Business Suite. The breach occurred in August 2025 but was not detected until late September. The notorious Cl0p ransomware gang has claimed responsibility, adding this attack to their long list of zero-day exploits against enterprise software, including MOVEit Transfer and GoAnywhere MFT. Cox is offering identity theft protection to affected individuals as the full scope of exposed data remains undisclosed.",
          "categories": [
            "Ransomware",
            "Vulnerability",
            "Data Breach"
          ],
          "tags": [
            "CVE-2025-61882",
            "Cl0p",
            "Oracle",
            "data breach",
            "ransomware",
            "zero-day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-23T15:00:00.000Z",
          "cves": [
            "CVE-2025-61882"
          ]
        },
        {
          "slug": "fortinet-patches-actively-exploited-fortiweb-command-injection-vulnerability-cve-2025-58034",
          "headline": "Fortinet Patches Actively Exploited Command Injection Flaw in FortiWeb WAF",
          "summary": "Fortinet has addressed an actively exploited command injection vulnerability, CVE-2025-58034, in its FortiWeb Web Application Firewall (WAF). The flaw allows an authenticated attacker to execute unauthorized code or commands via specially crafted requests. The vulnerability was reportedly 'stealth-patched' initially, with fixes included in software updates before a public advisory was released. With active exploitation confirmed and an exploit module now available in the Metasploit framework, Fortinet is urging all customers using affected 7.x and 8.x versions to apply the security updates immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CVE-2025-58034",
            "FortiWeb",
            "Fortinet",
            "command injection",
            "vulnerability",
            "zero-day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-23T15:00:00.000Z",
          "cves": [
            "CVE-2025-58034"
          ]
        },
        {
          "slug": "gainsight-supply-chain-attack-exposes-salesforce-customer-data",
          "headline": "Gainsight Supply Chain Attack Exposes Data from Salesforce Customers; Verizon, GitLab Named as Victims",
          "summary": "A supply chain attack targeting Gainsight, a customer success platform that integrates with Salesforce, has led to a significant data breach. A group calling itself 'Scattered LAPSUS$ Hunters' has claimed responsibility, alleging they have compromised data from 300 organizations, including high-profile Salesforce customers like Verizon, GitLab, and Atlassian. In response, Salesforce has revoked all active access tokens for the Gainsight integration to prevent further unauthorized access. The incident underscores the growing risk of supply chain attacks, where a breach at a third-party partner can have a cascading impact on its customers.",
          "categories": [
            "Supply Chain Attack",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "API security",
            "Gainsight",
            "LAPSUS$",
            "Salesforce",
            "data breach",
            "supply chain attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-23T15:00:00.000Z"
        },
        {
          "slug": "microsoft-mitigates-record-breaking-15-72-tbps-ddos-attack-on-azure",
          "headline": "Microsoft Mitigates Record-Breaking 15.72 Tbps DDoS Attack Targeting Azure",
          "summary": "Microsoft has successfully mitigated the largest Distributed Denial of Service (DDoS) attack ever recorded, peaking at an unprecedented 15.72 terabits per second (Tbps). The massive UDP flood attack, which also reached 3.64 billion packets per second, was attributed to the Aisuru Turbo botnet, a variant of the Mirai family. The attack originated from over 500,000 compromised IoT devices and targeted a public IP address on the Microsoft Azure cloud in Australia. Microsoft's advanced, real-time mitigation systems were able to absorb and filter the malicious traffic, preventing widespread service outages.",
          "categories": [
            "Cyberattack",
            "Threat Intelligence",
            "Cloud Security"
          ],
          "tags": [
            "Azure",
            "DDoS",
            "IoT",
            "Microsoft",
            "Mirai",
            "UDP flood",
            "botnet"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-23T15:00:00.000Z",
          "malware": [
            "Aisuru Turbo",
            "Mirai"
          ]
        },
        {
          "slug": "grafana-enterprise-hit-by-critical-cvss-10-vulnerability-cve-2025-41115",
          "headline": "Critical CVSS 10.0 Vulnerability in Grafana Enterprise Allows Account Takeover",
          "summary": "Grafana has released urgent patches for CVE-2025-41115, a critical vulnerability in Grafana Enterprise with a maximum CVSS score of 10.0. The flaw resides in the System for Cross-domain Identity Management (SCIM) component and can allow a malicious SCIM client to provide a numeric external ID that overrides an internal user ID, leading to complete account takeover or privilege escalation. The vulnerability affects Grafana Enterprise versions 12.0.0 to 12.2.1 but is only exploitable if SCIM is explicitly enabled. Administrators are urged to update their instances immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-41115",
            "CVSS 10",
            "Grafana",
            "SCIM",
            "account takeover",
            "vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-23T15:00:00.000Z",
          "cves": [
            "CVE-2025-41115"
          ]
        },
        {
          "slug": "google-patches-actively-exploited-chrome-zero-day-vulnerability-cve-2025-13223",
          "headline": "Google Patches Seventh Actively Exploited Chrome Zero-Day of 2025",
          "summary": "Google has released an emergency security update for its Chrome browser, patching a high-severity zero-day vulnerability tracked as CVE-2025-13223. The flaw, a type confusion weakness in the V8 JavaScript engine, is being actively exploited in the wild. A successful exploit could allow a remote attacker to achieve arbitrary code execution by tricking a user into visiting a malicious website. This is the seventh Chrome zero-day that Google has addressed in 2025. Users on Windows, macOS, and Linux are urged to update their browsers to version 142.0.7444.175 or later immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CVE-2025-13223",
            "Google Chrome",
            "RCE",
            "V8 engine",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-23T15:00:00.000Z",
          "cves": [
            "CVE-2025-13223"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "logitech-confirms-data-breach-by-clop-ransomware-via-oracle-zero-day",
        "originalHeadline": "Logitech Confirms Breach: Clop Ransomware Exploits Oracle Zero-Day",
        "updateTitle": "Update: Logitech Confirms Breach: Clop Ransomware Exploits Oracle Zero-Day",
        "updateSummary": "Cox Enterprises confirmed as new victim of Clop's Oracle EBS zero-day campaign, impacting 9,500 individuals.",
        "categories": [
          "Data Breach",
          "Ransomware",
          "Vulnerability"
        ],
        "tags": [
          "CVE-2025-61882",
          "Clop",
          "Data Breach",
          "Logitech",
          "Oracle",
          "Ransomware",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-61882",
          "CVE-2025-61884",
          "CVE-2025-618842"
        ],
        "severity": "high",
        "publishedAt": "2025-11-18T15:00:00.000Z",
        "updatedAt": "2025-11-23T12:00:00.000Z"
      },
      {
        "slug": "cisa-mandates-7-day-patch-for-actively-exploited-fortinet-fortiweb-zero-day-cve-2025-58034",
        "originalHeadline": "URGENT: CISA Orders 7-Day Patch for Actively Exploited FortiWeb Zero-Day",
        "updateTitle": "Update: URGENT: CISA Orders 7-Day Patch for Actively Exploited FortiWeb Zero-Day",
        "updateSummary": "Fortinet patches FortiWeb WAF CVE-2025-58034; Metasploit module released, increasing exploitation risk for 7.x/8.x versions.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Cyberattack"
        ],
        "tags": [
          "CISA",
          "Command Injection",
          "FortiWeb",
          "Fortinet",
          "KEV",
          "WAF",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-58034",
          "CVE-2025-64446"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-20T15:00:00.000Z",
        "updatedAt": "2025-11-23T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}