{
  "lastUpdated": "2025-11-09T01:27:28.687Z",
  "runDate": "2025-11-08",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-08",
      "type": "publication-daily",
      "headline": "Samsung Zero-Day Exploited by LANDFALL Spyware; Sandworm Escalates Destructive Attacks on Ukraine",
      "articleCount": 10,
      "articles": [
        {
          "slug": "malicious-vs-code-extension-with-ransomware-found-on-marketplace",
          "headline": "Malicious VS Code Extension with Ransomware Capabilities Discovered on Official Marketplace",
          "summary": "A malicious Visual Studio (VS) Code extension named \"susvsex\" was discovered on the official VS Code Extension Marketplace. The extension, which appears to have been created with AI assistance, contained overt ransomware capabilities. Upon activation, it was designed to archive a target directory, exfiltrate the ZIP file to a remote server, and then encrypt the original files. The extension also used a private GitHub repository as a command-and-control channel. Although its default target was a test folder, it could easily be modified to target sensitive user data. Microsoft has since removed the extension, which was published on November 5, 2025.",
          "categories": [
            "Malware",
            "Supply Chain Attack",
            "Ransomware"
          ],
          "tags": [
            "Developer Security",
            "Malicious Extension",
            "Microsoft",
            "Ransomware",
            "Supply Chain Attack",
            "VS Code"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z",
          "malware": [
            "Vidar",
            "susvsex"
          ]
        },
        {
          "slug": "bahrain-polytechnic-and-beyon-cyber-partner-on-ai-and-cybersecurity",
          "headline": "Bahrain Fosters Digital Talent with AI and Cybersecurity Partnership",
          "summary": "Bahrain is strengthening its national digital capabilities through a new partnership between Beyon Cyber, a cybersecurity firm, and Bahrain Polytechnic. The two organizations signed a Memorandum of Understanding (MoU) to foster innovation in Artificial Intelligence and cybersecurity. The collaboration aims to develop advanced, AI-driven security solutions and cultivate a skilled local workforce. This strategic initiative is aligned with Bahrain's goal of becoming a regional leader in technology and equipping its next generation of professionals with the skills to tackle modern cybersecurity challenges.",
          "categories": [
            "Security Operations",
            "Other"
          ],
          "tags": [
            "AI",
            "Bahrain",
            "Cybersecurity",
            "Education",
            "Partnership",
            "Talent Development"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "eu-advances-digital-regulation-with-new-gdpr-and-dsa-enforcement",
          "headline": "EU Strengthens Digital Rulebook with New GDPR Enforcement and DSA Measures",
          "summary": "The European Union has taken several steps to strengthen its digital regulatory environment. New rules have been passed to harmonize the enforcement of GDPR in cross-border cases. A new regulation on political advertising has also entered into force, imposing transparency requirements on online platforms and banning certain types of ad targeting. Additionally, the European Commission has issued a Cloud Sovereignty Framework and is advancing enforcement actions under the Digital Services Act (DSA), including issuing preliminary findings that Meta and TikTok may have breached DSA obligations regarding researcher access to data.",
          "categories": [
            "Regulatory",
            "Policy and Compliance"
          ],
          "tags": [
            "Cloud Sovereignty",
            "DSA",
            "EU",
            "GDPR",
            "Meta",
            "Policy",
            "Regulation",
            "TikTok"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "uae-cybersecurity-council-warns-public-on-deepfake-dangers",
          "headline": "UAE Issues Public Warning on Misinformation Risks from AI Deepfakes",
          "summary": "The UAE Cybersecurity Council issued a formal public warning on November 7, 2025, about the escalating threat posed by AI-generated \"deepfake\" content. The advisory highlights the potential for highly realistic but fraudulent videos and audio clips to be used for spreading misinformation, committing fraud, and damaging the reputations of individuals and institutions. The council emphasized that public awareness is the primary defense and urged citizens to verify information from official sources before sharing. The warning also referenced Federal Decree-Law No. (34) of 2021, which criminalizes the creation and distribution of such content.",
          "categories": [
            "Policy and Compliance",
            "Regulatory"
          ],
          "tags": [
            "AI",
            "Cybersecurity Council",
            "Deepfake",
            "Misinformation",
            "Policy",
            "Regulatory",
            "UAE"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "hungarian-political-party-tisza-suffers-major-data-breach",
          "headline": "Data of Nearly 200,000 Supporters of Hungarian Party TISZA Leaked Online",
          "summary": "The personal data of nearly 200,000 supporters of the Hungarian political party TISZA has been leaked and is being widely distributed online. The breach, which occurred in October 2025, originated from the party's \"TISZA Világ\" service. The compromised dataset, containing 198,500 records, has been added to the Have I Been Pwned service. Exposed information includes supporters' full names, email addresses, phone numbers, physical addresses, and usernames. This incident places affected individuals at significant risk of phishing, fraud, and other malicious targeting.",
          "categories": [
            "Data Breach"
          ],
          "tags": [
            "Data Breach",
            "GDPR",
            "Have I Been Pwned",
            "Hungary",
            "PII",
            "Politics"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "daily-ransomware-report-qilin-gang-dominates-november-8-2025",
          "headline": "Qilin Ransomware Gang Claims 7 of 11 New Victims in 24 Hours",
          "summary": "The daily ransomware report for November 8, 2025, highlights a significant burst of activity from the Qilin ransomware group, which claimed responsibility for 7 of the 11 new victims announced in the past 24 hours. The DragonForce group was the second most active with three victims. The attacks primarily targeted the professional services and manufacturing sectors, with victims located in the United States, Canada, and the United Kingdom. This latest surge brings the total number of publicly claimed ransomware victims in 2025 to 6,364, underscoring the relentless and persistent threat that ransomware-as-a-service (RaaS) operations pose to organizations globally.",
          "categories": [
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "Cybercrime",
            "Data Breach",
            "DragonForce",
            "Qilin",
            "RaaS",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "russian-apt-sandworm-intensifies-destructive-attacks-on-ukraine",
          "headline": "Sandworm Escalates Wiper Attacks, Targeting Ukraine's Grain Sector for First Time",
          "summary": "A new report from ESET covering APT activity from April to September 2025 reveals that the Russia-linked threat group Sandworm has escalated its destructive cyberattacks against Ukraine. The group deployed new data-wiping malware, including Zerolot and Sting, targeting government bodies, energy companies, and logistics. In a significant strategic shift, Sandworm's attacks have expanded to include Ukraine's grain export sector, a vital part of its economy. The report also notes that another group, UAC-0099, has been observed supporting Sandworm by providing initial access to victim networks. This campaign is part of a broader increase in global state-sponsored cyber activity, with groups from China, Iran, and North Korea also expanding their espionage and disruptive operations.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "APT",
            "Critical Infrastructure",
            "Cyber War",
            "ESET",
            "Russia",
            "Sandworm",
            "Ukraine",
            "Wiper Malware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z",
          "malware": [
            "Sting",
            "Zerolot"
          ]
        },
        {
          "slug": "software-supply-chain-attacks-hit-record-high-in-october-2025",
          "headline": "Software Supply Chain Attacks Surge Over 30% to Record High, Driven by Ransomware",
          "summary": "According to a new report from threat intelligence firm Cyble, software supply chain attacks surged to a record high in October 2025, with 41 documented incidents. This represents a 30% increase from the previous peak and more than double the monthly average from early 2024. Ransomware groups, notably Qilin and Akira, are increasingly adopting this tactic, shifting focus from direct network breaches to compromising organizations through their third-party technology partners. The attacks have heavily targeted the energy, healthcare, and manufacturing sectors. Incidents include Qilin compromising a cloud services provider for the healthcare sector by finding clear-text credentials, demonstrating the critical need for improved vendor risk management.",
          "categories": [
            "Supply Chain Attack",
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "Akira",
            "Cyble",
            "Qilin",
            "Ransomware",
            "Supply Chain Attack",
            "Third-Party Risk",
            "Vendor Management"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "sonicwall-confirms-state-sponsored-actor-behind-cloud-backup-breach",
          "headline": "SonicWall: State-Sponsored Actor Breached Cloud Backups via API Exploit",
          "summary": "Cybersecurity vendor SonicWall has confirmed that a sophisticated state-sponsored threat actor was behind the security breach in September 2025. The investigation, assisted by Mandiant, found that the attackers gained unauthorized access to a cloud environment by exploiting a compromised API call. This allowed them to steal firewall configuration backup files belonging to customers of the MySonicWall cloud backup service. SonicWall asserts that the incident was isolated to that specific environment and did not affect its core products or internal networks. The company has since implemented remedial actions and released tools to help customers reset credentials and secure their services.",
          "categories": [
            "Data Breach",
            "Cloud Security",
            "Threat Actor"
          ],
          "tags": [
            "API Security",
            "APT",
            "Cloud Security",
            "Data Breach",
            "Mandiant",
            "SonicWall",
            "State-Sponsored"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "landfall-spyware-exploits-samsung-zero-day-in-middle-east-attacks",
          "headline": "LANDFALL Spyware Uses Samsung Zero-Day for Zero-Click Attacks in Middle East",
          "summary": "A sophisticated commercial-grade Android spyware known as LANDFALL has been identified in targeted cyber-espionage campaigns across the Middle East. The attackers exploited a critical zero-day vulnerability, CVE-2025-21042, in Samsung Galaxy devices to achieve remote code execution without user interaction. The flaw, an out-of-bounds write in an image processing library, was triggered by sending a malicious DNG image file. The campaign was active for months before Samsung issued a patch in April 2025, affecting users in Iraq, Iran, Turkey, and Morocco. Once installed, LANDFALL acts as a comprehensive surveillance tool, capable of exfiltrating a wide array of data, including microphone recordings, location data, photos, and communications.",
          "categories": [
            "Vulnerability",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "Android",
            "CVE-2025-21042",
            "Mobile Security",
            "RCE",
            "Spyware",
            "Zero-Click",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z",
          "cves": [
            "CVE-2025-21042",
            "CVE-2025-21043",
            "CVE-2025-43300"
          ],
          "malware": [
            "LANDFALL"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-07",
      "type": "publication-daily",
      "headline": "Cisco Firewalls Under Siege by New DoS Attacks; AI Supercharges Ransomware Campaigns",
      "articleCount": 10,
      "articles": [
        {
          "slug": "ai-supercharges-ransomware-slashing-attack-times-crowdstrike-reports",
          "headline": "AI-Powered Ransomware Attacks Cut Breach Times to 24 Hours, CrowdStrike Warns",
          "summary": "A new report from CrowdStrike reveals that threat actors are leveraging artificial intelligence (AI) to dramatically accelerate ransomware attacks, with some groups like SCATTERED SPIDER now able to complete their attack cycle in just 24 hours. The '2025 European Threat Landscape Report' highlights that this increased efficiency has made Europe the second most-targeted region globally, accounting for 22% of all victims. The report also notes the rise of 'violence-as-a-service' networks and continued espionage from China-aligned state actors.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Threat Actor"
          ],
          "tags": [
            "AI",
            "CrowdStrike",
            "Europe",
            "Ransomware",
            "SCATTERED SPIDER",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-07T15:00:00.000Z"
        },
        {
          "slug": "amazon-patches-high-severity-flaw-in-workspaces-linux-client",
          "headline": "Amazon Patches High-Severity Flaw in WorkSpaces Linux Client",
          "summary": "Amazon Web Services (AWS) has patched a high-severity vulnerability, CVE-2025-12779, in its WorkSpaces client for Linux. The flaw, rated 8.8 CVSS, could allow a local attacker on a shared computer to extract another user's authentication token and gain unauthorized access to their virtual desktop session. The issue affects Linux client versions 2023.0 through 2024.8. AWS has released a patched version and recommends all users upgrade immediately to mitigate the risk.",
          "categories": [
            "Vulnerability",
            "Cloud Security",
            "Patch Management"
          ],
          "tags": [
            "AWS",
            "Authentication",
            "CVE-2025-12779",
            "Cloud Security",
            "Linux",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-07T15:00:00.000Z",
          "cves": [
            "CVE-2025-12779"
          ]
        },
        {
          "slug": "i-paid-twice-phishing-campaign-targets-booking-com-hotels-and-guests",
          "headline": "Massive 'I Paid Twice' Phishing Scheme Defrauds Booking.com Hotels and Guests",
          "summary": "A sophisticated global phishing campaign named 'I Paid Twice' is targeting hotels on Booking.com and Expedia, compromising their administrative accounts to defraud guests. Since at least April 2025, attackers have been using social engineering and the PureRAT malware to gain access to hotel systems. Once in, they impersonate hotel staff to send fraudulent payment requests to travelers with upcoming reservations, tricking them into paying a second time via a malicious portal. Security firm Sekoia.io, which discovered the operation, reports that the campaign is highly active and has resulted in financial losses for an unknown number of victims.",
          "categories": [
            "Phishing",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "Booking.com",
            "Hospitality",
            "Malware",
            "Phishing",
            "PureRAT",
            "Social Engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-07T15:00:00.000Z",
          "malware": [
            "PureRAT"
          ]
        },
        {
          "slug": "monkey-ransomware-emerges-with-data-exfiltration-and-backup-deletion",
          "headline": "New 'Monkey Ransomware' Strain Combines Encryption with Backup Deletion",
          "summary": "A new ransomware strain named 'Monkey Ransomware' has been discovered by researchers at CYFIRMA. Targeting Windows systems, the malware encrypts files with a '.monkey' extension, exfiltrates data for double extortion, and actively attempts to delete Volume Shadow Copies to hinder recovery. The ransom note demands contact within 24 hours, threatening to increase the ransom and leak the stolen data. This new variant combines several common but effective tactics seen in modern ransomware campaigns.",
          "categories": [
            "Ransomware",
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "Data Exfiltration",
            "Double Extortion",
            "Malware",
            "Ransomware",
            "Windows"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-07T15:00:00.000Z",
          "malware": [
            "Monkey Ransomware"
          ]
        },
        {
          "slug": "software-supply-chain-attacks-hit-record-high-cyble-report-reveals",
          "headline": "Software Supply Chain Attacks Skyrocket to Record High, Driven by Ransomware Gangs",
          "summary": "Software supply chain attacks reached an all-time high in October 2025, with 41 claimed incidents, according to a new report from Cyble. This figure is over 30% higher than the previous monthly record. Ransomware groups, particularly Qilin and Akira, are identified as the primary drivers of this trend, responsible for a majority of attacks in 2025. The information technology, finance, and energy sectors are the most heavily targeted, highlighting a strategic shift by attackers to compromise organizations through their trusted third-party suppliers.",
          "categories": [
            "Supply Chain Attack",
            "Ransomware",
            "Threat Intelligence"
          ],
          "tags": [
            "Akira",
            "Cyble",
            "Dark Web",
            "Qilin",
            "Ransomware",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-07T15:00:00.000Z"
        },
        {
          "slug": "state-backed-hackers-escalate-attacks-on-ukraine-and-americas-eset-reports",
          "headline": "State-Backed Hacking Escalates: Russia Targets Ukraine, China Eyes Latin America",
          "summary": "A new report from ESET reveals a significant escalation in cyber operations by state-sponsored threat groups from Russia and China between April and September 2025. Russia-aligned groups, notably Sandworm, have accelerated destructive wiper malware attacks against Ukraine's critical infrastructure, including energy and logistics. Simultaneously, China-aligned actors like FamousSparrow have increased espionage activities targeting governmental entities in Latin America, potentially in response to shifting geopolitical dynamics. The report highlights a global landscape of heightened cyber conflict driven by national interests.",
          "categories": [
            "Threat Intelligence",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Espionage",
            "Geopolitics",
            "Sandworm",
            "Threat Intelligence",
            "Wiper"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-07T15:00:00.000Z",
          "malware": [
            "Kalambur"
          ]
        },
        {
          "slug": "cisa-mandates-federal-patch-for-actively-exploited-centos-panel-flaw",
          "headline": "CISA Orders Federal Agencies to Patch Actively Exploited CentOS Web Panel Flaw",
          "summary": "The US Cybersecurity and Infrastructure Security Agency (CISA) has added a critical remote code execution (RCE) vulnerability in CentOS Web Panel (CWP) to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, CVE-2025-48703, allows an unauthenticated remote attacker to execute arbitrary shell commands with root privileges, requiring only a valid username on the target system. Due to active exploitation in the wild, CISA has mandated that all Federal Civilian Executive Branch agencies patch the vulnerability by November 25, 2025.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Policy and Compliance"
          ],
          "tags": [
            "CISA",
            "CVE-2025-48703",
            "KEV",
            "Patch Management",
            "RCE",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-07T15:00:00.000Z",
          "cves": [
            "CVE-2025-48703"
          ]
        },
        {
          "slug": "cisco-warns-new-attack-variant-exploiting-critical-firewall-vulnerabilities",
          "headline": "Cisco Firewalls Under Renewed Assault as New DoS Attack Variant Emerges",
          "summary": "Cisco has issued an urgent security warning about a new denial-of-service (DoS) attack variant that is actively exploiting two previously patched vulnerabilities, CVE-2025-20333 and CVE-2025-20362, in its Secure Firewall ASA and FTD software. The campaign, which began on November 5, 2025, causes unpatched devices to enter a continuous reload loop, rendering them inoperable. This follows months of active exploitation by advanced threat actors, including a compromise of at least one US government agency. Cisco strongly urges all customers to apply the available patches immediately, as no effective workarounds exist.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "Cisco",
            "DoS",
            "Firewall",
            "Patch Management",
            "RCE",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-07T15:00:00.000Z",
          "cves": [
            "CVE-2025-20333",
            "CVE-2025-20362"
          ]
        },
        {
          "slug": "malicious-nuget-packages-contain-time-delayed-industrial-sabotage-code",
          "headline": "Patient Sabotage: Malicious NuGet Packages with Time-Delayed ICS Payloads Discovered",
          "summary": "Security researchers have discovered nine malicious packages on the NuGet repository, downloaded over 9,400 times, containing hidden, time-delayed sabotage code. One package, 'Sharp7Extend,' was specifically designed to corrupt write operations in industrial control systems (ICS) by silently causing them to fail after a grace period. This could lead to physical damage or production failures. The code was set to trigger on specific dates, some as far in the future as 2028, demonstrating a patient and highly destructive approach to supply chain attacks.",
          "categories": [
            "Supply Chain Attack",
            "Industrial Control Systems",
            "Malware"
          ],
          "tags": [
            "ICS",
            "Malware",
            "NuGet",
            "OT",
            "Sabotage",
            "Supply Chain Attack"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-07T15:00:00.000Z",
          "malware": [
            "Sharp7Extend"
          ]
        },
        {
          "slug": "samsung-zero-day-flaw-exploited-to-deploy-landfall-android-spyware",
          "headline": "Samsung Zero-Day Exploited in the Wild to Install 'LANDFALL' Android Spyware",
          "summary": "A now-patched zero-day vulnerability, CVE-2025-21042, in Samsung Galaxy devices was actively exploited to install a commercial-grade Android spyware known as LANDFALL. Researchers from Palo Alto Networks' Unit 42 discovered that attackers sent malicious DNG image files via WhatsApp to targets in the Middle East. The flaw, an out-of-bounds write in an image processing library, allowed for remote code execution. This incident highlights the growing trend of exploiting mobile image parsing libraries to deliver spyware, echoing similar attacks against Apple devices.",
          "categories": [
            "Vulnerability",
            "Malware",
            "Mobile Security"
          ],
          "tags": [
            "Android",
            "CVE-2025-21042",
            "Mobile Security",
            "Samsung",
            "Spyware",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-07T15:00:00.000Z",
          "cves": [
            "CVE-2025-21042",
            "CVE-2025-21043",
            "CVE-2025-43300",
            "CVE-2025-55177"
          ],
          "malware": [
            "LANDFALL"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "qilin-ransomware-gang-claims-new-attacks-across-us-france-africa",
        "originalHeadline": "Qilin Ransomware Strikes Again, Claiming Victims Across US, France, and Africa",
        "updateTitle": "Update: Qilin Ransomware Strikes Again, Claiming Victims Across US, France, and Africa",
        "updateSummary": "Qilin claims 7 new victims in 24 hours, showing continued high activity and targeting professional services and manufacturing.",
        "categories": [
          "Ransomware",
          "Threat Actor"
        ],
        "tags": [
          "Cyberattack",
          "Data Leak",
          "Double Extortion",
          "Qilin",
          "RaaS",
          "Ransomware"
        ],
        "severity": "high",
        "publishedAt": "2025-10-16T15:00:00.000Z",
        "updatedAt": "2025-11-08T12:00:00.000Z"
      },
      {
        "slug": "clop-ransomware-exploits-oracle-e-business-suite-zero-day-cve-2025-61882",
        "originalHeadline": "Cl0p Gang Exploits Oracle EBS Zero-Day in Massive Data Theft Spree",
        "updateTitle": "Update: Cl0p Gang Exploits Oracle EBS Zero-Day in Massive Data Theft Spree",
        "updateSummary": "CL0P names Washington Post among 100+ victims of Oracle EBS zero-day, demanding up to $50M in ransoms and publicly shaming non-payers.",
        "categories": [
          "Vulnerability",
          "Ransomware",
          "Data Breach"
        ],
        "tags": [
          "Cl0p",
          "Data Theft",
          "Extortion",
          "KEV",
          "Oracle",
          "RCE",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-61882"
        ],
        "severity": "critical",
        "publishedAt": "2025-10-09T15:00:00.000Z",
        "updatedAt": "2025-11-08T00:00:00.000Z"
      },
      {
        "slug": "sonicwall-breach-expands-compromising-all-cloud-backup-users",
        "originalHeadline": "SonicWall Breach Far Worse Than Feared: All Cloud Backup Users' Firewall Configs Stolen",
        "updateTitle": "Update: SonicWall Breach Far Worse Than Feared: All Cloud Backup Users' Firewall Configs Stolen",
        "updateSummary": "SonicWall confirms state-sponsored actor behind September cloud backup breach, exploiting a compromised API call to steal customer firewall configurations.",
        "categories": [
          "Data Breach",
          "Supply Chain Attack",
          "Cloud Security"
        ],
        "tags": [
          "API security",
          "SonicWall",
          "cloud security",
          "configuration management",
          "data breach",
          "firewall"
        ],
        "severity": "high",
        "publishedAt": "2025-10-10T15:00:00.000Z",
        "updatedAt": "2025-11-08T00:00:00.000Z"
      },
      {
        "slug": "ai-driven-social-engineering-top-cyber-threat-for-2026",
        "originalHeadline": "AI-Powered Social Engineering to Become Top Cyber Threat, ISACA Warns",
        "updateTitle": "Update: AI-Powered Social Engineering to Become Top Cyber Threat, ISACA Warns",
        "updateSummary": "UAE issues public warning on AI deepfakes, highlighting legal risks and public awareness.",
        "categories": [
          "Threat Intelligence",
          "Phishing",
          "Policy and Compliance"
        ],
        "tags": [
          "Artificial Intelligence",
          "Cyber Threat",
          "Deepfake",
          "Generative AI",
          "ISACA",
          "Phishing",
          "Social Engineering"
        ],
        "severity": "informational",
        "publishedAt": "2025-10-20T15:00:00.000Z",
        "updatedAt": "2025-11-08T00:00:00.000Z"
      },
      {
        "slug": "cisa-adds-actively-exploited-control-web-panel-flaw-to-kev-catalog",
        "originalHeadline": "CISA Adds Actively Exploited Control Web Panel RCE Flaw to KEV",
        "updateTitle": "Update: CISA Adds Actively Exploited Control Web Panel RCE Flaw to KEV",
        "updateSummary": "New details confirm root-level RCE for CVE-2025-48703 in CWP, CISA advises discontinuing use if unpatchable.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Cyberattack"
        ],
        "tags": [
          "CISA",
          "CVE-2025-48703",
          "Control Web Panel",
          "KEV",
          "RCE",
          "Vulnerability",
          "Web Hosting"
        ],
        "cves": [
          "CVE-2025-48703"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-06T15:00:00.000Z",
        "updatedAt": "2025-11-07T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}