{
  "lastUpdated": "2026-01-26T15:05:03.618Z",
  "runDate": "2026-01-26",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-26",
      "type": "publication-daily",
      "headline": "QuantumLeap Ransomware Halts Global Logistics; Critical Zero-Days in NexusFlow and Mobile OSes Actively Exploited",
      "articleCount": 12,
      "articles": [
        {
          "slug": "researchers-detail-chronostealer-a-new-modular-malware-as-a-service",
          "headline": "Researchers Detail 'ChronoStealer', a New Modular Info-Stealing Malware-as-a-Service",
          "summary": "Security researchers at Check Point have published a deep-dive analysis of 'ChronoStealer', a new and highly modular information-stealing malware sold on a subscription basis in underground forums. This Malware-as-a-Service (MaaS) model allows low-skilled criminals to rent the sophisticated tool and its infrastructure for as little as $200 per month. ChronoStealer's core function is to steal credentials from over 50 web browsers and other applications. Its capabilities can be expanded with add-on modules for stealing cryptocurrency wallets, logging keystrokes, and capturing session cookies. The malware uses the Telegram API for C2 communications to better blend in with legitimate traffic. The rise of such user-friendly, powerful MaaS platforms represents a significant force multiplier for the cybercrime ecosystem.",
          "categories": [
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "Check Point",
            "MaaS",
            "Malware-as-a-Service",
            "Telegram",
            "cybercrime",
            "infostealer",
            "malware"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z",
          "malware": [
            "ChronoStealer"
          ]
        },
        {
          "slug": "cisa-issues-directive-on-post-quantum-cryptography-readiness",
          "headline": "CISA Issues Directive Mandating Federal Agencies Prepare for Post-Quantum Cryptography",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued Binding Operational Directive (BOD) 26-03, a landmark mandate requiring Federal Civilian Executive Branch (FCEB) agencies to prepare for the transition to post-quantum cryptography (PQC). The directive addresses the future threat posed by quantum computers capable of breaking current public-key encryption standards. Agencies are required to inventory all systems using public-key cryptography by September 2026 and submit a comprehensive migration roadmap by March 2027. The initiative prioritizes the protection of systems with long-term data confidentiality needs, which are vulnerable to 'harvest now, decrypt later' attacks. This directive establishes the foundational steps for a coordinated, government-wide migration to NIST-standardized PQC algorithms.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "BOD",
            "CISA",
            "NIST",
            "PQC",
            "government",
            "policy",
            "post-quantum cryptography",
            "quantum computing"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "operation-echidna-dismantles-crimson-market-dark-web-hub",
          "headline": "International Operation 'Echidna' Dismantles 'Crimson Market' Dark Web Hub, 50+ Arrested",
          "summary": "A coordinated international law enforcement action, codenamed 'Operation Echidna', has successfully dismantled 'Crimson Market', one of the largest dark web marketplaces for cybercrime tools and stolen data. The operation, involving the FBI, Europol, and the UK's NCA, resulted in the seizure of the market's server infrastructure and the arrest of over 50 individuals worldwide, including its alleged administrator. Crimson Market was a key hub for selling billions of stolen credentials, malware-as-a-service (including ransomware and info-stealers), and phishing kits. The 18-month investigation involved undercover operations to trace cryptocurrency transactions. The takedown represents a major disruption to the cybercrime economy, and data from the seized servers is expected to lead to further arrests.",
          "categories": [
            "Threat Intelligence",
            "Policy and Compliance"
          ],
          "tags": [
            "Europol",
            "FBI",
            "cybercrime",
            "dark web",
            "law enforcement",
            "takedown"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "silentvoice-phishing-campaign-uses-ai-deepfakes-to-bypass-mfa",
          "headline": "'SilentVoice' Phishing Campaign Weaponizes AI Deepfake Audio to Bypass MFA",
          "summary": "A sophisticated social engineering campaign named 'SilentVoice' is successfully bypassing multi-factor authentication (MFA) by using AI-generated deepfake audio of corporate executives. According to researchers at Proofpoint, attackers clone an executive's voice from public audio samples and then use it in a vishing (voice phishing) call to a subordinate employee. The deepfake voice creates a sense of urgency, tricking the employee into entering their credentials on a fake site and then approving the subsequent MFA push notification sent to their device. This highly convincing technique circumvents the protection offered by many common MFA methods, leading to full account takeover. The campaign has already resulted in successful breaches and financial fraud, highlighting the emerging threat of AI-weaponized social engineering.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "AI",
            "MFA bypass",
            "account takeover",
            "deepfake",
            "phishing",
            "social engineering",
            "vishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "fintech-startup-voltpay-exposes-5-million-customer-records-in-cloud-leak",
          "headline": "Fintech Startup VoltPay Leaks 5 Million Customer Records via Misconfigured Cloud Database",
          "summary": "The financial technology startup VoltPay has confirmed a massive data breach affecting approximately 5 million users. The leak was caused by a misconfigured Elasticsearch database that was left publicly accessible on the internet without a password for over three months. A security researcher discovered and reported the exposure. The leaked data includes highly sensitive information: full names, email addresses, phone numbers, physical addresses, dates of birth, hashed passwords, and full transaction histories. The last four digits of credit card and bank account numbers were also exposed. This incident, attributed to 'human error during a server migration', places millions of users at significant risk of identity theft and targeted phishing attacks, and has reportedly triggered investigations by U.S. and European regulators.",
          "categories": [
            "Data Breach",
            "Cloud Security",
            "Regulatory"
          ],
          "tags": [
            "CCPA",
            "Elasticsearch",
            "GDPR",
            "PII",
            "cloud security",
            "data breach",
            "fintech",
            "misconfiguration"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "medusa-ransomware-group-escalates-attacks-in-africa",
          "headline": "Medusa Ransomware Exploits Cybersecurity Gaps, Escalating Attacks Across Africa",
          "summary": "Ransomware attacks are a pervasive and highly damaging threat across the African continent, where a significant cybersecurity skills and resources gap creates a fertile ground for cybercriminals. Notorious ransomware groups, including Medusa, are increasingly targeting organizations in the region, leveraging double extortion tactics to maximize pressure on their victims. These attacks involve not only encrypting critical data but also stealing it and threatening public release if the ransom is not paid. Key sectors such as healthcare, finance, and critical infrastructure are prime targets. According to reports, a high percentage of African organizations hit by ransomware end up paying the ransom, perpetuating the cycle of attacks. The situation underscores an urgent need for increased investment in cybersecurity infrastructure, skills development, and awareness across the continent.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Africa",
            "Medusa",
            "critical infrastructure",
            "cybersecurity gap",
            "double extortion",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "popular-npm-package-js-utility-kit-compromised-in-supply-chain-attack",
          "headline": "NPM Package 'js-utility-kit' Hijacked in Supply Chain Attack to Steal Crypto Keys and Credentials",
          "summary": "A significant software supply chain attack has compromised the popular NPM package 'js-utility-kit', which is downloaded over 5 million times per week. Security firm Snyk discovered that malicious versions (2.1.8, 2.1.9, and 2.2.1) were published after the maintainer's account was hijacked via a credential stuffing attack. The compromised packages contained a post-install script that downloaded and executed a sophisticated information stealer. The malware was designed to steal cryptocurrency private keys, browser extension data for crypto wallets, and sensitive credentials such as environment variables and cloud provider CLI configurations from developers' machines and CI/CD pipelines. The NPM security team has removed the malicious versions, but any project that installed them between January 24 and 26 is considered compromised and requires immediate auditing and credential rotation.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Data Breach"
          ],
          "tags": [
            "CI/CD",
            "NPM",
            "cryptocurrency",
            "developer security",
            "infostealer",
            "malware",
            "supply chain attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "apt-steelhydra-targets-geothermal-energy-sector-with-novel-ics-malware",
          "headline": "Nation-State Actor 'SteelHydra' (APT47) Deploys 'GeoShifter' ICS Malware to Spy on Geothermal Energy Firms",
          "summary": "The nation-state threat actor 'SteelHydra' (also tracked as APT47) is behind a sophisticated cyber-espionage campaign targeting the geothermal energy sector. According to research from Mandiant, the campaign has impacted firms in the United States, Canada, and Iceland. The attackers are using a novel, custom-built malware framework called 'GeoShifter', which is specifically designed to operate in Industrial Control System (ICS) environments and interface with SCADA/PLC systems from vendors like Siemens and Schneider Electric. The initial infection vector is a spear-phishing campaign that deploys a backdoor named 'PipeDreamer'. The ultimate goal of the campaign appears to be the theft of intellectual property and operational data related to geothermal technology, which could be used for economic advantage or to plan future disruptive attacks.",
          "categories": [
            "Threat Actor",
            "Industrial Control Systems",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "ICS",
            "SCADA",
            "cyber espionage",
            "geothermal energy",
            "nation-state",
            "spear-phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z",
          "malware": [
            "GeoShifter",
            "PipeDreamer"
          ]
        },
        {
          "slug": "quantumleap-ransomware-cripples-global-logistics-giant-navigistics",
          "headline": "New QuantumLeap Ransomware Demands $50M, Halts Global Shipments at NaviGistics",
          "summary": "The global logistics firm NaviGistics has suffered a catastrophic cyberattack from a new ransomware strain dubbed 'QuantumLeap'. The attack, orchestrated by a group calling itself 'Entropy Collective', has encrypted critical systems and brought the company's worldwide shipping and freight operations to a standstill. The threat actors gained initial access via a compromised VPN account lacking multi-factor authentication, demonstrating a sophisticated lateral movement campaign before deploying the payload. The group is demanding a $50 million ransom and has threatened to leak over 2 terabytes of exfiltrated data, including sensitive customer and financial records. This incident highlights the extreme vulnerability of the global supply chain to targeted cyber-extortion and the devastating operational and financial impact of modern ransomware attacks.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "VPN security",
            "cyber extortion",
            "double extortion",
            "logistics",
            "ransomware",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z",
          "malware": [
            "QuantumLeap"
          ]
        },
        {
          "slug": "volt-typhoon-linked-to-data-breach-at-us-water-utility",
          "headline": "Volt Typhoon Linked to Breach at U.S. Water Utility, Exfiltrating Operational Documents",
          "summary": "The Chinese state-sponsored group Volt Typhoon has been attributed to a data breach at the Park County Water District in Colorado. According to a joint advisory from CISA, the FBI, and the NSA, the hackers exploited a known vulnerability in an internet-facing network appliance to gain initial access. Consistent with their known TTPs, Volt Typhoon then used 'living off the land' techniques, leveraging built-in network administration tools to blend in and evade detection. The attackers moved laterally within the IT network and exfiltrated sensitive operational documents, including engineering schematics and maintenance schedules. While officials stated that the operational technology (OT) network and water supply were not affected, the incident highlights the group's continued focus on reconnaissance against U.S. critical infrastructure.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Industrial Control Systems"
          ],
          "tags": [
            "APT",
            "CISA",
            "Volt Typhoon",
            "critical infrastructure",
            "living off the land",
            "nation-state",
            "water utility"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "apple-google-release-emergency-patches-for-ghosttouch-zero-click-flaw",
          "headline": "Apple & Google Issue Emergency Patches for 'GhostTouch' Zero-Click RCE Flaw (CVE-2026-23456)",
          "summary": "Apple and Google have released coordinated, emergency security updates to fix a critical zero-click remote code execution (RCE) vulnerability, dubbed 'GhostTouch' and tracked as CVE-2026-23456. The flaw exists in a core open-source graphics rendering library used by both iOS and Android, affecting billions of smartphones and tablets worldwide. The vulnerability can be exploited by sending a victim a specially crafted image file via messaging apps or email, requiring no user interaction to achieve code execution. Researchers at The Citizen Lab discovered the flaw being actively used by a commercial surveillance vendor to deploy spyware against high-risk individuals. CISA has added the CVE to its KEV catalog, and all users are urged to update to iOS 19.2.1, iPadOS 19.2.1, or the latest Android security patch immediately.",
          "categories": [
            "Vulnerability",
            "Mobile Security",
            "Cyberattack"
          ],
          "tags": [
            "Android",
            "CISA KEV",
            "RCE",
            "iOS",
            "mobile security",
            "spyware",
            "vulnerability",
            "zero-click"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z",
          "cves": [
            "CVE-2026-23456"
          ]
        },
        {
          "slug": "critical-rce-zero-day-in-nexusflow-api-gateway-actively-exploited",
          "headline": "Urgent Patch Required: Critical RCE Zero-Day (CVE-2026-12345) in NexusFlow API Gateway Under Active Attack",
          "summary": "A critical pre-authentication remote code execution (RCE) zero-day vulnerability, CVE-2026-12345, is being actively exploited in the wild against the popular NexusFlow API Gateway. The flaw, which carries the maximum CVSS score of 10.0, allows unauthenticated attackers to gain complete control of vulnerable servers by sending a single, specially crafted HTTP request. Security firm Horizon Security Labs discovered the exploitation during a breach investigation. The vulnerability is wormable, creating a risk of rapid, widespread compromise. NexusFlow's parent company, Voltara, has released an emergency patch (version 3.8.1) and is urging all customers to update immediately. CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to patch by February 9, 2026.",
          "categories": [
            "Vulnerability",
            "Cyberattack"
          ],
          "tags": [
            "API security",
            "CISA KEV",
            "RCE",
            "buffer overflow",
            "patch management",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z",
          "cves": [
            "CVE-2026-12345"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-25",
      "type": "publication-daily",
      "headline": "Massive 149M Credential Leak, Sandworm's 'DynoWiper' Targets Poland, and FortiGate Firewalls Breached Despite Patches",
      "articleCount": 12,
      "articles": [
        {
          "slug": "microsoft-releases-emergency-update-to-fix-outlook-freezing-issue",
          "headline": "Microsoft Rushes Out Emergency Fix for Outlook Freezing Bug",
          "summary": "Microsoft has released an emergency out-of-band (OOB) update to fix a bug causing the Microsoft Outlook client to freeze. The issue, which is separate from the recent Windows 11 boot failures, primarily affects users who store their PST (Personal Storage Table) files on cloud services like OneDrive or Dropbox. The problem was reported to be more prevalent in enterprise environments. Users experiencing the freezing issue are advised to apply the emergency patch immediately.",
          "categories": [
            "Patch Management",
            "Security Operations"
          ],
          "tags": [
            "Dropbox",
            "Microsoft Outlook",
            "OOB update",
            "OneDrive",
            "PST file",
            "bug"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "microsoft-investigates-windows-11-boot-failures-after-january-2026-updates",
          "headline": "Windows 11 Fails to Boot for Some Users After Installing January 2026 Security Updates",
          "summary": "Microsoft is investigating widespread reports of Windows 11 devices failing to boot after installing the January 2026 security updates, including cumulative update KB5074109. Affected users are met with a black screen and an 'UNMOUNTABLE_BOOT_VOLUME' stop error. The issue primarily impacts physical devices running Windows 11 versions 25H2 and 24H2. Microsoft has acknowledged the reports and is gathering information via the Feedback Hub to determine the root cause and develop a fix.",
          "categories": [
            "Patch Management",
            "Security Operations"
          ],
          "tags": [
            "KB5074109",
            "Patch Tuesday",
            "Windows 11",
            "boot failure",
            "bug"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "everest-ransomware-group-leaks-343gb-of-under-armour-customer-data",
          "headline": "Everest Ransomware Group Leaks 343GB of Under Armour Customer Data",
          "summary": "The Russia-linked Everest ransomware group has leaked 343 GB of data allegedly stolen from global sportswear brand Under Armour. The massive data dump, which occurred on January 24, 2026, followed a failed extortion attempt. The leaked data is reported to contain the personally identifiable information (PII) of millions of customers, highlighting the 'double extortion' tactic where data publication is the primary threat. Under Armour has not yet commented on the incident.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Everest",
            "PII",
            "Under Armour",
            "data leak",
            "double extortion",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "massive-149m-credential-leak-exposes-gmail-facebook-financial-services",
          "headline": "Massive 149 Million Credential Leak Exposes Gmail, Facebook, and Financial Service Users",
          "summary": "A publicly accessible, unencrypted 96 GB database containing 149.4 million unique login credentials has been discovered by a security researcher. The data, believed to be compiled from various infostealer malware logs and past breaches, impacts an estimated 48 million Gmail accounts, alongside users of Facebook, financial services, government portals, and numerous other online platforms. The leak includes usernames, passwords, and the direct login URLs, posing a significant risk of account takeover and fraud for millions of individuals globally.",
          "categories": [
            "Data Breach",
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "account takeover",
            "credential leak",
            "data exposure",
            "infostealer",
            "password security"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "malware": [
            "Infostealer malware"
          ]
        },
        {
          "slug": "microsoft-warns-of-aitm-phishing-and-bec-attacks-targeting-energy-firms",
          "headline": "Microsoft Warns of Sophisticated Phishing Attacks on Energy Sector",
          "summary": "The Microsoft Defender Security Research Team has issued a warning about a sophisticated, multi-stage phishing campaign targeting organizations in the energy sector. The attack begins with phishing emails sent from trusted, previously compromised accounts and abuses Microsoft SharePoint for payload delivery. After initial compromise, attackers use Adversary-in-the-Middle (AitM) techniques and create inbox rules for persistence. The campaign then evolves into Business Email Compromise (BEC) activity to expand its reach.",
          "categories": [
            "Phishing",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "AitM",
            "BEC",
            "Microsoft 365",
            "SharePoint",
            "energy sector",
            "phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "nike-investigates-data-breach-claim-from-worldleaks-extortion-group",
          "headline": "Nike Probes Data Breach Claim by 'WorldLeaks' Extortion Group",
          "summary": "Global apparel giant Nike has launched an investigation into a potential data breach after being listed as a victim by the 'WorldLeaks' data extortion group. The group, which emerged in 2025 and focuses on data theft without deploying ransomware, threatened to publish stolen Nike data on January 24. Nike has confirmed it is assessing the situation. The type and volume of the allegedly stolen data have not been disclosed by the attackers.",
          "categories": [
            "Data Breach",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "WorldLeaks",
            "cybercrime",
            "data theft",
            "extortion",
            "retail"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "multi-stage-phishing-campaign-targets-russia-with-amnesia-rat-and-ransomware",
          "headline": "Phishing Campaign Hits Russia with Amnesia RAT, Uses GitHub and Dropbox for Payload Delivery",
          "summary": "A sophisticated, multi-stage phishing campaign is targeting users in Russia, delivering a combination of the Amnesia remote access trojan (RAT) and ransomware. The attack, analyzed by Fortinet FortiGuard Labs, is notable for its use of public cloud services like GitHub and Dropbox to host payloads and its use of a tool called 'defendnot' to disable Microsoft Defender antivirus. The campaign relies on social engineering and abuse of native Windows features rather than software exploits to achieve system compromise.",
          "categories": [
            "Phishing",
            "Malware",
            "Ransomware"
          ],
          "tags": [
            "Amnesia RAT",
            "Dropbox",
            "GitHub",
            "Microsoft Defender",
            "defense evasion",
            "phishing",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "malware": [
            "Amnesia RAT",
            "defendnot"
          ]
        },
        {
          "slug": "shinyhunters-claims-breaches-of-crunchbase-betterment-via-okta-vishing",
          "headline": "ShinyHunters Claims Breach of Crunchbase, Betterment via Okta Vishing Attacks",
          "summary": "The notorious cyber extortion syndicate ShinyHunters has claimed responsibility for breaching business intelligence firm Crunchbase and financial advisory company Betterment. According to the threat actor, the initial access was gained by using sophisticated voice phishing (vishing) attacks to socially engineer employees and compromise their Okta single sign-on (SSO) credentials. This method allows attackers to bypass weaker forms of multi-factor authentication. Neither of the targeted companies has publicly confirmed the breach.",
          "categories": [
            "Phishing",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Betterment",
            "Crunchbase",
            "MFA bypass",
            "Okta",
            "ShinyHunters",
            "social engineering",
            "vishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "trend-micro-details-new-rce-exploit-for-metagpt-cve-2026-0761",
          "headline": "Trend Micro Details New RCE Flaw in MetaGPT (CVE-2026-0761)",
          "summary": "Trend Micro has published details and a detection rule for a new high-severity remote code execution (RCE) vulnerability in Foundation Agents MetaGPT, tracked as CVE-2026-0761. The exploit, which occurs over HTTP, can be leveraged by an attacker for initial access into a network or for lateral movement. Trend Micro has released DDI RULE 5627 to detect exploitation attempts and advises organizations to update security products and scan for signs of compromise.",
          "categories": [
            "Vulnerability",
            "Threat Intelligence"
          ],
          "tags": [
            "CVE-2026-0761",
            "MetaGPT",
            "RCE",
            "Trend Micro",
            "exploit",
            "vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "cves": [
            "CVE-2026-0761"
          ]
        },
        {
          "slug": "critical-11-year-old-telnet-vulnerability-cve-2026-24061-disclosed",
          "headline": "Critical 11-Year-Old Telnet Flaw (CVE-2026-24061) with 9.8 CVSS Score Disclosed",
          "summary": "A critical, 11-year-old authentication bypass vulnerability in the GNU InetUtils telnet daemon (telnetd) has been disclosed. Tracked as CVE-2026-24061, the flaw carries a CVSS score of 9.8 out of 10.0 and allows a remote attacker to gain root access on affected systems without authentication. The vulnerability impacts GNU InetUtils versions 1.9.3 through 2.7, posing a severe risk to legacy enterprise systems and embedded devices where the outdated Telnet protocol may still be in use.",
          "categories": [
            "Vulnerability"
          ],
          "tags": [
            "CVE-2026-24061",
            "GNU InetUtils",
            "Telnet",
            "authentication bypass",
            "legacy systems",
            "vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "cves": [
            "CVE-2026-24061"
          ]
        },
        {
          "slug": "sandworm-deploys-new-dynowiper-malware-in-attack-on-polish-power-grid",
          "headline": "Sandworm Deploys New 'DynoWiper' Malware in Failed Attack on Polish Power Grid",
          "summary": "The Russian state-sponsored hacking group Sandworm has been attributed with a major, albeit unsuccessful, cyberattack against Poland's power system in late December 2025. Poland's energy minister described it as the 'largest cyber attack' on their energy infrastructure in years. Cybersecurity firm ESET linked the attack to Sandworm and discovered the use of a previously undocumented destructive malware, which has been named 'DynoWiper'. This incident underscores Sandworm's continued focus on targeting critical infrastructure with new cyber weapons.",
          "categories": [
            "Cyberattack",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "DynoWiper",
            "ICS",
            "OT",
            "Poland",
            "Russia",
            "Sandworm",
            "critical infrastructure",
            "nation-state",
            "wiper malware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "malware": [
            "DynoWiper"
          ]
        },
        {
          "slug": "fully-patched-fortigate-firewalls-compromised-via-sso-bypass",
          "headline": "Warning: Fully Patched FortiGate Firewalls Are Being Compromised via New SSO Bypass",
          "summary": "Security analysts are warning of a new wave of attacks compromising even fully patched Fortinet FortiGate firewalls. The activity, observed since January 15, 2026, allows attackers to bypass SAML-based single sign-on (SSO) authentication to gain administrative access. The attacks result in unauthorized configuration changes, creation of persistent user accounts, and exfiltration of device configurations. Fortinet has reportedly identified a new, distinct attack path related to previously disclosed vulnerabilities (CVE-2025-59718, CVE-2025-59719), suggesting existing patches may not be fully effective.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "FortiGate",
            "Fortinet",
            "SAML",
            "SSO",
            "authentication bypass",
            "firewall",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "cves": [
            "CVE-2025-59718",
            "CVE-2025-59719"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "microsoft-releases-emergency-oob-updates-to-fix-january-patch-tuesday-issues",
        "originalHeadline": "Microsoft Issues Emergency Out-of-Band Patches for Flawed January Updates",
        "updateTitle": "Update: Microsoft Issues Emergency Out-of-Band Patches for Flawed January Updates",
        "updateSummary": "New critical boot failures reported on Windows 11 after January updates, Microsoft investigating.",
        "categories": [
          "Patch Management",
          "Security Operations"
        ],
        "tags": [
          "Bug Fix",
          "KB5078136",
          "KB5078238",
          "Microsoft",
          "Out-of-Band",
          "Patch Tuesday",
          "Remote Desktop",
          "Windows Update"
        ],
        "severity": "medium",
        "publishedAt": "2026-01-24T15:00:00.000Z",
        "updatedAt": "2026-01-25T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}