{
  "lastUpdated": "2025-11-10T16:10:29.906Z",
  "runDate": "2025-11-10",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-10",
      "type": "publication-daily",
      "headline": "China's Cyber Arsenal Exposed in Massive Leak; Critical Flaws Threaten QNAP, Docker, and Kubernetes",
      "articleCount": 10,
      "articles": [
        {
          "slug": "dods-cmmc-program-officially-begins-phased-rollout",
          "headline": "It's Official: DoD Begins Phased Rollout of CMMC Cybersecurity Program",
          "summary": "The U.S. Department of Defense (DoD) has officially started the phased, three-year implementation of its Cybersecurity Maturity Model Certification (CMMC) program as of November 10, 2025. DoD contracting officers can now begin inserting CMMC requirements into new solicitations for the Defense Industrial Base (DIB). The first phase requires contractors handling Federal Contract Information (FCI) or some Controlled Unclassified Information (CUI) to perform self-assessments. More stringent third-party certification requirements for higher CMMC levels will be introduced in subsequent phases, with full implementation expected by late 2028, fundamentally changing the security landscape for all DoD contractors.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Security Operations"
          ],
          "tags": [
            "CMMC",
            "Compliance",
            "DFARS",
            "DIB",
            "DoD",
            "NIST 800-171",
            "Regulatory"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-10T15:00:00.000Z"
        },
        {
          "slug": "osce-releases-new-guide-urging-unified-cyber-physical-security-for-critical-infrastructure",
          "headline": "OSCE Guide Urges Unified Cyber-Physical Defense for Critical Infrastructure",
          "summary": "The Organization for Security and Cooperation in Europe (OSCE) has published a new technical guide advising governments and operators to adopt a unified approach to securing critical infrastructure. The guide emphasizes the growing convergence of physical and cybersecurity domains, warning that siloed security teams lack a holistic view of modern threats. It highlights how internet-connected Industrial Control Systems (ICS) have expanded the attack surface, making infrastructure vulnerable to remote cyberattacks. The document provides recommendations for integrating intrusion detection, access control, and insider threat management into a single, cohesive security framework.",
          "categories": [
            "Industrial Control Systems",
            "Policy and Compliance",
            "Security Operations"
          ],
          "tags": [
            "Critical Infrastructure",
            "Cyber-Physical",
            "Guidance",
            "ICS",
            "OSCE",
            "OT Security",
            "Policy"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-10T15:00:00.000Z"
        },
        {
          "slug": "owasp-top-10-for-2025-released-highlighting-supply-chain-and-design-flaws",
          "headline": "OWASP Top 10 for 2025 Released, Spotlighting Supply Chain and Design Flaws",
          "summary": "The OWASP Foundation has released the 2025 release candidate for its influential Top 10 list of web application security risks. This update signals a major shift in focus, with the introduction of new categories like 'A03: Software Supply Chain Failures' and 'A10: Mishandling of Exceptional Conditions'. 'Broken Access Control' remains the top risk, but 'Security Misconfiguration' has climbed to the number two spot. The 2025 list emphasizes a move away from fixing individual bugs towards addressing systemic root causes like insecure design and dependency management, reflecting the modern threat landscape of complex, interconnected applications.",
          "categories": [
            "Security Operations",
            "Policy and Compliance",
            "Supply Chain Attack"
          ],
          "tags": [
            "AppSec",
            "Application Security",
            "DevSecOps",
            "Insecure Design",
            "OWASP",
            "OWASP Top 10",
            "Supply Chain Security"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-10T15:00:00.000Z"
        },
        {
          "slug": "akira-ransomware-group-claims-attack-on-manufacturer-koch-and-co",
          "headline": "Akira Ransomware Hits US Manufacturer Koch & Co., Threatens to Leak 54GB of Data",
          "summary": "The Akira ransomware group has added U.S. manufacturer Koch & Co., Inc. to its list of victims. In a November 7 post on its dark web leak site, the group claimed to have stolen 54 gigabytes of sensitive corporate data, including detailed financials, contracts, and HR files. Akira is threatening to publish the data if a ransom is not paid. This attack is characteristic of Akira's double-extortion tactics, targeting mid-sized organizations with data exfiltration followed by encryption. Koch & Co. has not yet issued a public statement on the incident.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Akira",
            "Data Breach",
            "Double Extortion",
            "Manufacturing",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-10T15:00:00.000Z",
          "malware": [
            "Akira ransomware"
          ]
        },
        {
          "slug": "eu-public-administrations-face-surging-ddos-and-data-threats-enisa-reports",
          "headline": "EU Governments Under Siege: ENISA Reports Massive Surge in DDoS and Data Attacks",
          "summary": "A new threat landscape report from the EU Agency for Cybersecurity (ENISA) reveals that public administrations across the European Union are facing a dramatic increase in cyberattacks. DDoS attacks, largely driven by pro-Russia hacktivist groups like NoName057(16), account for 60% of all incidents, primarily targeting central governments. While disruptive, the report warns that data breaches (17.4%) and ransomware (10%) pose a more significant threat to the continuity of essential public services. ENISA also highlights ongoing espionage campaigns by Russian and Chinese state actors, and notes that the sector's immaturity under the new NIS2 Directive places it in a high-risk zone.",
          "categories": [
            "Threat Intelligence",
            "Policy and Compliance",
            "Cyberattack"
          ],
          "tags": [
            "DDoS",
            "ENISA",
            "EU",
            "Government",
            "Hacktivism",
            "NIS2",
            "NoName057(16)",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-10T15:00:00.000Z"
        },
        {
          "slug": "swedish-it-supplier-miljodata-hit-by-breach-exposing-data-of-1-5-million-people",
          "headline": "Swedish IT Supplier Breach Exposes Personal Data of 1.5 Million Citizens",
          "summary": "The 'Datacarry' ransomware group has claimed responsibility for a major cyberattack on Miljödata, a Swedish IT supplier for local governments, exposing the sensitive personal data of up to 1.5 million people. The attack, which occurred in August 2025, targeted the company's HR systems, leading to the theft of names, government IDs, and contact information. The 224MB data archive was subsequently published on the dark web. The breach has caused service disruptions for numerous Swedish municipalities and affected data from major companies like SAS and Volvo. The incident is now under a national privacy investigation for potential GDPR violations.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Supply Chain Attack"
          ],
          "tags": [
            "Conti",
            "Data Breach",
            "Datacarry",
            "GDPR",
            "Ransomware",
            "Supply Chain Attack",
            "Sweden"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-10T15:00:00.000Z",
          "malware": [
            "Conti"
          ]
        },
        {
          "slug": "critical-runc-flaws-allow-container-escape-on-docker-and-kubernetes",
          "headline": "CRITICAL: runC Flaws Allow Container Escape, Granting Root on Docker & Kubernetes Hosts",
          "summary": "Three high-severity vulnerabilities have been disclosed in runC, the universal container runtime engine that underpins Docker, Kubernetes, and other major containerization platforms. Tracked as CVE-2025-31133, CVE-2025-52565, and CVE-2025-52881, these flaws could allow a malicious container to break out of its isolated environment and gain root-level access to the underlying host system. The vulnerabilities exploit race conditions and weaknesses in how runC handles file mounts and symlinks. Given runC's ubiquitous use, these flaws pose a widespread threat to cloud and DevOps environments. Patches are available, and administrators are urged to update their container runtimes immediately.",
          "categories": [
            "Vulnerability",
            "Cloud Security",
            "Cyberattack"
          ],
          "tags": [
            "CVE-2025-31133",
            "Cloud Security",
            "Container Escape",
            "Docker",
            "Kubernetes",
            "Vulnerability",
            "runC"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-10T15:00:00.000Z",
          "cves": [
            "CVE-2025-31133",
            "CVE-2025-52565",
            "CVE-2025-52881"
          ]
        },
        {
          "slug": "chinese-firm-knownsec-breached-exposing-state-hacking-tools-and-global-target-lists",
          "headline": "China's Cyber Arsenal Exposed: Knownsec Breach Leaks State Hacking Tools and Global Target Lists",
          "summary": "A monumental data breach at Knownsec, a prominent Chinese cybersecurity firm with close government ties, has resulted in the exposure of over 12,000 classified documents. The leak, which occurred in early November 2025, provides an unprecedented view into China's offensive cyber capabilities, revealing a sophisticated arsenal of malware for multiple operating systems, custom hardware attack tools, and an extensive list of global espionage targets. The compromised data details large-scale data theft from countries including India, South Korea, and Taiwan, targeting critical infrastructure, government databases, and telecommunications networks, signaling a major intelligence failure for China's state-sponsored cyber operations.",
          "categories": [
            "Data Breach",
            "Threat Intelligence",
            "Cyberattack"
          ],
          "tags": [
            "China",
            "Data Leak",
            "Espionage",
            "Hardware Attack",
            "RAT",
            "State-Sponsored Hacking",
            "Threat Intelligence"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-10T15:00:00.000Z"
        },
        {
          "slug": "qnap-patches-seven-critical-zero-day-vulnerabilities-after-pwn2own-exploits",
          "headline": "URGENT: QNAP Patches Seven Critical Zero-Days Allowing Full NAS Takeover",
          "summary": "QNAP has issued urgent security updates to fix seven critical zero-day vulnerabilities affecting its QTS and QuTS hero NAS operating systems and several key applications. These flaws were successfully demonstrated at the Pwn2Own Ireland 2025 hacking competition, where research teams chained them to achieve complete, unauthenticated remote code execution on target devices. The vulnerabilities, which include stack-based buffer overflows and improper input validation, could allow attackers to bypass authentication, gain kernel-level control, and exfiltrate data. All QNAP users are strongly advised to apply the patches immediately to mitigate the significant risk of data breach and service disruption.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "NAS",
            "Patch Management",
            "Pwn2Own",
            "QNAP",
            "RCE",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-10T15:00:00.000Z",
          "cves": [
            "CVE-2025-11837",
            "CVE-2025-59389",
            "CVE-2025-62840",
            "CVE-2025-62842",
            "CVE-2025-62847",
            "CVE-2025-62848",
            "CVE-2025-62849"
          ]
        },
        {
          "slug": "us-congressional-budget-office-confirms-cyberattack-by-suspected-foreign-hackers",
          "headline": "US Congressional Budget Office Hacked, Foreign State Actor Suspected",
          "summary": "The U.S. Congressional Budget Office (CBO), a key nonpartisan federal agency, has confirmed it was the victim of a cyberattack perpetrated by a suspected foreign threat actor. The breach has raised serious national security concerns, as the attackers may have accessed sensitive economic data, draft legislation, and confidential communications between the CBO and Congress. Cybersecurity researchers suggest the attackers may have exploited a known vulnerability in an outdated Cisco ASA firewall that had not been patched since 2024. The incident has triggered an investigation and a warning to all congressional offices about potential data exposure.",
          "categories": [
            "Cyberattack",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "CBO",
            "Cisco ASA",
            "Cyberattack",
            "Espionage",
            "Government",
            "Nation-State",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-10T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-09",
      "type": "publication-daily",
      "headline": "Clop Ransomware Breaches Washington Post; Critical Flaws Found in Docker, QNAP, and AI Models",
      "articleCount": 10,
      "articles": [
        {
          "slug": "microsoft-reveals-whisper-leak-attack-infers-ai-chat-topics-from-encrypted-traffic",
          "headline": "Microsoft 'Whisper Leak' Attack Can Spy on Encrypted AI Chats",
          "summary": "Microsoft researchers have discovered a novel side-channel attack method named 'Whisper Leak' that undermines the privacy of encrypted AI chatbot conversations. By analyzing the size and timing of encrypted data packets from streaming Large Language Models (LLMs), a passive network observer can accurately infer the topic of a conversation. The proof-of-concept attack achieved over 98% accuracy against models from OpenAI, Mistral, xAI, and DeepSeek. While major AI providers have already implemented mitigations following a responsible disclosure, the finding exposes a fundamental privacy risk in the architecture of streaming LLMs, particularly for users in sensitive sectors like law and healthcare.",
          "categories": [
            "Vulnerability",
            "Threat Intelligence",
            "Cloud Security"
          ],
          "tags": [
            "AI Security",
            "Encryption",
            "LLM",
            "Microsoft",
            "Privacy",
            "Side-Channel Attack",
            "Whisper Leak"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z",
          "malware": [
            "Whisper Leak"
          ]
        },
        {
          "slug": "only-10-percent-of-firms-ready-for-ai-powered-cyberattacks-accenture-report",
          "headline": "Accenture Report: 90% of Firms Unprepared for AI-Powered Cyberattacks",
          "summary": "A new report from Accenture, 'State of Cybersecurity Resilience 2025,' reveals a critical gap in corporate defenses against AI-augmented cyberattacks. The study, surveying over 2,200 executives, found that only 10% of organizations are 'Reinvention Ready' with adaptive and resilient security postures. A concerning 63% are in the 'Exposed Zone,' relying on reactive and insufficient defenses. The report highlights that AI adoption is rapidly outpacing security implementation, with 77% of firms lacking the necessary security practices to protect their AI models and data pipelines, creating a significant and growing business risk.",
          "categories": [
            "Policy and Compliance",
            "Threat Intelligence",
            "Regulatory"
          ],
          "tags": [
            "AI Security",
            "Accenture",
            "Cybersecurity Resilience",
            "Governance",
            "Risk Management",
            "Threat Intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "indian-mp-urges-government-to-create-national-cybersecurity-certification-council",
          "headline": "Indian MP Proposes National Council to Standardize Cybersecurity Certifications",
          "summary": "On November 9, 2025, Indian MP Praveen Khandelwal formally requested that the central government establish a National Cybersecurity Certification Council. The proposal aims to standardize cybersecurity education and professional certifications across India to address the growing talent gap and combat a recent surge in cyber fraud and data breaches. By promoting globally recognized certifications like CEH and CCISO, the council would seek to build a skilled workforce, enhance national cyber defense capabilities, and support the 'Digital India' initiative.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Other"
          ],
          "tags": [
            "Certification",
            "Cybersecurity Training",
            "Government",
            "India",
            "Policy",
            "Regulation"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "philippines-lawmakers-propose-dedicated-national-cybersecurity-fund",
          "headline": "Philippines Lawmakers Push for National Cybersecurity Fund",
          "summary": "In the Philippines, Representatives Migz and Luigi Villafuerte have introduced a proposal to create a 'Cybersecurity Risk Management and Mitigation Fund' (CRMMF). This dedicated national fund would provide the government with the necessary resources to prevent and respond to cyberattacks against both public and private sector entities. The proposal comes after recent DDoS attack attempts on local banks and designates 30% of the fund for rapid restoration of critical information infrastructure, signaling a strong political push to enhance the nation's cyber resilience.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Incident Response"
          ],
          "tags": [
            "Critical Infrastructure",
            "Cybersecurity Fund",
            "DDoS",
            "Government",
            "Philippines",
            "Policy"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "security-risk-found-in-chinese-made-electric-buses-across-europe-australia",
          "headline": "Chinese-Made Electric Buses in Europe & Australia Pose Remote Shutdown Risk",
          "summary": "Cybersecurity tests conducted in Norway on November 7, 2025, have uncovered a significant security risk in Chinese-manufactured Yutong electric buses, which are widely used across Europe and Australia. The 'Lion Cage' experiment demonstrated that the buses' connected systems could theoretically be accessed and disabled remotely by the manufacturer. The findings have triggered urgent security reviews by public transit authorities in multiple countries, highlighting the growing national security concerns surrounding internet-connected critical infrastructure and potential vulnerabilities in international supply chains.",
          "categories": [
            "Industrial Control Systems",
            "Cyberattack",
            "Supply Chain Attack"
          ],
          "tags": [
            "Critical Infrastructure",
            "ICS",
            "National Security",
            "Supply Chain Security",
            "Transportation",
            "Yutong"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "glassworm-malware-returns-in-vscode-marketplace-supply-chain-attack",
          "headline": "GlassWorm Malware Hits VSCode Marketplace, Stealing Dev Credentials",
          "summary": "The financially motivated GlassWorm malware campaign has returned, targeting developers through the OpenVSX marketplace for Visual Studio Code. Security researchers discovered three malicious VSCode extensions published on November 8, 2025, which have already been downloaded over 10,000 times. The malware is designed to steal developer credentials, including GitHub and NPM tokens, and exfiltrate data from 49 different cryptocurrency wallet extensions. In a novel twist, the malware uses Solana blockchain transactions to fetch its malicious payload, complicating detection and takedown efforts. The extensions remain active, posing an ongoing threat to the software development community.",
          "categories": [
            "Malware",
            "Supply Chain Attack",
            "Threat Actor"
          ],
          "tags": [
            "Credential Theft",
            "Cryptocurrency",
            "GlassWorm",
            "Malware",
            "OpenVSX",
            "Supply Chain Attack",
            "VSCode"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z",
          "malware": [
            "GlassWorm"
          ]
        },
        {
          "slug": "microsoft-warns-of-payroll-pirates-phishing-campaign",
          "headline": "Microsoft Warns of 'Payroll Pirates' Phishing Gang Targeting M365 Credentials",
          "summary": "Microsoft has issued a warning about a sophisticated phishing campaign dubbed 'Payroll Pirates.' The attackers impersonate HR departments in targeted emails to lure employees into giving up their Microsoft 365 credentials. The campaign uses spoofed domains and legitimate Microsoft Forms to appear authentic. The ultimate goal of the operation is to gain access to employee accounts, alter their direct deposit information, and divert their payroll to attacker-controlled bank accounts. This form of Business Email Compromise (BEC) attack poses a direct financial threat to employees, and Microsoft urges organizations to enable multi-factor authentication as a key defense.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Data Breach"
          ],
          "tags": [
            "BEC",
            "Business Email Compromise",
            "Credential Theft",
            "Microsoft 365",
            "Payroll Fraud",
            "Phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "washington-post-confirms-breach-in-massive-oracle-software-attack",
          "headline": "Washington Post Breached by Clop Ransomware via Oracle Flaws",
          "summary": "The Washington Post has officially confirmed it was a victim of a large-scale cyberattack orchestrated by the Clop ransomware group. The threat actors exploited vulnerabilities in Oracle's E-Business Suite, compromising over 100 organizations globally. The campaign involves data exfiltration followed by aggressive extortion tactics, with Clop publicly naming victims on its dark web leak site to pressure them into paying ransoms reportedly as high as $50 million. This incident underscores the significant risk posed by vulnerabilities in widely used enterprise software and the sophisticated, multi-faceted extortion methods employed by modern ransomware gangs.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Clop",
            "Data Breach",
            "E-Business Suite",
            "Extortion",
            "Oracle",
            "Ransomware",
            "TA505"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "critical-flaws-in-runc-container-runtime-threaten-docker-kubernetes",
          "headline": "Critical Container Escape Flaws in runC Threaten Docker & Kubernetes",
          "summary": "A security alert issued on November 9, 2025, warns of three new critical vulnerabilities in runC, the low-level container runtime used by Docker, Kubernetes, and other major container platforms. The flaws could allow a malicious actor to execute a 'container escape,' breaking out of the isolated container environment to gain unauthorized access to the underlying host operating system. A successful container escape is a worst-case scenario in cloud-native security, as it would allow an attacker to compromise all other containers on the host. Administrators of all containerized environments are urged to monitor for and apply patches immediately.",
          "categories": [
            "Vulnerability",
            "Cloud Security",
            "Patch Management"
          ],
          "tags": [
            "Cloud Security",
            "Container Escape",
            "Docker",
            "Kubernetes",
            "Vulnerability",
            "Zero-Day",
            "runC"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "qnap-patches-seven-zero-day-vulnerabilities-from-pwn2own-2025",
          "headline": "QNAP Patches 7 Zero-Days Allowing Full NAS Takeover",
          "summary": "QNAP has issued urgent security updates to address seven zero-day vulnerabilities affecting its QTS, QuTS hero, and related software. These critical flaws were successfully exploited by security researchers at the Pwn2Own Ireland 2025 hacking contest in October, demonstrating paths to unauthenticated remote code execution (RCE) and full system takeover. The vulnerabilities, including buffer overflows and path traversal issues, impact the NAS operating systems as well as integrated applications like HBS 3 Hybrid Backup Sync and Malware Remover. QNAP users are strongly urged to apply the patches immediately to protect their data from potential attack.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "NAS",
            "Patch Management",
            "Pwn2Own",
            "QNAP",
            "RCE",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z",
          "cves": [
            "CVE-2025-11837",
            "CVE-2025-62840",
            "CVE-2025-62842",
            "CVE-2025-62847",
            "CVE-2025-62848",
            "CVE-2025-62849"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "76-percent-of-orgs-cant-match-speed-of-ai-powered-attacks",
        "originalHeadline": "Over 75% of Orgs Can't Keep Pace with AI-Powered Attacks, Survey Finds",
        "updateTitle": "Update: Over 75% of Orgs Can't Keep Pace with AI-Powered Attacks, Survey Finds",
        "updateSummary": "Accenture report confirms widespread unpreparedness for AI-powered cyberattacks, with 90% of firms unready and 77% lacking AI security practices.",
        "categories": [
          "Threat Intelligence",
          "Ransomware",
          "Policy and Compliance"
        ],
        "tags": [
          "AI",
          "CrowdStrike",
          "artificial intelligence",
          "cybersecurity survey",
          "ransomware",
          "threat landscape"
        ],
        "severity": "informational",
        "publishedAt": "2025-10-22T15:00:00.000Z",
        "updatedAt": "2025-11-09T00:00:00.000Z"
      },
      {
        "slug": "pwn2own-ireland-day-1-hackers-earn-522k-for-34-zero-days",
        "originalHeadline": "Pwn2Own Day 1: Hackers Net $522K for 34 Zero-Days in SOHO Devices",
        "updateTitle": "Update: Pwn2Own Day 1: Hackers Net $522K for 34 Zero-Days in SOHO Devices",
        "updateSummary": "QNAP has released urgent patches for 7 zero-day vulnerabilities exploited at Pwn2Own Ireland 2025, including RCE flaws, affecting QTS and QuTS hero.",
        "categories": [
          "Vulnerability",
          "IoT Security",
          "Threat Intelligence"
        ],
        "tags": [
          "IoT",
          "Pwn2Own",
          "SOHO",
          "ZDI",
          "hacking",
          "vulnerability",
          "zero-day"
        ],
        "severity": "high",
        "publishedAt": "2025-10-22T15:00:00.000Z",
        "updatedAt": "2025-11-09T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}