{
  "lastUpdated": "2026-01-20T16:52:48.431Z",
  "runDate": "2026-01-20",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-20",
      "type": "publication-daily",
      "headline": "Ingram Micro Breach Exposes 42k; UK Warns of Pro-Russia DDoS; New Ransomware Threats Emerge",
      "articleCount": 12,
      "articles": [
        {
          "slug": "ceos-cisos-split-on-ai-cybersecurity-risks-rewards-survey-finds",
          "headline": "CEOs Optimistic, CISOs Wary: Survey Reveals Deep Divide on AI's Cybersecurity Impact",
          "summary": "A new survey by specialty insurer AXIS Capital, released on January 20, 2026, reveals a significant perception gap between CEOs and CISOs regarding the role of artificial intelligence in cybersecurity. While CEOs are largely optimistic about AI's productivity and security benefits, CISOs are more acutely aware of the new risks it introduces, including data leakage, model manipulation, and sophisticated AI-driven attacks. This disconnect could lead to misaligned security strategies and underinvestment in critical risk areas.",
          "categories": [
            "Policy and Compliance",
            "Security Operations",
            "Other"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "CEO",
            "CISO",
            "cybersecurity leadership",
            "risk management",
            "survey"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        },
        {
          "slug": "gtmaritime-launches-gt-identify-to-bolster-maritime-cybersecurity-compliance",
          "headline": "GTMaritime Launches 'GT Identify' to Tackle Maritime Cybersecurity and Compliance",
          "summary": "Maritime technology firm GTMaritime has launched GT Identify, a new cybersecurity system designed to help ship operators comply with increasingly stringent regulations. Announced on January 20, 2026, the system provides fleet-wide hardware and software asset inventory, vulnerability reporting, and aligns with the NIST Cybersecurity Framework. The launch addresses the growing need for robust cyber risk management to meet IMO and IACS E26/E27 requirements.",
          "categories": [
            "Policy and Compliance",
            "Industrial Control Systems",
            "Patch Management"
          ],
          "tags": [
            "IACS",
            "IMO",
            "NIST",
            "asset management",
            "compliance",
            "cybersecurity",
            "maritime",
            "shipping"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        },
        {
          "slug": "dragonforce-emerges-as-new-ransomware-cartel-using-lockbit-and-conti-code",
          "headline": "'DragonForce' Emerges as New Ransomware Cartel Built on LockBit and Conti DNA",
          "summary": "A new Ransomware-as-a-Service (RaaS) operation named DragonForce has emerged, positioning itself as a \"ransomware cartel.\" The group is reportedly building its operations on the leaked source code of the notorious LockBit 3.0 and Conti ransomware variants. Operating a RaaS platform called 'Ransombay,' DragonForce's strategy includes absorbing smaller rival operations, signaling a trend towards consolidation in the cybercrime ecosystem.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "Conti",
            "DragonForce",
            "LockBit",
            "RaaS",
            "Ransombay",
            "cybercrime",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "Conti",
            "LockBit 3.0",
            "Ransombay"
          ]
        },
        {
          "slug": "evelyn-stealer-malware-targets-developers-via-vs-code-extensions",
          "headline": "'Evelyn Stealer' Malware Targets Developers in Malicious VS Code Extensions",
          "summary": "A sophisticated, multi-stage malware campaign is deploying the 'Evelyn' information stealer by hiding it within malicious Visual Studio Code (VSC) extensions. First analyzed by Trend Micro, the malware specifically targets software developers to exfiltrate a wide range of sensitive data, including browser credentials, system information, clipboard data, and cryptocurrency wallets. The campaign highlights the growing risk of supply chain attacks originating from compromised developer environments.",
          "categories": [
            "Malware",
            "Supply Chain Attack",
            "Threat Intelligence"
          ],
          "tags": [
            "Evelyn",
            "Visual Studio Code",
            "developer security",
            "infostealer",
            "malware",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "Evelyn"
          ]
        },
        {
          "slug": "crashfix-campaign-uses-fake-ad-blocker-to-crash-browsers-and-push-malware",
          "headline": "Fake Ad Blocker Crashes Chrome, Tricks Users into Installing 'ModeloRAT' Malware",
          "summary": "A novel malware campaign dubbed \"CrashFix\" is using a malicious Google Chrome extension that impersonates the 'uBlock Origin Lite' ad blocker to intentionally crash victims' browsers. The attack, attributed to a group called 'KongTuke,' then uses social engineering, presenting a fake crash report that tricks users into running a PowerShell command to \"fix\" the issue. This command ultimately downloads and installs 'ModeloRAT,' a previously undocumented Python-based remote access trojan.",
          "categories": [
            "Malware",
            "Phishing",
            "Threat Actor"
          ],
          "tags": [
            "Chrome extension",
            "KongTuke",
            "LOLBAS",
            "ModeloRAT",
            "malware",
            "social engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "CrashFix",
            "ModeloRAT",
            "NexShield"
          ]
        },
        {
          "slug": "ingram-micro-discloses-ransomware-attack-impacting-42000-individuals",
          "headline": "Ingram Micro Breach Exposes Data of 42,000 After Safepay Ransomware Attack",
          "summary": "Global IT distributor Ingram Micro has officially notified 42,521 individuals that their personal and sensitive information, including Social Security numbers, was stolen during a ransomware attack in July 2025. The incident, attributed to the Safepay ransomware group, compromised employment and job applicant records. After Ingram Micro reportedly refused to pay the ransom, the threat actors published the stolen 3.5 terabytes of data on their dark web leak site.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Supply Chain Attack"
          ],
          "tags": [
            "PII",
            "Safepay",
            "Social Security Number",
            "data breach",
            "ransomware",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        },
        {
          "slug": "north-korean-apt-konni-abuses-google-ads-in-operation-poseidon",
          "headline": "North Korean 'Konni' APT Weaponizes Google Ads to Deliver EndRAT Malware",
          "summary": "The North Korean state-sponsored threat group Konni is conducting a sophisticated spear-phishing campaign dubbed \"Operation Poseidon.\" The advanced persistent threat (APT) actor is weaponizing Google advertising URLs to make malicious links appear legitimate, thereby bypassing security filters and tricking users. The campaign's ultimate goal is to deliver the 'EndRAT' malware, a remote access trojan, onto victim systems.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Phishing"
          ],
          "tags": [
            "APT",
            "EndRAT",
            "Google Ads",
            "Konni",
            "North Korea",
            "malvertising",
            "spear-phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "EndRAT"
          ]
        },
        {
          "slug": "pdfsider-backdoor-uses-dll-side-loading-to-evade-defenses",
          "headline": "Stealthy 'PDFSIDER' Backdoor Uses DLL Side-Loading to Bypass EDR and AV",
          "summary": "Security researchers at Resecurity have uncovered a new stealthy backdoor, dubbed 'PDFSIDER,' that uses a DLL side-loading technique to evade EDR and antivirus solutions. The malware masquerades as a legitimate PDF application to load a malicious DLL, establishing an encrypted command-and-control channel for long-term, covert access. The backdoor is already being actively used by ransomware groups, including the notorious Qilin gang, for payload delivery.",
          "categories": [
            "Malware",
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "DLL side-loading",
            "EDR evasion",
            "PDFSIDER",
            "Qilin",
            "Resecurity",
            "backdoor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "PDFSIDER"
          ]
        },
        {
          "slug": "hacktivists-and-cybercriminals-expand-attacks-on-ics-and-ai-systems",
          "headline": "Threat Landscape Converges as Attackers Target ICS and AI Systems",
          "summary": "New research from Cyble highlights a dangerous convergence of threats, as both hacktivists and financially motivated cybercriminals are increasingly targeting Industrial Control Systems (ICS), Operational Technology (OT), and enterprise AI systems. The report, published January 20, 2026, notes that attackers are exploiting exposed HMI and SCADA systems while also leveraging AI to create polymorphic malware and more effective social engineering lures.",
          "categories": [
            "Threat Intelligence",
            "Industrial Control Systems",
            "Cyberattack"
          ],
          "tags": [
            "AI security",
            "ICS",
            "OT",
            "SCADA",
            "cybercrime",
            "hacktivism",
            "threat intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        },
        {
          "slug": "uk-ncsc-warns-of-persistent-pro-russia-hacktivist-ddos-attacks",
          "headline": "UK NCSC Sounds Alarm on Pro-Russia Hacktivist DDoS Attacks Targeting CNI",
          "summary": "The UK's National Cyber Security Centre (NCSC) has issued a formal alert warning of persistent and disruptive denial-of-service (DoS) attacks from Russian-aligned hacktivist groups. The ideologically motivated attacks are primarily targeting UK local government and critical national infrastructure (CNI), including operational technology (OT) systems. The NCSC named the group NoName057(16) as particularly active and urged organizations to bolster their defenses.",
          "categories": [
            "Cyberattack",
            "Threat Actor",
            "Industrial Control Systems"
          ],
          "tags": [
            "CNI",
            "DDoS",
            "NCSC",
            "NoName057(16)",
            "OT",
            "Russia",
            "UK",
            "hacktivism"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "DDoSia"
          ]
        },
        {
          "slug": "cyberattack-on-belgian-hospital-forces-shutdown-patient-transfers",
          "headline": "Cyberattack Forces Belgian Hospital to Shut Down, Cancel Surgeries, and Transfer Patients",
          "summary": "A severe cyberattack on the AZ Monica hospital network in Belgium has forced a complete IT shutdown across its two campuses in Deurne and Antwerp. The incident led to the cancellation of all scheduled surgeries, the suspension of most treatments, and the emergency transfer of seven critical care patients to other facilities. The hospital's emergency department is operating at a reduced capacity, and an investigation by the Federal Police's Computer Crime Unit is underway.",
          "categories": [
            "Cyberattack",
            "Ransomware",
            "Industrial Control Systems"
          ],
          "tags": [
            "Belgium",
            "cyberattack",
            "healthcare",
            "hospital",
            "patient safety",
            "ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        },
        {
          "slug": "south-korean-conglomerate-kyowon-hit-by-major-ransomware-attack",
          "headline": "South Korean Giant Kyowon Group Hit by Ransomware, 9.6 Million Accounts at Risk",
          "summary": "The South Korean conglomerate Kyowon Group has confirmed it suffered a significant ransomware attack that disrupted operations and resulted in data exfiltration. The attack, detected on January 10, 2026, compromised approximately 600 of the company's 800 servers. South Korean authorities estimate that up to 9.6 million user accounts (representing 5.5 million unique individuals) may have been affected, as attackers reportedly exploited an open external port to gain initial access.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Kyowon",
            "South Korea",
            "cyberattack",
            "data breach",
            "ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-19",
      "type": "publication-daily",
      "headline": "Google Gemini Flaw Exposes Calendar Data; Black Basta Ransomware Leader on EU's Most Wanted",
      "articleCount": 12,
      "articles": [
        {
          "slug": "cloud-security-incidents-surge-costing-firms-over-5-million-per-breach",
          "headline": "Cloud Breaches Skyrocket, Now Costing Firms an Average of $5.1 Million",
          "summary": "Recent reports analyzing the 2025-2026 threat landscape reveal a significant and sustained increase in attacks against cloud infrastructure. Cloud-targeted attacks rose 21% year-over-year, with 81% of organizations experiencing at least one cloud security incident. The primary causes are not sophisticated exploits but fundamental security lapses: credential compromise was the top attack vector, followed closely by cloud misconfigurations and insecure APIs. The financial consequences are severe, with the average cost of a cloud data breach climbing to an estimated $5.1 million in 2026, highlighting an urgent need for improved cloud security posture management.",
          "categories": [
            "Cloud Security",
            "Policy and Compliance",
            "Data Breach"
          ],
          "tags": [
            "API Security",
            "Cloud Misconfiguration",
            "Cloud Security",
            "Credential Compromise",
            "Cybersecurity Statistics",
            "Data Breach"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z"
        },
        {
          "slug": "ransomware-and-supply-chain-attacks-reached-record-levels-in-2025",
          "headline": "Report: Ransomware Attacks Soared 52%, Supply Chain Attacks Nearly Doubled in 2025",
          "summary": "A new report from Cyble analyzing the 2025 cyber threat landscape reveals a record-breaking year for both ransomware and supply chain attacks. Ransomware incidents surged by 52%, with 6,604 attacks documented, while supply chain attacks saw a massive 93% increase to 297 events. The report highlights a dangerous convergence of these threats, with ransomware groups now perpetrating over half of all supply chain attacks by compromising a single software vendor to deploy ransomware to all its customers. The Qilin ransomware group was the most active player for the year, underscoring the persistent and evolving nature of these high-impact threats heading into 2026.",
          "categories": [
            "Ransomware",
            "Supply Chain Attack",
            "Threat Intelligence"
          ],
          "tags": [
            "Cybersecurity Report",
            "Cyble",
            "LockBit",
            "Qilin",
            "Ransomware",
            "Supply Chain Attack",
            "Threat Landscape"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z",
          "malware": [
            "Ransomware"
          ]
        },
        {
          "slug": "raaga-pass-sport-breaches-added-to-have-i-been-pwned-16m-records",
          "headline": "16.6 Million Records Exposed: Raaga and Pass'Sport Breaches Added to Have I Been Pwned",
          "summary": "The Have I Been Pwned (HIBP) data breach notification service has been updated with over 16.6 million user records from two separate incidents. The first breach involves 10.2 million users of the Indian music streaming service Raaga, which occurred in December 2025 and exposed names, email addresses, and MD5-hashed passwords. The second breach affects 6.4 million users of the French government's Pass'Sport program, also from December 2025, exposing names, dates of birth, and email addresses. Users of these services are urged to check HIBP and change their passwords, especially for the Raaga breach, due to the high risk of credential stuffing attacks from the weakly hashed passwords.",
          "categories": [
            "Data Breach"
          ],
          "tags": [
            "Credential Stuffing",
            "Data Breach",
            "HIBP",
            "Have I Been Pwned",
            "MD5",
            "Pass'Sport",
            "Raaga"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z"
        },
        {
          "slug": "jordanian-access-broker-pleads-guilty-to-selling-network-access",
          "headline": "Access Broker Pleads Guilty After Selling Access to 50 Companies to Undercover FBI Agent",
          "summary": "A Jordanian national has pleaded guilty in a U.S. court for his role as an Initial Access Broker (IAB) in the cybercrime ecosystem. The man admitted to compromising and selling unauthorized access to the corporate networks of approximately 50 different enterprise organizations. The operation was uncovered when he unknowingly sold this access to an undercover U.S. federal agent. The case highlights the critical role IABs play in the cybercrime supply chain, providing the initial foothold for major threat actors like ransomware groups, and demonstrates the effectiveness of law enforcement sting operations in disrupting these criminal enterprises.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Policy and Compliance"
          ],
          "tags": [
            "Cybercrime",
            "FBI",
            "IAB",
            "Initial Access Broker",
            "Ransomware",
            "Threat Actor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z"
        },
        {
          "slug": "evelyn-stealer-malware-targets-developers-via-malicious-vs-code-extensions",
          "headline": "Evelyn Stealer: New Malware Hits Developers Through Malicious VS Code Extensions",
          "summary": "A new information-stealing malware, named Evelyn Stealer, is being distributed through malicious extensions on the Microsoft Visual Studio Code (VS Code) Marketplace. Researchers at Trend Micro and Koi Security report the campaign specifically targets software developers to steal credentials, cryptocurrency wallet data, and other sensitive information. Three malicious extensions—`BigBlack.bitcoin-black`, `BigBlack.codo-ai`, and `BigBlack.mrbigblacktheme`—have been identified as the distribution vectors. This supply chain attack highlights the significant risk posed by unvetted third-party tools in development environments, as compromising a single developer can provide a gateway into an entire organization's critical infrastructure.",
          "categories": [
            "Malware",
            "Supply Chain Attack",
            "Threat Actor"
          ],
          "tags": [
            "Developer Security",
            "Evelyn Stealer",
            "InfoStealer",
            "Malware",
            "Supply Chain Attack",
            "Visual Studio Code"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z",
          "malware": [
            "Evelyn Stealer"
          ]
        },
        {
          "slug": "healthcare-breaches-double-amid-shadow-ai-and-vendor-risk",
          "headline": "Healthcare Data Breaches Double, Fueled by 'Shadow AI' and Vendor Risk",
          "summary": "The healthcare industry is facing a cybersecurity crisis, with a new report indicating that the number of data breaches doubled in the past year. The surge is being driven by two key factors: the unmanaged use of generative AI tools by staff, termed 'shadow AI,' and persistent, unmitigated risks from third-party vendors. This dangerous trend is exemplified by the McLaren data breach, where a ransomware attack compromised the sensitive health information of over 743,000 patients. The report highlights a lack of confidence within the sector to handle these evolving threats, urging organizations to gain visibility into AI usage and implement far more stringent vendor risk management programs.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Policy and Compliance"
          ],
          "tags": [
            "Data Breach",
            "HIPAA",
            "Healthcare",
            "Ransomware",
            "Shadow AI",
            "Third-Party Risk",
            "Vendor Risk"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z",
          "malware": [
            "Ransomware"
          ]
        },
        {
          "slug": "leader-of-black-basta-ransomware-on-eu-most-wanted-list",
          "headline": "Manhunt: Black Basta Ransomware Leader Added to EU's Most Wanted List After Raids",
          "summary": "An international law enforcement operation has targeted the prolific Black Basta ransomware group, which is linked to over 600 attacks and millions in ransom payments. Police in Ukraine conducted raids against two suspected members of the syndicate. Concurrently, an international arrest warrant and an INTERPOL Red Notice have been issued for a Russian national believed to be the group's founder and leader. The individual has been placed on the EU's Most Wanted list, signaling a high-priority, coordinated effort to dismantle one of the world's most active ransomware operations.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Black Basta",
            "Cybercrime",
            "EU Most Wanted",
            "INTERPOL",
            "Law Enforcement",
            "Ransomware",
            "Threat Actor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z",
          "malware": [
            "Black Basta Ransomware"
          ]
        },
        {
          "slug": "north-korean-apt-scarcruft-evolves-tactics-in-artemis-campaign",
          "headline": "ScarCruft APT: North Korean Hackers Evolve Tactics in 'Artemis' Campaign",
          "summary": "The North Korean advanced persistent threat (APT) group ScarCruft, also known as APT37 or Reaper, has launched a new campaign dubbed 'Artemis'. Active since late 2025, the campaign targets entities likely in South Korea using malicious Hanword Word Processor (HWP) documents. Researchers report that ScarCruft has evolved its tactics, now employing steganography to hide malicious code within image files and leveraging legitimate cloud services, specifically Yandex Cloud, for its command and control (C2) infrastructure. This shift makes the group's activities harder to detect, as their C2 traffic blends in with legitimate cloud service activity.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "APT",
            "APT37",
            "North Korea",
            "Reaper",
            "ScarCruft",
            "Steganography",
            "Threat Actor",
            "Yandex Cloud"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z"
        },
        {
          "slug": "malicious-chrome-extensions-caught-hijacking-enterprise-user-sessions",
          "headline": "Warning: Malicious Chrome Extensions Hijack Workday, NetSuite Sessions to Bypass MFA",
          "summary": "Security researchers have uncovered five malicious Google Chrome extensions that impersonate legitimate add-ons for popular enterprise SaaS applications like Workday and NetSuite. The extensions are designed to perform session hijacking by stealing active session cookies and tokens after a user logs in. This technique allows attackers to completely bypass security controls, including multi-factor authentication (MFA), and gain full, authenticated access to the user's account. The stolen sessions can be used to exfiltrate sensitive corporate data, such as financial records and employee PII, highlighting the significant threat posed by unvetted browser extensions in corporate environments.",
          "categories": [
            "Malware",
            "Data Breach",
            "Cloud Security"
          ],
          "tags": [
            "Chrome Extension",
            "MFA Bypass",
            "Malware",
            "NetSuite",
            "SaaS Security",
            "Session Hijacking",
            "Workday"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z"
        },
        {
          "slug": "google-gemini-prompt-injection-flaw-exposes-private-calendar-data",
          "headline": "Weaponized Invites: Google Gemini Flaw Allows Calendar Data Theft via Prompt Injection",
          "summary": "Security researchers from Miggo Security have uncovered a significant vulnerability in Google Gemini's integration with Google Calendar. The flaw allowed attackers to use an indirect prompt injection technique to exfiltrate summaries of private meetings. By sending a specially crafted calendar invitation containing a hidden malicious prompt, an attacker could trick the AI into executing unauthorized actions when the user made a legitimate query about their calendar. This attack bypassed Google's privacy controls without requiring the user to interact directly with the malicious payload, highlighting emerging security risks in applications integrated with large language models (LLMs).",
          "categories": [
            "Vulnerability",
            "Cloud Security",
            "Data Breach"
          ],
          "tags": [
            "AI Security",
            "Data Exfiltration",
            "Google Calendar",
            "Google Gemini",
            "LLM Security",
            "Prompt Injection"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z"
        },
        {
          "slug": "critical-vulnerability-in-tp-link-vigi-cameras-allows-remote-hacking",
          "headline": "Patch Now: Critical Flaw Exposes Thousands of TP-Link VIGI Cameras to Remote Hacking",
          "summary": "TP-Link has issued urgent firmware updates for a critical vulnerability in its VIGI line of security cameras. The flaw could allow an unauthenticated remote attacker to gain unauthorized access to the devices, potentially viewing, modifying, or deleting surveillance footage. At the time of disclosure, researchers discovered over 2,500 VIGI cameras were exposed to the public internet and vulnerable to this attack. Owners are strongly advised to update their camera firmware immediately and ensure their devices are not directly accessible from the internet to mitigate the significant risk of compromise.",
          "categories": [
            "Vulnerability",
            "IoT Security",
            "Patch Management"
          ],
          "tags": [
            "Firmware",
            "IoT Security",
            "Patch Management",
            "Remote Hacking",
            "TP-Link",
            "VIGI",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z"
        },
        {
          "slug": "critical-sql-injection-and-authorization-flaws-disclosed-with-public-exploits",
          "headline": "Public Exploits Released for Critical SQLi and RCE Flaws in Business Software",
          "summary": "Multiple critical and high-severity vulnerabilities have been disclosed in various business software products, with proof-of-concept (PoC) exploits made public, elevating the risk of immediate attack. A critical SQL injection flaw (CVE-2026-1179) affects Yonyou KSOA 9.0. A critical command injection vulnerability (CVE-2026-1192) was found in Tosei Online Store Management System 1.01. Additionally, a high-severity improper authorization bug (CVE-2026-1193) impacts MineAdmin. Since vendors reportedly did not respond before disclosure, users of these products are urged to apply immediate mitigations to prevent compromise.",
          "categories": [
            "Vulnerability",
            "Cyberattack"
          ],
          "tags": [
            "CVE-2026-1179",
            "CVE-2026-1192",
            "CVE-2026-1193",
            "Command Injection",
            "Public Exploit",
            "RCE",
            "SQL Injection",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-19T15:00:00.000Z",
          "cves": [
            "CVE-2026-1179",
            "CVE-2026-1192",
            "CVE-2026-1193"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "threat-reports-detail-record-breaking-ransomware-activity-in-2025",
        "originalHeadline": "Ransomware Attacks Skyrocket 58% in 2025, Setting New Records",
        "updateTitle": "Update: Ransomware Attacks Skyrocket 58% in 2025, Setting New Records",
        "updateSummary": "New report highlights a 93% surge in supply chain attacks in 2025, with ransomware groups leveraging them for mass deployment, significantly increasing the overall threat landscape.",
        "categories": [
          "Ransomware",
          "Threat Intelligence",
          "Threat Actor"
        ],
        "tags": [
          "Akira",
          "GuidePoint Security",
          "LockBit",
          "Qilin",
          "RaaS",
          "Ransomware",
          "Symantec",
          "Threat Intelligence"
        ],
        "severity": "high",
        "publishedAt": "2026-01-16T15:00:00.000Z",
        "updatedAt": "2026-01-19T12:00:00.000Z"
      },
      {
        "slug": "2025-data-breaches-driven-by-misconfigurations-and-supply-chain-attacks",
        "originalHeadline": "2025 in Review: Simple Errors, Not 0-Days, Caused Biggest Breaches",
        "updateTitle": "Update: 2025 in Review: Simple Errors, Not 0-Days, Caused Biggest Breaches",
        "updateSummary": "Cloud breaches surged 21% in 2025, costing $5.1M per incident, driven by credential compromise, misconfigurations, and insecure APIs.",
        "categories": [
          "Data Breach",
          "Supply Chain Attack",
          "Cloud Security"
        ],
        "tags": [
          "2025 Review",
          "Cloud Security",
          "Data Breach",
          "Default Password",
          "Misconfiguration",
          "Supply Chain Attack"
        ],
        "severity": "informational",
        "publishedAt": "2025-12-26T15:00:00.000Z",
        "updatedAt": "2026-01-19T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}