{
  "lastUpdated": "2025-11-05T13:57:51.262Z",
  "runDate": "2025-11-05",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-05",
      "type": "publication-daily",
      "headline": "Critical Infrastructure Under Fire: CISA Warns of Major ICS Flaws, State-Sponsor Breaches F5 BIG-IP",
      "articleCount": 10,
      "articles": [
        {
          "slug": "identity-is-the-new-perimeter-cloud-attacks-driven-by-stolen-credentials",
          "headline": "Identity is the New Perimeter: Stolen Credentials and Over-Privileged Accounts Drive Cloud Breaches",
          "summary": "A consensus is forming across the cybersecurity industry: identity is the new security perimeter in the cloud. New reports from ReliaQuest and Amazon Web Services (AWS) reveal that identity-based attacks are the leading driver of cloud security incidents. Key findings show that compromised credentials caused 20% of breaches, while a staggering 99% of cloud identities are 'over-privileged,' possessing excessive permissions. Experts are urging a strategic shift away from network-centric security and towards a 'zero standing privileges' model, where access is granted on a temporary, as-needed basis to mitigate this massive attack surface.",
          "categories": [
            "Cloud Security",
            "Security Operations",
            "Policy and Compliance"
          ],
          "tags": [
            "AWS",
            "CIEM",
            "Cloud Security",
            "IAM",
            "Identity and Access Management",
            "ReliaQuest",
            "Stolen Credentials",
            "Zero Trust"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-05T15:00:00.000Z"
        },
        {
          "slug": "apt-c-60-renews-attacks-on-japan-with-updated-malware-and-tactics",
          "headline": "APT-C-60 Updates Tactics in Ongoing Espionage Campaign Against Japan",
          "summary": "The state-sponsored threat group APT-C-60 is continuing its cyber-espionage campaign targeting Japan and other East Asian regions, according to a new report from JPCERT/CC. The group has updated its TTPs, now attaching malicious VHDX files directly to spear-phishing emails rather than using download links. The attack chain involves a user opening the VHDX, clicking an LNK file, and executing a script via a legitimate Git executable. The group has also shifted its C2 infrastructure from Bitbucket to GitHub and updated its SpyGlace backdoor, demonstrating a persistent and evolving threat.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "APT-C-60",
            "COM Hijacking",
            "Cyber Espionage",
            "GitHub",
            "JPCERT",
            "Japan",
            "SpyGlace",
            "VHDX"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-05T15:00:00.000Z",
          "malware": [
            "SpyGlace"
          ]
        },
        {
          "slug": "dragonforce-cartel-emerges-from-conti-with-upgraded-ransomware",
          "headline": "Conti Successor 'DragonForce' Rebrands as Cartel, Deploys Advanced Ransomware",
          "summary": "The ransomware-as-a-service (RaaS) group DragonForce, which builds upon leaked Conti v3 source code, has rebranded itself as a 'cartel' and is actively recruiting affiliates. According to research from Acronis, the group has upgraded its malware to use a 'bring your own vulnerable driver' (BYOVD) technique to disable security software, using drivers like `truesight.sys`. The group has also been linked to the notorious financially motivated threat actor Scattered Spider, expanding its reach and sophistication. DragonForce has already listed over 200 victims on its leak site, targeting industries like retail, airlines, and MSPs.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "BYOVD",
            "Conti",
            "Double Extortion",
            "DragonForce",
            "RaaS",
            "Ransomware",
            "Scattered Spider"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-05T15:00:00.000Z",
          "malware": [
            "rentdrv2.sys",
            "truesight.sys"
          ]
        },
        {
          "slug": "ernst-young-exposes-4tb-sensitive-data-in-azure-misconfiguration",
          "headline": "Ernst & Young Exposes 4TB Database Backup on Public Azure Server",
          "summary": "Global professional services firm Ernst & Young (EY) has reportedly suffered a major data exposure after a 4-terabyte SQL Server database backup file was left publicly accessible on a Microsoft Azure cloud server. The misconfiguration, discovered by security researchers, exposed a `.BAK` file that likely contained a vast amount of sensitive information, including internal user data, API keys, system credentials, and database schemas. This incident underscores the severe risks associated with simple cloud configuration errors, even at large, security-conscious organizations.",
          "categories": [
            "Data Breach",
            "Cloud Security",
            "Security Operations"
          ],
          "tags": [
            "Azure",
            "CSPM",
            "Cloud Misconfiguration",
            "Data Breach",
            "Data Exposure",
            "Ernst & Young"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-05T15:00:00.000Z"
        },
        {
          "slug": "hackers-claim-breach-of-russian-nuclear-waste-facility-radon",
          "headline": "Hackers Claim Breach and Full Database Theft from Russian Nuclear Waste Facility 'Radon'",
          "summary": "A threat actor has posted on a data leak forum claiming to have breached Radon, a Russian state-owned enterprise responsible for nuclear waste management and operated by the nuclear giant Rosatom. The attackers allege they have stolen the company's entire database, which reportedly includes sensitive test statistics, user IDs, and the personal information of employees. Security experts warn that if the claim is legitimate, the breach poses a severe risk, as the data could be used to forge safety documents, endanger physical safety, or launch sophisticated spear-phishing campaigns against Russia's critical nuclear infrastructure.",
          "categories": [
            "Cyberattack",
            "Data Breach",
            "Industrial Control Systems"
          ],
          "tags": [
            "Critical Infrastructure",
            "Cyberattack",
            "Data Breach",
            "Nuclear",
            "OT",
            "Radon",
            "Rosatom",
            "Russia"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-05T15:00:00.000Z"
        },
        {
          "slug": "cybersecurity-insiders-indicted-for-blackcat-ransomware-attacks",
          "headline": "Insider Threat Shocker: Cybersecurity Pros Charged in BlackCat Ransomware Conspiracy",
          "summary": "In a startling insider threat case, U.S. federal prosecutors have indicted three cybersecurity professionals for allegedly conspiring to deploy the BlackCat/ALPHV ransomware against at least five U.S. companies. The accused include an incident response manager from the cybersecurity firm Sygnia and two ransomware negotiators from DigitalMint. The group is charged with using their specialized knowledge to conduct attacks between May and November 2023, exfiltrating data and extorting millions in ransom payments from victims in the healthcare, engineering, and manufacturing sectors.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Regulatory"
          ],
          "tags": [
            "ALPHV",
            "BlackCat",
            "Cybercrime",
            "Indictment",
            "Insider Threat",
            "Ransomware",
            "Sygnia"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-05T15:00:00.000Z",
          "malware": [
            "BlackCat (ALPHV)"
          ]
        },
        {
          "slug": "swedish-it-firm-miljodata-breach-exposes-1-5-million",
          "headline": "Swedish IT Firm Breach Exposes Data of 1.5 Million, Sparks GDPR Probe",
          "summary": "The Swedish IT services firm Miljödata has suffered a severe data breach, exposing the personal and potentially sensitive information of over 1.5 million people. The incident, which occurred in late August, resulted in the stolen data being published on the darknet. In response, the Swedish Data Protection Authority (IMY) has launched a major investigation under the General Data Protection Regulation (GDPR), targeting both Miljödata and several of its public sector clients, including the City of Gothenburg and Region Västmanland.",
          "categories": [
            "Data Breach",
            "Regulatory",
            "Policy and Compliance"
          ],
          "tags": [
            "Data Breach",
            "GDPR",
            "IMY",
            "PII",
            "Supply Chain Attack",
            "Sweden"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-05T15:00:00.000Z"
        },
        {
          "slug": "cisa-adds-actively-exploited-gladinet-cwp-flaws-to-kev-catalog",
          "headline": "CISA Adds Actively Exploited Gladinet and CWP Flaws to KEV Catalog",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added two new vulnerabilities to its Known Exploited Vulnerabilities (KEV) catalog, confirming they are under active attack. The flaws include an information disclosure bug in Gladinet CentreStack/Triofox (CVE-2025-11371) and an OS command injection vulnerability in CWP Control Web Panel (CVE-2025-48703). Under Binding Operational Directive (BOD) 22-01, federal agencies are mandated to patch these vulnerabilities by a specified deadline, and CISA strongly urges all organizations to prioritize remediation to defend against these active threats.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Threat Intelligence"
          ],
          "tags": [
            "BOD 22-01",
            "CISA",
            "CWP",
            "Command Injection",
            "Gladinet",
            "Information Disclosure",
            "KEV"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-05T15:00:00.000Z",
          "cves": [
            "CVE-2025-11371",
            "CVE-2025-48703"
          ]
        },
        {
          "slug": "cisa-exposes-critical-flaws-in-industrial-control-systems",
          "headline": "CISA Warns of Critical ICS Flaws in Fuji, Delta, and Radiometrics Systems",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has released five advisories detailing critical vulnerabilities in Industrial Control Systems (ICS) from Fuji Electric, Survision, Delta Electronics, Radiometrics, and IDIS. The flaws, which include buffer overflows and authentication bypasses with CVSS scores up to 10.0, could allow remote code execution and severe disruption of critical infrastructure in sectors like manufacturing, energy, and aviation. CISA is urging immediate review and mitigation, as successful exploitation could lead to loss of control over industrial processes and, in some cases, create hazardous physical conditions.",
          "categories": [
            "Industrial Control Systems",
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "Authentication Bypass",
            "Buffer Overflow",
            "CISA",
            "Critical Infrastructure",
            "ICS",
            "OT",
            "SCADA"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-05T15:00:00.000Z",
          "cves": [
            "CVE-2025-12556",
            "CVE-2025-54496",
            "CVE-2025-54526",
            "CVE-2025-58317",
            "CVE-2025-61945"
          ]
        },
        {
          "slug": "state-sponsored-hackers-breach-f5-big-ip-posing-ics-ot-risk",
          "headline": "State-Sponsored Hackers Breach F5, Steal BIG-IP Source Code, Posing Major ICS/OT Risk",
          "summary": "F5 has disclosed a major security breach by a state-sponsored threat actor, identified as UNC5221, who gained prolonged access to the company's BIG-IP engineering and development environments. The attack resulted in the compromise of sensitive source code, vulnerability details, and some customer data. This supply chain attack poses a significant threat to critical infrastructure sectors worldwide, as many organizations rely on F5 BIG-IP appliances to secure the boundary between their IT and sensitive OT/ICS networks. The access to source code could allow the actor to discover and weaponize new zero-day vulnerabilities.",
          "categories": [
            "Supply Chain Attack",
            "Cyberattack",
            "Industrial Control Systems"
          ],
          "tags": [
            "BIG-IP",
            "F5",
            "ICS",
            "OT",
            "State-Sponsored",
            "Supply Chain Attack",
            "UNC5221",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-05T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-04",
      "type": "publication-daily",
      "headline": "Insider Threats, Zero-Days, and Ransomware Shake Global Cybersecurity Landscape",
      "articleCount": 10,
      "articles": [
        {
          "slug": "philippine-police-on-high-alert-for-anticipated-ddos-attacks",
          "headline": "Philippine Police Brace for Coordinated DDoS Attacks on Government Websites",
          "summary": "The Philippine National Police (PNP) has mobilized its cybersecurity units and placed them on high alert in anticipation of a potential large-scale distributed denial-of-service (DDoS) campaign targeting government websites. According to intelligence, the attacks are slated to begin on November 5, 2025. The PNP is coordinating with the Department of Information and Communications Technology (DICT) and other national agencies to harden critical digital infrastructure and prepare rapid response teams to mitigate any disruption to public services.",
          "categories": [
            "Cyberattack",
            "Security Operations",
            "Policy and Compliance"
          ],
          "tags": [
            "DDoS",
            "Philippines",
            "alert",
            "cyberattack",
            "government",
            "threat intelligence"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        },
        {
          "slug": "eu-tests-joint-cyber-crisis-response-in-blueolex-2025-exercise",
          "headline": "EU Stress-Tests Cyber Defenses in Large-Scale Crisis Simulation",
          "summary": "The European Union has concluded its 2025 'Blueprint Operational Level Exercise' (BlueOLEx), a large-scale simulation designed to test and improve the bloc's collective response to major cybersecurity crises. Hosted in Cyprus with support from the EU's cybersecurity agency, ENISA, the exercise brought together senior officials from all member states to role-play a significant cyber incident affecting critical sectors. The drill was the first to test the new EU Cyber Blueprint, which aims to clarify roles and streamline coordination between national authorities and the European Commission during a cross-border attack.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Security Operations"
          ],
          "tags": [
            "BlueOLEx",
            "ENISA",
            "EU",
            "NIS 2",
            "crisis response",
            "cyber exercise",
            "policy"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        },
        {
          "slug": "dragonforce-ransomware-emerges-from-leaked-conti-code-with-cartel-model",
          "headline": "Conti's Ghost: New 'DragonForce' Ransomware Adopts Cartel Model",
          "summary": "A new ransomware operation named DragonForce has been identified by security researchers, notable for its use of leaked source code from the infamous Conti ransomware. Instead of a traditional Ransomware-as-a-Service (RaaS) model, DragonForce operates with a 'cartel-like' structure, providing affiliates with a builder to create their own branded ransomware variants. This approach facilitates the rapid proliferation of new threats, with groups like 'Devman' already seen deploying malware created with the DragonForce builder. The core malware retains Conti's technical features, including its encryption scheme and ability to spread via SMB.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "Conti",
            "DragonForce",
            "RaaS",
            "cartel",
            "malware",
            "ransomware",
            "source code leak"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        },
        {
          "slug": "everest-ransomware-claims-attacks-on-att-dublin-airport-and-svenska-kraftnat",
          "headline": "Everest Ransomware Claims Hits on AT&T, Dublin Airport, and Swedish Power Grid",
          "summary": "The Everest ransomware group has made bold claims of responsibility for a series of high-profile cyberattacks, alleging the theft of massive amounts of data from major international entities. The targets reportedly include U.S. telecom giant AT&T, Dublin Airport, the airline Air Arabia, and Sweden's power grid operator, Svenska kraftnät. The group claims to have exfiltrated millions of customer and employee records and hundreds of gigabytes of internal data, highlighting a focus on critical infrastructure and data-rich organizations.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Everest",
            "aviation",
            "critical infrastructure",
            "data exfiltration",
            "energy",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        },
        {
          "slug": "us-homeland-security-warns-of-rising-cyber-threats-amid-shutdown",
          "headline": "Homeland Security Warns Gov't Shutdown and Lapsed Law Cripple U.S. Cyber Defenses",
          "summary": "The U.S. House Committee on Homeland Security has issued a stark warning in its latest 'Cyber Threat Snapshot,' stating that the nation's ability to defend against cyber threats is being severely hampered. The report cites a dual crisis: a federal government shutdown that furloughs key cybersecurity personnel, and the lapse of the Cybersecurity Information Sharing Act of 2015. This creates 'dangerous blind spots' at a time of heightened threat activity from nation-state actors like China and Iran, and a surge in attacks against U.S. critical infrastructure.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "CISA",
            "Homeland Security",
            "critical infrastructure",
            "government shutdown",
            "information sharing",
            "nation-state",
            "policy"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        },
        {
          "slug": "cybersecurity-professionals-indicted-for-blackcat-ransomware-attacks",
          "headline": "Insider Threat: Cybersecurity Pros Charged in BlackCat Ransomware Spree",
          "summary": "In a shocking case of insider threat, U.S. federal prosecutors have indicted two cybersecurity professionals, Ryan Clifford Goldberg and Kevin Tyler Martin, for their role in a series of ALPHV/BlackCat ransomware attacks. The individuals, who worked in incident response and ransomware negotiation, allegedly used their specialized knowledge to extort at least five U.S. companies between May and November 2023. The attacks targeted organizations across multiple sectors, including healthcare and manufacturing, with one victim paying over $1.2 million in ransom. This case highlights the grave risks posed by malicious insiders within the cybersecurity industry itself.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Data Breach"
          ],
          "tags": [
            "ALPHV",
            "BlackCat",
            "DOJ",
            "extortion",
            "incident response",
            "insider threat",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z",
          "malware": [
            "ALPHV/BlackCat"
          ]
        },
        {
          "slug": "cl0p-ransomware-exploits-oracle-e-business-suite-zero-day-cve-2025-61882",
          "headline": "Cl0p Ransomware Exploits Oracle E-Business Suite Zero-Day, Hits Major Corporations",
          "summary": "The notorious Cl0p ransomware gang is the primary suspect behind a new wave of attacks exploiting a zero-day remote code execution (RCE) vulnerability in Oracle E-Business Suite. The flaw, tracked as CVE-2025-61882, affects the Oracle Concurrent Processing component and has allegedly been used to breach several major corporations. Victims include mining company Pan American Silver, energy giant Schneider Electric, and communications conglomerate Cox Enterprises. Data from the latter two has already been leaked on Cl0p's dark web site, demonstrating the group's continued proficiency in weaponizing zero-day vulnerabilities in enterprise software.",
          "categories": [
            "Ransomware",
            "Vulnerability",
            "Data Breach"
          ],
          "tags": [
            "Cl0p",
            "E-Business Suite",
            "Oracle",
            "RCE",
            "ransomware",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z",
          "cves": [
            "CVE-2025-61882"
          ]
        },
        {
          "slug": "critical-rce-vulnerability-in-react-native-npm-package-cve-2025-11953",
          "headline": "Millions of Devs at Risk: Critical RCE Flaw in Popular React Native Package",
          "summary": "A critical remote code execution (RCE) vulnerability, CVE-2025-11953, has been discovered in a popular React Native command-line tool, putting millions of developers at risk. The flaw, rated 9.8 on the CVSS scale, exists in the '@react-native-community/cli' NPM package and allows an unauthenticated attacker to execute arbitrary code on a developer's machine by sending a malicious request to the Metro development server. This could lead to source code theft, malware injection, or a full-blown supply chain attack. Meta has released a patch, and developers are strongly urged to update their dependencies.",
          "categories": [
            "Vulnerability",
            "Supply Chain Attack",
            "Patch Management"
          ],
          "tags": [
            "NPM",
            "RCE",
            "React Native",
            "developer security",
            "supply chain",
            "vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z",
          "cves": [
            "CVE-2025-11953"
          ]
        },
        {
          "slug": "critical-android-zero-click-rce-flaw-cve-2025-48593",
          "headline": "Patch Now: Critical Zero-Click RCE Flaw Hits Billions of Android Devices",
          "summary": "Google's November 2025 Android Security Bulletin has put users on high alert with the disclosure of CVE-2025-48593, a critical zero-click remote code execution (RCE) vulnerability. The flaw, residing in the Android System component, affects Android versions 13, 14, 15, and 16. Its most dangerous characteristic is that it can be exploited remotely without any user interaction, potentially allowing an attacker to take full control of a device. Google has released patches, and users are urged to update their devices to the 2025-11-01 security patch level or later immediately.",
          "categories": [
            "Vulnerability",
            "Mobile Security",
            "Patch Management"
          ],
          "tags": [
            "Android",
            "RCE",
            "mobile security",
            "patch management",
            "vulnerability",
            "zero-click"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z",
          "cves": [
            "CVE-2025-48581",
            "CVE-2025-48593"
          ]
        },
        {
          "slug": "sk-telecom-profits-plummet-90-percent-after-massive-data-breach",
          "headline": "SK Telecom Profit Plummets 90% After Data Breach Hits 27M Customers",
          "summary": "South Korean telecommunications giant SK Telecom has suffered a catastrophic financial blow, reporting a 90% drop in its third-quarter operating profit. The dramatic decline is a direct result of a massive data breach disclosed in April, which compromised the sensitive personal data of approximately 27 million customers. The costs, stemming from a record regulatory fine of $96.5 million and a $349 million 'customer appreciation package,' underscore the devastating and long-lasting financial consequences of major cybersecurity failures.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Regulatory"
          ],
          "tags": [
            "APT",
            "South Korea",
            "data breach",
            "dwell time",
            "financial impact",
            "telecom"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "f5-discloses-nation-state-breach-source-code-stolen",
        "originalHeadline": "F5 Hacked by Nation-State Actor; BIG-IP Source Code Stolen",
        "updateTitle": "Update: F5 Hacked by Nation-State Actor; BIG-IP Source Code Stolen",
        "updateSummary": "F5 breach now includes customer data, confirmed as supply chain attack, posing major ICS/OT risk with potential for malicious code injection.",
        "categories": [
          "Supply Chain Attack",
          "Data Breach",
          "Threat Actor"
        ],
        "tags": [
          "BIG-IP",
          "BRICKSTORM",
          "Data Breach",
          "Espionage",
          "F5",
          "Nation-State",
          "Source Code",
          "Supply Chain Attack",
          "UNC5221"
        ],
        "cves": [
          "CVE-2025-53868"
        ],
        "malware": [
          "BRICKSTORM"
        ],
        "severity": "critical",
        "publishedAt": "2025-10-17T15:00:00.000Z",
        "updatedAt": "2025-11-05T00:00:00.000Z"
      },
      {
        "slug": "key-us-cyber-information-sharing-law-expires-sparking-concerns",
        "originalHeadline": "US Cyber Threat Sharing Law 'CISA 2015' Expires, Creating Potential Intelligence Gap",
        "updateTitle": "Update: US Cyber Threat Sharing Law 'CISA 2015' Expires, Creating Potential Intelligence Gap",
        "updateSummary": "House Committee warns US cyber defenses crippled by CISA 2015 lapse & government shutdown, citing increased nation-state threats and AI-driven attacks.",
        "categories": [
          "Policy and Compliance",
          "Regulatory",
          "Threat Intelligence"
        ],
        "tags": [
          "CISA",
          "US government",
          "cybersecurity law",
          "information sharing",
          "policy",
          "threat intelligence"
        ],
        "severity": "medium",
        "publishedAt": "2025-10-10T15:00:00.000Z",
        "updatedAt": "2025-11-04T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}