{
  "lastUpdated": "2025-11-26T00:59:38.492Z",
  "runDate": "2025-11-25",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-25",
      "type": "publication-daily",
      "headline": "Massive 'Sha1-Hulud' Supply Chain Attack Compromises 25,000+ GitHub Repos; CISA Warns of Multiple Actively Exploited Zero-Days",
      "articleCount": 10,
      "articles": [
        {
          "slug": "uk-introduces-cyber-security-and-resilience-bill-to-regulate-critical-suppliers",
          "headline": "UK Bill to Regulate Critical Infrastructure Supply Chain for First Time",
          "summary": "The United Kingdom has introduced the Cyber Security and Resilience Bill, a new law that will, for the first time, regulate the cybersecurity practices of suppliers to the nation's critical infrastructure. The bill aims to prevent supply chain attacks by legally requiring companies deemed 'critical suppliers'—such as IT management firms and data centers serving entities like the NHS and energy companies—to meet minimum security standards. These suppliers will also be mandated to report significant breaches to the government and the National Cyber Security Centre (NCSC) and demonstrate robust incident response capabilities.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "NCSC",
            "UK",
            "compliance",
            "critical infrastructure",
            "policy",
            "regulation",
            "supply chain"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "akira-ransomware-exploits-unpatched-sonicwall-devices-during-ma",
          "headline": "Akira Ransomware Targets M&A Blind Spots, Breaching Firms via Inherited SonicWall Devices",
          "summary": "The Akira ransomware group is exploiting security blind spots created during corporate mergers and acquisitions (M&A). According to research by ReliaQuest, Akira affiliates are gaining initial access to acquiring companies by compromising vulnerable SonicWall SSL VPN appliances inherited from smaller, acquired firms. Attackers leverage the fact that the acquiring organizations are often unaware of these unpatched, legacy devices on their new network. Once inside, they use zombie credentials and move laterally, with the time from lateral movement to ransomware deployment averaging less than one hour, highlighting a rapid and effective attack chain.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Akira",
            "M&A",
            "ReliaQuest",
            "SonicWall",
            "ransomware",
            "supply chain",
            "vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "black-friday-phishing-attacks-skyrocket-620-percent-amazon-impersonated",
          "headline": "Black Friday Phishing Attacks Surge Over 600%; Amazon is Top Impersonated Brand",
          "summary": "As the Black Friday shopping season approaches, a new analysis from Darktrace reveals a massive 620% increase in phishing attacks since the beginning of November 2025. Attacks impersonating major retailers like Walmart and Macy's have jumped 54% in the last week alone. Amazon is the most abused brand, featuring in 80% of all major brand impersonation phishing attempts. Researchers warn that attack volumes are expected to climb another 20-30% during the peak shopping week, with cybercriminals using fake 'deal' websites and social engineering to lure victims into giving up personal data and payment information.",
          "categories": [
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "Amazon",
            "Black Friday",
            "Darktrace",
            "brand impersonation",
            "phishing",
            "social engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "cisa-warns-commercial-spyware-targets-signal-whatsapp-users",
          "headline": "CISA: Commercial Spyware Hijacking Signal & WhatsApp via Zero-Clicks",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued a critical alert regarding active campaigns using commercial spyware to compromise the Signal and WhatsApp accounts of high-value targets. Attackers are employing sophisticated methods including social engineering, malicious QR codes for device linking, and zero-click exploits that require no user interaction. The campaigns are reportedly targeting current and former government officials, military personnel, and civil society organizations across the U.S., Europe, and the Middle East. CISA warns that initial access to messaging apps is often used as a beachhead to deploy further malware and achieve full device compromise.",
          "categories": [
            "Malware",
            "Mobile Security",
            "Threat Intelligence"
          ],
          "tags": [
            "CISA",
            "Signal",
            "WhatsApp",
            "mobile security",
            "phishing",
            "social engineering",
            "spyware",
            "zero-click"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "remote-disabling-flaw-in-chinese-electric-buses-sparks-european-security-probes",
          "headline": "Flaw in Chinese Electric Buses Allowing Remote Disabling Sparks European Security Probes",
          "summary": "A software vulnerability discovered in Chinese-made electric buses operating in Oslo, Norway, has raised significant security alarms across Europe. The flaw could reportedly allow the vehicles to be remotely disabled, prompting authorities in the UK and Denmark to launch their own investigations into similar bus fleets. This incident has intensified concerns about potential backdoors and kill switches in Chinese technology embedded in critical public infrastructure. The finding comes amid heightened warnings from security agencies about pre-positioned threats in Western networks, such as the 'Volt Typhoon' campaign.",
          "categories": [
            "Industrial Control Systems",
            "Vulnerability",
            "Threat Intelligence"
          ],
          "tags": [
            "China",
            "ICS",
            "SCADA",
            "Volt Typhoon",
            "backdoor",
            "critical infrastructure",
            "transportation",
            "vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "banking-vendor-situsamc-hit-by-supply-chain-attack-client-data-stolen",
          "headline": "Supply Chain Breach at Banking Vendor SitusAMC Exposes Client Financial Data",
          "summary": "SitusAMC, a major third-party technology and services provider for the banking and real estate finance industry, has disclosed a cyberattack that occurred on November 12, 2025. The attackers breached SitusAMC's systems and exfiltrated sensitive data belonging to its banking clients, including accounting records and legal agreements. Personal data of the banks' customers was also compromised. The incident, which did not involve ransomware, is being investigated with the assistance of the FBI. It serves as a stark reminder of the significant supply chain risks within the heavily regulated financial services sector.",
          "categories": [
            "Supply Chain Attack",
            "Data Breach",
            "Regulatory"
          ],
          "tags": [
            "FBI",
            "SitusAMC",
            "banking",
            "data breach",
            "financial services",
            "supply chain attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z"
        },
        {
          "slug": "fortinet-warns-of-actively-exploited-fortiweb-zero-day-cve-2025-58034",
          "headline": "Fortinet Warns of Actively Exploited Zero-Day in FortiWeb WAF Appliances",
          "summary": "Fortinet has revealed that a command injection vulnerability in its FortiWeb web application firewall (WAF), CVE-2025-58034, was exploited as a zero-day before a patch was available. The flaw, rated medium severity (CVSS 6.7), allows an authenticated attacker to execute arbitrary code. However, its risk is significantly elevated as it can be chained with another recently disclosed path-traversal zero-day (CVE-2025-64446). This combination allows a remote, unauthenticated attacker to bypass authentication, create an admin account, and achieve full remote code execution. Patches are available and should be applied immediately.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-58034",
            "CVE-2025-64446",
            "FortiWeb",
            "Fortinet",
            "RCE",
            "WAF",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z",
          "cves": [
            "CVE-2025-58034",
            "CVE-2025-64446"
          ]
        },
        {
          "slug": "google-patches-actively-exploited-chrome-v8-zero-day-cve-2025-13223",
          "headline": "Google Patches Actively Exploited Chrome Zero-Day in V8 Engine",
          "summary": "Google has released an emergency security update for its Chrome web browser to fix a high-severity zero-day vulnerability, CVE-2025-13223, that is being actively exploited. The flaw is a type confusion vulnerability in the V8 JavaScript engine, which could allow a remote attacker to achieve arbitrary code execution by tricking a user into visiting a malicious website. The patch has been released for Chrome version 142.0.7444.175 on Windows, macOS, and Linux. Users of other Chromium-based browsers like Microsoft Edge and Brave are also urged to update immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-13223",
            "Google Chrome",
            "RCE",
            "V8",
            "patch management",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z",
          "cves": [
            "CVE-2025-13223"
          ]
        },
        {
          "slug": "cisa-orders-patch-for-critical-oracle-identity-manager-rce-flaw-cve-2025-61757",
          "headline": "Patch Now: Critical 9.8 RCE Flaw in Oracle Identity Manager Under Active Attack",
          "summary": "A critical remote code execution (RCE) vulnerability, CVE-2025-61757, in Oracle Identity Manager is being actively exploited by threat actors. The flaw, which has a CVSS score of 9.8, allows an unauthenticated, remote attacker to gain complete control over vulnerable systems via a specially crafted HTTP request. The vulnerability stems from a missing authentication check in the product's REST WebServices component. Due to evidence of in-the-wild exploitation, CISA has added the bug to its Known Exploited Vulnerabilities (KEV) catalog and mandated that all U.S. federal agencies apply the patch by December 12, 2025.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA",
            "CVE-2025-61757",
            "KEV",
            "Oracle",
            "Oracle Identity Manager",
            "RCE",
            "patch management",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z",
          "cves": [
            "CVE-2025-61757"
          ]
        },
        {
          "slug": "sha1-hulud-supply-chain-attack-compromises-25000-github-repos-via-npm",
          "headline": "Sha1-Hulud: Destructive Supply Chain Attack Hits 25,000+ Repos via npm",
          "summary": "A sophisticated and self-propagating software supply chain attack, dubbed 'Sha1-Hulud,' has compromised over 25,000 GitHub repositories since November 21, 2025. The attack leverages hundreds of malicious npm packages that execute code during the `preinstall` phase to steal developer credentials, GitHub tokens, and cloud secrets. The malware exfiltrates stolen data to public GitHub repositories and includes a destructive 'scorched earth' component that wipes the victim's home directory if data theft fails, turning it into a denial-of-service attack. The campaign has impacted packages from major organizations like Zapier, Postman, and ENS Domains, highlighting a severe threat to the open-source ecosystem.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "GitHub",
            "Sha1-Hulud",
            "credential theft",
            "data destruction",
            "malware",
            "npm",
            "supply chain attack"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-25T15:00:00.000Z",
          "malware": [
            "Sha1-Hulud"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-24",
      "type": "publication-daily",
      "headline": "Supply Chain Attacks Cripple NPM and Salesforce; FCC Rolls Back ISP Security Rules",
      "articleCount": 10,
      "articles": [
        {
          "slug": "fcc-rescinds-isp-cybersecurity-rules-amidst-ongoing-threats",
          "headline": "FCC Rolls Back ISP Cybersecurity Rules Despite China-Linked Hacking Threats",
          "summary": "In a controversial decision, the U.S. Federal Communications Commission (FCC) has rescinded cybersecurity regulations for internet service providers (ISPs). These rules were implemented by the Biden Administration following the discovery that the Chinese state-sponsored hacking group Salt Typhoon had breached major U.S. carriers. The revoked rules mandated minimum security standards and compliance certifications. The FCC claimed the original ruling was based on a \"flawed legal analysis,\" but the move has drawn sharp criticism, with Commissioner Anna M. Gomez stating it leaves the country \"less secure\" against increasing nation-state threats.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Actor"
          ],
          "tags": [
            "CALEA",
            "Cybersecurity Policy",
            "FCC",
            "Government",
            "ISP",
            "National Security",
            "Regulation",
            "Salt Typhoon"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "ransomware-attacks-peak-on-holidays-and-weekends-study-shows",
          "headline": "Ransomware Attacks Peak on Holidays and Weekends, Exploiting Low Staffing",
          "summary": "A new global study by Semperis, the \"2025 Holiday Ransomware Risk Report,\" confirms that threat actors strategically launch attacks during holidays and weekends to exploit reduced security staffing. The report found that 52% of organizations were targeted during these off-hour periods. Alarmingly, 78% of companies cut their Security Operation Center (SOC) staffing by 50% or more during these times. The study also revealed that 60% of attacks follow major corporate events like mergers or layoffs, when organizations are most distracted.",
          "categories": [
            "Security Operations",
            "Ransomware",
            "Incident Response"
          ],
          "tags": [
            "Cybersecurity Report",
            "Holiday Security",
            "Incident Response",
            "Ransomware",
            "SOC",
            "Security Operations",
            "Semperis"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "supply-chain-breaches-rise-despite-increased-defense-efforts-report-finds",
          "headline": "Supply Chain Breaches Escalate Despite Maturing Defenses, Report Finds",
          "summary": "A new 2025 report from cybersecurity firm BlueVoyant reveals a troubling trend: despite most organizations maturing their third-party risk management (TPRM) programs, the number of supply chain breaches is escalating. The study found that 97% of surveyed organizations experienced a supplier-related security incident in the past year, a significant jump from 81% in 2024. The report identifies ineffective tool integration and internal organizational silos as key barriers, with the manufacturing sector being particularly hard-hit, averaging 3.8 breaches per organization.",
          "categories": [
            "Security Operations",
            "Policy and Compliance",
            "Supply Chain Attack"
          ],
          "tags": [
            "BlueVoyant",
            "Cybersecurity Report",
            "Manufacturing",
            "Risk Management",
            "Supply Chain Security",
            "TPRM",
            "Third-Party Risk Management"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "akira-ransomware-hits-lg-energy-solution-claims-1-7tb-data-theft",
          "headline": "Akira Ransomware Gang Hits LG Energy Solution, Claims 1.7TB Data Theft",
          "summary": "South Korean battery manufacturing giant LG Energy Solution has confirmed it was the victim of a ransomware attack at one of its overseas facilities. The notorious Akira ransomware gang has claimed responsibility for the breach, alleging on its dark web leak site that it stole 1.7 terabytes of data from the company's network. While LG Energy Solution reports that the affected systems have been restored and its headquarters was not impacted, the incident highlights the continued threat of double-extortion ransomware attacks against the manufacturing sector. The Akira gang has been highly active, often gaining initial access via compromised VPN credentials.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Akira",
            "Data Breach",
            "Double Extortion",
            "LG Energy Solution",
            "Manufacturing",
            "Ransomware",
            "VPN"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z",
          "malware": [
            "Akira Ransomware"
          ]
        },
        {
          "slug": "italian-it-firm-almaviva-hit-by-cyberattack-2-3tb-of-data-leaked",
          "headline": "Italian IT Firm Almaviva Hit by Cyberattack, 2.3TB of Data Leaked",
          "summary": "The prominent Italian IT services provider Almaviva has confirmed it was hit by a major cyberattack, resulting in the theft and leaking of nearly 2.3 terabytes of sensitive data. The breach has exposed information from several of Almaviva's clients, most notably Italy's national railway operator, Ferrovie dello Stato Italiane. The leaked files reportedly include highly sensitive data such as passenger passport details, employee records, financial documents, and defense-related contracts. The identity of the attackers has not yet been disclosed.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Supply Chain Attack"
          ],
          "tags": [
            "Almaviva",
            "Cyberattack",
            "Data Breach",
            "Data Leak",
            "Ferrovie dello Stato Italiane",
            "IT Services",
            "Italy"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "autumn-dragon-espionage-campaign-targets-southeast-asian-nations",
          "headline": "New \"Autumn Dragon\" Espionage Campaign Targets Southeast Asia",
          "summary": "A newly identified cyber-espionage campaign named \"Autumn Dragon\" has been targeting government and media organizations across Southeast Asia since early 2025. The operation, attributed with medium confidence to a China-nexus Advanced Persistent Threat (APT) group, aims to gather intelligence related to the South China Sea. The attackers use spearphishing emails with malicious WinRAR archives that exploit the vulnerability CVE-2025-8088. Upon execution, a dropper script masquerading as a Windows Defender update retrieves and runs additional payloads to establish a foothold for intelligence gathering.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Vulnerability"
          ],
          "tags": [
            "APT",
            "Autumn Dragon",
            "CVE-2025-8088",
            "China",
            "Cyber Espionage",
            "Southeast Asia",
            "Spearphishing",
            "WinRAR"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z",
          "cves": [
            "CVE-2025-8088"
          ]
        },
        {
          "slug": "salesforce-data-exposed-in-gainsight-supply-chain-attack",
          "headline": "Salesforce Data of 200+ Firms Exposed in Gainsight Supply Chain Breach",
          "summary": "A sophisticated supply chain attack has compromised the sensitive data of over 200 corporate clients using Salesforce. The breach did not originate within Salesforce but through a third-party application from Gainsight. The threat actor group \"Scattered Lapsus$ Hunters,\" reportedly linked to ShinyHunters, claimed responsibility, stating they used stolen authentication tokens to access Gainsight and pivot to connected Salesforce instances. High-profile companies like Atlassian, CrowdStrike, and Verizon were named as victims, though several have denied impact. As a precaution, Salesforce has revoked all active access tokens for Gainsight integrations.",
          "categories": [
            "Supply Chain Attack",
            "Data Breach",
            "Cloud Security"
          ],
          "tags": [
            "Cloud Security",
            "Data Breach",
            "Gainsight",
            "Salesforce",
            "Scattered Lapsus$ Hunters",
            "ShinyHunters",
            "Stolen Tokens",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "wall-street-banks-hit-by-breach-at-mortgage-tech-vendor-situsamc",
          "headline": "Wall Street Banks Hit by Data Breach at Mortgage Technology Vendor SitusAMC",
          "summary": "A significant cyberattack on SitusAMC, a key technology and service provider for the U.S. real estate finance industry, has exposed sensitive data belonging to major Wall Street banks, including JPMorgan Chase, Citi, and Morgan Stanley. The breach, first detected on November 12th, compromised both corporate data and customer information related to residential mortgages. SitusAMC, which serves most leading firms in the $13.5 trillion mortgage market, confirmed the incident but stated it did not involve ransomware. The attack highlights the systemic risk posed by third-party vendors in the critical financial supply chain.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Cyberattack"
          ],
          "tags": [
            "Citi",
            "Data Breach",
            "Finance",
            "JPMorgan Chase",
            "Morgan Stanley",
            "Mortgage",
            "SitusAMC",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z"
        },
        {
          "slug": "massive-npm-supply-chain-attack-spreads-shai-hulud-worm",
          "headline": "Massive NPM Supply Chain Attack Spreads Self-Replicating \"Shai-Hulud\" Worm",
          "summary": "A significant, ongoing supply chain attack is targeting the NPM JavaScript ecosystem, where a self-replicating worm dubbed \"Shai-Hulud\" has infected over 400 software packages. The attack has a substantial impact on the cryptocurrency sector, compromising at least 10 widely used libraries crucial for the Ethereum Name Service (ENS), including 'content-hash' and 'address-encoder'. The malware functions as a general-purpose credential stealer, exfiltrating secrets like wallet keys from infected developer environments. The scale is vast, with researchers at Wiz observing over 25,000 affected repositories, highlighting a critical threat to developer infrastructure worldwide.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "Credential Stealing",
            "Cryptocurrency",
            "ENS",
            "JavaScript",
            "NPM",
            "Shai-Hulud",
            "Supply Chain Attack",
            "Worm"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z",
          "malware": [
            "Shai-Hulud"
          ]
        },
        {
          "slug": "shadowpad-backdoor-deployed-exploiting-windows-server-vulnerability",
          "headline": "ShadowPad Backdoor Deployed via Critical WSUS Server Vulnerability",
          "summary": "An active intrusion campaign is exploiting a critical remote code execution (RCE) vulnerability, CVE-2025-59287, in Microsoft's Windows Server Update Services (WSUS). Attackers, believed to be Chinese state-sponsored APTs, are leveraging the flaw to gain system-level access and deploy the sophisticated ShadowPad backdoor. The attack chain involves using PowerShell and legitimate system utilities like 'certutil' and 'curl' to download the malware, which is then executed using a DLL sideloading technique for stealth and persistence. The campaign highlights the rapid weaponization of newly disclosed vulnerabilities for espionage purposes.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "CVE-2025-59287",
            "China",
            "DLL Side-Loading",
            "Patch Management",
            "RCE",
            "ShadowPad",
            "WSUS"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-24T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ],
          "malware": [
            "ShadowPad"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "cisa-mandates-7-day-patch-for-actively-exploited-fortinet-fortiweb-zero-day-cve-2025-58034",
        "originalHeadline": "URGENT: CISA Orders 7-Day Patch for Actively Exploited FortiWeb Zero-Day",
        "updateTitle": "Update: URGENT: CISA Orders 7-Day Patch for Actively Exploited FortiWeb Zero-Day",
        "updateSummary": "Fortinet confirms CVE-2025-58034 (medium severity) chains with CVE-2025-64446 (path traversal) for unauthenticated RCE. Patched versions released.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Cyberattack"
        ],
        "tags": [
          "CISA",
          "Command Injection",
          "FortiWeb",
          "Fortinet",
          "KEV",
          "WAF",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-58034",
          "CVE-2025-64446"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-20T15:00:00.000Z",
        "updatedAt": "2025-11-25T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}