{
  "lastUpdated": "2025-10-25T22:46:27.490Z",
  "runDate": "2025-10-25",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-10-25",
      "type": "publication-daily",
      "headline": "CISA Issues Emergency Directive for Actively Exploited Microsoft WSUS Flaw; Ransomware Surges 50% in 2025",
      "articleCount": 11,
      "articles": [
        {
          "slug": "eu-finds-meta-and-tiktok-in-preliminary-breach-of-digital-services-act",
          "headline": "EU Accuses Meta and TikTok of Breaching Digital Services Act Transparency Rules",
          "summary": "The European Commission has issued preliminary findings that Meta's platforms (Facebook and Instagram) and TikTok have breached their obligations under the Digital Services Act (DSA). The Commission alleges the companies failed to provide adequate access to public data for researchers, hindering independent scrutiny of their platforms. Furthermore, Meta is accused of using 'dark patterns' and creating a burdensome process for users to report illegal content. These are initial findings, and both companies will have the opportunity to respond and propose remedies before any final decision or penalties are imposed.",
          "categories": [
            "Regulatory",
            "Policy and Compliance"
          ],
          "tags": [
            "DSA",
            "Dark Patterns",
            "Digital Services Act",
            "EU",
            "Meta",
            "Regulation",
            "TikTok",
            "Transparency"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-25T15:00:00.000Z"
        },
        {
          "slug": "india-implements-new-telecom-cybersecurity-rules-for-imei-and-mobile-validation",
          "headline": "India Enacts New Telecom Cybersecurity Rules for IMEI and Mobile Number Validation",
          "summary": "India's Ministry of Communications has enacted new cybersecurity regulations for its telecommunications sector, effective October 22, 2025. The 'Telecommunications (Telecom Cyber Security) Amendment Rules, 2025' introduce two key measures: the establishment of a centralized Mobile Number Validation (MNV) platform to secure digital communications, and stricter controls on International Mobile Equipment Identity (IMEI) numbers. The new IMEI rules prohibit the assignment of already-used IMEIs to new devices and mandate that sellers and buyers of used devices verify the IMEI against a national database to combat theft and tampering.",
          "categories": [
            "Regulatory",
            "Policy and Compliance",
            "Mobile Security"
          ],
          "tags": [
            "Cybersecurity",
            "IMEI",
            "India",
            "Policy",
            "Regulation",
            "Telecom"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-25T15:00:00.000Z"
        },
        {
          "slug": "uk-singapore-lead-global-initiative-to-secure-supply-chains-from-ransomware",
          "headline": "UK and Singapore Launch Global Guidance to Defend Supply Chains from Ransomware",
          "summary": "The United Kingdom and Singapore have launched new international guidance aimed at helping organizations defend against the escalating threat of supply chain ransomware attacks. Unveiled at a summit for the Counter Ransomware Initiative (CRI), the framework has been endorsed by all 67 member nations. It provides businesses with practical steps to assess the security posture of their suppliers and mitigate vulnerabilities. The initiative comes in response to recent high-profile attacks, such as the one on NHS supplier Synnovis, which demonstrated the cascading and disruptive impact of targeting a single entity within a complex supply chain.",
          "categories": [
            "Policy and Compliance",
            "Supply Chain Attack",
            "Ransomware"
          ],
          "tags": [
            "Counter Ransomware Initiative",
            "NCSC",
            "Policy",
            "Ransomware",
            "Singapore",
            "Supply Chain",
            "Third-Party Risk",
            "UK"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-25T15:00:00.000Z"
        },
        {
          "slug": "un-convention-against-cybercrime-signed-in-hanoi-vietnam",
          "headline": "UN Convention Against Cybercrime Signed in Hanoi Amid Global Endorsement and Controversy",
          "summary": "In a landmark event in Hanoi, Vietnam, representatives from nearly 100 UN member states have signed the United Nations Convention against Cybercrime. Adopted by the UN General Assembly in December 2024, this treaty, also known as the Hanoi Convention, establishes the first global legal framework for international cooperation in combating a wide array of online crimes, including fraud, child exploitation, and money laundering. While hailed as a milestone by the UN Secretary-General, the event drew criticism from rights groups over the choice of Vietnam as the host, and a major tech industry group, the Cybersecurity Tech Accord, declined to attend.",
          "categories": [
            "Policy and Compliance",
            "Regulatory"
          ],
          "tags": [
            "Cybercrime",
            "Hanoi Convention",
            "International Cooperation",
            "Law",
            "Policy",
            "United Nations"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-25T15:00:00.000Z"
        },
        {
          "slug": "lockbit-ransomware-resurfaces-with-new-lockbit-5-0-variant",
          "headline": "LockBit Is Back: Notorious Ransomware Group Returns with Upgraded 'LockBit 5.0'",
          "summary": "The notorious LockBit ransomware group has made a definitive comeback following a major law enforcement disruption earlier in the year. Security researchers at Check Point have identified a new wave of attacks utilizing a significantly upgraded encryptor, dubbed 'LockBit 5.0'. This new variant boasts multi-platform support for Windows, Linux, and ESXi, along with enhanced anti-detection features. The group has actively recruited new affiliates on underground forums and has already targeted at least a dozen organizations across Europe, the Americas, and Asia, signaling the return of one of the world's most prolific ransomware threats.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "Check Point",
            "Cybercrime",
            "ESXi",
            "LockBit",
            "LockBit 5.0",
            "RaaS",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-25T15:00:00.000Z",
          "malware": [
            "LockBit 3.0",
            "LockBit 5.0"
          ]
        },
        {
          "slug": "smishing-triad-campaign-linked-to-194000-malicious-domains",
          "headline": "Massive 'Smishing Triad' Campaign Uses 194,000+ Domains for Global Data Theft",
          "summary": "A highly sophisticated and widespread smishing (SMS phishing) campaign, attributed to a China-linked group dubbed the 'Smishing Triad,' has utilized over 194,000 malicious domains since early 2024. Researchers at Palo Alto Networks' Unit 42 exposed the campaign's massive scale, revealing a decentralized ecosystem of threat actors using fraudulent text messages about unpaid tolls and package deliveries. The primary goal is harvesting a wide range of personal and financial data from victims globally, with a significant focus on the United States. The operation uses rapid domain turnover and a mix of Chinese and U.S. infrastructure to evade detection.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Mobile Security"
          ],
          "tags": [
            "China",
            "Mobile Security",
            "Phishing",
            "Smishing",
            "Smishing Triad",
            "Unit 42"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-25T15:00:00.000Z"
        },
        {
          "slug": "microsoft-october-2025-patch-tuesday-fixes-193-flaws-6-zero-days",
          "headline": "Microsoft's Massive October Patch Tuesday Tackles 193 Flaws, 6 Zero-Days",
          "summary": "Microsoft's October 2025 Patch Tuesday security update is one of the largest of the year, addressing 193 vulnerabilities across its product ecosystem. The update includes patches for nine critical flaws and, most notably, six zero-day vulnerabilities, four of which were actively exploited in the wild. Key products affected include Windows, Office, and various server components. This release also marks the final security update for Windows 10, ending its support lifecycle. Concurrently, Adobe released patches for 36 vulnerabilities in its software, urging users to update their systems promptly to mitigate significant security risks.",
          "categories": [
            "Patch Management",
            "Vulnerability"
          ],
          "tags": [
            "Adobe",
            "Microsoft",
            "Patch Tuesday",
            "RCE",
            "Vulnerability",
            "Windows 10",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-25T15:00:00.000Z",
          "cves": [
            "CVE-2025-49708",
            "CVE-2025-55680",
            "CVE-2025-55692",
            "CVE-2025-55694",
            "CVE-2025-59287"
          ]
        },
        {
          "slug": "nation-state-financial-cybercrime-converge-industrial-sector-targeted",
          "headline": "Nation-State and Financial Cybercrime Blur as Industrial Sector Becomes Top Target",
          "summary": "A new report from Trellix reveals a significant convergence between the tactics of nation-state actors and financially motivated cybercriminals, with both increasingly leveraging AI-powered tools. The industrial sector has emerged as the most targeted industry, accounting for over 36% of attacks analyzed between April and September 2025. The research highlights the dominance of PowerShell as a key attack tool, used in nearly 78% of ransomware campaigns. The United States remains the most targeted nation, and the ransomware landscape is highly fragmented, with the top five groups accounting for less than 40% of all incidents.",
          "categories": [
            "Threat Intelligence",
            "Threat Actor",
            "Industrial Control Systems"
          ],
          "tags": [
            "APT",
            "Cybercrime",
            "ICS",
            "Industrial Sector",
            "PowerShell",
            "Threat Intelligence",
            "Trellix"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-25T15:00:00.000Z"
        },
        {
          "slug": "ransomware-attacks-skyrocket-50-percent-in-2025-qilin-emerges-as-leader",
          "headline": "Ransomware Attacks Surge 50% in 2025; Qilin Group Takes the Lead",
          "summary": "Cybersecurity researchers report a staggering 50% increase in ransomware attacks in 2025, with over 5,000 incidents claimed on dark web leak sites by late October. This surge occurs amidst a significant realignment in the ransomware ecosystem, with formerly dominant groups fading while new and resurgent actors like Qilin take their place. The Qilin group has been particularly prolific, leading in victim counts for most of the past six months. The United States remains the most targeted nation, and the industrial sector is the most heavily impacted industry. PowerShell has become the primary tool for attackers, used in nearly 78% of observed campaigns.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Threat Intelligence"
          ],
          "tags": [
            "Industrial Sector",
            "PowerShell",
            "Qilin",
            "RaaS",
            "Ransomware",
            "The Gentlemen",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-25T15:00:00.000Z"
        },
        {
          "slug": "google-patches-critical-rce-flaw-cve-2025-12036-in-chrome-v8-engine",
          "headline": "Google Issues Emergency Patch for Critical Chrome RCE Flaw Found by AI",
          "summary": "Google has released an emergency security update for the Chrome browser, addressing a critical remote code execution (RCE) vulnerability in its V8 JavaScript engine. The flaw, tracked as CVE-2025-12036, was discovered by Google's internal AI-driven research project, 'Big Sleep.' Successful exploitation could allow an attacker to execute arbitrary code on a user's system by tricking them into visiting a malicious website. The patch has been rolled out for Windows, macOS, and Linux users, who are urged to update their browsers immediately to mitigate the high-severity threat.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "AI",
            "CVE-2025-12036",
            "Google Chrome",
            "Patch Management",
            "RCE",
            "V8",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-25T15:00:00.000Z",
          "cves": [
            "CVE-2025-12036"
          ]
        },
        {
          "slug": "critical-microsoft-wsus-flaw-cve-2025-59287-actively-exploited",
          "headline": "URGENT: CISA Mandates Patch for Actively Exploited WSUS RCE Flaw",
          "summary": "Microsoft has released an emergency out-of-band patch for a critical remote code execution (RCE) vulnerability, CVE-2025-59287, in Windows Server Update Service (WSUS). The flaw, which allows unauthenticated attackers to gain SYSTEM privileges, is being actively exploited in the wild. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, issuing an emergency directive for federal agencies to apply the patch immediately. With a public proof-of-concept exploit available and an estimated 2,500 servers still exposed, organizations are urged to patch or apply mitigations without delay.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA",
            "CVE-2025-59287",
            "KEV",
            "Microsoft",
            "Patch Management",
            "RCE",
            "WSUS",
            "Windows Server",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-25T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-10-24",
      "type": "publication-daily",
      "headline": "Critical WSUS Zero-Day Exploited, Prosper Breach Hits 17.6M, and Iranian APT Deploys 'Phoenix' Backdoor",
      "articleCount": 10,
      "articles": [
        {
          "slug": "lawsuit-filed-against-south-carolina-school-district-after-ransomware-attack",
          "headline": "Lawsuit Hits SC School District After Ransomware Breach",
          "summary": "South Carolina's Lexington-Richland School District 5 (LR5) is facing a class-action lawsuit following a ransomware attack in June 2025 that exposed the personally identifiable information (PII) of over 31,000 students, staff, and alumni. The lawsuit alleges that the school district was negligent in protecting sensitive data and violated state law by failing to provide timely and complete notification of the breach. The compromised data included names, birthdates, Social Security numbers, and financial files, making it one of the most significant breaches for an educational institution in the region.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Regulatory"
          ],
          "tags": [
            "Data Breach",
            "Education Sector",
            "Lawsuit",
            "PII",
            "Ransomware"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "jingle-thief-hackers-exploit-cloud-for-gift-card-fraud",
          "headline": "'Jingle Thief' Group Steals Gift Cards via Cloud & M365",
          "summary": "A financially motivated cybercriminal group dubbed 'Jingle Thief' is actively targeting retail and consumer services companies in a campaign focused on large-scale gift card fraud. According to research from Unit 42, the group gains initial access via credential harvesting from phishing and smishing attacks. They then pivot to the victim's cloud environment, specifically Microsoft 365, to move laterally, find gift card issuance systems, and establish persistence by registering rogue authenticator applications. The campaign highlights a growing trend of abusing legitimate cloud services for financial crime.",
          "categories": [
            "Threat Actor",
            "Cloud Security",
            "Cyberattack"
          ],
          "tags": [
            "Cloud Security",
            "Gift Card Fraud",
            "Jingle Thief",
            "M365",
            "Phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "agenda-qilin-ransomware-abuses-legit-tools-targets-critical-infrastructure",
          "headline": "Agenda Ransomware Evolves, Hits Critical Infrastructure",
          "summary": "The Agenda ransomware group, also known as Qilin, is escalating its attacks by targeting critical infrastructure sectors with evolved tactics. According to research from Trend Micro, the ransomware-as-a-service (RaaS) operation is using a cross-platform approach, abusing legitimate remote management tools and deploying Linux-based ransomware on Windows hosts to evade security. The group also employs Bring Your Own Vulnerable Driver (BYOVD) attacks to neutralize endpoint defenses and steals backup credentials to hinder recovery, primarily targeting high-value organizations in the U.S., Canada, and the U.K.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Industrial Control Systems"
          ],
          "tags": [
            "Agenda Ransomware",
            "BYOVD",
            "Critical Infrastructure",
            "Qilin",
            "RaaS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "iranian-apt-deploys-phoenix-backdoor-against-government-targets",
          "headline": "Iranian APT 'Phoenix' Backdoor Hits 100+ Governments",
          "summary": "A cyber-espionage campaign attributed to an Iranian-linked Advanced Persistent Threat (APT) group has compromised over 100 government institutions worldwide. The attackers are utilizing a custom, multi-stage backdoor dubbed 'Phoenix' to achieve their objectives. Initial access is gained through a mix of credential spraying and spear-phishing. Once inside, the Phoenix backdoor is used to conduct reconnaissance, escalate privileges, and establish long-term persistence for intelligence gathering operations.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "APT",
            "Cyber-espionage",
            "Government",
            "Iran",
            "Phoenix Backdoor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z",
          "malware": [
            "Phoenix"
          ]
        },
        {
          "slug": "north-korean-lazarus-group-targets-european-drone-companies",
          "headline": "Lazarus Group's 'Operation DreamJob' Targets EU Drone-Makers",
          "summary": "The notorious North Korea-linked APT group, Lazarus, is conducting a cyber-espionage campaign dubbed 'Operation DreamJob' targeting European defense and aerospace companies. The campaign specifically focuses on firms involved in Unmanned Aerial Vehicle (UAV) technology. The attackers use sophisticated social engineering, creating fake recruiter profiles and job offers to lure employees. The ultimate goal is to compromise the target's network to steal sensitive intellectual property related to advanced drone technology.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Phishing"
          ],
          "tags": [
            "APT",
            "Cyber-espionage",
            "Defense Industry",
            "Lazarus Group",
            "Operation DreamJob"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "prosper-marketplace-data-breach-impacts-17-million-users",
          "headline": "Massive Prosper Breach Exposes SSNs of 17.6M Users",
          "summary": "Peer-to-peer lending platform Prosper Marketplace has disclosed a massive data breach affecting 17.6 million individuals. The incident, detected on September 2, 2025, involved an unauthorized third party gaining direct access to company databases and exfiltrating a vast trove of sensitive personal and financial data. The stolen information includes full names, Social Security numbers, government-issued IDs, income levels, and IP addresses, placing millions of users at significant risk of identity theft and sophisticated phishing attacks.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Phishing"
          ],
          "tags": [
            "Data Breach",
            "Fintech",
            "Identity Theft",
            "PII",
            "SSN"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "jewett-cameron-operations-disrupted-by-ransomware-attack",
          "headline": "Ransomware Hits Jewett-Cameron, Steals Financial Data",
          "summary": "Jewett-Cameron, an Oregon-based manufacturing and distribution company, has confirmed in an SEC filing that it suffered a ransomware attack on October 15, 2025. The attack caused significant disruption to its business operations and resulted in the theft of sensitive corporate data. The exfiltrated information reportedly includes IT and financial data being prepared for the company's upcoming Form 10-K filing, as well as screen captures from video meetings. The unidentified attackers have demanded a ransom and threatened to leak the stolen material.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Data Exfiltration",
            "Manufacturing",
            "Ransomware",
            "SEC Filing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "tengu-ransomware-claims-attack-on-brazilian-education-provider-unicursos",
          "headline": "Tengu Ransomware Hits Brazilian Education Provider",
          "summary": "The Tengu ransomware group has claimed responsibility for a cyberattack against UniCursos, a prominent education provider in Brazil. The attack, which was posted to the group's leak site on October 23, 2025, follows the common double-extortion model, where the attackers threaten to publish sensitive stolen data if their ransom demands are not met. The incident highlights the continued targeting of the education sector by ransomware gangs, who view them as valuable targets due to the sensitive student and staff data they hold.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Brazil",
            "Double Extortion",
            "Education Sector",
            "Tengu Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "google-patches-sixth-actively-exploited-chrome-zero-day-cve-2025-10585",
          "headline": "Google Patches 6th Actively Exploited Chrome Zero-Day of 2025",
          "summary": "Google has issued an emergency security update for its Chrome web browser to address CVE-2025-10585, a high-severity type confusion vulnerability in the V8 JavaScript engine. This marks the sixth time in 2025 that Google has patched a Chrome zero-day vulnerability that was being actively exploited in the wild. The flaw could allow an attacker to achieve arbitrary code execution on a victim's machine by tricking them into visiting a malicious website. All users of Chrome and other Chromium-based browsers are urged to update immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "Browser Security",
            "CVE-2025-10585",
            "Chrome",
            "RCE",
            "V8 Engine",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z",
          "cves": [
            "CVE-2025-10585"
          ]
        },
        {
          "slug": "critical-wsus-zero-day-cve-2025-59287-actively-exploited",
          "headline": "Urgent Patch for Actively Exploited WSUS Zero-Day!",
          "summary": "Microsoft has released an emergency out-of-band security update for a critical remote code execution (RCE) vulnerability in Windows Server Update Services (WSUS), tracked as CVE-2025-59287. The flaw, which can be exploited by an unauthenticated attacker, is being actively used in attacks, leading the U.S. Cybersecurity and Infrastructure Security Agency (CISA) to add it to its Known Exploited Vulnerabilities (KEV) catalog. A compromise of a WSUS server could grant attackers a powerful foothold within an enterprise network, enabling widespread lateral movement and subsequent attacks. Administrators are urged to apply the patch immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA KEV",
            "CVE-2025-59287",
            "Patch Management",
            "RCE",
            "WSUS",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "microsoft-october-2025-patch-tuesday-fixes-four-zero-days",
        "originalHeadline": "Patch Now: Microsoft Fixes 170+ Flaws, Including Four Actively Exploited Zero-Days",
        "updateTitle": "Update: Patch Now: Microsoft Fixes 170+ Flaws, Including Four Actively Exploited Zero-Days",
        "updateSummary": "Microsoft's October Patch Tuesday now addresses 193 flaws, including 6 zero-days, and marks the end of Windows 10 support. WSUS RCE received an out-of-band fix.",
        "categories": [
          "Patch Management",
          "Vulnerability"
        ],
        "tags": [
          "CISA",
          "CVE-2025-24990",
          "CVE-2025-47827",
          "CVE-2025-59230",
          "KEV",
          "Microsoft",
          "Patch Tuesday",
          "Privilege Escalation",
          "Vulnerability",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-24990",
          "CVE-2025-47827",
          "CVE-2025-49708",
          "CVE-2025-59230",
          "CVE-2025-59234",
          "CVE-2025-59236",
          "CVE-2025-59287",
          "CVE-2025-59291",
          "CVE-2025-59292"
        ],
        "severity": "critical",
        "publishedAt": "2025-10-16T15:00:00.000Z",
        "updatedAt": "2025-10-25T12:00:00.000Z"
      },
      {
        "slug": "ransomware-attacks-on-critical-industries-surge-34-percent",
        "originalHeadline": "Ransomware Attacks on Critical Industries Skyrocket by 34%, KELA Reports",
        "updateTitle": "Update: Ransomware Attacks on Critical Industries Skyrocket by 34%, KELA Reports",
        "updateSummary": "Ransomware attacks surged to 50% increase with over 5,000 incidents; Qilin group now leads, and PowerShell is a dominant attack tool.",
        "categories": [
          "Ransomware",
          "Threat Intelligence",
          "Cyberattack"
        ],
        "tags": [
          "Akira",
          "Clop",
          "CriticalInfrastructure",
          "Cyberattack",
          "KELA",
          "Qilin",
          "Ransomware"
        ],
        "severity": "high",
        "publishedAt": "2025-10-21T15:00:00.000Z",
        "updatedAt": "2025-10-25T12:00:00.000Z"
      },
      {
        "slug": "uk-government-and-ncsc-urge-businesses-to-bolster-cyber-defenses",
        "originalHeadline": "UK Gov & NCSC Issue Urgent Warning to FTSE 350 Boards on Cyber Resilience",
        "updateTitle": "Update: UK Gov & NCSC Issue Urgent Warning to FTSE 350 Boards on Cyber Resilience",
        "updateSummary": "UK and Singapore launch global guidance for supply chain ransomware defense, endorsed by 67 nations.",
        "categories": [
          "Policy and Compliance",
          "Regulatory",
          "Security Operations"
        ],
        "tags": [
          "FTSE 350",
          "NCSC",
          "UK",
          "board responsibility",
          "cyber resilience",
          "governance",
          "supply chain security"
        ],
        "severity": "informational",
        "publishedAt": "2025-10-22T15:00:00.000Z",
        "updatedAt": "2025-10-25T00:00:00.000Z"
      },
      {
        "slug": "critical-rce-flaw-cve-2025-59287-in-windows-server-update-services",
        "originalHeadline": "Critical RCE Flaw in WSUS Allows Unauthenticated SYSTEM Takeover",
        "updateTitle": "Update: Critical RCE Flaw in WSUS Allows Unauthenticated SYSTEM Takeover",
        "updateSummary": "WSUS RCE (CVE-2025-59287) now actively exploited in the wild; CISA adds to KEV catalog, prompting emergency out-of-band patch.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Supply Chain Attack"
        ],
        "tags": [
          "CVE-2025-59287",
          "Patch Tuesday",
          "RCE",
          "WSUS",
          "critical vulnerability",
          "deserialization",
          "supply chain"
        ],
        "cves": [
          "CVE-2025-59287"
        ],
        "severity": "critical",
        "publishedAt": "2025-10-19T15:00:00.000Z",
        "updatedAt": "2025-10-24T00:00:00.000Z"
      },
      {
        "slug": "prosper-lending-data-breach-affects-17-million",
        "originalHeadline": "Massive Prosper Data Breach Exposes Social Security Numbers of 17.6 Million Users",
        "updateTitle": "Update: Massive Prosper Data Breach Exposes Social Security Numbers of 17.6 Million Users",
        "updateSummary": "Prosper breach details emerge: government IDs, dates of birth, credit standing exposed via direct database access, increasing identity theft risk.",
        "categories": [
          "Data Breach",
          "Phishing",
          "Cloud Security"
        ],
        "tags": [
          "Data Breach",
          "Fintech",
          "Identity Theft",
          "PII",
          "Prosper",
          "Social Security Number"
        ],
        "severity": "critical",
        "publishedAt": "2025-10-20T15:00:00.000Z",
        "updatedAt": "2025-10-24T00:00:00.000Z"
      },
      {
        "slug": "iran-linked-muddywater-apt-targets-governments-with-phoenix-backdoor",
        "originalHeadline": "Iran's MuddyWater APT Targets 100+ Governments with Phoenix Backdoor",
        "updateTitle": "Update: Iran's MuddyWater APT Targets 100+ Governments with Phoenix Backdoor",
        "updateSummary": "Iranian APT campaign targeting 100+ governments expands scope globally, now using credential spraying alongside phishing for initial access with its multi-stage Phoenix backdoor.",
        "categories": [
          "Threat Actor",
          "Cyberattack",
          "Phishing"
        ],
        "tags": [
          "APT",
          "Iran",
          "MENA",
          "MuddyWater",
          "Phoenix",
          "cyber-espionage",
          "macros",
          "phishing"
        ],
        "malware": [
          "Phoenix"
        ],
        "severity": "high",
        "publishedAt": "2025-10-22T15:00:00.000Z",
        "updatedAt": "2025-10-24T00:00:00.000Z"
      },
      {
        "slug": "palo-alto-networks-uncovers-smishing-and-gift-card-fraud-campaigns",
        "originalHeadline": "Unit 42 Exposes 'Smishing Deluge' from China and 'Jingle Thief' Gift Card Fraud",
        "updateTitle": "Update: Unit 42 Exposes 'Smishing Deluge' from China and 'Jingle Thief' Gift Card Fraud",
        "updateSummary": "Jingle Thief campaign evolves, now infiltrating Microsoft 365 environments, registering rogue MFA applications for persistence, and issuing unauthorized gift cards.",
        "categories": [
          "Phishing",
          "Threat Intelligence",
          "Cloud Security"
        ],
        "tags": [
          "China",
          "Cloud Security",
          "Fraud",
          "Gift Card",
          "Phishing",
          "Smishing",
          "Unit 42"
        ],
        "severity": "medium",
        "publishedAt": "2025-10-23T15:00:00.000Z",
        "updatedAt": "2025-10-24T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}