{
  "lastUpdated": "2025-11-21T20:15:06.417Z",
  "runDate": "2025-11-21",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-21",
      "type": "publication-daily",
      "headline": "ShinyHunters Breaches Salesforce Ecosystem via Gainsight; SEC Drops Landmark SolarWinds Lawsuit",
      "articleCount": 10,
      "articles": [
        {
          "slug": "scattered-spider-suspects-plead-not-guilty-in-transport-for-london-hack",
          "headline": "'Scattered Spider' Suspects Plead Not Guilty in TfL Cyberattack Case",
          "summary": "Two British teenagers, Thalha Jubair (19) and Owen Flowers (18), have pleaded not guilty to charges related to a major 2024 cyberattack on Transport for London (TfL). UK law enforcement believes the pair are members of the notorious 'Scattered Spider' hacking collective. The attack caused millions in losses and compromised customer data. Flowers also faces charges for attacks on U.S. healthcare organizations SSM Health and Sutter Health. The case highlights the severe legal consequences facing alleged members of this prolific cybercrime group.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Policy and Compliance"
          ],
          "tags": [
            "Cybercrime",
            "MFA Fatigue",
            "NCA",
            "SIM Swapping",
            "Scattered Spider",
            "Social Engineering",
            "TfL"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-21T15:00:00.000Z"
        },
        {
          "slug": "new-bactor-ransomware-emerges-with-double-extortion-tactics",
          "headline": "New 'Bactor' Ransomware Strain Discovered with Double-Extortion Tactics",
          "summary": "A new ransomware variant named 'Bactor' has been identified by security researchers. Targeting Windows systems, Bactor employs double-extortion tactics, encrypting files and threatening to leak exfiltrated data if a ransom is not paid within a 48-hour deadline. The malware actively attempts to hinder recovery by executing commands to delete Volume Shadow Copies, removing built-in Windows backups. After encryption, files are appended with the '.bactor' extension, and a ransom note named '#HowToRecover.txt' is dropped on the victim's system.",
          "categories": [
            "Ransomware",
            "Malware"
          ],
          "tags": [
            "Bactor",
            "Double Extortion",
            "Malware",
            "Ransomware",
            "Windows",
            "vssadmin"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-21T15:00:00.000Z",
          "malware": [
            "Bactor Ransomware"
          ]
        },
        {
          "slug": "global-agencies-launch-effort-against-bulletproof-hosting-providers",
          "headline": "Global Coalition Targets 'Bulletproof' Hosting Services Fueling Cybercrime",
          "summary": "An international coalition of cybersecurity agencies, including the NSA, CISA, and the FBI, has launched a coordinated effort to combat 'bulletproof' hosting (BPH) providers. These services knowingly lease infrastructure to cybercriminals for activities like ransomware and phishing. A new joint advisory urges Internet Service Providers (ISPs) and network defenders to adopt strategies to identify, block, and report these malicious hosts. The guidance focuses on a nuanced approach, including creating high-confidence blocklists and improving 'know your customer' processes, to disrupt the foundational infrastructure of cybercrime.",
          "categories": [
            "Policy and Compliance",
            "Threat Intelligence",
            "Regulatory"
          ],
          "tags": [
            "BPH",
            "Bulletproof Hosting",
            "CISA",
            "Cybercrime Infrastructure",
            "FBI",
            "NSA",
            "Threat Intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-21T15:00:00.000Z"
        },
        {
          "slug": "sans-report-shows-rising-ot-ics-cyber-incidents-driven-by-ransomware",
          "headline": "SANS Report: OT/ICS Cyber Incidents Rising, 40% Cause Downtime",
          "summary": "A new report from the SANS Institute highlights a dangerous trend in the security of Operational Technology (OT) and Industrial Control Systems (ICS). The '2025 State of ICS/OT Security Report' found that over 21% of organizations experienced a cyber incident in their OT environment in the past year. Of those, 40.3% suffered operational downtime. Ransomware was a primary cause, responsible for 37.9% of incidents, with unauthorized external connections being the top initial access vector. The report also points to a significant 'resilience gap,' with recovery times often exceeding one month.",
          "categories": [
            "Industrial Control Systems",
            "Threat Intelligence",
            "Ransomware"
          ],
          "tags": [
            "Critical Infrastructure",
            "ICS Security",
            "OT Security",
            "Ransomware",
            "SANS",
            "Threat Report"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-21T15:00:00.000Z",
          "malware": [
            "Ransomware"
          ]
        },
        {
          "slug": "sec-dismisses-lawsuit-against-solarwinds-and-ciso-timothy-brown",
          "headline": "SEC Abandons Landmark Lawsuit Against SolarWinds and its CISO",
          "summary": "In a surprising move, the U.S. Securities and Exchange Commission (SEC) has voluntarily dismissed its civil enforcement action against SolarWinds and its CISO, Timothy G. Brown. The lawsuit, filed in October 2023, had accused the company and Brown of misleading investors about their cybersecurity posture before the 2020 SUNBURST supply chain attack. The dismissal is seen as a major victory for the cybersecurity community, which had feared the case would set a dangerous precedent for holding security executives personally liable for breaches and create a chilling effect on transparency.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Cyberattack"
          ],
          "tags": [
            "APT29",
            "CISO Liability",
            "Cybersecurity Law",
            "Legal",
            "SEC",
            "SUNBURST",
            "SolarWinds"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-21T15:00:00.000Z",
          "malware": [
            "SUNBURST"
          ]
        },
        {
          "slug": "uk-introduces-bill-to-expand-cybersecurity-regulations-to-msps",
          "headline": "UK Proposes Major Cybersecurity Bill to Regulate MSPs and Data Centres",
          "summary": "The UK government has introduced the Cyber Security and Resilience Bill, a significant legislative reform aimed at strengthening the nation's cyber defenses. The bill will expand the scope of the existing Network and Information Systems (NIS) Regulations to include managed service providers (MSPs) and data centre operators for the first time. It also proposes a stricter, two-tier penalty system with fines up to £17 million or 4% of global turnover, and mandates faster incident reporting, bringing the UK's rules more in line with the EU's NIS2 Directive.",
          "categories": [
            "Regulatory",
            "Policy and Compliance"
          ],
          "tags": [
            "Compliance",
            "Cybersecurity Regulation",
            "Data Center",
            "MSP",
            "NIS Regulations",
            "NIS2",
            "UK"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-21T15:00:00.000Z"
        },
        {
          "slug": "inc-ransomware-claims-attack-on-burj-khalifa-fire-safety-provider-naffco",
          "headline": "INC Ransomware Claims Breach of Burj Khalifa Fire-Safety Provider NAFFCO",
          "summary": "The INC ransomware group has claimed responsibility for a major cyberattack against NAFFCO, a Dubai-based fire-safety engineering firm known for its work on iconic structures like the Burj Khalifa. The threat actors posted on their dark web leak site that they exfiltrated 1 terabyte of sensitive data, including corporate contracts, financial records, and employee PII. To substantiate their claims, the group published 47 screenshots of the allegedly stolen files. NAFFCO, which reports $4.4 billion in annual revenue, has not yet commented on the incident.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Burj Khalifa",
            "Data Leak",
            "Double Extortion",
            "INC Ransom",
            "NAFFCO",
            "Ransomware-as-a-Service"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-21T15:00:00.000Z"
        },
        {
          "slug": "shinyhunters-implicated-in-salesforce-data-breach-via-gainsight-app",
          "headline": "ShinyHunters Hits Salesforce Again, Breaching Customers via Gainsight App",
          "summary": "Salesforce has disclosed a significant data breach affecting its customers, stemming from a compromised connection with the Gainsight customer success application. The notorious cybercrime group ShinyHunters, also tracked as UNC6240, has claimed responsibility for the attack, stating they exploited OAuth tokens to gain unauthorized access to approximately 285 additional Salesforce instances. In response, Salesforce has revoked credentials and removed the Gainsight apps from its AppExchange. The incident highlights the growing risk of supply chain attacks targeting trusted third-party SaaS integrations to pivot into major enterprise environments.",
          "categories": [
            "Supply Chain Attack",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "API Security",
            "OAuth",
            "SaaS Security",
            "Supply Chain",
            "Third-Party Risk",
            "UNC6240"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-21T15:00:00.000Z"
        },
        {
          "slug": "wel-companies-investigated-for-data-breach-affecting-122960-people",
          "headline": "WEL Companies Investigated for Data Breach Affecting 122,960 People",
          "summary": "The law firm Schubert Jonckheer & Kolbe LLP is investigating transportation and logistics firm WEL Companies, Inc., following a data breach that compromised the sensitive personal information of 122,960 people. The breach, which exposed names, Social Security numbers, and driver's license numbers, was first detected in January 2025. However, the company only began notifying victims in November 2025, a delay of nearly ten months that could lead to legal action for violating data breach notification laws.",
          "categories": [
            "Data Breach",
            "Policy and Compliance"
          ],
          "tags": [
            "Class Action",
            "Data Breach",
            "Logistics",
            "Notification Delay",
            "PII",
            "SSN",
            "Social Security Number"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-21T15:00:00.000Z"
        },
        {
          "slug": "microsoft-patches-actively-exploited-windows-kernel-zero-day-cve-2025-62215",
          "headline": "Microsoft Patches Actively Exploited Windows Kernel Zero-Day Flaw",
          "summary": "Microsoft's November 2025 Patch Tuesday update addresses 63 vulnerabilities, including a critical zero-day flaw in the Windows Kernel, CVE-2025-62215, that is being actively exploited. The vulnerability is an elevation of privilege bug with a CVSS score of 7.0. A local attacker who has already gained initial access can exploit a race condition to execute code with full SYSTEM-level privileges. Due to its active exploitation, Microsoft urges all users to apply the November security updates immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-62215",
            "KEV",
            "Microsoft",
            "Patch Tuesday",
            "Privilege Escalation",
            "Windows Kernel",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-21T15:00:00.000Z",
          "cves": [
            "CVE-2025-62215"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-20",
      "type": "publication-daily",
      "headline": "CISA Mandates Urgent Patching for Actively Exploited Fortinet, Chrome, and Windows Zero-Days",
      "articleCount": 10,
      "articles": [
        {
          "slug": "ai-powered-cyberattacks-surge-malware-emails-up-131-percent-report",
          "headline": "AI-Driven Attacks Explode: Malware Emails Spike 131%, Report Finds",
          "summary": "A new cybersecurity report from Hornetsecurity highlights a dramatic increase in AI-powered cyberattacks throughout 2025. The analysis of over 72 billion emails revealed that the volume of malware-laden emails grew by 131% year-over-year, while phishing and scam attempts also rose significantly. The report attributes this surge to threat actors' adoption of generative AI, which enables the creation of highly convincing and sophisticated malicious content at scale. In response, 77% of CISOs now view AI-generated phishing as a major threat, and 68% of organizations have invested in AI-powered defenses, signaling a new 'arms race' in cybersecurity.",
          "categories": [
            "Threat Intelligence",
            "Phishing",
            "Malware"
          ],
          "tags": [
            "AI",
            "Email Security",
            "Generative AI",
            "Malware",
            "Phishing",
            "Threat Intelligence"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-20T15:00:00.000Z"
        },
        {
          "slug": "cisa-publishes-six-new-advisories-for-industrial-control-systems-ics",
          "headline": "CISA Issues 6 New ICS Advisories for Schneider Electric, Shelly, METZ CONNECT",
          "summary": "On November 19, 2025, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) released six new Industrial Control Systems (ICS) advisories, highlighting multiple vulnerabilities in products from Schneider Electric, Shelly, and METZ CONNECT. The alerts affect a range of operational technology (OT) products, including SCADA systems and power monitoring devices. Four of the advisories are for Schneider Electric products like EcoStruxure and PowerChute. CISA urges administrators in critical infrastructure and manufacturing sectors to review the advisories and apply the recommended mitigations to prevent potential exploitation.",
          "categories": [
            "Industrial Control Systems",
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "ICS",
            "OT Security",
            "SCADA",
            "Schneider Electric",
            "Vulnerability"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-20T15:00:00.000Z"
        },
        {
          "slug": "cisa-launches-be-air-aware-guides-to-defend-critical-infrastructure-from-drone-threats",
          "headline": "CISA Releases \"Be Air Aware\" Guides to Combat Drone Threats",
          "summary": "As part of Critical Infrastructure Security and Resilience Month, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has released three new guides under its \"Be Air Aware™\" campaign. These resources are designed to help critical infrastructure owners and operators understand, assess, and mitigate the growing security risks posed by Unmanned Aircraft Systems (UAS), or drones. The guides provide actionable information on detecting suspicious drone activity, implementing detection technologies, and safely handling downed aircraft, aiming to integrate aerial threat considerations into existing security plans.",
          "categories": [
            "Policy and Compliance",
            "Industrial Control Systems",
            "Security Operations"
          ],
          "tags": [
            "CISA",
            "Critical Infrastructure",
            "Drones",
            "Physical Security",
            "Policy",
            "UAS"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-20T15:00:00.000Z"
        },
        {
          "slug": "cisa-and-fbi-release-guide-to-combat-malicious-bulletproof-hosting-providers",
          "headline": "CISA and Partners Release Guide to Combat Bulletproof Hosting",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA), along with the FBI, NSA, and international partners, has published a comprehensive guide to help network defenders and Internet Service Providers (ISPs) combat the threat of bulletproof hosting (BPH) providers. These services knowingly lease infrastructure to cybercriminals for a wide range of malicious activities, including ransomware, phishing, and malware distribution. The guide, 'Bulletproof Defense,' provides actionable recommendations for filtering malicious traffic, enhancing network monitoring, and improving intelligence sharing to disrupt the criminal ecosystem that relies on BPH for anonymity and resilience.",
          "categories": [
            "Policy and Compliance",
            "Threat Intelligence",
            "Security Operations"
          ],
          "tags": [
            "BPH",
            "Bulletproof Hosting",
            "CISA",
            "ISP",
            "Policy",
            "Threat Intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-20T15:00:00.000Z"
        },
        {
          "slug": "new-nova-stealer-malware-targets-macos-users-for-cryptocurrency-wallets",
          "headline": "New 'Nova Stealer' Malware Targets macOS Crypto Wallets",
          "summary": "A new information-stealing malware, dubbed 'Nova Stealer,' has been discovered actively targeting Apple macOS users. The malware's primary goal is the exfiltration of sensitive data, with a specific focus on cryptocurrency wallets. Nova Stealer operates as a trojan, infecting systems by replacing legitimate, installed applications with malicious versions. When a user launches the compromised application, the malware activates in the background to search for and steal wallet files and other valuable information. This discovery underscores the increasing trend of threat actors developing malware for the macOS platform, challenging the perception of it being inherently more secure than Windows.",
          "categories": [
            "Malware",
            "Threat Intelligence",
            "Mobile Security"
          ],
          "tags": [
            "Cryptocurrency",
            "InfoStealer",
            "Malware",
            "Trojan",
            "macOS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-20T15:00:00.000Z",
          "malware": [
            "Nova Stealer"
          ]
        },
        {
          "slug": "sinobi-ransomware-group-attacks-us-manufacturer-croft-and-indian-tech-firm-changepond",
          "headline": "Sinobi Ransomware Strikes US Manufacturer and Indian Tech Firm",
          "summary": "The 'sinobi' ransomware group has claimed responsibility for two recent cyberattacks targeting organizations in the United States and India. The victims are Croft, a U.S.-based window and door manufacturer, and CHANGEPOND, an enterprise software company headquartered in Chennai, India. Both breaches were discovered on November 19, 2025, occurring within minutes of each other. These incidents underscore the global reach and indiscriminate targeting of ransomware operators, affecting diverse sectors including manufacturing and technology. The attacks highlight the persistent threat posed by ransomware and the importance of robust cybersecurity defenses.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Data Breach",
            "Manufacturing",
            "Ransomware",
            "Technology",
            "sinobi"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-20T15:00:00.000Z",
          "malware": [
            "sinobi ransomware"
          ]
        },
        {
          "slug": "cisa-warns-of-actively-exploited-google-chrome-zero-day-cve-2025-13223",
          "headline": "Google Chrome Zero-Day Exploited in Wild, CISA Mandates Urgent Patch",
          "summary": "Google has patched a high-severity zero-day vulnerability in its Chrome web browser, CVE-2025-13223, which is being actively exploited in the wild. The flaw is a type confusion error in the V8 JavaScript engine that can be leveraged by an attacker for remote code execution (RCE) simply by luring a victim to a malicious website. Following Google's confirmation of in-the-wild exploitation, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) promptly added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating that federal agencies apply the update by December 10, 2025. The vulnerability affects Chrome on all major desktop platforms (Windows, macOS, and Linux) and other Chromium-based browsers.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "Browser Exploit",
            "CISA",
            "Google Chrome",
            "KEV",
            "RCE",
            "V8",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-20T15:00:00.000Z",
          "cves": [
            "CVE-2025-13223"
          ]
        },
        {
          "slug": "pennsylvania-attorney-general-confirms-major-data-breach-by-inc-ransom-group",
          "headline": "PA Attorney General Confirms Massive Data Breach by Inc Ransom",
          "summary": "The Pennsylvania Office of the Attorney General (OAG) has officially confirmed it was the victim of a significant ransomware attack orchestrated by the 'Inc Ransom' group. The attack, which occurred in August 2025, disrupted the agency's operations for three weeks. The threat actors claim to have exfiltrated 5.7 terabytes of highly sensitive data, including Social Security numbers, medical details, and investigative files. The initial access vector is believed to be the exploitation of the 'CitrixBleed2' vulnerability (CVE-2025-5777) on the agency's Citrix NetScaler appliances. The FBI is now investigating the incident, and the OAG is in the process of notifying affected individuals.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Vulnerability"
          ],
          "tags": [
            "CVE-2025-5777",
            "Citrix",
            "Data Breach",
            "Government",
            "Inc Ransom",
            "Ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-20T15:00:00.000Z",
          "cves": [
            "CVE-2025-5777"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-windows-kernel-zero-day-cve-2025-62215-in-november-patch-tuesday",
          "headline": "Patch Now: Microsoft Fixes Actively Exploited Windows Kernel Zero-Day",
          "summary": "As part of its November 2025 Patch Tuesday release, Microsoft has addressed 63 security vulnerabilities, including a high-severity zero-day flaw in the Windows Kernel (CVE-2025-62215) that is confirmed to be under active exploitation. The vulnerability is a local privilege escalation (LPE) bug with a CVSS score of 7.0, allowing an attacker who has already gained initial access to a system to elevate their privileges to SYSTEM level. Such flaws are critical components in post-exploitation attack chains, enabling threat actors to take full control of a compromised machine. The update also fixes 16 remote code execution (RCE) vulnerabilities and numerous other flaws across the Microsoft product suite. Immediate patching is strongly recommended for all Windows users.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Threat Intelligence"
          ],
          "tags": [
            "CVE",
            "Microsoft",
            "Patch Tuesday",
            "Privilege Escalation",
            "Windows Kernel",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": true,
          "publishedAt": "2025-11-20T15:00:00.000Z",
          "updatedAt": "2025-11-21T10:00:00.000Z",
          "cves": [
            "CVE-2025-62215"
          ]
        },
        {
          "slug": "cisa-mandates-7-day-patch-for-actively-exploited-fortinet-fortiweb-zero-day-cve-2025-58034",
          "headline": "URGENT: CISA Orders 7-Day Patch for Actively Exploited FortiWeb Zero-Day",
          "summary": "Fortinet has disclosed a critical OS command injection zero-day vulnerability, CVE-2025-58034, in its FortiWeb Web Application Firewall (WAF) that is being actively exploited in the wild. The flaw allows an authenticated attacker to execute arbitrary commands on the underlying system. In response to observed attacks, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog and issued an emergency directive mandating federal agencies apply patches within an accelerated seven-day window, by November 25, 2025. Researchers have detected approximately 2,000 attacks leveraging the flaw and warn it could potentially be chained with a recently disclosed authentication bypass vulnerability (CVE-2025-64446) to achieve unauthenticated remote code execution.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA",
            "Command Injection",
            "FortiWeb",
            "Fortinet",
            "KEV",
            "WAF",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-20T15:00:00.000Z",
          "cves": [
            "CVE-2025-58034",
            "CVE-2025-64446"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "microsoft-patches-actively-exploited-windows-kernel-zero-day-cve-2025-62215-in-november-patch-tuesday",
        "originalHeadline": "Patch Now: Microsoft Fixes Actively Exploited Windows Kernel Zero-Day",
        "updateTitle": "Update: Patch Now: Microsoft Fixes Actively Exploited Windows Kernel Zero-Day",
        "updateSummary": "CVE-2025-62215 added to CISA KEV catalog; exploitation described as likely limited and targeted.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Threat Intelligence"
        ],
        "tags": [
          "CVE",
          "Microsoft",
          "Patch Tuesday",
          "Privilege Escalation",
          "Windows Kernel",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-62215"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-20T15:00:00.000Z",
        "updatedAt": "2025-11-21T10:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}