{
  "lastUpdated": "2025-11-09T21:09:56.347Z",
  "runDate": "2025-11-09",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-09",
      "type": "publication-daily",
      "headline": "Clop Ransomware Breaches Washington Post; Critical Flaws Found in Docker, QNAP, and AI Models",
      "articleCount": 10,
      "articles": [
        {
          "slug": "microsoft-reveals-whisper-leak-attack-infers-ai-chat-topics-from-encrypted-traffic",
          "headline": "Microsoft 'Whisper Leak' Attack Can Spy on Encrypted AI Chats",
          "summary": "Microsoft researchers have discovered a novel side-channel attack method named 'Whisper Leak' that undermines the privacy of encrypted AI chatbot conversations. By analyzing the size and timing of encrypted data packets from streaming Large Language Models (LLMs), a passive network observer can accurately infer the topic of a conversation. The proof-of-concept attack achieved over 98% accuracy against models from OpenAI, Mistral, xAI, and DeepSeek. While major AI providers have already implemented mitigations following a responsible disclosure, the finding exposes a fundamental privacy risk in the architecture of streaming LLMs, particularly for users in sensitive sectors like law and healthcare.",
          "categories": [
            "Vulnerability",
            "Threat Intelligence",
            "Cloud Security"
          ],
          "tags": [
            "AI Security",
            "Encryption",
            "LLM",
            "Microsoft",
            "Privacy",
            "Side-Channel Attack",
            "Whisper Leak"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z",
          "malware": [
            "Whisper Leak"
          ]
        },
        {
          "slug": "only-10-percent-of-firms-ready-for-ai-powered-cyberattacks-accenture-report",
          "headline": "Accenture Report: 90% of Firms Unprepared for AI-Powered Cyberattacks",
          "summary": "A new report from Accenture, 'State of Cybersecurity Resilience 2025,' reveals a critical gap in corporate defenses against AI-augmented cyberattacks. The study, surveying over 2,200 executives, found that only 10% of organizations are 'Reinvention Ready' with adaptive and resilient security postures. A concerning 63% are in the 'Exposed Zone,' relying on reactive and insufficient defenses. The report highlights that AI adoption is rapidly outpacing security implementation, with 77% of firms lacking the necessary security practices to protect their AI models and data pipelines, creating a significant and growing business risk.",
          "categories": [
            "Policy and Compliance",
            "Threat Intelligence",
            "Regulatory"
          ],
          "tags": [
            "AI Security",
            "Accenture",
            "Cybersecurity Resilience",
            "Governance",
            "Risk Management",
            "Threat Intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "indian-mp-urges-government-to-create-national-cybersecurity-certification-council",
          "headline": "Indian MP Proposes National Council to Standardize Cybersecurity Certifications",
          "summary": "On November 9, 2025, Indian MP Praveen Khandelwal formally requested that the central government establish a National Cybersecurity Certification Council. The proposal aims to standardize cybersecurity education and professional certifications across India to address the growing talent gap and combat a recent surge in cyber fraud and data breaches. By promoting globally recognized certifications like CEH and CCISO, the council would seek to build a skilled workforce, enhance national cyber defense capabilities, and support the 'Digital India' initiative.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Other"
          ],
          "tags": [
            "Certification",
            "Cybersecurity Training",
            "Government",
            "India",
            "Policy",
            "Regulation"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "philippines-lawmakers-propose-dedicated-national-cybersecurity-fund",
          "headline": "Philippines Lawmakers Push for National Cybersecurity Fund",
          "summary": "In the Philippines, Representatives Migz and Luigi Villafuerte have introduced a proposal to create a 'Cybersecurity Risk Management and Mitigation Fund' (CRMMF). This dedicated national fund would provide the government with the necessary resources to prevent and respond to cyberattacks against both public and private sector entities. The proposal comes after recent DDoS attack attempts on local banks and designates 30% of the fund for rapid restoration of critical information infrastructure, signaling a strong political push to enhance the nation's cyber resilience.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Incident Response"
          ],
          "tags": [
            "Critical Infrastructure",
            "Cybersecurity Fund",
            "DDoS",
            "Government",
            "Philippines",
            "Policy"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "security-risk-found-in-chinese-made-electric-buses-across-europe-australia",
          "headline": "Chinese-Made Electric Buses in Europe & Australia Pose Remote Shutdown Risk",
          "summary": "Cybersecurity tests conducted in Norway on November 7, 2025, have uncovered a significant security risk in Chinese-manufactured Yutong electric buses, which are widely used across Europe and Australia. The 'Lion Cage' experiment demonstrated that the buses' connected systems could theoretically be accessed and disabled remotely by the manufacturer. The findings have triggered urgent security reviews by public transit authorities in multiple countries, highlighting the growing national security concerns surrounding internet-connected critical infrastructure and potential vulnerabilities in international supply chains.",
          "categories": [
            "Industrial Control Systems",
            "Cyberattack",
            "Supply Chain Attack"
          ],
          "tags": [
            "Critical Infrastructure",
            "ICS",
            "National Security",
            "Supply Chain Security",
            "Transportation",
            "Yutong"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "glassworm-malware-returns-in-vscode-marketplace-supply-chain-attack",
          "headline": "GlassWorm Malware Hits VSCode Marketplace, Stealing Dev Credentials",
          "summary": "The financially motivated GlassWorm malware campaign has returned, targeting developers through the OpenVSX marketplace for Visual Studio Code. Security researchers discovered three malicious VSCode extensions published on November 8, 2025, which have already been downloaded over 10,000 times. The malware is designed to steal developer credentials, including GitHub and NPM tokens, and exfiltrate data from 49 different cryptocurrency wallet extensions. In a novel twist, the malware uses Solana blockchain transactions to fetch its malicious payload, complicating detection and takedown efforts. The extensions remain active, posing an ongoing threat to the software development community.",
          "categories": [
            "Malware",
            "Supply Chain Attack",
            "Threat Actor"
          ],
          "tags": [
            "Credential Theft",
            "Cryptocurrency",
            "GlassWorm",
            "Malware",
            "OpenVSX",
            "Supply Chain Attack",
            "VSCode"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z",
          "malware": [
            "GlassWorm"
          ]
        },
        {
          "slug": "microsoft-warns-of-payroll-pirates-phishing-campaign",
          "headline": "Microsoft Warns of 'Payroll Pirates' Phishing Gang Targeting M365 Credentials",
          "summary": "Microsoft has issued a warning about a sophisticated phishing campaign dubbed 'Payroll Pirates.' The attackers impersonate HR departments in targeted emails to lure employees into giving up their Microsoft 365 credentials. The campaign uses spoofed domains and legitimate Microsoft Forms to appear authentic. The ultimate goal of the operation is to gain access to employee accounts, alter their direct deposit information, and divert their payroll to attacker-controlled bank accounts. This form of Business Email Compromise (BEC) attack poses a direct financial threat to employees, and Microsoft urges organizations to enable multi-factor authentication as a key defense.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Data Breach"
          ],
          "tags": [
            "BEC",
            "Business Email Compromise",
            "Credential Theft",
            "Microsoft 365",
            "Payroll Fraud",
            "Phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "washington-post-confirms-breach-in-massive-oracle-software-attack",
          "headline": "Washington Post Breached by Clop Ransomware via Oracle Flaws",
          "summary": "The Washington Post has officially confirmed it was a victim of a large-scale cyberattack orchestrated by the Clop ransomware group. The threat actors exploited vulnerabilities in Oracle's E-Business Suite, compromising over 100 organizations globally. The campaign involves data exfiltration followed by aggressive extortion tactics, with Clop publicly naming victims on its dark web leak site to pressure them into paying ransoms reportedly as high as $50 million. This incident underscores the significant risk posed by vulnerabilities in widely used enterprise software and the sophisticated, multi-faceted extortion methods employed by modern ransomware gangs.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Clop",
            "Data Breach",
            "E-Business Suite",
            "Extortion",
            "Oracle",
            "Ransomware",
            "TA505"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "critical-flaws-in-runc-container-runtime-threaten-docker-kubernetes",
          "headline": "Critical Container Escape Flaws in runC Threaten Docker & Kubernetes",
          "summary": "A security alert issued on November 9, 2025, warns of three new critical vulnerabilities in runC, the low-level container runtime used by Docker, Kubernetes, and other major container platforms. The flaws could allow a malicious actor to execute a 'container escape,' breaking out of the isolated container environment to gain unauthorized access to the underlying host operating system. A successful container escape is a worst-case scenario in cloud-native security, as it would allow an attacker to compromise all other containers on the host. Administrators of all containerized environments are urged to monitor for and apply patches immediately.",
          "categories": [
            "Vulnerability",
            "Cloud Security",
            "Patch Management"
          ],
          "tags": [
            "Cloud Security",
            "Container Escape",
            "Docker",
            "Kubernetes",
            "Vulnerability",
            "Zero-Day",
            "runC"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z"
        },
        {
          "slug": "qnap-patches-seven-zero-day-vulnerabilities-from-pwn2own-2025",
          "headline": "QNAP Patches 7 Zero-Days Allowing Full NAS Takeover",
          "summary": "QNAP has issued urgent security updates to address seven zero-day vulnerabilities affecting its QTS, QuTS hero, and related software. These critical flaws were successfully exploited by security researchers at the Pwn2Own Ireland 2025 hacking contest in October, demonstrating paths to unauthenticated remote code execution (RCE) and full system takeover. The vulnerabilities, including buffer overflows and path traversal issues, impact the NAS operating systems as well as integrated applications like HBS 3 Hybrid Backup Sync and Malware Remover. QNAP users are strongly urged to apply the patches immediately to protect their data from potential attack.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "NAS",
            "Patch Management",
            "Pwn2Own",
            "QNAP",
            "RCE",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-09T15:00:00.000Z",
          "cves": [
            "CVE-2025-11837",
            "CVE-2025-62840",
            "CVE-2025-62842",
            "CVE-2025-62847",
            "CVE-2025-62848",
            "CVE-2025-62849"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-08",
      "type": "publication-daily",
      "headline": "Samsung Zero-Day Exploited by LANDFALL Spyware; Sandworm Escalates Destructive Attacks on Ukraine",
      "articleCount": 10,
      "articles": [
        {
          "slug": "malicious-vs-code-extension-with-ransomware-found-on-marketplace",
          "headline": "Malicious VS Code Extension with Ransomware Capabilities Discovered on Official Marketplace",
          "summary": "A malicious Visual Studio (VS) Code extension named \"susvsex\" was discovered on the official VS Code Extension Marketplace. The extension, which appears to have been created with AI assistance, contained overt ransomware capabilities. Upon activation, it was designed to archive a target directory, exfiltrate the ZIP file to a remote server, and then encrypt the original files. The extension also used a private GitHub repository as a command-and-control channel. Although its default target was a test folder, it could easily be modified to target sensitive user data. Microsoft has since removed the extension, which was published on November 5, 2025.",
          "categories": [
            "Malware",
            "Supply Chain Attack",
            "Ransomware"
          ],
          "tags": [
            "Developer Security",
            "Malicious Extension",
            "Microsoft",
            "Ransomware",
            "Supply Chain Attack",
            "VS Code"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z",
          "malware": [
            "Vidar",
            "susvsex"
          ]
        },
        {
          "slug": "bahrain-polytechnic-and-beyon-cyber-partner-on-ai-and-cybersecurity",
          "headline": "Bahrain Fosters Digital Talent with AI and Cybersecurity Partnership",
          "summary": "Bahrain is strengthening its national digital capabilities through a new partnership between Beyon Cyber, a cybersecurity firm, and Bahrain Polytechnic. The two organizations signed a Memorandum of Understanding (MoU) to foster innovation in Artificial Intelligence and cybersecurity. The collaboration aims to develop advanced, AI-driven security solutions and cultivate a skilled local workforce. This strategic initiative is aligned with Bahrain's goal of becoming a regional leader in technology and equipping its next generation of professionals with the skills to tackle modern cybersecurity challenges.",
          "categories": [
            "Security Operations",
            "Other"
          ],
          "tags": [
            "AI",
            "Bahrain",
            "Cybersecurity",
            "Education",
            "Partnership",
            "Talent Development"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "eu-advances-digital-regulation-with-new-gdpr-and-dsa-enforcement",
          "headline": "EU Strengthens Digital Rulebook with New GDPR Enforcement and DSA Measures",
          "summary": "The European Union has taken several steps to strengthen its digital regulatory environment. New rules have been passed to harmonize the enforcement of GDPR in cross-border cases. A new regulation on political advertising has also entered into force, imposing transparency requirements on online platforms and banning certain types of ad targeting. Additionally, the European Commission has issued a Cloud Sovereignty Framework and is advancing enforcement actions under the Digital Services Act (DSA), including issuing preliminary findings that Meta and TikTok may have breached DSA obligations regarding researcher access to data.",
          "categories": [
            "Regulatory",
            "Policy and Compliance"
          ],
          "tags": [
            "Cloud Sovereignty",
            "DSA",
            "EU",
            "GDPR",
            "Meta",
            "Policy",
            "Regulation",
            "TikTok"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "uae-cybersecurity-council-warns-public-on-deepfake-dangers",
          "headline": "UAE Issues Public Warning on Misinformation Risks from AI Deepfakes",
          "summary": "The UAE Cybersecurity Council issued a formal public warning on November 7, 2025, about the escalating threat posed by AI-generated \"deepfake\" content. The advisory highlights the potential for highly realistic but fraudulent videos and audio clips to be used for spreading misinformation, committing fraud, and damaging the reputations of individuals and institutions. The council emphasized that public awareness is the primary defense and urged citizens to verify information from official sources before sharing. The warning also referenced Federal Decree-Law No. (34) of 2021, which criminalizes the creation and distribution of such content.",
          "categories": [
            "Policy and Compliance",
            "Regulatory"
          ],
          "tags": [
            "AI",
            "Cybersecurity Council",
            "Deepfake",
            "Misinformation",
            "Policy",
            "Regulatory",
            "UAE"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "hungarian-political-party-tisza-suffers-major-data-breach",
          "headline": "Data of Nearly 200,000 Supporters of Hungarian Party TISZA Leaked Online",
          "summary": "The personal data of nearly 200,000 supporters of the Hungarian political party TISZA has been leaked and is being widely distributed online. The breach, which occurred in October 2025, originated from the party's \"TISZA Világ\" service. The compromised dataset, containing 198,500 records, has been added to the Have I Been Pwned service. Exposed information includes supporters' full names, email addresses, phone numbers, physical addresses, and usernames. This incident places affected individuals at significant risk of phishing, fraud, and other malicious targeting.",
          "categories": [
            "Data Breach"
          ],
          "tags": [
            "Data Breach",
            "GDPR",
            "Have I Been Pwned",
            "Hungary",
            "PII",
            "Politics"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "daily-ransomware-report-qilin-gang-dominates-november-8-2025",
          "headline": "Qilin Ransomware Gang Claims 7 of 11 New Victims in 24 Hours",
          "summary": "The daily ransomware report for November 8, 2025, highlights a significant burst of activity from the Qilin ransomware group, which claimed responsibility for 7 of the 11 new victims announced in the past 24 hours. The DragonForce group was the second most active with three victims. The attacks primarily targeted the professional services and manufacturing sectors, with victims located in the United States, Canada, and the United Kingdom. This latest surge brings the total number of publicly claimed ransomware victims in 2025 to 6,364, underscoring the relentless and persistent threat that ransomware-as-a-service (RaaS) operations pose to organizations globally.",
          "categories": [
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "Cybercrime",
            "Data Breach",
            "DragonForce",
            "Qilin",
            "RaaS",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "russian-apt-sandworm-intensifies-destructive-attacks-on-ukraine",
          "headline": "Sandworm Escalates Wiper Attacks, Targeting Ukraine's Grain Sector for First Time",
          "summary": "A new report from ESET covering APT activity from April to September 2025 reveals that the Russia-linked threat group Sandworm has escalated its destructive cyberattacks against Ukraine. The group deployed new data-wiping malware, including Zerolot and Sting, targeting government bodies, energy companies, and logistics. In a significant strategic shift, Sandworm's attacks have expanded to include Ukraine's grain export sector, a vital part of its economy. The report also notes that another group, UAC-0099, has been observed supporting Sandworm by providing initial access to victim networks. This campaign is part of a broader increase in global state-sponsored cyber activity, with groups from China, Iran, and North Korea also expanding their espionage and disruptive operations.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "APT",
            "Critical Infrastructure",
            "Cyber War",
            "ESET",
            "Russia",
            "Sandworm",
            "Ukraine",
            "Wiper Malware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z",
          "malware": [
            "Sting",
            "Zerolot"
          ]
        },
        {
          "slug": "software-supply-chain-attacks-hit-record-high-in-october-2025",
          "headline": "Software Supply Chain Attacks Surge Over 30% to Record High, Driven by Ransomware",
          "summary": "According to a new report from threat intelligence firm Cyble, software supply chain attacks surged to a record high in October 2025, with 41 documented incidents. This represents a 30% increase from the previous peak and more than double the monthly average from early 2024. Ransomware groups, notably Qilin and Akira, are increasingly adopting this tactic, shifting focus from direct network breaches to compromising organizations through their third-party technology partners. The attacks have heavily targeted the energy, healthcare, and manufacturing sectors. Incidents include Qilin compromising a cloud services provider for the healthcare sector by finding clear-text credentials, demonstrating the critical need for improved vendor risk management.",
          "categories": [
            "Supply Chain Attack",
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "Akira",
            "Cyble",
            "Qilin",
            "Ransomware",
            "Supply Chain Attack",
            "Third-Party Risk",
            "Vendor Management"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "sonicwall-confirms-state-sponsored-actor-behind-cloud-backup-breach",
          "headline": "SonicWall: State-Sponsored Actor Breached Cloud Backups via API Exploit",
          "summary": "Cybersecurity vendor SonicWall has confirmed that a sophisticated state-sponsored threat actor was behind the security breach in September 2025. The investigation, assisted by Mandiant, found that the attackers gained unauthorized access to a cloud environment by exploiting a compromised API call. This allowed them to steal firewall configuration backup files belonging to customers of the MySonicWall cloud backup service. SonicWall asserts that the incident was isolated to that specific environment and did not affect its core products or internal networks. The company has since implemented remedial actions and released tools to help customers reset credentials and secure their services.",
          "categories": [
            "Data Breach",
            "Cloud Security",
            "Threat Actor"
          ],
          "tags": [
            "API Security",
            "APT",
            "Cloud Security",
            "Data Breach",
            "Mandiant",
            "SonicWall",
            "State-Sponsored"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z"
        },
        {
          "slug": "landfall-spyware-exploits-samsung-zero-day-in-middle-east-attacks",
          "headline": "LANDFALL Spyware Uses Samsung Zero-Day for Zero-Click Attacks in Middle East",
          "summary": "A sophisticated commercial-grade Android spyware known as LANDFALL has been identified in targeted cyber-espionage campaigns across the Middle East. The attackers exploited a critical zero-day vulnerability, CVE-2025-21042, in Samsung Galaxy devices to achieve remote code execution without user interaction. The flaw, an out-of-bounds write in an image processing library, was triggered by sending a malicious DNG image file. The campaign was active for months before Samsung issued a patch in April 2025, affecting users in Iraq, Iran, Turkey, and Morocco. Once installed, LANDFALL acts as a comprehensive surveillance tool, capable of exfiltrating a wide array of data, including microphone recordings, location data, photos, and communications.",
          "categories": [
            "Vulnerability",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "Android",
            "CVE-2025-21042",
            "Mobile Security",
            "RCE",
            "Spyware",
            "Zero-Click",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-08T15:00:00.000Z",
          "cves": [
            "CVE-2025-21042",
            "CVE-2025-21043",
            "CVE-2025-43300"
          ],
          "malware": [
            "LANDFALL"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "76-percent-of-orgs-cant-match-speed-of-ai-powered-attacks",
        "originalHeadline": "Over 75% of Orgs Can't Keep Pace with AI-Powered Attacks, Survey Finds",
        "updateTitle": "Update: Over 75% of Orgs Can't Keep Pace with AI-Powered Attacks, Survey Finds",
        "updateSummary": "Accenture report confirms widespread unpreparedness for AI-powered cyberattacks, with 90% of firms unready and 77% lacking AI security practices.",
        "categories": [
          "Threat Intelligence",
          "Ransomware",
          "Policy and Compliance"
        ],
        "tags": [
          "AI",
          "CrowdStrike",
          "artificial intelligence",
          "cybersecurity survey",
          "ransomware",
          "threat landscape"
        ],
        "severity": "informational",
        "publishedAt": "2025-10-22T15:00:00.000Z",
        "updatedAt": "2025-11-09T00:00:00.000Z"
      },
      {
        "slug": "pwn2own-ireland-day-1-hackers-earn-522k-for-34-zero-days",
        "originalHeadline": "Pwn2Own Day 1: Hackers Net $522K for 34 Zero-Days in SOHO Devices",
        "updateTitle": "Update: Pwn2Own Day 1: Hackers Net $522K for 34 Zero-Days in SOHO Devices",
        "updateSummary": "QNAP has released urgent patches for 7 zero-day vulnerabilities exploited at Pwn2Own Ireland 2025, including RCE flaws, affecting QTS and QuTS hero.",
        "categories": [
          "Vulnerability",
          "IoT Security",
          "Threat Intelligence"
        ],
        "tags": [
          "IoT",
          "Pwn2Own",
          "SOHO",
          "ZDI",
          "hacking",
          "vulnerability",
          "zero-day"
        ],
        "severity": "high",
        "publishedAt": "2025-10-22T15:00:00.000Z",
        "updatedAt": "2025-11-09T00:00:00.000Z"
      },
      {
        "slug": "qilin-ransomware-gang-claims-new-attacks-across-us-france-africa",
        "originalHeadline": "Qilin Ransomware Strikes Again, Claiming Victims Across US, France, and Africa",
        "updateTitle": "Update: Qilin Ransomware Strikes Again, Claiming Victims Across US, France, and Africa",
        "updateSummary": "Qilin claims 7 new victims in 24 hours, showing continued high activity and targeting professional services and manufacturing.",
        "categories": [
          "Ransomware",
          "Threat Actor"
        ],
        "tags": [
          "Cyberattack",
          "Data Leak",
          "Double Extortion",
          "Qilin",
          "RaaS",
          "Ransomware"
        ],
        "severity": "high",
        "publishedAt": "2025-10-16T15:00:00.000Z",
        "updatedAt": "2025-11-08T12:00:00.000Z"
      },
      {
        "slug": "clop-ransomware-exploits-oracle-e-business-suite-zero-day-cve-2025-61882",
        "originalHeadline": "Cl0p Gang Exploits Oracle EBS Zero-Day in Massive Data Theft Spree",
        "updateTitle": "Update: Cl0p Gang Exploits Oracle EBS Zero-Day in Massive Data Theft Spree",
        "updateSummary": "CL0P names Washington Post among 100+ victims of Oracle EBS zero-day, demanding up to $50M in ransoms and publicly shaming non-payers.",
        "categories": [
          "Vulnerability",
          "Ransomware",
          "Data Breach"
        ],
        "tags": [
          "Cl0p",
          "Data Theft",
          "Extortion",
          "KEV",
          "Oracle",
          "RCE",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-61882"
        ],
        "severity": "critical",
        "publishedAt": "2025-10-09T15:00:00.000Z",
        "updatedAt": "2025-11-08T00:00:00.000Z"
      },
      {
        "slug": "sonicwall-breach-expands-compromising-all-cloud-backup-users",
        "originalHeadline": "SonicWall Breach Far Worse Than Feared: All Cloud Backup Users' Firewall Configs Stolen",
        "updateTitle": "Update: SonicWall Breach Far Worse Than Feared: All Cloud Backup Users' Firewall Configs Stolen",
        "updateSummary": "SonicWall confirms state-sponsored actor behind September cloud backup breach, exploiting a compromised API call to steal customer firewall configurations.",
        "categories": [
          "Data Breach",
          "Supply Chain Attack",
          "Cloud Security"
        ],
        "tags": [
          "API security",
          "SonicWall",
          "cloud security",
          "configuration management",
          "data breach",
          "firewall"
        ],
        "severity": "high",
        "publishedAt": "2025-10-10T15:00:00.000Z",
        "updatedAt": "2025-11-08T00:00:00.000Z"
      },
      {
        "slug": "ai-driven-social-engineering-top-cyber-threat-for-2026",
        "originalHeadline": "AI-Powered Social Engineering to Become Top Cyber Threat, ISACA Warns",
        "updateTitle": "Update: AI-Powered Social Engineering to Become Top Cyber Threat, ISACA Warns",
        "updateSummary": "UAE issues public warning on AI deepfakes, highlighting legal risks and public awareness.",
        "categories": [
          "Threat Intelligence",
          "Phishing",
          "Policy and Compliance"
        ],
        "tags": [
          "Artificial Intelligence",
          "Cyber Threat",
          "Deepfake",
          "Generative AI",
          "ISACA",
          "Phishing",
          "Social Engineering"
        ],
        "severity": "informational",
        "publishedAt": "2025-10-20T15:00:00.000Z",
        "updatedAt": "2025-11-08T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}