{
  "lastUpdated": "2025-10-25T20:24:40.706Z",
  "runDate": "2025-10-24",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-10-24",
      "type": "publication-daily",
      "headline": "Critical WSUS Zero-Day Exploited, Prosper Breach Hits 17.6M, and Iranian APT Deploys 'Phoenix' Backdoor",
      "articleCount": 10,
      "articles": [
        {
          "slug": "lawsuit-filed-against-south-carolina-school-district-after-ransomware-attack",
          "headline": "Lawsuit Hits SC School District After Ransomware Breach",
          "summary": "South Carolina's Lexington-Richland School District 5 (LR5) is facing a class-action lawsuit following a ransomware attack in June 2025 that exposed the personally identifiable information (PII) of over 31,000 students, staff, and alumni. The lawsuit alleges that the school district was negligent in protecting sensitive data and violated state law by failing to provide timely and complete notification of the breach. The compromised data included names, birthdates, Social Security numbers, and financial files, making it one of the most significant breaches for an educational institution in the region.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Regulatory"
          ],
          "tags": [
            "Data Breach",
            "Education Sector",
            "Lawsuit",
            "PII",
            "Ransomware"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "jingle-thief-hackers-exploit-cloud-for-gift-card-fraud",
          "headline": "'Jingle Thief' Group Steals Gift Cards via Cloud & M365",
          "summary": "A financially motivated cybercriminal group dubbed 'Jingle Thief' is actively targeting retail and consumer services companies in a campaign focused on large-scale gift card fraud. According to research from Unit 42, the group gains initial access via credential harvesting from phishing and smishing attacks. They then pivot to the victim's cloud environment, specifically Microsoft 365, to move laterally, find gift card issuance systems, and establish persistence by registering rogue authenticator applications. The campaign highlights a growing trend of abusing legitimate cloud services for financial crime.",
          "categories": [
            "Threat Actor",
            "Cloud Security",
            "Cyberattack"
          ],
          "tags": [
            "Cloud Security",
            "Gift Card Fraud",
            "Jingle Thief",
            "M365",
            "Phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "agenda-qilin-ransomware-abuses-legit-tools-targets-critical-infrastructure",
          "headline": "Agenda Ransomware Evolves, Hits Critical Infrastructure",
          "summary": "The Agenda ransomware group, also known as Qilin, is escalating its attacks by targeting critical infrastructure sectors with evolved tactics. According to research from Trend Micro, the ransomware-as-a-service (RaaS) operation is using a cross-platform approach, abusing legitimate remote management tools and deploying Linux-based ransomware on Windows hosts to evade security. The group also employs Bring Your Own Vulnerable Driver (BYOVD) attacks to neutralize endpoint defenses and steals backup credentials to hinder recovery, primarily targeting high-value organizations in the U.S., Canada, and the U.K.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Industrial Control Systems"
          ],
          "tags": [
            "Agenda Ransomware",
            "BYOVD",
            "Critical Infrastructure",
            "Qilin",
            "RaaS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "iranian-apt-deploys-phoenix-backdoor-against-government-targets",
          "headline": "Iranian APT 'Phoenix' Backdoor Hits 100+ Governments",
          "summary": "A cyber-espionage campaign attributed to an Iranian-linked Advanced Persistent Threat (APT) group has compromised over 100 government institutions worldwide. The attackers are utilizing a custom, multi-stage backdoor dubbed 'Phoenix' to achieve their objectives. Initial access is gained through a mix of credential spraying and spear-phishing. Once inside, the Phoenix backdoor is used to conduct reconnaissance, escalate privileges, and establish long-term persistence for intelligence gathering operations.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "APT",
            "Cyber-espionage",
            "Government",
            "Iran",
            "Phoenix Backdoor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z",
          "malware": [
            "Phoenix"
          ]
        },
        {
          "slug": "north-korean-lazarus-group-targets-european-drone-companies",
          "headline": "Lazarus Group's 'Operation DreamJob' Targets EU Drone-Makers",
          "summary": "The notorious North Korea-linked APT group, Lazarus, is conducting a cyber-espionage campaign dubbed 'Operation DreamJob' targeting European defense and aerospace companies. The campaign specifically focuses on firms involved in Unmanned Aerial Vehicle (UAV) technology. The attackers use sophisticated social engineering, creating fake recruiter profiles and job offers to lure employees. The ultimate goal is to compromise the target's network to steal sensitive intellectual property related to advanced drone technology.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Phishing"
          ],
          "tags": [
            "APT",
            "Cyber-espionage",
            "Defense Industry",
            "Lazarus Group",
            "Operation DreamJob"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "prosper-marketplace-data-breach-impacts-17-million-users",
          "headline": "Massive Prosper Breach Exposes SSNs of 17.6M Users",
          "summary": "Peer-to-peer lending platform Prosper Marketplace has disclosed a massive data breach affecting 17.6 million individuals. The incident, detected on September 2, 2025, involved an unauthorized third party gaining direct access to company databases and exfiltrating a vast trove of sensitive personal and financial data. The stolen information includes full names, Social Security numbers, government-issued IDs, income levels, and IP addresses, placing millions of users at significant risk of identity theft and sophisticated phishing attacks.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Phishing"
          ],
          "tags": [
            "Data Breach",
            "Fintech",
            "Identity Theft",
            "PII",
            "SSN"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "jewett-cameron-operations-disrupted-by-ransomware-attack",
          "headline": "Ransomware Hits Jewett-Cameron, Steals Financial Data",
          "summary": "Jewett-Cameron, an Oregon-based manufacturing and distribution company, has confirmed in an SEC filing that it suffered a ransomware attack on October 15, 2025. The attack caused significant disruption to its business operations and resulted in the theft of sensitive corporate data. The exfiltrated information reportedly includes IT and financial data being prepared for the company's upcoming Form 10-K filing, as well as screen captures from video meetings. The unidentified attackers have demanded a ransom and threatened to leak the stolen material.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Data Exfiltration",
            "Manufacturing",
            "Ransomware",
            "SEC Filing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "tengu-ransomware-claims-attack-on-brazilian-education-provider-unicursos",
          "headline": "Tengu Ransomware Hits Brazilian Education Provider",
          "summary": "The Tengu ransomware group has claimed responsibility for a cyberattack against UniCursos, a prominent education provider in Brazil. The attack, which was posted to the group's leak site on October 23, 2025, follows the common double-extortion model, where the attackers threaten to publish sensitive stolen data if their ransom demands are not met. The incident highlights the continued targeting of the education sector by ransomware gangs, who view them as valuable targets due to the sensitive student and staff data they hold.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Brazil",
            "Double Extortion",
            "Education Sector",
            "Tengu Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z"
        },
        {
          "slug": "google-patches-sixth-actively-exploited-chrome-zero-day-cve-2025-10585",
          "headline": "Google Patches 6th Actively Exploited Chrome Zero-Day of 2025",
          "summary": "Google has issued an emergency security update for its Chrome web browser to address CVE-2025-10585, a high-severity type confusion vulnerability in the V8 JavaScript engine. This marks the sixth time in 2025 that Google has patched a Chrome zero-day vulnerability that was being actively exploited in the wild. The flaw could allow an attacker to achieve arbitrary code execution on a victim's machine by tricking them into visiting a malicious website. All users of Chrome and other Chromium-based browsers are urged to update immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "Browser Security",
            "CVE-2025-10585",
            "Chrome",
            "RCE",
            "V8 Engine",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z",
          "cves": [
            "CVE-2025-10585"
          ]
        },
        {
          "slug": "critical-wsus-zero-day-cve-2025-59287-actively-exploited",
          "headline": "Urgent Patch for Actively Exploited WSUS Zero-Day!",
          "summary": "Microsoft has released an emergency out-of-band security update for a critical remote code execution (RCE) vulnerability in Windows Server Update Services (WSUS), tracked as CVE-2025-59287. The flaw, which can be exploited by an unauthenticated attacker, is being actively used in attacks, leading the U.S. Cybersecurity and Infrastructure Security Agency (CISA) to add it to its Known Exploited Vulnerabilities (KEV) catalog. A compromise of a WSUS server could grant attackers a powerful foothold within an enterprise network, enabling widespread lateral movement and subsequent attacks. Administrators are urged to apply the patch immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA KEV",
            "CVE-2025-59287",
            "Patch Management",
            "RCE",
            "WSUS",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-24T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-10-23",
      "type": "publication-daily",
      "headline": "Ransomware Automation Slashes Attack Times to Minutes; Supply Chain Overconfidence Creates Massive Risk",
      "articleCount": 10,
      "articles": [
        {
          "slug": "september-healthcare-breaches-decline-but-data-incomplete-due-to-shutdown",
          "headline": "Healthcare Breaches Seem to Drop, But Government Shutdown Hides True Numbers",
          "summary": "Official data for September 2025 shows only 26 major healthcare data breaches, the lowest monthly total since 2018. However, The HIPAA Journal cautions that this apparent decline is misleading. A US government shutdown has largely halted the HHS's Office for Civil Rights (OCR) from processing and updating its public breach portal. The 26 reported breaches affected over 1.29 million individuals, with hacking incidents accounting for 98.8% of the exposed records. Experts believe the true number of breaches for September is significantly higher and will be reflected in a surge of reports once the OCR resumes normal operations.",
          "categories": [
            "Data Breach",
            "Regulatory",
            "Policy and Compliance"
          ],
          "tags": [
            "Compliance",
            "Data Breach",
            "Government Shutdown",
            "HHS",
            "HIPAA",
            "Healthcare",
            "OCR"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "ny-dfs-issues-guidance-on-third-party-cybersecurity-risks",
          "headline": "NY Regulator Puts Financial Firms on Notice: You Are Accountable for Your Vendors' Security",
          "summary": "The New York State Department of Financial Services (DFS) has issued new guidance for financial institutions, emphasizing their ultimate accountability for managing cybersecurity risks originating from third-party service providers (TPSPs). The regulator warned that as firms increasingly rely on cloud computing, AI, and fintech solutions from vendors, their exposure to threats grows. The guidance explicitly states that boards of directors and senior officers must possess sufficient cybersecurity knowledge to oversee and challenge management's third-party risk strategies. DFS Acting Superintendent Kaitlin Asrow stressed that regulated entities cannot outsource their responsibility for protecting consumer data and ensuring operational security.",
          "categories": [
            "Regulatory",
            "Policy and Compliance",
            "Supply Chain Attack"
          ],
          "tags": [
            "Compliance",
            "Financial Services",
            "NYDFS",
            "Regulation",
            "Supply Chain",
            "Third-Party Risk Management"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "palo-alto-networks-uncovers-smishing-and-gift-card-fraud-campaigns",
          "headline": "Unit 42 Exposes 'Smishing Deluge' from China and 'Jingle Thief' Gift Card Fraud",
          "summary": "Researchers at Palo Alto Networks' Unit 42 have detailed two distinct and significant cybercrime operations. The first, a massive smishing campaign dubbed 'The Smishing Deluge,' is attributed to a China-based threat actor and is flooding mobile users globally with malicious SMS messages. The second campaign, named 'Jingle Thief,' is a sophisticated cloud-based operation focused on automating the theft and monetization of gift cards. These findings, highlighted in Unit 42's October Threat Bulletin, showcase the diverse tactics of modern criminals, from large-scale social engineering to highly targeted financial fraud.",
          "categories": [
            "Phishing",
            "Threat Intelligence",
            "Cloud Security"
          ],
          "tags": [
            "China",
            "Cloud Security",
            "Fraud",
            "Gift Card",
            "Phishing",
            "Smishing",
            "Unit 42"
          ],
          "severity": "medium",
          "isUpdate": true,
          "publishedAt": "2025-10-23T15:00:00.000Z",
          "updatedAt": "2025-10-24T00:00:00.000Z"
        },
        {
          "slug": "ai-powered-ransomware-surges-in-asia-pacific-australia-is-2-target",
          "headline": "AI-Fueled Ransomware Pummels Asia-Pacific; Australia Ranks as #2 Target",
          "summary": "A new report from CrowdStrike reveals that Australia is the second-most targeted nation for eCrime in the Asia-Pacific and Japan (APJ) region, trailing only India. The '2025 APJ eCrime Landscape Report' highlights a surge in ransomware attacks fueled by AI-developed malware and the industrialization of cybercrime through underground markets. From January 2024 to April 2025, 763 organizations in the APJ region were named on data leak sites. The manufacturing, technology, and financial services sectors are the most frequent victims. Emerging RaaS providers like KillSec and Funklocker are leveraging AI to launch high-velocity attacks, contributing to over 120 incidents against these high-value targets.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Threat Actor"
          ],
          "tags": [
            "AI",
            "APJ",
            "Australia",
            "CrowdStrike",
            "Funklocker",
            "KillSec",
            "Ransomware",
            "eCrime"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "cisa-adds-new-actively-exploited-vulnerability-to-kev-catalog",
          "headline": "CISA Orders Federal Agencies to Patch New Actively Exploited Vulnerability",
          "summary": "On October 22, 2025, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) added a new, unspecified vulnerability to its Known Exploited Vulnerabilities (KEV) catalog. This action confirms that the flaw is being actively exploited in the wild by malicious actors. Under Binding Operational Directive (BOD) 22-01, all Federal Civilian Executive Branch (FCEB) agencies are now required to remediate this vulnerability by a specific deadline to protect federal networks. While the CVE identifier was not immediately released, the alert serves as a critical warning to all organizations to prioritize its patching.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Regulatory"
          ],
          "tags": [
            "BOD 22-01",
            "CISA",
            "KEV",
            "Patch Management",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "overconfidence-in-supply-chain-security-poses-major-risk-ncc-group-report",
          "headline": "False Confidence: 94% of Firms Claim Supply Chain Resilience, But a Third Neglect Basic Risk Assessments",
          "summary": "A new report from NCC Group highlights a critical disconnect in enterprise security: while 94% of businesses are confident in their ability to handle a supply chain attack, 34% do not perform regular supplier risk assessments. This widespread overconfidence creates significant vulnerabilities as threat actors increasingly target less secure third-party vendors to compromise larger organizations. The research, which surveyed over 1,000 cybersecurity leaders, comes as ransomware attacks hit record highs and UK authorities report a 130% increase in nationally significant cyber incidents, many originating from the supply chain. Experts warn this misplaced trust is a primary driver of risk, enabling invoice redirection fraud, credential theft, and widespread disruption across entire business ecosystems.",
          "categories": [
            "Supply Chain Attack",
            "Policy and Compliance",
            "Threat Intelligence"
          ],
          "tags": [
            "Cyber Risk",
            "NCC Group",
            "Overconfidence",
            "Supply Chain Security",
            "Third-Party Risk Management",
            "Vendor Management"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "palomar-health-medical-group-discloses-data-breach-affecting-patients",
          "headline": "Palomar Health Breach Exposes Highly Sensitive Patient Data, Including Biometrics",
          "summary": "Palomar Health Medical Group (PHMG), a California-based healthcare provider, has announced it was the victim of a cybersecurity incident that exposed sensitive patient data. The compromised information includes not only names and personal identifiers but also highly sensitive data types such as biometric data, U.S. alien registration numbers, and financial account information. The full scope of the breach, including the number of affected patients, has not yet been disclosed. The national class action law firm Lynch Carpenter is now investigating claims against PHMG, signaling significant legal and financial fallout for the provider.",
          "categories": [
            "Data Breach",
            "Regulatory"
          ],
          "tags": [
            "Biometric Data",
            "California",
            "Data Breach",
            "HIPAA",
            "Healthcare",
            "Palomar Health"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "ransomware-automation-cuts-attack-timelines-to-18-minutes",
          "headline": "18 Minutes to Mayhem: Ransomware Attacks Now Fully Automated, Slashing Defender Response Time",
          "summary": "A new report from ReliaQuest reveals a dramatic acceleration in ransomware attacks, with the average time from initial access to lateral movement ('breakout time') plummeting to just 18 minutes. This is a significant decrease from 48 minutes in 2024, driven by the adoption of automation and AI by 80% of Ransomware-as-a-Service (RaaS) groups. The report highlights the Qilin ransomware gang as a prime example, whose platform automates key attack phases like discovery, backup deletion, and encryption. Other groups like LockBit are also integrating AI to enhance their operations, creating a hyper-competitive landscape where speed and automation are paramount. This shrinking response window poses a monumental challenge for security teams, demanding automated detection and response capabilities to counter the threat.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Threat Intelligence"
          ],
          "tags": [
            "AI",
            "Automation",
            "Breakout Time",
            "Incident Response",
            "LockBit",
            "Qilin",
            "Ransomware",
            "SOAR"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z",
          "malware": [
            "LockBit 5.0"
          ]
        },
        {
          "slug": "critical-industries-face-escalating-ransomware-threat-kela-report",
          "headline": "50% of Ransomware Attacks in 2025 Hit Critical Infrastructure, KELA Reports",
          "summary": "A new report from threat intelligence firm KELA reveals a stark trend: 50% of all ransomware attacks between January and September 2025 have targeted critical infrastructure. Sectors such as manufacturing, healthcare, energy, and transportation are bearing the brunt of a 34% year-over-year increase in attacks. The report, 'Escalating Ransomware Threats to National Security,' documented 4,701 total ransomware incidents globally in the first nine months of the year, with 2,332 of those hitting critical sectors. The United States remains the most-targeted nation, accounting for 21% of all incidents. The findings have prompted calls to treat cyber resilience as a matter of national defense.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Industrial Control Systems"
          ],
          "tags": [
            "Critical Infrastructure",
            "ICS",
            "KELA",
            "National Security",
            "OT",
            "Ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        },
        {
          "slug": "jaguar-land-rover-hack-costs-uk-economy-1-9-billion",
          "headline": "UK's Most Costly Cyberattack: Jaguar Land Rover Hack Inflicts £1.9 Billion Economic Damage",
          "summary": "A report from the Cyber Monitoring Centre (CMC) estimates that the late August 2025 cyberattack on Jaguar Land Rover (JLR) has cost the UK economy £1.9 billion, potentially making it the most expensive cyber incident in the nation's history. The attack forced a complete shutdown of JLR's factories and offices, with full production not expected to resume until January 2026. The economic devastation cascaded through the automotive giant's supply chain, impacting an estimated 5,000 organizations and forcing smaller suppliers to lay off workers. Former NCSC head Ciaran Martin described the incident as a stark reminder of the systemic risk posed by disruptions to critical networks and supply chains.",
          "categories": [
            "Cyberattack",
            "Supply Chain Attack",
            "Industrial Control Systems"
          ],
          "tags": [
            "Cyberattack",
            "Economic Impact",
            "Jaguar Land Rover",
            "Manufacturing",
            "Supply Chain",
            "Systemic Risk",
            "UK"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-23T15:00:00.000Z"
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "critical-rce-flaw-cve-2025-59287-in-windows-server-update-services",
        "originalHeadline": "Critical RCE Flaw in WSUS Allows Unauthenticated SYSTEM Takeover",
        "updateTitle": "Update: Critical RCE Flaw in WSUS Allows Unauthenticated SYSTEM Takeover",
        "updateSummary": "WSUS RCE (CVE-2025-59287) now actively exploited in the wild; CISA adds to KEV catalog, prompting emergency out-of-band patch.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Supply Chain Attack"
        ],
        "tags": [
          "CVE-2025-59287",
          "Patch Tuesday",
          "RCE",
          "WSUS",
          "critical vulnerability",
          "deserialization",
          "supply chain"
        ],
        "cves": [
          "CVE-2025-59287"
        ],
        "severity": "critical",
        "publishedAt": "2025-10-19T15:00:00.000Z",
        "updatedAt": "2025-10-24T00:00:00.000Z"
      },
      {
        "slug": "prosper-lending-data-breach-affects-17-million",
        "originalHeadline": "Massive Prosper Data Breach Exposes Social Security Numbers of 17.6 Million Users",
        "updateTitle": "Update: Massive Prosper Data Breach Exposes Social Security Numbers of 17.6 Million Users",
        "updateSummary": "Prosper breach details emerge: government IDs, dates of birth, credit standing exposed via direct database access, increasing identity theft risk.",
        "categories": [
          "Data Breach",
          "Phishing",
          "Cloud Security"
        ],
        "tags": [
          "Data Breach",
          "Fintech",
          "Identity Theft",
          "PII",
          "Prosper",
          "Social Security Number"
        ],
        "severity": "critical",
        "publishedAt": "2025-10-20T15:00:00.000Z",
        "updatedAt": "2025-10-24T00:00:00.000Z"
      },
      {
        "slug": "iran-linked-muddywater-apt-targets-governments-with-phoenix-backdoor",
        "originalHeadline": "Iran's MuddyWater APT Targets 100+ Governments with Phoenix Backdoor",
        "updateTitle": "Update: Iran's MuddyWater APT Targets 100+ Governments with Phoenix Backdoor",
        "updateSummary": "Iranian APT campaign targeting 100+ governments expands scope globally, now using credential spraying alongside phishing for initial access with its multi-stage Phoenix backdoor.",
        "categories": [
          "Threat Actor",
          "Cyberattack",
          "Phishing"
        ],
        "tags": [
          "APT",
          "Iran",
          "MENA",
          "MuddyWater",
          "Phoenix",
          "cyber-espionage",
          "macros",
          "phishing"
        ],
        "malware": [
          "Phoenix"
        ],
        "severity": "high",
        "publishedAt": "2025-10-22T15:00:00.000Z",
        "updatedAt": "2025-10-24T00:00:00.000Z"
      },
      {
        "slug": "palo-alto-networks-uncovers-smishing-and-gift-card-fraud-campaigns",
        "originalHeadline": "Unit 42 Exposes 'Smishing Deluge' from China and 'Jingle Thief' Gift Card Fraud",
        "updateTitle": "Update: Unit 42 Exposes 'Smishing Deluge' from China and 'Jingle Thief' Gift Card Fraud",
        "updateSummary": "Jingle Thief campaign evolves, now infiltrating Microsoft 365 environments, registering rogue MFA applications for persistence, and issuing unauthorized gift cards.",
        "categories": [
          "Phishing",
          "Threat Intelligence",
          "Cloud Security"
        ],
        "tags": [
          "China",
          "Cloud Security",
          "Fraud",
          "Gift Card",
          "Phishing",
          "Smishing",
          "Unit 42"
        ],
        "severity": "medium",
        "publishedAt": "2025-10-23T15:00:00.000Z",
        "updatedAt": "2025-10-24T00:00:00.000Z"
      },
      {
        "slug": "ai-powered-ransomware-outpacing-defenses-crowdstrike-warns",
        "originalHeadline": "CrowdStrike: 76% of Organizations Can't Keep Pace with AI-Powered Ransomware",
        "updateTitle": "Update: CrowdStrike: 76% of Organizations Can't Keep Pace with AI-Powered Ransomware",
        "updateSummary": "Ransomware breakout time shrinks to 18 minutes due to AI/automation, challenging human-speed response.",
        "categories": [
          "Threat Intelligence",
          "Ransomware",
          "Other"
        ],
        "tags": [
          "AI",
          "CrowdStrike",
          "CybersecuritySurvey",
          "Deepfakes",
          "Ransomware",
          "ThreatIntelligence"
        ],
        "severity": "informational",
        "publishedAt": "2025-10-21T15:00:00.000Z",
        "updatedAt": "2025-10-23T12:00:00.000Z"
      },
      {
        "slug": "uk-ncsc-warns-of-rising-supply-chain-attacks-as-significant-incidents-double",
        "originalHeadline": "UK's NCSC Warns of Doubling 'Nationally Significant' Cyberattacks, Cites Supply Chain Risk",
        "updateTitle": "Update: UK's NCSC Warns of Doubling 'Nationally Significant' Cyberattacks, Cites Supply Chain Risk",
        "updateSummary": "New report reveals 94% of firms are confident in supply chain resilience, yet 34% neglect basic risk assessments, increasing vulnerability.",
        "categories": [
          "Supply Chain Attack",
          "Policy and Compliance",
          "Cyberattack"
        ],
        "tags": [
          "Cybersecurity",
          "NCSC",
          "Supply Chain Attack",
          "Threat Intelligence",
          "UK",
          "Vendor Risk Management"
        ],
        "severity": "high",
        "publishedAt": "2025-10-18T15:00:00.000Z",
        "updatedAt": "2025-10-23T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}