{
  "lastUpdated": "2025-12-06T19:44:01.098Z",
  "runDate": "2025-12-06",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-12-06",
      "type": "publication-daily",
      "headline": "React2Shell Zero-Day Exploited by Chinese APTs, Triggers Global Cloudflare Outage; FinCEN Reports Ransomware Payments Top $2.1B",
      "articleCount": 10,
      "articles": [
        {
          "slug": "iran-bans-government-officials-from-using-internet-connected-devices",
          "headline": "Iran Bans Officials From Using All Internet-Connected Devices Over Espionage Fears",
          "summary": "In a drastic measure to combat espionage, Iran's Cybersecurity Command has banned all government officials and their security staff from using any device connected to public communication networks. The directive, reported on December 5, 2025, includes smartphones, laptops, and smartwatches. The move is a direct response to fears of hacking and mobile tracking being used for targeted assassinations, referencing past attacks on nuclear scientists and recent pager and walkie-talkie attacks against Hezbollah. The policy highlights a security philosophy of complete network isolation for key personnel over reliance on defensive technology.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "Espionage",
            "Geopolitics",
            "Iran",
            "Network Isolation",
            "OPSEC",
            "Policy"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-06T15:00:00.000Z"
        },
        {
          "slug": "fincen-report-ransomware-payments-exceed-2-billion-in-three-years",
          "headline": "Ransomware Payments Surpass $2.1 Billion in Three Years, FinCEN Reports",
          "summary": "A new report from the U.S. Treasury's Financial Crimes Enforcement Network (FinCEN) reveals that ransomware-related payments reported under the Bank Secrecy Act (BSA) totaled over $2.1 billion across 4,194 incidents between January 2022 and December 2024. The analysis highlights 2023 as a record year, with payments surging to $1.1 billion, a 77% increase from 2022. While a decrease was noted in 2024, attributed to law enforcement actions against groups like ALPHV/BlackCat and LockBit, the financial toll remains immense. The manufacturing sector was the most frequently targeted, but financial services firms paid the most, underscoring ransomware's continued threat to the U.S. economy.",
          "categories": [
            "Ransomware",
            "Regulatory",
            "Policy and Compliance"
          ],
          "tags": [
            "ALPHV",
            "Akira",
            "BSA",
            "FinCEN",
            "Financial Crime",
            "LockBit",
            "Ransomware"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-06T15:00:00.000Z",
          "malware": [
            "ALPHV/BlackCat",
            "Akira",
            "Black Basta",
            "LockBit",
            "Phobos"
          ]
        },
        {
          "slug": "albiriox-android-rat-maas-targets-400-financial-apps",
          "headline": "'Albiriox' Android RAT-as-a-Service Targets 400+ Financial Apps",
          "summary": "A new and sophisticated Android Remote Access Trojan (RAT) named 'Albiriox' is being sold as a Malware-as-a-Service (MaaS) on cybercrime forums. The malware is designed for on-device fraud (ODF), allowing attackers to gain live remote control of an infected device using VNC. This enables them to perform fraudulent transactions directly within legitimate apps, bypassing many security controls. Albiriox targets a hardcoded list of over 400 banking, cryptocurrency, and financial applications worldwide. Distributed via smishing campaigns with fake app store lures, the malware uses a third-party crypting service called 'Golden Crypt' to evade detection. The MaaS subscription costs around $720 per month.",
          "categories": [
            "Malware",
            "Mobile Security",
            "Threat Actor"
          ],
          "tags": [
            "Albiriox",
            "Android",
            "Banking Trojan",
            "MaaS",
            "Mobile Security",
            "On-Device Fraud",
            "RAT"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-06T15:00:00.000Z",
          "malware": [
            "Albiriox"
          ]
        },
        {
          "slug": "model-context-protocol-mcp-servers-emerge-as-new-supply-chain-risk",
          "headline": "AI Infrastructure at Risk: MCP Servers Emerge as New Supply Chain Threat",
          "summary": "A new security advisory warns that Model Context Protocol (MCP) servers represent a significant and growing supply chain risk for organizations building AI-powered applications. These servers act as highly privileged automation engines, often possessing trusted access to sensitive enterprise resources like code repositories, email systems, and internal APIs. The warning follows the analysis of a critical vulnerability at hosting service Smithery.ai, where a single path traversal flaw could have allowed an attacker to gain administrative control over 3,000 hosted MCP servers. This and other incidents demonstrate that MCP servers are high-value targets that can be exploited to compromise entire AI software supply chains.",
          "categories": [
            "Supply Chain Attack",
            "Cloud Security",
            "Vulnerability"
          ],
          "tags": [
            "AI Security",
            "Docker",
            "MCP",
            "Path Traversal",
            "Smithery.ai",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-06T15:00:00.000Z"
        },
        {
          "slug": "cloudflare-outage-caused-by-botched-emergency-patch-for-react2shell",
          "headline": "Cloudflare Outage Hits 28% of Global Traffic After Faulty React2Shell Patch",
          "summary": "Cloudflare, a leading internet infrastructure provider, experienced a 25-minute global outage on December 5, 2025, that impacted approximately 28% of its HTTP traffic and made numerous popular websites inaccessible. The company quickly confirmed the disruption was not a cyberattack but was self-inflicted, caused by a faulty emergency change to its Web Application Firewall (WAF). The problematic update was deployed to provide mitigation against the critical React2Shell (CVE-2025-55182) vulnerability. The incident highlights the inherent risks of rapid, large-scale deployments, even when intended to improve security, and raises questions about change management processes for critical infrastructure.",
          "categories": [
            "Security Operations",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "500 Error",
            "Change Management",
            "Cloudflare",
            "Incident Response",
            "Outage",
            "React2Shell",
            "WAF"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-06T15:00:00.000Z",
          "cves": [
            "CVE-2025-55182"
          ]
        },
        {
          "slug": "cybercrime-alliance-scattered-lapsus-hunters-threatens-salesforce-data",
          "headline": "Cybercrime Supergroup 'Scattered LAPSUS$ Hunters' Threatens to Leak Salesforce Customer Data",
          "summary": "A new cybercrime 'supergroup' calling itself 'Scattered LAPSUS$ Hunters' is threatening to leak a massive trove of data allegedly stolen from Salesforce customer environments. The group, which appears to be a collaboration between members of the notorious Lapsus$, Scattered Spider, and ShinyHunters crews, has created a dark web leak site to extort victims. They are publicly demanding that Salesforce negotiate a payment to prevent the data of its customers from being leaked. Salesforce has stated its own platform was not breached, attributing the data access to sophisticated social engineering and OAuth token abuse targeting its clients, consistent with the known TTPs of the involved threat actor groups.",
          "categories": [
            "Threat Actor",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Data Breach",
            "Extortion",
            "Lapsus$",
            "Salesforce",
            "Scattered Lapsus Hunters",
            "Scattered Spider",
            "ShinyHunters",
            "Social Engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-06T15:00:00.000Z"
        },
        {
          "slug": "ongoing-supply-chain-risk-in-npm-ecosystem-following-shai-hulud-worm",
          "headline": "NPM Ecosystem Still at Risk from Supply Chain Attacks After 'Shai-Hulud' Worm",
          "summary": "A security advisory from the University of Toronto warns that the NPM package ecosystem remains a high-risk environment for software supply chain attacks. The alert, issued on December 5, 2025, follows the large-scale 'Shai-Hulud 2.0' worm attack in late November that compromised over 700 packages. Despite cleanup efforts, malicious packages re-emerged as recently as December 1. The worm operated by stealing developer credentials to inject malicious 'preinstall' scripts into new package versions, which then exfiltrated secrets like API keys to public GitHub repositories. The advisory highlights ongoing risks and urges organizations to enhance supply chain security by verifying package integrity and auditing CI/CD pipelines.",
          "categories": [
            "Supply Chain Attack",
            "Malware"
          ],
          "tags": [
            "JavaScript",
            "Malware",
            "NPM",
            "Shai-Hulud",
            "Supply Chain Attack",
            "Worm"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-06T15:00:00.000Z",
          "malware": [
            "Shai-Hulud Worm"
          ]
        },
        {
          "slug": "new-benzona-ransomware-strain-uses-double-extortion-tactics",
          "headline": "New 'Benzona' Ransomware Emerges with Double-Extortion Tactics",
          "summary": "A new ransomware strain named 'Benzona' has been identified by security researchers at CYFIRMA. The malware operates on a double-extortion model, encrypting victim files with a '.benzona' extension while also exfiltrating sensitive data. Attackers leave a ransom note, 'RECOVERY_INFO.txt', which gives victims a 72-hour deadline to make contact via a Tor-based portal. Failure to pay results in the threat of leaking the stolen data on a public extortion site. Technical analysis shows Benzona is designed to cripple system recovery by deleting shadow copies and disabling Windows recovery features. Initial victims are from the automotive, digital services, and community sectors.",
          "categories": [
            "Ransomware",
            "Malware"
          ],
          "tags": [
            "Benzona",
            "CYFIRMA",
            "Data Leak",
            "Double Extortion",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-06T15:00:00.000Z",
          "malware": [
            "Benzona"
          ]
        },
        {
          "slug": "intellexa-predator-spyware-delivered-via-zero-click-aladdin-ad-vector",
          "headline": "Intellexa Predator Spyware Uses Zero-Click 'Aladdin' Ad Vector for Infection",
          "summary": "A joint investigation based on leaked internal documents from the spyware vendor Intellexa has exposed a powerful zero-click infection vector named 'Aladdin.' This system delivers the invasive Predator spyware by exploiting the commercial mobile advertising ecosystem. It forces a weaponized ad onto a target's device through any app or website using a participating ad network; simply viewing the ad is enough to infect the device without any user interaction. The 'Intellexa Leaks' investigation, led by Amnesty International and news outlets, also identified new victims of the spyware and revealed that Intellexa may have retained remote access to its government clients' surveillance systems, despite U.S. sanctions.",
          "categories": [
            "Malware",
            "Threat Actor",
            "Vulnerability"
          ],
          "tags": [
            "Aladdin",
            "Amnesty International",
            "Intellexa",
            "Predator",
            "Privacy",
            "Spyware",
            "Zero-Click"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-06T15:00:00.000Z",
          "cves": [
            "CVE-2025-6554"
          ],
          "malware": [
            "Predator"
          ]
        },
        {
          "slug": "react2shell-flaw-cve-2025-55182-actively-exploited-by-chinese-apts",
          "headline": "React2Shell Zero-Day Exploited Within Hours by Chinese APTs, CISA Issues Emergency Directive",
          "summary": "A critical, maximum-severity (CVSS 10.0) remote code execution vulnerability in React Server Components, dubbed React2Shell (CVE-2025-55182), is being actively exploited by Chinese state-sponsored threat groups like Earth Lamia and Jackpot Panda. The flaw, caused by insecure deserialization in React's 'Flight' protocol, allows unauthenticated attackers to take full control of affected servers. The rapid weaponization, occurring just hours after disclosure, prompted the U.S. CISA to add the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog on December 5, 2025, mandating urgent patching for federal agencies. The availability of public PoCs and a Metasploit module has significantly increased the risk for organizations using affected versions of React, Next.js, and other dependent frameworks.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Insecure Deserialization",
            "KEV",
            "Next.js",
            "RCE",
            "React",
            "React2Shell",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-06T15:00:00.000Z",
          "cves": [
            "CVE-2025-55182"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-12-05",
      "type": "publication-daily",
      "headline": "Critical 'React2Shell' RCE Exploited by Chinese Hackers; Google Patches Android Zero-Days",
      "articleCount": 10,
      "articles": [
        {
          "slug": "ftc-reaches-settlement-with-illuminate-education-over-massive-student-data-breach",
          "headline": "FTC Settles with Ed-Tech Firm Illuminate Education After Breach Exposed 10 Million Students' Data",
          "summary": "The U.S. Federal Trade Commission (FTC) has reached a proposed settlement with education technology provider Illuminate Education, Inc. following a major data breach in 2021. The incident, which exposed the personal information of over 10 million students, was allegedly caused by inadequate security practices, including the failure to deactivate the credentials of a former employee. The settlement will require the company to significantly improve its data security program and undergo regular audits.",
          "categories": [
            "Data Breach",
            "Regulatory",
            "Policy and Compliance"
          ],
          "tags": [
            "Data Breach",
            "EdTech",
            "FTC",
            "Illuminate Education",
            "Regulatory",
            "Student Data"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-05T15:00:00.000Z"
        },
        {
          "slug": "new-benzona-ransomware-strain-emerges",
          "headline": "New \"Benzona\" Ransomware Strain Discovered in the Wild",
          "summary": "Security researchers at CYFIRMA have discovered a new ransomware strain named \"Benzona.\" The malware encrypts files on Windows, macOS, and Linux systems, appending a \".benzona\" extension and dropping a ransom note titled \"RECOVERY_INFO.txt\". Victims are instructed to use the TOR browser to access a chat portal for recovery negotiations. The threat actors behind Benzona are believed to use a variety of initial access vectors, including social engineering, botnets, and exploitation of software vulnerabilities.",
          "categories": [
            "Ransomware",
            "Malware"
          ],
          "tags": [
            "Benzona",
            "CYFIRMA",
            "Malware",
            "Ransomware",
            "TOR"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-05T15:00:00.000Z",
          "malware": [
            "Benzona"
          ]
        },
        {
          "slug": "g7-announces-framework-for-coordinated-cyber-incident-response-in-financial-sector",
          "headline": "G7 Unveils Framework for Coordinated Cyber Response in Financial Sector",
          "summary": "The G7 Cyber Expert Group, co-chaired by the U.S. Treasury and the Bank of England, has published a new policy paper outlining a framework for Collective Cyber Incident Response and Recovery (CCIRR). Released on December 4, 2025, the paper provides non-binding principles to enhance cooperation and compatibility among financial institutions and authorities during major cyber incidents. The framework aims to build a trusted community to respond to attacks that could threaten global financial stability.",
          "categories": [
            "Policy and Compliance",
            "Regulatory"
          ],
          "tags": [
            "Cybersecurity Framework",
            "Financial Sector",
            "G7",
            "Incident Response",
            "Policy",
            "Regulation"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-05T15:00:00.000Z"
        },
        {
          "slug": "clop-ransomware-breaches-barts-health-nhs-trust-via-oracle-vulnerability",
          "headline": "Clop Ransomware Breaches UK's Largest NHS Trust via Oracle Vulnerability",
          "summary": "The Clop ransomware group has successfully breached Barts Health NHS Trust, the largest NHS trust in the United Kingdom. The attack, confirmed by the trust on December 5, 2025, involved the exploitation of an unspecified vulnerability in its Oracle E-business Suite software. The Russian-speaking cybercrime group stole files from a database and is known for leveraging software vulnerabilities for large-scale data theft and extortion campaigns. This incident highlights the significant and ongoing threat ransomware poses to the critical healthcare sector.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Cyberattack"
          ],
          "tags": [
            "Clop",
            "Data Breach",
            "Healthcare",
            "NHS",
            "Oracle",
            "Ransomware",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-05T15:00:00.000Z"
        },
        {
          "slug": "active-exploitation-of-critical-7-zip-rce-vulnerability-confirmed",
          "headline": "Critical 7-Zip RCE Vulnerability Now Under Active Exploitation",
          "summary": "A critical remote code execution (RCE) vulnerability in the popular 7-Zip file archiver, tracked as CVE-2025-11001, is now being actively exploited in the wild. The path traversal flaw, which affects versions prior to 25.0.0, can be triggered when a user extracts a specially crafted malicious archive. This allows an attacker to write files to arbitrary locations and execute code. NHS England has issued an advisory confirming active exploitation, urging all organizations to update their installations immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "7-Zip",
            "Patch Management",
            "Path Traversal",
            "RCE",
            "Vulnerability",
            "Zip Slip"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-05T15:00:00.000Z",
          "cves": [
            "CVE-2025-11001",
            "CVE-2025-11002"
          ]
        },
        {
          "slug": "google-patches-two-actively-exploited-android-zero-days",
          "headline": "Google Patches Two Android Zero-Days Exploited in the Wild",
          "summary": "Google has released its December 2025 Android Security Bulletin, addressing over 100 vulnerabilities. Among them are two high-severity zero-days, CVE-2025-48633 and CVE-2025-48572, which are being actively exploited in limited, targeted attacks. Both vulnerabilities reside in the Android Framework, affecting versions 13 through 16, and can be chained for information disclosure and privilege escalation. CISA has added both flaws to its Known Exploited Vulnerabilities (KEV) catalog, mandating a patch deadline of December 23, 2025, for U.S. federal agencies.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Mobile Security"
          ],
          "tags": [
            "Android",
            "Google",
            "Information Disclosure",
            "KEV",
            "Mobile Security",
            "Privilege Escalation",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-05T15:00:00.000Z",
          "cves": [
            "CVE-2025-48572",
            "CVE-2025-48631",
            "CVE-2025-48633"
          ]
        },
        {
          "slug": "ransomware-tactics-shift-data-theft-spikes-in-manufacturing-sector",
          "headline": "Ransomware Tactics Evolve: Data Theft and Extortion Replace Encryption in Manufacturing Sector",
          "summary": "A new report on ransomware trends reveals a major tactical shift in attacks against the manufacturing sector. Over the past year, attacks involving data encryption have fallen from 74% to 40%, while extortion-only attacks have tripled to 10%. This change suggests that while organizations are getting better at preventing operational disruption, attackers are adapting by focusing on data theft for financial leverage. Double extortion, combining both theft and encryption, was used in over half of all incidents, with groups like Akira, Qilin, and PLAY being the most active.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Data Breach"
          ],
          "tags": [
            "Akira",
            "Data Theft",
            "Extortion",
            "Manufacturing",
            "PLAY",
            "Qilin",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-05T15:00:00.000Z",
          "malware": [
            "Akira",
            "PLAY",
            "Qilin"
          ]
        },
        {
          "slug": "us-canada-issue-alert-on-chinese-brickstorm-malware",
          "headline": "US & Canada Warn of Chinese \"BRICKSTORM\" Malware Targeting VMware",
          "summary": "U.S. and Canadian cybersecurity agencies have released a joint advisory on \"BRICKSTORM,\" a sophisticated malware backdoor attributed to a Chinese state-sponsored threat actor dubbed \"Warp Panda.\" The malware has been used in long-term campaigns since at least 2022 to compromise VMware environments in government and IT sectors. Attackers exploit edge devices for initial access, then pivot to VMware vCenter servers to deploy BRICKSTORM, enabling persistent access, data exfiltration, and further malware execution.",
          "categories": [
            "Malware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "BRICKSTORM",
            "Backdoor",
            "CISA",
            "China",
            "Espionage",
            "VMware",
            "Warp Panda"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-05T15:00:00.000Z",
          "malware": [
            "BRICKSTORM"
          ]
        },
        {
          "slug": "chinese-state-backed-groups-exploit-critical-react2shell-vulnerability",
          "headline": "React2Shell Zero-Day Exploited by Chinese Hackers Hours After Disclosure",
          "summary": "A critical remote code execution (RCE) vulnerability with a 10.0 CVSS score, dubbed \"React2Shell\" (CVE-2025-55182), is under active exploitation by multiple Chinese state-sponsored threat groups. The flaw affects modern web applications using React Server Components and the Next.js framework, allowing for unauthenticated code execution. The attacks began just hours after the vulnerability's public disclosure, prompting the U.S. Cybersecurity and Infrastructure Security Agency (CISA) to add it to its Known Exploited Vulnerabilities (KEV) catalog, mandating urgent patching for federal agencies.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "China",
            "Deserialization",
            "KEV",
            "Next.js",
            "RCE",
            "React",
            "React2Shell",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-05T15:00:00.000Z",
          "cves": [
            "CVE-2025-55182",
            "CVE-2025-66478"
          ]
        },
        {
          "slug": "spyware-vendor-intellexa-arsenal-of-zero-days-and-ad-based-attacks-revealed",
          "headline": "Spyware Vendor Intellexa Wields Zero-Days and Malicious Ads to Deploy Predator Spyware",
          "summary": "A new report from Google's Threat Analysis Group (TAG) identifies sanctioned spyware vendor Intellexa as one of the most prolific exploiters of zero-day vulnerabilities, responsible for 15 unique flaws discovered by Google since 2021. In a major tactical shift, Intellexa is now leveraging the mobile advertising ecosystem to deliver its Predator spyware. A system called \"Aladdin\" uses malicious ads to fingerprint and redirect targets to exploit servers in zero-click attacks, moving beyond the group's previous reliance on one-time links.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Vulnerability"
          ],
          "tags": [
            "Google TAG",
            "Intellexa",
            "Malvertising",
            "Mobile Security",
            "Predator",
            "Spyware",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-05T15:00:00.000Z",
          "cves": [
            "CVE-2021-38003",
            "CVE-2023-2033",
            "CVE-2023-2136",
            "CVE-2023-3079",
            "CVE-2023-41991",
            "CVE-2023-41992",
            "CVE-2023-41993",
            "CVE-2023-4762",
            "CVE-2024-4610",
            "CVE-2025-48543",
            "CVE-2025-6554"
          ],
          "malware": [
            "Predator"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "scattered-lapsus-hunters-claim-supply-chain-breach-via-gainsight-salesforce-integration",
        "originalHeadline": "Massive Supply Chain Attack Hits 200+ Companies via Salesforce App; Hacker Group Claims Breach",
        "updateTitle": "Update: Massive Supply Chain Attack Hits 200+ Companies via Salesforce App; Hacker Group Claims Breach",
        "updateSummary": "Scattered LAPSUS$ Hunters launched a dark web leak site, threatening to expose Salesforce customer data and demanding a ransom from Salesforce directly.",
        "categories": [
          "Supply Chain Attack",
          "Data Breach",
          "Cloud Security"
        ],
        "tags": [
          "Data Breach",
          "Gainsight",
          "OAuth",
          "SaaS",
          "Salesforce",
          "Scattered Lapsus$ Hunters",
          "Supply Chain Attack",
          "Token Theft"
        ],
        "severity": "high",
        "publishedAt": "2025-11-22T15:00:00.000Z",
        "updatedAt": "2025-12-06T00:00:00.000Z"
      },
      {
        "slug": "washington-post-confirms-breach-in-massive-oracle-software-attack",
        "originalHeadline": "Washington Post Breached by Clop Ransomware via Oracle Flaws",
        "updateTitle": "Update: Washington Post Breached by Clop Ransomware via Oracle Flaws",
        "updateSummary": "Clop ransomware has added Barts Health NHS Trust, the UK's largest NHS trust, as a new victim in its ongoing Oracle E-business Suite campaign.",
        "categories": [
          "Ransomware",
          "Data Breach",
          "Cyberattack"
        ],
        "tags": [
          "Clop",
          "Data Breach",
          "E-Business Suite",
          "Extortion",
          "Oracle",
          "Ransomware",
          "TA505"
        ],
        "severity": "high",
        "publishedAt": "2025-11-09T15:00:00.000Z",
        "updatedAt": "2025-12-05T00:00:00.000Z"
      },
      {
        "slug": "cisa-warns-of-brickstorm-malware-used-by-chinese-hackers-against-us-government",
        "originalHeadline": "CISA Exposes 'BRICKSTORM' Backdoor Used by Chinese State Actors to Infiltrate US Government",
        "updateTitle": "Update: CISA Exposes 'BRICKSTORM' Backdoor Used by Chinese State Actors to Infiltrate US Government",
        "updateSummary": "Chinese state actor 'Warp Panda' identified, active since 2022, impacting dozens of US orgs via edge device exploits.",
        "categories": [
          "Threat Actor",
          "Malware",
          "Cyberattack"
        ],
        "tags": [
          "BRICKSTORM",
          "Backdoor",
          "CISA",
          "China",
          "NSA",
          "PRC",
          "State-Sponsored",
          "Threat Actor",
          "VMware"
        ],
        "malware": [
          "BRICKSTORM"
        ],
        "severity": "high",
        "publishedAt": "2025-12-04T15:00:00.000Z",
        "updatedAt": "2025-12-05T00:00:00.000Z"
      },
      {
        "slug": "actively-exploited-android-zero-days-added-to-cisa-kev-catalog",
        "originalHeadline": "Android Zero-Days Under Active Attack, CISA Adds to KEV Catalog",
        "updateTitle": "Update: Android Zero-Days Under Active Attack, CISA Adds to KEV Catalog",
        "updateSummary": "Google released December 2025 Android Security Bulletin, patching 107 vulnerabilities including the two zero-days, with a Dec 23 deadline for federal agencies.",
        "categories": [
          "Vulnerability",
          "Mobile Security",
          "Threat Intelligence"
        ],
        "tags": [
          "Android",
          "CISA",
          "CVE-2025-48572",
          "CVE-2025-48633",
          "KEV",
          "Mobile Security",
          "Vulnerability",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-48572",
          "CVE-2025-48633"
        ],
        "severity": "high",
        "publishedAt": "2025-12-04T15:00:00.000Z",
        "updatedAt": "2025-12-05T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}