{
  "lastUpdated": "2026-01-13T16:04:29.686Z",
  "runDate": "2026-01-13",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-13",
      "type": "publication-daily",
      "headline": "CISA KEV Alert for Gogs RCE Flaw; BreachForums Database Leaked; AI Threats Forecasted to Rise",
      "articleCount": 12,
      "articles": [
        {
          "slug": "experian-forecasts-ai-agents-to-become-top-cause-of-data-breaches",
          "headline": "AI to Overtake Human Error as Top Cause of Breaches, Experian Predicts",
          "summary": "In its 13th Annual Data Breach Industry Forecast, Experian predicts a paradigm shift in cybersecurity for 2026, with autonomous AI agents potentially surpassing human error as the leading cause of data breaches. The report warns that threat actors are weaponizing AI to create sophisticated polymorphic malware, execute highly personalized attacks, and generate 'pristine synthetic identities' at scale from stolen data. This new wave of AI-driven threats, combined with the looming risk of quantum computing, is expected to fuel a massive spike in identity theft and fundamentally change the nature of cyberattacks.",
          "categories": [
            "Threat Intelligence",
            "Policy and Compliance"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "Polymorphic Malware",
            "Quantum Computing",
            "Synthetic Identity",
            "Threat Forecast"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z",
          "malware": [
            "Metamorphic malware",
            "Polymorphic malware"
          ]
        },
        {
          "slug": "g7-unveils-roadmap-for-post-quantum-cryptography-in-finance-sector",
          "headline": "G7 Unveils Roadmap for Financial Sector's Transition to Post-Quantum Cryptography",
          "summary": "The G7 Cyber Expert Group (CEG), co-chaired by the U.S. Treasury and the Bank of England, has released a strategic roadmap to guide the global financial sector's transition to quantum-resilient technology. Published on January 12, 2026, the guidance addresses the existential threat that future quantum computers pose to current cryptographic standards like RSA and ECC. The non-prescriptive roadmap recommends a phased approach, urging firms to begin inventorying cryptographic assets by 2027 and aim for a full transition to Post-Quantum Cryptography (PQC) by 2035 to mitigate 'harvest now, decrypt later' risks.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "Banking",
            "Cryptography",
            "Finance",
            "G7",
            "PQC",
            "Post-Quantum Cryptography",
            "Quantum Computing"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "crazyhunter-ransomware-escalates-attacks-on-taiwanese-healthcare",
          "headline": "'CrazyHunter' Ransomware Targets Taiwanese Hospitals with Advanced Tactics",
          "summary": "A sophisticated Go-based ransomware variant named CrazyHunter is escalating attacks, primarily targeting the healthcare sector in Taiwan with at least six confirmed victims. According to research from Trellix, CrazyHunter is a fork of the open-source 'Prince Ransomware' but incorporates significant enhancements. The attackers use weak Active Directory passwords for initial access, leverage the SharpGPOAbuse tool for rapid network-wide deployment, and employ Bring Your Own Vulnerable Driver (BYOVD) techniques to disable security software. The ransomware uses a hybrid ChaCha20 and ECIES encryption scheme and appends the `.Hunter` extension to files.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "BYOVD",
            "GPO",
            "Go",
            "Healthcare",
            "Ransomware",
            "Taiwan"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z",
          "malware": [
            "Prince Ransomware"
          ]
        },
        {
          "slug": "brightspeed-investigates-data-breach-claim-from-crimson-collective-affecting-1m-customers",
          "headline": "Brightspeed Probes Breach Claim by 'Crimson Collective' Affecting Over 1M Customers",
          "summary": "U.S. broadband provider Brightspeed is actively investigating a significant cybersecurity event following a claim by the 'Crimson Collective' extortion group. The group alleges it breached Brightspeed's systems and stole the personally identifiable information (PII) of over one million residential customers, including names, addresses, and partial payment details. Crimson Collective, a group known for targeting AWS cloud environments, posted its claim on Telegram and threatened to leak the data if its demands are not met. Brightspeed, which serves 20 states, has acknowledged the threat and is working with authorities.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "AWS",
            "Cloud Security",
            "Extortion",
            "PII",
            "Telecommunications"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "french-immigration-agency-data-leaked-via-third-party-contractor-breach",
          "headline": "French Immigration Agency Data Leaked via Third-Party Breach",
          "summary": "France's Office for Immigration and Integration (OFII) has confirmed a data breach originating from a compromised third-party service provider. In early January 2026, a hacker claimed to be selling a database of up to 2.1 million records of foreign residents on BreachForums, posting samples that included names, contact details, and nationalities. OFII clarified that its own systems were not breached, but that the attack targeted a private training provider responsible for mandatory integration courses. The incident highlights the significant risks of supply chain attacks for government agencies and could lead to GDPR penalties for OFII as the data controller.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Regulatory"
          ],
          "tags": [
            "France",
            "GDPR",
            "Government",
            "PII",
            "Supply Chain Attack",
            "Third Party Breach"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "gobuteforcer-botnet-exploits-weak-passwords-in-linux-servers-fueled-by-ai-defaults",
          "headline": "GoBruteforcer Botnet Targets Linux Servers with Weak Passwords and AI-Generated Defaults",
          "summary": "A modular, Go-based botnet named GoBruteforcer is actively targeting Linux servers by brute-forcing weak passwords for exposed services like phpMyAdmin, MySQL, and FTP. According to Check Point Research, the campaign's success is fueled by two trends: the continued use of insecure legacy web stacks and the proliferation of insecure default configurations suggested by AI tools. The botnet turns compromised machines into scanners to find more victims. The financially motivated attackers also deploy tools to scan for and drain cryptocurrency wallets on compromised servers, with a focus on TRON and Binance Smart Chain.",
          "categories": [
            "Malware",
            "Cyberattack",
            "Cloud Security"
          ],
          "tags": [
            "AI",
            "Botnet",
            "Brute Force",
            "Cryptocurrency",
            "Linux",
            "MySQL",
            "phpMyAdmin"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z",
          "malware": [
            "GoBruteforcer"
          ]
        },
        {
          "slug": "logistics-cyberattacks-expected-to-double-in-2026-targeting-supply-chains",
          "headline": "Logistics Cyberattacks to Double in 2026 as Hackers Target Supply Chain Networks",
          "summary": "A new report from supply chain risk management firm Everstream Analytics predicts that cyberattacks targeting the logistics sector will double in 2026. The report highlights a staggering 965% increase in such incidents since 2021, with a 61% jump in 2025 alone. Threat actors, including state-sponsored groups from Russia, China, and Iran, are strategically shifting their focus from individual companies to shared transportation networks like ports and 3PLs to cause widespread, cascading disruption across the global supply chain. This trend has elevated logistics cyberattacks to a top-four supply chain risk for the coming year.",
          "categories": [
            "Supply Chain Attack",
            "Threat Intelligence",
            "Industrial Control Systems"
          ],
          "tags": [
            "ICS",
            "Logistics",
            "Maritime",
            "OT Security",
            "Supply Chain",
            "Transportation"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "new-zealand-patient-portal-manage-my-health-hit-by-ransomware",
          "headline": "New Zealand's 'Manage My Health' Portal Breached; Data of 120,000 Patients Held for Ransom",
          "summary": "New Zealand's largest patient portal, Manage My Health, is responding to a significant data breach that occurred in late December 2025. An attacker using the alias 'Kazu' claims to have stolen over 400,000 files, including sensitive medical records like lab results and clinical notes, affecting up to 126,000 individuals. The attacker has demanded a $60,000 ransom. The breach originated from a vulnerability in the 'Health Documents' module of the application. Manage My Health has since closed the security gap and is working with New Zealand authorities, while the government has launched an urgent review of the incident.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Cyberattack"
          ],
          "tags": [
            "Healthcare",
            "New Zealand",
            "PHI",
            "Patient Data",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "oregon-deq-data-breach-of-4800-people-kept-secret-for-nine-months",
          "headline": "Oregon DEQ Kept Data Breach of 4,800 People Secret for Nine Months",
          "summary": "The Oregon Department of Environmental Quality (DEQ) confirmed on January 13, 2026, that a cyberattack in April 2025 exposed the personal data of approximately 4,800 people. The agency opted not to issue a broad public disclosure, citing that Oregon law did not require it, and instead began sending notification letters to affected individuals in late December 2025, over eight months after the incident. The initial attack, which the Rhysida ransomware gang later claimed, caused significant operational disruption. The delay in notification has drawn criticism and raises questions about the agency's transparency and incident response process.",
          "categories": [
            "Data Breach",
            "Incident Response",
            "Regulatory"
          ],
          "tags": [
            "Data Breach Notification",
            "Government",
            "Incident Response",
            "Ransomware",
            "Transparency"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "breachforums-user-database-leaked-exposing-324000-cybercriminals",
          "headline": "Poetic Justice: BreachForums Hacked, Database of 324,000 Cybercriminals Leaked",
          "summary": "In a significant turn of events for the cybercrime community, the user database for the notorious hacking marketplace BreachForums was leaked online on January 9, 2026. The dump contains sensitive records for 323,986 users, including usernames, email addresses, IP addresses, private messages, and Argon2-hashed passwords. The breach, allegedly occurring in August 2025 and claimed by an individual named \"James,\" represents a major operational security failure and provides a trove of intelligence for law enforcement agencies seeking to identify and prosecute threat actors like 'IntelBroker' and 'ShinyHunters' who were active on the forum.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "Cybercrime",
            "Database Leak",
            "Hacking Forum",
            "Law Enforcement",
            "OPSEC",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z"
        },
        {
          "slug": "critical-unauthenticated-rce-flaw-ni8mare-in-n8n-automation-platform",
          "headline": "CVSS 10.0 'Ni8mare' Bug in n8n Allows Unauthenticated RCE",
          "summary": "A critical unauthenticated remote code execution (RCE) vulnerability, dubbed 'Ni8mare' and tracked as CVE-2026-21858, has been disclosed in the n8n workflow automation platform. The flaw, rated a maximum 10.0 on the CVSS scale, stems from a content-type confusion bug in the Form Webhook node. It allows an unauthenticated attacker to read arbitrary files, expose sensitive credentials, and ultimately achieve full RCE on vulnerable instances. The flaw affects n8n versions prior to 1.121.0, and with tens of thousands of instances exposed online, administrators are urged to patch immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVSS 10",
            "Ni8mare",
            "RCE",
            "Unauthenticated",
            "Workflow Automation",
            "n8n"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z",
          "cves": [
            "CVE-2026-21858"
          ]
        },
        {
          "slug": "cisa-adds-actively-exploited-gogs-rce-vulnerability-to-kev-catalog",
          "headline": "Urgent Patch: CISA Adds Actively Exploited Gogs RCE Flaw to KEV Catalog",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical path traversal vulnerability, CVE-2025-8110, in the Gogs self-hosted Git service to its Known Exploited Vulnerabilities (KEV) catalog. This flaw, which allows for remote code execution (RCE) via symlink manipulation, is confirmed to be actively exploited in the wild. With a CVSS score of 8.7, it bypasses a previous patch for CVE-2024-55947. Federal agencies are mandated to remediate by February 2, 2026. The vulnerability affects an estimated 1,600 internet-exposed Gogs servers, posing a significant risk to organizations using the platform for source code management.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "Git",
            "KEV",
            "Path Traversal",
            "RCE",
            "Source Code Management",
            "Symlink"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-13T15:00:00.000Z",
          "cves": [
            "CVE-2024-55947",
            "CVE-2025-8110"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-12",
      "type": "publication-daily",
      "headline": "CrazyHunter Ransomware Hits Taiwanese Healthcare, G7 Warns on Quantum Threats, and Malicious npm Packages Target n8n",
      "articleCount": 12,
      "articles": [
        {
          "slug": "instagram-denies-breach-amid-password-reset-bug-and-data-leak-confusion",
          "headline": "Instagram Denies Breach After Password Bug Sparks Widespread Panic",
          "summary": "Instagram's parent company, Meta, has denied that its systems were breached after a bug caused a wave of legitimate but unsolicited password reset emails to be sent to users, sparking fears of a mass compromise. The incident coincided with the circulation of a 17.5 million user dataset on a hacker forum, which further fueled breach speculation. However, Meta clarified the password emails were due to a now-fixed bug that did not expose accounts. Security researchers have assessed the leaked data as a repackaged version of an old dataset from 2017, not the result of a new breach. Despite the lack of a new intrusion, the events increase the risk of targeted phishing attacks against users.",
          "categories": [
            "Data Breach",
            "Phishing",
            "Cloud Security"
          ],
          "tags": [
            "Cybernews",
            "Data Breach",
            "Instagram",
            "Meta",
            "Password Reset",
            "Phishing",
            "Social Media"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        },
        {
          "slug": "wef-report-cyber-fraud-overtakes-ransomware-as-top-threat",
          "headline": "Cyber-Fraud Now Top Global Threat, Surpassing Ransomware, WEF Report Finds",
          "summary": "The World Economic Forum's (WEF) 'Global Cybersecurity Outlook 2026' report, produced with Accenture, reveals a major shift in the threat landscape: cyber-enabled fraud and phishing have now surpassed ransomware as the top concern for global business leaders. The report highlights that fraud has reached 'record highs,' with 77% of leaders reporting an increase. It also identifies Artificial Intelligence as the most consequential force shaping cybersecurity in 2026, with 94% of leaders agreeing it will be the biggest factor. AI is seen as a double-edged sword, accelerating both offensive capabilities and defensive solutions, while growing concerns about data leaks from generative AI persist.",
          "categories": [
            "Policy and Compliance",
            "Threat Intelligence",
            "Regulatory"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "Cyber Fraud",
            "Cybersecurity Outlook",
            "Phishing",
            "Ransomware",
            "WEF"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        },
        {
          "slug": "g7-issues-roadmap-for-post-quantum-cryptography-in-financial-sector",
          "headline": "G7 Urges Financial Sector to Prepare for Quantum Computing Threat",
          "summary": "The G7 Cyber Expert Group (CEG), co-chaired by the U.S. Department of the Treasury and the Bank of England, has issued a public statement and roadmap advising the global financial sector to begin a coordinated transition to quantum-resilient technology. The guidance warns that advanced quantum computers will eventually be able to break the public-key cryptography that secures the world's financial transactions. The roadmap encourages financial institutions to start assessing their quantum risks and developing formal plans for migrating to post-quantum cryptography (PQC) standards, such as those being developed by NIST, to counter 'harvest now, decrypt later' attacks.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "Banking",
            "Finance",
            "G7",
            "NIST",
            "PQC",
            "Post-Quantum Cryptography",
            "Quantum Computing",
            "U.S. Treasury"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        },
        {
          "slug": "crazyhunter-ransomware-cripples-taiwanese-hospitals-with-advanced-tactics",
          "headline": "CrazyHunter Ransomware Cripples Taiwanese Hospitals with Advanced Tactics",
          "summary": "The CrazyHunter ransomware, a sophisticated fork of the open-source Prince ransomware, has actively targeted and compromised at least six healthcare organizations in Taiwan. Security researchers from Trellix report the Go-developed malware uses advanced evasion and propagation techniques, including Group Policy Object (GPO) abuse and Bring Your Own Vulnerable Driver (BYOVD) attacks to disable security software. The attackers operate a dedicated data leak site, employing a double-extortion model that puts immense pressure on critical healthcare providers to pay ransoms and prevent the release of sensitive patient data.",
          "categories": [
            "Ransomware",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "Active Directory",
            "BYOVD",
            "CrazyHunter",
            "GPO Abuse",
            "Go",
            "Healthcare",
            "Ransomware",
            "Taiwan",
            "Trellix"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "malware": [
            "Prince Ransomware"
          ]
        },
        {
          "slug": "gobuteforcer-botnet-exploits-weak-credentials-on-linux-servers",
          "headline": "GoBruteforcer Botnet Exploits Weak Credentials on Linux Servers to Target Crypto Wallets",
          "summary": "A modular Go-based botnet named GoBruteforcer is actively compromising internet-facing Linux servers by brute-forcing weak credentials for services like FTP, MySQL, and PostgreSQL. According to Check Point Research, the campaign's success is fueled by the widespread use of default or weak passwords, often found in AI-generated server deployment examples. Once compromised, servers are added to an IRC-controlled botnet and used to scan for more victims. The attackers have a clear financial motive, as they have been observed deploying tools on compromised hosts to scan for and drain TRON and Binance Smart Chain cryptocurrency wallets.",
          "categories": [
            "Malware",
            "Cyberattack",
            "Cloud Security"
          ],
          "tags": [
            "Botnet",
            "Brute Force",
            "Check Point",
            "Cryptocurrency",
            "GoBruteforcer",
            "Linux",
            "Malware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "malware": [
            "GoBruteforcer"
          ]
        },
        {
          "slug": "high-severity-code-injection-flaw-in-open-webui-disclosed",
          "headline": "High-Severity Code Injection Flaw in Open WebUI (CVE-2025-64496) Allows RCE",
          "summary": "A high-severity vulnerability, tracked as CVE-2025-64496, has been discovered in Open WebUI, a popular self-hosted interface for large language models (LLMs). The flaw, found by Cato Networks, allows a malicious AI server to inject arbitrary JavaScript code into a user's browser session. This can be exploited to steal authentication tokens and take over the user's account. If the compromised user has specific permissions enabled, the vulnerability can be escalated to achieve full remote code execution (RCE) on the host server. The issue affects Open WebUI versions 0.6.34 and older and was patched in version 0.6.35.",
          "categories": [
            "Vulnerability",
            "Cloud Security",
            "Threat Intelligence"
          ],
          "tags": [
            "AI",
            "Account Takeover",
            "CVE-2025-64496",
            "LLM",
            "Open WebUI",
            "RCE",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "cves": [
            "CVE-2025-64496"
          ]
        },
        {
          "slug": "black-axe-cyber-fraud-network-dismantled-in-spain",
          "headline": "International 'Black Axe' Cybercrime Gang Disrupted in Spain, 34 Arrested",
          "summary": "A joint international law enforcement operation involving Spanish and German police, with support from Europol, has resulted in the arrest of 34 individuals in Spain suspected of belonging to the notorious 'Black Axe' criminal organization. The highly structured, Nigerian-origin network is accused of a wide range of cyber-enabled fraud, including business email compromise (BEC) and romance scams. This specific cell is believed to be responsible for over €5.9 million in fraud losses and was actively recruiting money mules in Spain to launder the proceeds of their global criminal activities.",
          "categories": [
            "Threat Actor",
            "Policy and Compliance",
            "Phishing"
          ],
          "tags": [
            "BEC",
            "Black Axe",
            "Cybercrime",
            "Europol",
            "Fraud",
            "Spain",
            "Takedown"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        },
        {
          "slug": "margaritaville-at-sea-sued-over-customer-data-breach",
          "headline": "Margaritaville at Sea Faces Class Action Lawsuit Over 2025 Data Breach",
          "summary": "A class action lawsuit has been filed against Classica Cruise Operator Ltd., the operator of Margaritaville at Sea, following a data breach in September 2025. The lawsuit alleges the cruise line was negligent in protecting customer data, which resulted in the compromise of extensive Personally Identifiable Information (PII) and Protected Health Information (PHI). The breach, reportedly carried out by the Lynx ransomware group, is said to have exposed names, passport details, Social Security numbers, and financial data. The plaintiff seeks damages for affected customers, who now face an increased risk of identity theft and fraud.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Regulatory"
          ],
          "tags": [
            "Data Breach",
            "Lawsuit",
            "Margaritaville at Sea",
            "Negligence",
            "PHI",
            "PII",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "malware": [
            "Lynx Ransomware"
          ]
        },
        {
          "slug": "pro-russian-hacktivists-target-uk-with-massive-ddos-campaign",
          "headline": "Pro-Russian Hacktivist Group NoName057(16) Unleashes Massive DDoS Campaign Against UK",
          "summary": "The pro-Russian hacktivist group NoName057(16) conducted a highly coordinated and intensive Distributed Denial-of-Service (DDoS) campaign against United Kingdom infrastructure between January 5 and 11, 2026. A report from SOCRadar details 1,812 attack entries targeting 86 unique domains, with 85% of the attacks focused on the UK. The primary targets were government services (55%), but the campaign also hit critical infrastructure, including major seaports and rail networks. The attacks are coordinated through the group's 'DDoSia' project, which uses a volunteer-driven botnet managed via Telegram.",
          "categories": [
            "Cyberattack",
            "Threat Actor",
            "Industrial Control Systems"
          ],
          "tags": [
            "Critical Infrastructure",
            "DDoS",
            "DDoSia",
            "Hacktivism",
            "NoName057(16)",
            "SOCRadar",
            "United Kingdom"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "malware": [
            "DDoSia"
          ]
        },
        {
          "slug": "malicious-npm-packages-target-n8n-automation-platform-in-supply-chain-attack",
          "headline": "Supply Chain Attack: Malicious npm Packages Steal Credentials from n8n Automation Platform",
          "summary": "A novel supply chain attack discovered by Endor Labs is targeting users of the n8n workflow automation platform. Attackers are publishing malicious packages to the npm registry, disguised as legitimate 'community nodes' for popular services. When an unsuspecting user installs one of these nodes and enters their credentials (e.g., OAuth tokens, API keys), the malicious code exfiltrates the entire credential store from the n8n instance to an attacker-controlled server. This gives the attackers access to all services connected to the victim's n8n workflows, such as Salesforce and Stripe, creating a significant risk of widespread data breaches and financial fraud.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "CVE-2026-21858",
            "Credential Theft",
            "Endor Labs",
            "Supply Chain Attack",
            "Workflow Automation",
            "n8n",
            "npm"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "cves": [
            "CVE-2026-21858"
          ]
        },
        {
          "slug": "everest-ransomware-group-claims-major-breach-of-nissan",
          "headline": "Everest Hacking Group Claims Major Breach of Nissan, Alleges 900GB Data Theft",
          "summary": "The Everest hacking group has claimed responsibility for a significant cyberattack against Japanese automaker Nissan, alleging the exfiltration of approximately 900 GB of sensitive corporate data. On January 10, 2026, the group posted its claims and sample data on its dark web leak site. The published samples, which include screenshots and directory listings, suggest the stolen data contains proprietary designs, financial information, employee records, and customer data. Everest is a Ransomware-as-a-Service (RaaS) group known for its double-extortion tactics. Nissan has not yet publicly confirmed the breach.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Automotive",
            "Data Breach",
            "Everest",
            "Manufacturing",
            "Nissan",
            "RaaS",
            "Ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        },
        {
          "slug": "new-zealand-manage-my-health-patient-portal-suffers-major-data-breach",
          "headline": "Manage My Health Breach: 126,000 New Zealand Patients' Data Exposed",
          "summary": "Manage My Health, New Zealand's largest online patient portal, has confirmed it suffered a major cyberattack in late December 2025. The breach may have exposed the health documents of between 108,000 and 126,000 patients. An attacker using the alias 'Kazu' has claimed responsibility on a cybercrime forum, demanding a US$60,000 ransom and threatening to leak over 400,000 stolen health documents. The company states the breach was limited to its 'Health Documents' module and that its core patient database and user credentials were not accessed. The incident has prompted a government review in New Zealand.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "Data Breach",
            "Healthcare",
            "Kazu",
            "Manage My Health",
            "New Zealand",
            "PHI",
            "Patient Data"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        }
      ]
    }
  ],
  "articles": {
    "updated": []
  },
  "pages": {
    "updated": []
  }
}