{
  "lastUpdated": "2025-11-13T14:50:30.163Z",
  "runDate": "2025-11-13",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-13",
      "type": "publication-daily",
      "headline": "Microsoft Patches Actively Exploited Windows Zero-Day as Global Law Enforcement Dismantles Major Cybercrime Rings",
      "articleCount": 10,
      "articles": [
        {
          "slug": "retail-sector-faces-surge-in-ai-driven-cyber-threats-report",
          "headline": "Retailers Unprepared for AI-Powered Cyberattack Tsunami, Report Warns",
          "summary": "A new report from managed security provider LevelBlue reveals a troubling state of cybersecurity in the retail sector. The study found that 44% of retailers have experienced a significant increase in cyberattacks, with many feeling unprepared for the next wave of AI-powered threats. Despite 45% of executives expecting AI-driven attacks, only 25% believe their organization is ready to defend against them. The report also highlights major weaknesses in supply chain security, with nearly half of retailers admitting to having poor visibility into their suppliers' security practices, creating significant risk across the industry.",
          "categories": [
            "Threat Intelligence",
            "Phishing",
            "Supply Chain Attack"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "Deepfake",
            "LevelBlue",
            "Retail",
            "Supply Chain",
            "Threat Intelligence"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z"
        },
        {
          "slug": "uk-introduces-cyber-security-and-resilience-bill-to-protect-critical-services",
          "headline": "UK Overhauls Cyber Law, Targeting MSPs and Data Centers with New Bill",
          "summary": "The United Kingdom has introduced the new Cyber Security and Resilience Bill, a major legislative update designed to strengthen the security of its critical national services. The bill significantly expands the scope of the 2018 NIS Regulations to include, for the first time, managed service providers (MSPs) and data centers. It also imposes stricter incident reporting timelines, requiring an initial notification within 24 hours of a harmful cyber event. The legislation aims to mitigate supply chain risks by allowing regulators to designate 'critical suppliers' who will be held to the same security standards as essential service operators.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "Compliance",
            "Cybersecurity Bill",
            "Data Center",
            "Legislation",
            "MSP",
            "NIS Regulations",
            "Supply Chain",
            "UK"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z"
        },
        {
          "slug": "cisa-adds-actively-exploited-watchguard-and-triofox-flaws-to-kev-catalog",
          "headline": "CISA KEV Alert: WatchGuard and Triofox Flaws Now Under Active Attack",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added three new vulnerabilities to its Known Exploited Vulnerabilities (KEV) catalog, indicating they are under active attack. The additions include CVE-2025-9242, an out-of-bounds write flaw in WatchGuard Firebox appliances, and CVE-2025-12480, an improper access control vulnerability in Gladinet's Triofox product. The third is the recently disclosed Windows Kernel zero-day, CVE-2025-62215. Federal agencies are now mandated to patch these flaws by a specified deadline, and CISA strongly urges all organizations to prioritize remediation.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "Active Exploitation",
            "CISA",
            "CVE-2025-12480",
            "CVE-2025-9242",
            "Gladinet",
            "KEV",
            "Vulnerability",
            "WatchGuard"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "cves": [
            "CVE-2025-12480",
            "CVE-2025-62215",
            "CVE-2025-9242"
          ]
        },
        {
          "slug": "operation-endgame-dismantles-rhadamanthys-venomrat-cybercrime-infrastructure",
          "headline": "GAME OVER: 'Operation Endgame' Dismantles Global Cybercrime Services",
          "summary": "In a massive international crackdown dubbed 'Operation Endgame,' law enforcement agencies from 11 countries, coordinated by Europol, have dismantled the infrastructure of three major cybercrime-as-a-service platforms: the Rhadamanthys information stealer, the VenomRAT remote access trojan, and the Elysium botnet. The operation resulted in the seizure of over 1,025 servers, the takedown of 20 domains, and the arrest of the main suspect behind VenomRAT. The targeted malware was responsible for infecting hundreds of thousands of computers worldwide, stealing vast amounts of data, including millions in cryptocurrency.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Incident Response"
          ],
          "tags": [
            "Cybercrime",
            "Europol",
            "Infostealer",
            "Operation Endgame",
            "RAT",
            "Rhadamanthys",
            "Takedown",
            "VenomRAT"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "malware": [
            "Elysium botnet",
            "Rhadamanthys",
            "VenomRAT"
          ]
        },
        {
          "slug": "hotels-targeted-in-booking-com-phishing-scheme-deploying-purerat-ransomware",
          "headline": "No Vacancy for Hackers: Hotels Hit by Booking.com Phishing & Ransomware",
          "summary": "A large-scale phishing campaign is targeting the global hospitality industry by impersonating Booking.com. Attackers are using a phishing framework known as 'ClickFix' to socially engineer hotel staff into visiting malicious sites. The goal of the operation is to steal credentials for hotel booking platforms, which are then used to defraud guests or sold on criminal forums. In some cases, the attack chain also leads to the deployment of the PureRAT ransomware, adding data encryption and extortion to the threat.",
          "categories": [
            "Phishing",
            "Ransomware",
            "Cyberattack"
          ],
          "tags": [
            "Booking.com",
            "ClickFix",
            "Credential Theft",
            "Hospitality",
            "Phishing",
            "PureRAT",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "malware": [
            "ClickFix",
            "PureRAT"
          ]
        },
        {
          "slug": "european-organizations-targeted-by-phishing-campaign-using-html-smuggling-and-telegram-bots",
          "headline": "Stealthy Phishing Attack Uses HTML Smuggling & Telegram Bots to Steal Credentials",
          "summary": "A sophisticated phishing campaign is targeting organizations across Central and Eastern Europe, using HTML smuggling to deliver credential harvesting forms. Researchers at Cyble discovered the attack, which uses malicious HTML file attachments to bypass email security filters. Once a victim enters their credentials into the fake login page, an embedded JavaScript code exfiltrates the data directly to the attackers' private Telegram channels via the Telegram Bot API. This technique makes the campaign highly evasive, as it avoids the use of traditional, blockable C2 infrastructure.",
          "categories": [
            "Phishing",
            "Threat Intelligence",
            "Malware"
          ],
          "tags": [
            "Credential Theft",
            "Cyble",
            "Europe",
            "HTML Smuggling",
            "Phishing",
            "Telegram"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z"
        },
        {
          "slug": "synnovis-confirms-patient-data-stolen-in-qilin-ransomware-attack",
          "headline": "Synnovis Confirms Patient Data Stolen in Qilin Ransomware Attack on London Hospitals",
          "summary": "Pathology service provider Synnovis has officially confirmed that patient personal data, including names, NHS numbers, and dates of birth, was stolen during the June 2024 ransomware attack attributed to the Qilin gang. The attack caused widespread disruption to London hospitals, leading to the cancellation of over 1,100 procedures. After a lengthy forensic investigation, Synnovis acknowledged the data breach, which followed the attackers leaking approximately 400GB of data. Affected NHS trusts are now beginning the process of notifying individual patients whose information was compromised.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Data Breach",
            "Double Extortion",
            "Healthcare",
            "NHS",
            "Qilin",
            "Ransomware",
            "Synnovis"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "malware": [
            "Qilin ransomware"
          ]
        },
        {
          "slug": "amazon-uncovers-apt-exploiting-cisco-and-citrix-zero-day-flaws",
          "headline": "APT Caught Exploiting Cisco & Citrix Zero-Days in Sophisticated Attack",
          "summary": "Amazon's threat intelligence team has discovered a sophisticated advanced persistent threat (APT) campaign that exploited two separate zero-day vulnerabilities in Cisco Identity Service Engine (CVE-2025-20337) and Citrix products (CVE-2025-5777) before they were publicly known. The attackers used the flaws to gain pre-authentication remote code execution and deployed custom, in-memory malware designed to evade detection. This discovery highlights a growing trend of targeting identity and access management systems at the network edge and underscores the capabilities of highly-resourced threat actors.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Amazon",
            "CVE-2025-20337",
            "CVE-2025-5777",
            "Cisco ISE",
            "Citrix",
            "In-Memory Malware",
            "Web Shell",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "cves": [
            "CVE-2025-20337",
            "CVE-2025-5777"
          ]
        },
        {
          "slug": "dell-patches-critical-privilege-escalation-vulnerability-in-data-lakehouse",
          "headline": "Dell Patches Critical 9.1 CVSS Flaw in Data Lakehouse Platform",
          "summary": "Dell has released a security update to address a critical vulnerability (CVE-2025-46608) in its Data Lakehouse platform, which received a CVSS score of 9.1. The flaw is an improper access control issue that could be exploited by a remote, high-privileged attacker to gain further elevated rights and potentially compromise the entire system. Due to the severity and the potential for a complete confidentiality, integrity, and availability loss, Dell is urging all customers to upgrade to version 1.6.0.0 immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-46608",
            "Data Lakehouse",
            "Dell",
            "Patch Management",
            "Privilege Escalation",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "cves": [
            "CVE-2025-46608"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-windows-kernel-zero-day-cve-2025-62215",
          "headline": "Patch Now: Microsoft Scrambles to Fix Actively Exploited Windows Kernel Zero-Day",
          "summary": "Microsoft has released its November 2025 Patch Tuesday updates, addressing 63 vulnerabilities, including a critical zero-day in the Windows Kernel (CVE-2025-62215) that is being actively exploited in the wild. This privilege escalation flaw allows local attackers to gain full SYSTEM-level control of affected Windows and Windows Server systems. Due to its active exploitation, CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating immediate patching for federal agencies. The update also fixes four other critical flaws, including a severe remote code execution vulnerability (CVE-2025-60724) in the Microsoft Graphics Component.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA KEV",
            "CVE-2025-62215",
            "Patch Tuesday",
            "Privilege Escalation",
            "Race Condition",
            "Windows Kernel",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "cves": [
            "CVE-2025-60704",
            "CVE-2025-60724",
            "CVE-2025-62199",
            "CVE-2025-62215",
            "CVE-2025-62220"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-12",
      "type": "publication-daily",
      "headline": "Microsoft Patches Actively Exploited Windows Zero-Day; Advanced Actors Target Cisco and Citrix in New Campaigns",
      "articleCount": 10,
      "articles": [
        {
          "slug": "nydfs-part-500-cybersecurity-rules-on-mfa-and-asset-inventory-take-effect",
          "headline": "NYDFS Part 500 Final Rules on MFA and Asset Inventory Now in Effect for Financial Firms",
          "summary": "As of November 1, 2025, the final provisions of the amended New York Department of Financial Services (NYDFS) Part 500 cybersecurity regulation are now in force. Financial entities regulated by NYDFS must now comply with stricter requirements for implementing multi-factor authentication (MFA) across their information systems and maintaining a comprehensive, detailed asset inventory. These rules, part of a major update from 2023, conclude a two-year transition period. Firms must certify their compliance for the first time in their annual reports due by April 15, 2026, and are also guided to enforce similar MFA standards on their third-party vendors.",
          "categories": [
            "Regulatory",
            "Policy and Compliance",
            "Security Operations"
          ],
          "tags": [
            "Asset Inventory",
            "Compliance",
            "Financial Services",
            "MFA",
            "NYDFS",
            "Part 500",
            "Regulation"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "uk-introduces-sweeping-cyber-security-and-resilience-bill",
          "headline": "UK Introduces Sweeping Cyber Security and Resilience Bill to Regulate MSPs and Mandate Stricter Breach Reporting",
          "summary": "The UK government has introduced the Cyber Security and Resilience Bill to Parliament, a landmark piece of legislation set to replace the 2018 NIS Regulations. This new bill significantly expands the regulatory landscape by bringing Managed Service Providers (MSPs) into scope for the first time, a move impacting up to 1,100 firms. It also imposes stricter incident reporting rules, requiring an initial report within 24 hours and a full report within 72 hours. The legislation aims to bolster national security by strengthening supply chain resilience and aligning the UK with updated international standards like the EU's NIS2 Directive.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "Cybersecurity Law",
            "Incident Reporting",
            "MSP",
            "NIS2",
            "Regulation",
            "Supply Chain",
            "UK"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "ransomware-attack-cripples-asahi-breweries-operations-ahead-of-peak-season",
          "headline": "Asahi Breweries Crippled by Ransomware Attack, Shipments Plummet to 10% Ahead of Peak Holiday Season",
          "summary": "Japan's largest brewer, Asahi Group Holdings Ltd., is facing severe operational paralysis more than a month after a devastating ransomware attack. The attack disabled the company's core order and shipment management system, forcing a regression to manual processes like phone calls and faxes. As a result, shipments are at only 10% of normal levels, a critical blow as the company enters its busiest sales month. The incident, which has also forced Asahi to postpone its Q3 earnings report, highlights the extreme vulnerability of complex supply chains and legacy IT systems to modern cyber threats.",
          "categories": [
            "Ransomware",
            "Cyberattack",
            "Supply Chain Attack"
          ],
          "tags": [
            "Asahi",
            "Cyberattack",
            "Japan",
            "Manufacturing",
            "Ransomware",
            "Supply Chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "clop-ransomware-gang-claims-attack-on-dartmouth-college",
          "headline": "Clop Ransomware Gang Claims Attack on Dartmouth College, Threatens to Leak Data",
          "summary": "The notorious Clop ransomware gang has claimed responsibility for a cyberattack against Dartmouth College, an Ivy League university in the U.S. On November 11, 2025, the group added the institution to its dark web leak site, threatening to publish exfiltrated data if the university does not enter negotiations. This incident highlights the increasing trend of ransomware attacks targeting the education sector, which holds vast amounts of sensitive personal data. Dartmouth College has not yet issued a public statement on the alleged breach, but the threat from Clop is considered highly credible due to the group's track record.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Clop",
            "Dartmouth College",
            "Data Breach",
            "Education",
            "Ransomware",
            "Threat Actor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "google-sues-operators-of-lighthouse-phishing-as-a-service-platform",
          "headline": "Google Sues Operators of 'Lighthouse' Phishing-as-a-Service Platform Used in Massive Smishing Campaigns",
          "summary": "Google has filed a civil lawsuit in New York against the alleged China-based operators of 'Lighthouse,' a large-scale Phishing-as-a-Service (PhaaS) platform. The platform enabled cybercriminals to launch SMS phishing (smishing) campaigns that have targeted over one million users in 120 countries. The service provided toolkits for impersonating trusted brands like E-ZPass and the USPS to harvest financial information. The threat group, dubbed 'Smishing Triad,' used over 194,000 malicious domains. Google's legal action aims to dismantle the platform's infrastructure, marking another instance of a major tech company using lawsuits to combat cybercrime.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Policy and Compliance"
          ],
          "tags": [
            "Cybercrime",
            "E-ZPass",
            "Google",
            "Lighthouse",
            "PhaaS",
            "Smishing",
            "USPS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z",
          "malware": [
            "Lighthouse"
          ]
        },
        {
          "slug": "ics-patch-tuesday-siemens-schneider-electric-address-critical-flaws-november-2025",
          "headline": "ICS Patch Tuesday: Siemens, Schneider Electric Address Critical Flaws in Industrial Control Systems",
          "summary": "The November 2025 Industrial Control Systems (ICS) Patch Tuesday includes a series of important security advisories from major operational technology (OT) vendors, including Siemens, Schneider Electric, Aveva, and Rockwell Automation. The patches address numerous vulnerabilities in products used across critical infrastructure sectors like manufacturing and energy. Notably, a critical flaw in Aveva software also affects Schneider Electric products, highlighting supply chain complexities in the OT space. The coordinated disclosure aims to improve security posture and mitigate risks of remote code execution and denial-of-service attacks in sensitive industrial environments.",
          "categories": [
            "Industrial Control Systems",
            "Patch Management",
            "Vulnerability"
          ],
          "tags": [
            "Critical Infrastructure",
            "ICS",
            "OT",
            "Patch Tuesday",
            "Schneider Electric",
            "Siemens",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "iranian-apt-ferocious-kitten-targets-dissidents-with-markirat-malware",
          "headline": "Iranian APT 'Ferocious Kitten' Continues to Target Dissidents With Custom MarkiRAT Surveillance Malware",
          "summary": "The Iranian-aligned APT group 'Ferocious Kitten' continues its long-running cyber-espionage campaign against Iranian dissidents and activists, according to new research from Picus Security. Active since at least 2015, the group uses spear-phishing emails with malicious Office documents to deploy its custom remote access trojan (RAT), MarkiRAT. This malware is a sophisticated surveillance tool, featuring an advanced keylogger that activates only when password managers are not in use, clipboard hijacking, and data exfiltration over HTTP/S. The group also employs various defense evasion techniques, including the use of BITS and the RTLO trick to disguise malicious files.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Cyber-espionage",
            "Ferocious Kitten",
            "Iran",
            "Malware",
            "MarkiRAT",
            "Spear-phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z",
          "malware": [
            "MarkiRAT"
          ]
        },
        {
          "slug": "facebook-business-suite-abused-in-large-scale-phishing-campaign",
          "headline": "Massive Phishing Campaign Abuses Facebook's Own Email Domain to Bypass Security Filters",
          "summary": "Security researchers at Check Point have uncovered a large-scale phishing campaign that cleverly abuses Meta's own infrastructure to deliver highly convincing malicious emails. By using the legitimate 'Business invitation feature' in Facebook Business Suite, attackers are sending phishing emails from the authentic `facebookmail.com` domain, allowing them to bypass standard email security filters. The campaign has already targeted over 5,000 businesses, primarily SMBs, with over 40,000 emails. The attack aims to trick employees who are accustomed to receiving genuine Meta notifications into giving up their credentials or other sensitive information.",
          "categories": [
            "Phishing",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "BEC",
            "Check Point",
            "Facebook",
            "Meta",
            "Phishing",
            "Social Engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "advanced-threat-actor-exploits-cisco-ise-and-citrix-netscaler-zero-days",
          "headline": "Advanced Threat Actor Exploits Cisco and Citrix Zero-Days in Targeted Attacks on Network Infrastructure",
          "summary": "Amazon's threat intelligence team has discovered an advanced threat actor actively exploiting two previously undisclosed zero-day vulnerabilities in Cisco Identity Service Engine (ISE) and Citrix NetScaler Application Delivery Controllers (ADC). The vulnerabilities, now tracked as CVE-2025-20337 (Cisco) and CVE-2025-5777 (Citrix), are being used to target critical identity and network access control infrastructure. The attackers are leveraging custom malware to gain initial access and establish persistence on these edge devices. Both Cisco and Citrix have been notified and are working on patches, which security teams are urged to apply immediately upon release.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Amazon",
            "CVE-2025-20337",
            "CVE-2025-5777",
            "Cisco ISE",
            "Citrix NetScaler",
            "Threat Intelligence",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z",
          "cves": [
            "CVE-2025-20337",
            "CVE-2025-5777"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-windows-kernel-zero-day-in-november-2025-patch-tuesday",
          "headline": "Microsoft Patches Actively Exploited Windows Kernel Zero-Day in November Patch Tuesday",
          "summary": "Microsoft's November 2025 Patch Tuesday update addresses 63 vulnerabilities, including a critical Windows Kernel privilege escalation zero-day (CVE-2025-62215) that is being actively exploited in the wild. The flaw, which has a CVSS score of 7.0, allows a local attacker to gain SYSTEM-level privileges. The release also includes patches for four other critical vulnerabilities, notably a remote code execution flaw in the Microsoft Graphics Component (GDI+) with a CVSS score of 9.8 (CVE-2025-60724). Other significant fixes address high-severity issues in Windows Kerberos, Microsoft Office, and Visual Studio, requiring immediate attention from administrators to prevent potential system compromise and supply chain attacks.",
          "categories": [
            "Patch Management",
            "Vulnerability",
            "Cyberattack"
          ],
          "tags": [
            "CVE-2025-62215",
            "GDI+",
            "Kerberos",
            "Microsoft",
            "Patch Tuesday",
            "Privilege Escalation",
            "RCE",
            "Windows Kernel",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z",
          "cves": [
            "CVE-2025-30398",
            "CVE-2025-60704",
            "CVE-2025-60719",
            "CVE-2025-60724",
            "CVE-2025-62199",
            "CVE-2025-62213",
            "CVE-2025-62214",
            "CVE-2025-62215",
            "CVE-2025-62217",
            "CVE-2025-62220"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": []
  },
  "pages": {
    "updated": []
  }
}