{
  "lastUpdated": "2025-11-12T20:13:23.347Z",
  "runDate": "2025-11-12",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-12",
      "type": "publication-daily",
      "headline": "Microsoft Patches Actively Exploited Windows Zero-Day; Advanced Actors Target Cisco and Citrix in New Campaigns",
      "articleCount": 10,
      "articles": [
        {
          "slug": "nydfs-part-500-cybersecurity-rules-on-mfa-and-asset-inventory-take-effect",
          "headline": "NYDFS Part 500 Final Rules on MFA and Asset Inventory Now in Effect for Financial Firms",
          "summary": "As of November 1, 2025, the final provisions of the amended New York Department of Financial Services (NYDFS) Part 500 cybersecurity regulation are now in force. Financial entities regulated by NYDFS must now comply with stricter requirements for implementing multi-factor authentication (MFA) across their information systems and maintaining a comprehensive, detailed asset inventory. These rules, part of a major update from 2023, conclude a two-year transition period. Firms must certify their compliance for the first time in their annual reports due by April 15, 2026, and are also guided to enforce similar MFA standards on their third-party vendors.",
          "categories": [
            "Regulatory",
            "Policy and Compliance",
            "Security Operations"
          ],
          "tags": [
            "Asset Inventory",
            "Compliance",
            "Financial Services",
            "MFA",
            "NYDFS",
            "Part 500",
            "Regulation"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "uk-introduces-sweeping-cyber-security-and-resilience-bill",
          "headline": "UK Introduces Sweeping Cyber Security and Resilience Bill to Regulate MSPs and Mandate Stricter Breach Reporting",
          "summary": "The UK government has introduced the Cyber Security and Resilience Bill to Parliament, a landmark piece of legislation set to replace the 2018 NIS Regulations. This new bill significantly expands the regulatory landscape by bringing Managed Service Providers (MSPs) into scope for the first time, a move impacting up to 1,100 firms. It also imposes stricter incident reporting rules, requiring an initial report within 24 hours and a full report within 72 hours. The legislation aims to bolster national security by strengthening supply chain resilience and aligning the UK with updated international standards like the EU's NIS2 Directive.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "Cybersecurity Law",
            "Incident Reporting",
            "MSP",
            "NIS2",
            "Regulation",
            "Supply Chain",
            "UK"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "ransomware-attack-cripples-asahi-breweries-operations-ahead-of-peak-season",
          "headline": "Asahi Breweries Crippled by Ransomware Attack, Shipments Plummet to 10% Ahead of Peak Holiday Season",
          "summary": "Japan's largest brewer, Asahi Group Holdings Ltd., is facing severe operational paralysis more than a month after a devastating ransomware attack. The attack disabled the company's core order and shipment management system, forcing a regression to manual processes like phone calls and faxes. As a result, shipments are at only 10% of normal levels, a critical blow as the company enters its busiest sales month. The incident, which has also forced Asahi to postpone its Q3 earnings report, highlights the extreme vulnerability of complex supply chains and legacy IT systems to modern cyber threats.",
          "categories": [
            "Ransomware",
            "Cyberattack",
            "Supply Chain Attack"
          ],
          "tags": [
            "Asahi",
            "Cyberattack",
            "Japan",
            "Manufacturing",
            "Ransomware",
            "Supply Chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "clop-ransomware-gang-claims-attack-on-dartmouth-college",
          "headline": "Clop Ransomware Gang Claims Attack on Dartmouth College, Threatens to Leak Data",
          "summary": "The notorious Clop ransomware gang has claimed responsibility for a cyberattack against Dartmouth College, an Ivy League university in the U.S. On November 11, 2025, the group added the institution to its dark web leak site, threatening to publish exfiltrated data if the university does not enter negotiations. This incident highlights the increasing trend of ransomware attacks targeting the education sector, which holds vast amounts of sensitive personal data. Dartmouth College has not yet issued a public statement on the alleged breach, but the threat from Clop is considered highly credible due to the group's track record.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Clop",
            "Dartmouth College",
            "Data Breach",
            "Education",
            "Ransomware",
            "Threat Actor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "google-sues-operators-of-lighthouse-phishing-as-a-service-platform",
          "headline": "Google Sues Operators of 'Lighthouse' Phishing-as-a-Service Platform Used in Massive Smishing Campaigns",
          "summary": "Google has filed a civil lawsuit in New York against the alleged China-based operators of 'Lighthouse,' a large-scale Phishing-as-a-Service (PhaaS) platform. The platform enabled cybercriminals to launch SMS phishing (smishing) campaigns that have targeted over one million users in 120 countries. The service provided toolkits for impersonating trusted brands like E-ZPass and the USPS to harvest financial information. The threat group, dubbed 'Smishing Triad,' used over 194,000 malicious domains. Google's legal action aims to dismantle the platform's infrastructure, marking another instance of a major tech company using lawsuits to combat cybercrime.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Policy and Compliance"
          ],
          "tags": [
            "Cybercrime",
            "E-ZPass",
            "Google",
            "Lighthouse",
            "PhaaS",
            "Smishing",
            "USPS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z",
          "malware": [
            "Lighthouse"
          ]
        },
        {
          "slug": "ics-patch-tuesday-siemens-schneider-electric-address-critical-flaws-november-2025",
          "headline": "ICS Patch Tuesday: Siemens, Schneider Electric Address Critical Flaws in Industrial Control Systems",
          "summary": "The November 2025 Industrial Control Systems (ICS) Patch Tuesday includes a series of important security advisories from major operational technology (OT) vendors, including Siemens, Schneider Electric, Aveva, and Rockwell Automation. The patches address numerous vulnerabilities in products used across critical infrastructure sectors like manufacturing and energy. Notably, a critical flaw in Aveva software also affects Schneider Electric products, highlighting supply chain complexities in the OT space. The coordinated disclosure aims to improve security posture and mitigate risks of remote code execution and denial-of-service attacks in sensitive industrial environments.",
          "categories": [
            "Industrial Control Systems",
            "Patch Management",
            "Vulnerability"
          ],
          "tags": [
            "Critical Infrastructure",
            "ICS",
            "OT",
            "Patch Tuesday",
            "Schneider Electric",
            "Siemens",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "iranian-apt-ferocious-kitten-targets-dissidents-with-markirat-malware",
          "headline": "Iranian APT 'Ferocious Kitten' Continues to Target Dissidents With Custom MarkiRAT Surveillance Malware",
          "summary": "The Iranian-aligned APT group 'Ferocious Kitten' continues its long-running cyber-espionage campaign against Iranian dissidents and activists, according to new research from Picus Security. Active since at least 2015, the group uses spear-phishing emails with malicious Office documents to deploy its custom remote access trojan (RAT), MarkiRAT. This malware is a sophisticated surveillance tool, featuring an advanced keylogger that activates only when password managers are not in use, clipboard hijacking, and data exfiltration over HTTP/S. The group also employs various defense evasion techniques, including the use of BITS and the RTLO trick to disguise malicious files.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Cyber-espionage",
            "Ferocious Kitten",
            "Iran",
            "Malware",
            "MarkiRAT",
            "Spear-phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z",
          "malware": [
            "MarkiRAT"
          ]
        },
        {
          "slug": "facebook-business-suite-abused-in-large-scale-phishing-campaign",
          "headline": "Massive Phishing Campaign Abuses Facebook's Own Email Domain to Bypass Security Filters",
          "summary": "Security researchers at Check Point have uncovered a large-scale phishing campaign that cleverly abuses Meta's own infrastructure to deliver highly convincing malicious emails. By using the legitimate 'Business invitation feature' in Facebook Business Suite, attackers are sending phishing emails from the authentic `facebookmail.com` domain, allowing them to bypass standard email security filters. The campaign has already targeted over 5,000 businesses, primarily SMBs, with over 40,000 emails. The attack aims to trick employees who are accustomed to receiving genuine Meta notifications into giving up their credentials or other sensitive information.",
          "categories": [
            "Phishing",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "BEC",
            "Check Point",
            "Facebook",
            "Meta",
            "Phishing",
            "Social Engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z"
        },
        {
          "slug": "advanced-threat-actor-exploits-cisco-ise-and-citrix-netscaler-zero-days",
          "headline": "Advanced Threat Actor Exploits Cisco and Citrix Zero-Days in Targeted Attacks on Network Infrastructure",
          "summary": "Amazon's threat intelligence team has discovered an advanced threat actor actively exploiting two previously undisclosed zero-day vulnerabilities in Cisco Identity Service Engine (ISE) and Citrix NetScaler Application Delivery Controllers (ADC). The vulnerabilities, now tracked as CVE-2025-20337 (Cisco) and CVE-2025-5777 (Citrix), are being used to target critical identity and network access control infrastructure. The attackers are leveraging custom malware to gain initial access and establish persistence on these edge devices. Both Cisco and Citrix have been notified and are working on patches, which security teams are urged to apply immediately upon release.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Amazon",
            "CVE-2025-20337",
            "CVE-2025-5777",
            "Cisco ISE",
            "Citrix NetScaler",
            "Threat Intelligence",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z",
          "cves": [
            "CVE-2025-20337",
            "CVE-2025-5777"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-windows-kernel-zero-day-in-november-2025-patch-tuesday",
          "headline": "Microsoft Patches Actively Exploited Windows Kernel Zero-Day in November Patch Tuesday",
          "summary": "Microsoft's November 2025 Patch Tuesday update addresses 63 vulnerabilities, including a critical Windows Kernel privilege escalation zero-day (CVE-2025-62215) that is being actively exploited in the wild. The flaw, which has a CVSS score of 7.0, allows a local attacker to gain SYSTEM-level privileges. The release also includes patches for four other critical vulnerabilities, notably a remote code execution flaw in the Microsoft Graphics Component (GDI+) with a CVSS score of 9.8 (CVE-2025-60724). Other significant fixes address high-severity issues in Windows Kerberos, Microsoft Office, and Visual Studio, requiring immediate attention from administrators to prevent potential system compromise and supply chain attacks.",
          "categories": [
            "Patch Management",
            "Vulnerability",
            "Cyberattack"
          ],
          "tags": [
            "CVE-2025-62215",
            "GDI+",
            "Kerberos",
            "Microsoft",
            "Patch Tuesday",
            "Privilege Escalation",
            "RCE",
            "Windows Kernel",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-12T15:00:00.000Z",
          "cves": [
            "CVE-2025-30398",
            "CVE-2025-60704",
            "CVE-2025-60719",
            "CVE-2025-60724",
            "CVE-2025-62199",
            "CVE-2025-62213",
            "CVE-2025-62214",
            "CVE-2025-62215",
            "CVE-2025-62217",
            "CVE-2025-62220"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-11",
      "type": "publication-daily",
      "headline": "Triofox Zero-Day Exploited In-the-Wild; CMMC Enforcement Begins for DoD Contractors",
      "articleCount": 9,
      "articles": [
        {
          "slug": "dod-cmmc-program-enforcement-officially-begins-for-defense-contractors",
          "headline": "CMMC Enforcement Officially Begins, Mandating Compliance for DoD Contractors",
          "summary": "The U.S. Department of Defense's (DoD) Cybersecurity Maturity Model Certification (CMMC) program officially entered its enforcement phase on November 10, 2025. Defense industrial base (DIB) contractors are now required to meet specific, verifiable cybersecurity standards to be eligible for new contracts. The program, which will be rolled out in phases over three years, aims to protect Federal Contract Information (FCI) and Controlled Unclassified Information (CUI) across the defense supply chain. Companies that fail to achieve the required certification level risk being excluded from future DoD contracts.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "CMMC",
            "DFARS",
            "DoD",
            "NIST 800-171",
            "compliance",
            "regulation",
            "supply chain"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-11T15:00:00.000Z"
        },
        {
          "slug": "pentagon-unveils-new-cyber-force-generation-model",
          "headline": "Pentagon Overhauls Cyber Force Model to Boost USCYBERCOM Readiness",
          "summary": "The U.S. Department of War (DoW) has announced a new cyber force generation model aimed at enhancing the operational effectiveness, specialization, and lethality of forces assigned to U.S. Cyber Command (USCYBERCOM). The revised plan is designed to create a more integrated and agile cyber force by streamlining the processes of recruiting, training, and retaining personnel across all military branches. This strategic shift seeks to address emerging cyber threats and deter aggression in the cyber domain more effectively.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Security Operations"
          ],
          "tags": [
            "DoD",
            "Pentagon",
            "USCYBERCOM",
            "cyber policy",
            "military",
            "workforce development"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-11T15:00:00.000Z"
        },
        {
          "slug": "fantasy-hub-android-malware-as-a-service-emerges-on-telegram",
          "headline": "'Fantasy Hub' Android MaaS Sells Full-Service Spyware on Telegram",
          "summary": "A new Android Remote Access Trojan (RAT) named 'Fantasy Hub' is being sold as a Malware-as-a-Service (MaaS) on Russian-speaking Telegram channels. For a subscription fee starting at $200/week, the service provides novice attackers with a full suite of tools for device espionage, including live audio/video streaming, data theft, and credential harvesting from major Russian financial apps using overlay attacks. The service even includes tools for creating fake Google Play Store pages to distribute the malware, significantly lowering the barrier to entry for mobile-focused cybercrime.",
          "categories": [
            "Malware",
            "Mobile Security",
            "Cyberattack"
          ],
          "tags": [
            "Android",
            "BYOD",
            "MaaS",
            "RAT",
            "Telegram",
            "credential theft",
            "spyware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-11T15:00:00.000Z",
          "malware": [
            "Fantasy Hub"
          ]
        },
        {
          "slug": "hyundai-autoever-notifies-customers-of-major-data-breach",
          "headline": "Hyundai IT Affiliate Discloses Major Data Breach Exposing PII and SSNs",
          "summary": "Hyundai AutoEver America, the IT services subsidiary of the Hyundai Group, has begun notifying customers of a major data breach that occurred between late February and early March 2025. The incident involved unauthorized access to the company's IT environment, exposing highly sensitive personally identifiable information (PII), including full names, driver's license numbers, and Social Security numbers. While the exact number of victims is unconfirmed, the company's software is used in up to 2.7 million vehicles in North America, indicating a potentially massive scale.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Other"
          ],
          "tags": [
            "Hyundai",
            "PII",
            "SSN",
            "automotive",
            "data breach"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-11T15:00:00.000Z"
        },
        {
          "slug": "konni-apt-abuses-google-find-hub-for-remote-data-wipes",
          "headline": "KONNI APT Weaponizes Google's Find Hub for Destructive Attacks",
          "summary": "The North Korea-linked threat group KONNI has been observed in a novel campaign targeting individuals in South Korea. The attackers use social engineering to deploy PC malware that steals Google account credentials. With these credentials, they access the victim's Google account and abuse the legitimate 'Find Hub' service (formerly Find My Device) to track the real-time location of the victim's Android phone and remotely trigger a factory reset, wiping all data. This campaign highlights the group's creativity in weaponizing legitimate services for destructive purposes.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "APT",
            "Android",
            "Google",
            "KONNI",
            "credential theft",
            "data destruction",
            "social engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-11T15:00:00.000Z",
          "malware": [
            "QuasarRAT",
            "RemcosRAT",
            "RftRAT"
          ]
        },
        {
          "slug": "cisco-warns-of-new-dos-attack-variant-targeting-firewalls",
          "headline": "New DoS Attack Variant Targets Unpatched Cisco Firewalls",
          "summary": "Cisco has updated its security advisory to warn of a new attack variant actively exploiting two previously disclosed vulnerabilities, CVE-2025-20333 and CVE-2025-20362, in its Secure Firewall ASA and FTD software. The new variant causes unpatched devices to reload unexpectedly, resulting in a denial-of-service (DoS) condition. These flaws were originally exploited as zero-days in the 'ArcaneDoor' campaign attributed to a state-sponsored actor. Despite patches being available since September, many devices remain vulnerable, and all customers are urged to apply updates immediately.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "ArcaneDoor",
            "Cisco ASA",
            "Cisco FTD",
            "DoS",
            "firewall",
            "vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-11T15:00:00.000Z",
          "cves": [
            "CVE-2025-20333",
            "CVE-2025-20362"
          ]
        },
        {
          "slug": "nikkei-discloses-slack-breach-exposing-data-of-17000-users",
          "headline": "Nikkei Slack Breach Exposes Data of 17,000 Users via Stolen Credentials",
          "summary": "Japanese media giant Nikkei Inc., owner of the Financial Times, has disclosed a significant data breach affecting its internal Slack workspace. An attacker gained access using authentication credentials stolen from an employee's personal computer, which was infected with infostealer malware. The incident, which was detected in September 2025, exposed the names, email addresses, and chat histories of 17,368 employees and business partners. The breach highlights the persistent threat of infostealer malware and the security risks associated with credentials stored in web browsers.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "Slack",
            "credential theft",
            "data breach",
            "infostealer",
            "media",
            "session hijacking"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-11T15:00:00.000Z",
          "malware": [
            "Infostealer malware"
          ]
        },
        {
          "slug": "cisa-adds-actively-exploited-samsung-mobile-zero-day-to-kev-catalog",
          "headline": "CISA Adds Actively Exploited Samsung Zero-Day to KEV Catalog",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical vulnerability in Samsung mobile devices, CVE-2025-21042, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, an out-of-bounds write issue in the image processing library, is being actively exploited in zero-click attacks to deploy spyware named 'LANDFALL' on Samsung Galaxy devices. The attack requires no user interaction, allowing for remote code execution and full device compromise. Federal agencies are mandated to patch the vulnerability, and all organizations are strongly urged to apply updates immediately.",
          "categories": [
            "Vulnerability",
            "Mobile Security",
            "Malware"
          ],
          "tags": [
            "Android",
            "CISA",
            "KEV",
            "RCE",
            "Samsung",
            "spyware",
            "zero-click",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-11T15:00:00.000Z",
          "cves": [
            "CVE-2025-21042"
          ],
          "malware": [
            "LANDFALL"
          ]
        },
        {
          "slug": "triofox-zero-day-exploited-by-unc6485-for-system-level-access",
          "headline": "Critical Triofox Zero-Day Actively Exploited for System-Level Access",
          "summary": "A critical, unauthenticated remote code execution vulnerability (CVE-2025-12480) in Gladinet's Triofox file-sharing platform is being actively exploited by a threat group tracked as UNC6485. The attackers are bypassing authentication by spoofing HTTP Host headers to 'localhost', allowing them to create rogue administrator accounts. They then abuse a built-in antivirus feature to execute malicious code with SYSTEM-level privileges, leading to full system compromise. Post-exploitation activity includes the deployment of commercial remote access tools like Zoho UEMS and AnyDesk to maintain persistence. Gladinet has released a patch, and organizations are urged to update immediately.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "Gladinet",
            "RCE",
            "UNC6485",
            "authentication bypass",
            "file sharing",
            "privilege escalation",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-11T15:00:00.000Z",
          "cves": [
            "CVE-2025-11371",
            "CVE-2025-12480",
            "CVE-2025-30406"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "cisco-warns-new-attack-variant-exploiting-critical-firewall-vulnerabilities",
        "originalHeadline": "Cisco Firewalls Under Renewed Assault as New DoS Attack Variant Emerges",
        "updateTitle": "Update: Cisco Firewalls Under Renewed Assault as New DoS Attack Variant Emerges",
        "updateSummary": "New details link Cisco firewall vulnerabilities to the state-sponsored 'ArcaneDoor' zero-day campaign, with a new DoS variant actively exploited.",
        "categories": [
          "Vulnerability",
          "Cyberattack",
          "Patch Management"
        ],
        "tags": [
          "Cisco",
          "DoS",
          "Firewall",
          "Patch Management",
          "RCE",
          "Vulnerability"
        ],
        "cves": [
          "CVE-2025-20333",
          "CVE-2025-20362"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-07T15:00:00.000Z",
        "updatedAt": "2025-11-11T12:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}