{
  "lastUpdated": "2026-01-27T13:49:02.894Z",
  "runDate": "2026-01-27",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-27",
      "type": "publication-daily",
      "headline": "Microsoft Patches Actively Exploited Office Zero-Day as Ransomware Groups Target Major Supply Chains",
      "articleCount": 12,
      "articles": [
        {
          "slug": "ai-authored-linux-malware-framework-voidlink-discovered",
          "headline": "\"VoidLink\": Researchers Uncover First AI-Authored Cloud-Native Linux Malware Framework",
          "summary": "Security researchers have discovered \"VoidLink,\" a new and sophisticated cloud-native Linux malware framework that appears to have been almost entirely written by an AI model under the direction of a single human operator. The speed of development was remarkable, with a functional implant being created in less than a week. This discovery marks a potential paradigm shift in the threat landscape, demonstrating that AI can be leveraged to rapidly create complex malware, lowering the barrier to entry for threat actors and accelerating the pace of new threat creation. The actor used a methodology dubbed 'Spec Driven Development' (SDD), using the AI for more than just code generation.",
          "categories": [
            "Malware",
            "Threat Intelligence",
            "Cloud Security"
          ],
          "tags": [
            "AI",
            "Cloud Security",
            "Linux",
            "Malware",
            "Threat Intelligence",
            "VoidLink"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z",
          "malware": [
            "VoidLink"
          ]
        },
        {
          "slug": "cyberattack-disrupts-operations-at-dresden-state-art-collections",
          "headline": "Cyberattack Cripples Digital Services at Germany's Dresden State Art Collections",
          "summary": "Germany's Dresden State Art Collections (SKD), one of Europe's most significant museum networks, has been hit by a cyberattack that caused widespread disruption to its digital infrastructure. The attack knocked out the SKD's online ticketing system, visitor services, museum shop website, and internal communications. On-site services were severely impacted, with ticket sales reverting to cash-only. While the operational disruption is significant, the SKD has stated that there is currently no evidence that any data, including sensitive collection or visitor data, was stolen during the incident. The attack highlights the increasing vulnerability of cultural institutions to cyber threats.",
          "categories": [
            "Cyberattack",
            "Other"
          ],
          "tags": [
            "Cultural Heritage",
            "Cyberattack",
            "Disruption",
            "Germany",
            "Museum"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z"
        },
        {
          "slug": "microsoft-teams-phishing-campaign-abuses-guest-invitations",
          "headline": "Widespread Phishing Campaign Abuses Microsoft Teams Guest Invites to Target 6,000+ Users",
          "summary": "A large-scale phishing campaign is abusing Microsoft Teams' guest invitation feature to target thousands of users with fake billing notices. Researchers at Check Point have observed over 12,000 phishing emails sent to more than 6,100 users, primarily in the manufacturing, technology, and education sectors in the United States. Attackers create Teams groups with finance-related names and send guest invitations to targets. The invitation email, which comes from a legitimate Microsoft address, contains obfuscated text that appears to be a billing notification, lending it an air of authenticity and increasing the likelihood that a user will click the malicious link.",
          "categories": [
            "Phishing",
            "Cloud Security"
          ],
          "tags": [
            "Cloud Security",
            "Credential Harvesting",
            "Microsoft Teams",
            "Phishing",
            "Social Engineering"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z"
        },
        {
          "slug": "eu-proposes-revised-cybersecurity-act-to-counter-growing-threats",
          "headline": "EU Proposes Major Overhaul of Cybersecurity Act to Strengthen ENISA and Tackle Supply Chain Risks",
          "summary": "The European Commission has introduced a significant proposal to revise the EU Cybersecurity Act, aiming to fortify the region's defenses against escalating cyber threats. The update seeks to enhance the mandate of the European Union Agency for Cybersecurity (ENISA), streamline the cybersecurity certification framework, and introduce new measures to manage ICT supply chain risks. A key and potentially controversial element is the power to identify and restrict high-risk suppliers across 18 critical sectors, which could lead to the exclusion of certain technologies from the EU market and even the withdrawal of already-deployed products.",
          "categories": [
            "Regulatory",
            "Policy and Compliance",
            "Supply Chain Attack"
          ],
          "tags": [
            "Cybersecurity Certification",
            "ENISA",
            "EU",
            "Legislation",
            "NIS2",
            "Supply Chain Security"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z"
        },
        {
          "slug": "health-isac-report-highlights-ai-driven-attacks-as-top-concern-for-2026",
          "headline": "Health-ISAC Report: AI-Enabled Attacks Named Top Threat to Healthcare Sector in 2026",
          "summary": "The Health Information Sharing and Analysis Center (Health-ISAC) has released its 2026 Global Health Sector Threat Landscape report, identifying AI-enabled attacks as the number one projected concern for the year. Based on surveys of healthcare executives and security professionals, the report highlights a shift in focus towards emerging, sophisticated threats. Alongside AI, the report emphasizes the persistent dangers of major supply chain vulnerabilities and the continued high impact of ransomware. The findings, drawn from extensive data including over 1,200 targeted alerts in 2025, urge healthcare organizations to move towards a more proactive and resilient security posture.",
          "categories": [
            "Threat Intelligence",
            "Policy and Compliance",
            "Ransomware"
          ],
          "tags": [
            "AI",
            "Health-ISAC",
            "Healthcare",
            "Ransomware",
            "Supply Chain Attack",
            "Threat Intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z"
        },
        {
          "slug": "data-of-10-million-raaga-users-surfaces-on-criminal-forums",
          "headline": "10.2 Million Raaga Music Streamer User Records Leaked, Exposing Weakly Hashed Passwords",
          "summary": "Indian music streaming service Raaga has suffered a major data breach, with a database containing 10.2 million user records surfacing on criminal forums. The data, reportedly stolen in December 2025, includes sensitive personally identifiable information such as names, email addresses, and geographic locations. Most critically, user passwords were found to be protected only with unsalted MD5 hashes, a notoriously weak and outdated hashing algorithm. This makes the passwords trivial to crack, exposing users to a high risk of credential stuffing attacks against other online services and targeted phishing campaigns.",
          "categories": [
            "Data Breach",
            "Phishing"
          ],
          "tags": [
            "Credential Stuffing",
            "Data Breach",
            "India",
            "MD5",
            "Password Security"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z"
        },
        {
          "slug": "under-armour-customer-data-leaked-on-dark-web-after-ransomware-attack",
          "headline": "Data of 72 Million Under Armour Customers Leaked on Dark Web Following Everest Ransomware Attack",
          "summary": "A massive database allegedly containing the personal information of 72 million Under Armour customers has been leaked on a dark web forum. This data dump is the direct result of a November 2025 ransomware attack claimed by the Everest ransomware group, who reportedly published the data after ransom negotiations failed. The compromised information is said to include full names, email addresses, phone numbers, physical locations, and purchase histories, putting millions of customers at risk of identity theft, phishing, and other malicious activities. A class-action lawsuit has already been filed against Under Armour in the U.S. over the breach.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "Dark Web",
            "Data Breach",
            "Everest",
            "PII",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z"
        },
        {
          "slug": "new-osiris-ransomware-uses-legitimate-tools-for-attacks",
          "headline": "New \"Osiris\" Ransomware Disables Security Software Using Malicious \"Poortry\" Driver",
          "summary": "A new ransomware family named \"Osiris\" has been identified, employing a 'living off the land' strategy by combining legitimate tools with custom malware. A key component of its attack is a malicious driver called \"Poortry,\" which masquerades as a Malwarebytes component to terminate security software processes, effectively disabling endpoint protection. Before encryption, the Osiris operators use the legitimate data transfer utility Rclone to exfiltrate stolen data to Wasabi cloud storage. This combination of defense evasion and use of legitimate tools makes the ransomware particularly difficult to detect.",
          "categories": [
            "Ransomware",
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "Defense Evasion",
            "LOLBAS",
            "Osiris",
            "Poortry",
            "Ransomware",
            "Rclone"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z",
          "malware": [
            "Osiris",
            "Poortry"
          ]
        },
        {
          "slug": "ransomhub-claims-cyberattack-on-apple-supplier-luxshare",
          "headline": "RansomHub Claims Breach of Apple Supplier Luxshare, Threatens to Leak Stolen CAD Models and Designs",
          "summary": "The RansomHub ransomware group has listed Luxshare, a critical electronics manufacturer for tech giants like Apple, Nvidia, and Tesla, as its latest victim. The threat actors claim to have exfiltrated sensitive intellectual property, including proprietary 3D CAD models and detailed circuit board designs. This attack underscores the increasing trend of targeting vital links in the global technology supply chain. While Luxshare has not yet confirmed the breach, the potential leak of such valuable data poses a significant threat to the competitive advantage of both the manufacturer and its high-profile clients. Security vendors like Check Point have already released signatures to detect the RansomHub threat.",
          "categories": [
            "Ransomware",
            "Supply Chain Attack",
            "Data Breach"
          ],
          "tags": [
            "Intellectual Property",
            "Manufacturing",
            "RansomHub",
            "Ransomware",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z"
        },
        {
          "slug": "fortinet-confirms-active-exploitation-of-forticloud-sso-bypass",
          "headline": "Fortinet Confirms Active Exploitation of FortiCloud SSO Bypass on Fully Patched FortiGate Firewalls",
          "summary": "Fortinet has confirmed that a critical Single Sign-On (SSO) authentication bypass vulnerability affecting FortiCloud is being actively exploited in the wild. The attacks, linked to CVE-2025-59718 and CVE-2025-59719, are reportedly successful even against fully patched FortiGate firewalls. Attackers are exploiting the flaw by sending specially crafted SAML messages to bypass authentication. Once inside, they are creating persistent administrative accounts, enabling VPN access, and exfiltrating firewall configurations. This allows for long-term persistence and deep network compromise. Customers are urged to review Fortinet's advisories and take immediate mitigation steps.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "Authentication Bypass",
            "FortiGate",
            "Fortinet",
            "SAML",
            "SSO",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z",
          "cves": [
            "CVE-2025-59718",
            "CVE-2025-59719"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-office-zero-day-cve-2026-21509",
          "headline": "Microsoft Scrambles to Patch Actively Exploited Office Zero-Day, CISA Issues Urgent Directive",
          "summary": "Microsoft has issued an emergency out-of-band security update for a high-severity zero-day vulnerability in Microsoft Office, tracked as CVE-2026-21509. The flaw, a security feature bypass with a CVSS score of 7.8, is being actively exploited in targeted attacks, allowing threat actors to bypass OLE mitigations via specially crafted Office files. In response, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating that federal agencies apply the patch by February 16, 2026. The vulnerability affects multiple versions of Office, including Office 2016, 2019, LTSC 2021, and Microsoft 365 Apps for Enterprise.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA KEV",
            "Microsoft Office",
            "OLE",
            "Security Feature Bypass",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z",
          "cves": [
            "CVE-2026-21509"
          ]
        },
        {
          "slug": "zoom-patches-critical-rce-flaw-in-node-multimedia-routers-cve-2026-22844",
          "headline": "Zoom Patches Critical RCE Flaw in Node Multimedia Routers That Could Let a Participant Hijack Meetings",
          "summary": "Zoom has released a security update to address a critical command injection vulnerability, CVE-2026-22844, in its Zoom Node Multimedia Routers. These routers are a key component in on-premise and hybrid meeting deployments. The flaw could allow a malicious participant within a meeting to execute arbitrary code remotely on the vulnerable router, potentially leading to a compromise of meeting integrity and the underlying infrastructure. Zoom has patched the vulnerability in version 5.2.1716.0 and later and states there is no evidence of active exploitation in the wild. Customers are urged to update their systems immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cloud Security"
          ],
          "tags": [
            "Command Injection",
            "Patch Management",
            "RCE",
            "Vulnerability",
            "Zoom"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-27T15:00:00.000Z",
          "cves": [
            "CVE-2026-22844"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-26",
      "type": "publication-daily",
      "headline": "QuantumLeap Ransomware Halts Global Logistics; Critical Zero-Days in NexusFlow and Mobile OSes Actively Exploited",
      "articleCount": 12,
      "articles": [
        {
          "slug": "researchers-detail-chronostealer-a-new-modular-malware-as-a-service",
          "headline": "Researchers Detail 'ChronoStealer', a New Modular Info-Stealing Malware-as-a-Service",
          "summary": "Security researchers at Check Point have published a deep-dive analysis of 'ChronoStealer', a new and highly modular information-stealing malware sold on a subscription basis in underground forums. This Malware-as-a-Service (MaaS) model allows low-skilled criminals to rent the sophisticated tool and its infrastructure for as little as $200 per month. ChronoStealer's core function is to steal credentials from over 50 web browsers and other applications. Its capabilities can be expanded with add-on modules for stealing cryptocurrency wallets, logging keystrokes, and capturing session cookies. The malware uses the Telegram API for C2 communications to better blend in with legitimate traffic. The rise of such user-friendly, powerful MaaS platforms represents a significant force multiplier for the cybercrime ecosystem.",
          "categories": [
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "Check Point",
            "MaaS",
            "Malware-as-a-Service",
            "Telegram",
            "cybercrime",
            "infostealer",
            "malware"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z",
          "malware": [
            "ChronoStealer"
          ]
        },
        {
          "slug": "cisa-issues-directive-on-post-quantum-cryptography-readiness",
          "headline": "CISA Issues Directive Mandating Federal Agencies Prepare for Post-Quantum Cryptography",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued Binding Operational Directive (BOD) 26-03, a landmark mandate requiring Federal Civilian Executive Branch (FCEB) agencies to prepare for the transition to post-quantum cryptography (PQC). The directive addresses the future threat posed by quantum computers capable of breaking current public-key encryption standards. Agencies are required to inventory all systems using public-key cryptography by September 2026 and submit a comprehensive migration roadmap by March 2027. The initiative prioritizes the protection of systems with long-term data confidentiality needs, which are vulnerable to 'harvest now, decrypt later' attacks. This directive establishes the foundational steps for a coordinated, government-wide migration to NIST-standardized PQC algorithms.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "BOD",
            "CISA",
            "NIST",
            "PQC",
            "government",
            "policy",
            "post-quantum cryptography",
            "quantum computing"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "operation-echidna-dismantles-crimson-market-dark-web-hub",
          "headline": "International Operation 'Echidna' Dismantles 'Crimson Market' Dark Web Hub, 50+ Arrested",
          "summary": "A coordinated international law enforcement action, codenamed 'Operation Echidna', has successfully dismantled 'Crimson Market', one of the largest dark web marketplaces for cybercrime tools and stolen data. The operation, involving the FBI, Europol, and the UK's NCA, resulted in the seizure of the market's server infrastructure and the arrest of over 50 individuals worldwide, including its alleged administrator. Crimson Market was a key hub for selling billions of stolen credentials, malware-as-a-service (including ransomware and info-stealers), and phishing kits. The 18-month investigation involved undercover operations to trace cryptocurrency transactions. The takedown represents a major disruption to the cybercrime economy, and data from the seized servers is expected to lead to further arrests.",
          "categories": [
            "Threat Intelligence",
            "Policy and Compliance"
          ],
          "tags": [
            "Europol",
            "FBI",
            "cybercrime",
            "dark web",
            "law enforcement",
            "takedown"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "silentvoice-phishing-campaign-uses-ai-deepfakes-to-bypass-mfa",
          "headline": "'SilentVoice' Phishing Campaign Weaponizes AI Deepfake Audio to Bypass MFA",
          "summary": "A sophisticated social engineering campaign named 'SilentVoice' is successfully bypassing multi-factor authentication (MFA) by using AI-generated deepfake audio of corporate executives. According to researchers at Proofpoint, attackers clone an executive's voice from public audio samples and then use it in a vishing (voice phishing) call to a subordinate employee. The deepfake voice creates a sense of urgency, tricking the employee into entering their credentials on a fake site and then approving the subsequent MFA push notification sent to their device. This highly convincing technique circumvents the protection offered by many common MFA methods, leading to full account takeover. The campaign has already resulted in successful breaches and financial fraud, highlighting the emerging threat of AI-weaponized social engineering.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "AI",
            "MFA bypass",
            "account takeover",
            "deepfake",
            "phishing",
            "social engineering",
            "vishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "fintech-startup-voltpay-exposes-5-million-customer-records-in-cloud-leak",
          "headline": "Fintech Startup VoltPay Leaks 5 Million Customer Records via Misconfigured Cloud Database",
          "summary": "The financial technology startup VoltPay has confirmed a massive data breach affecting approximately 5 million users. The leak was caused by a misconfigured Elasticsearch database that was left publicly accessible on the internet without a password for over three months. A security researcher discovered and reported the exposure. The leaked data includes highly sensitive information: full names, email addresses, phone numbers, physical addresses, dates of birth, hashed passwords, and full transaction histories. The last four digits of credit card and bank account numbers were also exposed. This incident, attributed to 'human error during a server migration', places millions of users at significant risk of identity theft and targeted phishing attacks, and has reportedly triggered investigations by U.S. and European regulators.",
          "categories": [
            "Data Breach",
            "Cloud Security",
            "Regulatory"
          ],
          "tags": [
            "CCPA",
            "Elasticsearch",
            "GDPR",
            "PII",
            "cloud security",
            "data breach",
            "fintech",
            "misconfiguration"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "medusa-ransomware-group-escalates-attacks-in-africa",
          "headline": "Medusa Ransomware Exploits Cybersecurity Gaps, Escalating Attacks Across Africa",
          "summary": "Ransomware attacks are a pervasive and highly damaging threat across the African continent, where a significant cybersecurity skills and resources gap creates a fertile ground for cybercriminals. Notorious ransomware groups, including Medusa, are increasingly targeting organizations in the region, leveraging double extortion tactics to maximize pressure on their victims. These attacks involve not only encrypting critical data but also stealing it and threatening public release if the ransom is not paid. Key sectors such as healthcare, finance, and critical infrastructure are prime targets. According to reports, a high percentage of African organizations hit by ransomware end up paying the ransom, perpetuating the cycle of attacks. The situation underscores an urgent need for increased investment in cybersecurity infrastructure, skills development, and awareness across the continent.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Africa",
            "Medusa",
            "critical infrastructure",
            "cybersecurity gap",
            "double extortion",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "popular-npm-package-js-utility-kit-compromised-in-supply-chain-attack",
          "headline": "NPM Package 'js-utility-kit' Hijacked in Supply Chain Attack to Steal Crypto Keys and Credentials",
          "summary": "A significant software supply chain attack has compromised the popular NPM package 'js-utility-kit', which is downloaded over 5 million times per week. Security firm Snyk discovered that malicious versions (2.1.8, 2.1.9, and 2.2.1) were published after the maintainer's account was hijacked via a credential stuffing attack. The compromised packages contained a post-install script that downloaded and executed a sophisticated information stealer. The malware was designed to steal cryptocurrency private keys, browser extension data for crypto wallets, and sensitive credentials such as environment variables and cloud provider CLI configurations from developers' machines and CI/CD pipelines. The NPM security team has removed the malicious versions, but any project that installed them between January 24 and 26 is considered compromised and requires immediate auditing and credential rotation.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Data Breach"
          ],
          "tags": [
            "CI/CD",
            "NPM",
            "cryptocurrency",
            "developer security",
            "infostealer",
            "malware",
            "supply chain attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "apt-steelhydra-targets-geothermal-energy-sector-with-novel-ics-malware",
          "headline": "Nation-State Actor 'SteelHydra' (APT47) Deploys 'GeoShifter' ICS Malware to Spy on Geothermal Energy Firms",
          "summary": "The nation-state threat actor 'SteelHydra' (also tracked as APT47) is behind a sophisticated cyber-espionage campaign targeting the geothermal energy sector. According to research from Mandiant, the campaign has impacted firms in the United States, Canada, and Iceland. The attackers are using a novel, custom-built malware framework called 'GeoShifter', which is specifically designed to operate in Industrial Control System (ICS) environments and interface with SCADA/PLC systems from vendors like Siemens and Schneider Electric. The initial infection vector is a spear-phishing campaign that deploys a backdoor named 'PipeDreamer'. The ultimate goal of the campaign appears to be the theft of intellectual property and operational data related to geothermal technology, which could be used for economic advantage or to plan future disruptive attacks.",
          "categories": [
            "Threat Actor",
            "Industrial Control Systems",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "ICS",
            "SCADA",
            "cyber espionage",
            "geothermal energy",
            "nation-state",
            "spear-phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z",
          "malware": [
            "GeoShifter",
            "PipeDreamer"
          ]
        },
        {
          "slug": "quantumleap-ransomware-cripples-global-logistics-giant-navigistics",
          "headline": "New QuantumLeap Ransomware Demands $50M, Halts Global Shipments at NaviGistics",
          "summary": "The global logistics firm NaviGistics has suffered a catastrophic cyberattack from a new ransomware strain dubbed 'QuantumLeap'. The attack, orchestrated by a group calling itself 'Entropy Collective', has encrypted critical systems and brought the company's worldwide shipping and freight operations to a standstill. The threat actors gained initial access via a compromised VPN account lacking multi-factor authentication, demonstrating a sophisticated lateral movement campaign before deploying the payload. The group is demanding a $50 million ransom and has threatened to leak over 2 terabytes of exfiltrated data, including sensitive customer and financial records. This incident highlights the extreme vulnerability of the global supply chain to targeted cyber-extortion and the devastating operational and financial impact of modern ransomware attacks.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "VPN security",
            "cyber extortion",
            "double extortion",
            "logistics",
            "ransomware",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z",
          "malware": [
            "QuantumLeap"
          ]
        },
        {
          "slug": "volt-typhoon-linked-to-data-breach-at-us-water-utility",
          "headline": "Volt Typhoon Linked to Breach at U.S. Water Utility, Exfiltrating Operational Documents",
          "summary": "The Chinese state-sponsored group Volt Typhoon has been attributed to a data breach at the Park County Water District in Colorado. According to a joint advisory from CISA, the FBI, and the NSA, the hackers exploited a known vulnerability in an internet-facing network appliance to gain initial access. Consistent with their known TTPs, Volt Typhoon then used 'living off the land' techniques, leveraging built-in network administration tools to blend in and evade detection. The attackers moved laterally within the IT network and exfiltrated sensitive operational documents, including engineering schematics and maintenance schedules. While officials stated that the operational technology (OT) network and water supply were not affected, the incident highlights the group's continued focus on reconnaissance against U.S. critical infrastructure.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Industrial Control Systems"
          ],
          "tags": [
            "APT",
            "CISA",
            "Volt Typhoon",
            "critical infrastructure",
            "living off the land",
            "nation-state",
            "water utility"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z"
        },
        {
          "slug": "apple-google-release-emergency-patches-for-ghosttouch-zero-click-flaw",
          "headline": "Apple & Google Issue Emergency Patches for 'GhostTouch' Zero-Click RCE Flaw (CVE-2026-23456)",
          "summary": "Apple and Google have released coordinated, emergency security updates to fix a critical zero-click remote code execution (RCE) vulnerability, dubbed 'GhostTouch' and tracked as CVE-2026-23456. The flaw exists in a core open-source graphics rendering library used by both iOS and Android, affecting billions of smartphones and tablets worldwide. The vulnerability can be exploited by sending a victim a specially crafted image file via messaging apps or email, requiring no user interaction to achieve code execution. Researchers at The Citizen Lab discovered the flaw being actively used by a commercial surveillance vendor to deploy spyware against high-risk individuals. CISA has added the CVE to its KEV catalog, and all users are urged to update to iOS 19.2.1, iPadOS 19.2.1, or the latest Android security patch immediately.",
          "categories": [
            "Vulnerability",
            "Mobile Security",
            "Cyberattack"
          ],
          "tags": [
            "Android",
            "CISA KEV",
            "RCE",
            "iOS",
            "mobile security",
            "spyware",
            "vulnerability",
            "zero-click"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z",
          "cves": [
            "CVE-2026-23456"
          ]
        },
        {
          "slug": "critical-rce-zero-day-in-nexusflow-api-gateway-actively-exploited",
          "headline": "Urgent Patch Required: Critical RCE Zero-Day (CVE-2026-12345) in NexusFlow API Gateway Under Active Attack",
          "summary": "A critical pre-authentication remote code execution (RCE) zero-day vulnerability, CVE-2026-12345, is being actively exploited in the wild against the popular NexusFlow API Gateway. The flaw, which carries the maximum CVSS score of 10.0, allows unauthenticated attackers to gain complete control of vulnerable servers by sending a single, specially crafted HTTP request. Security firm Horizon Security Labs discovered the exploitation during a breach investigation. The vulnerability is wormable, creating a risk of rapid, widespread compromise. NexusFlow's parent company, Voltara, has released an emergency patch (version 3.8.1) and is urging all customers to update immediately. CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to patch by February 9, 2026.",
          "categories": [
            "Vulnerability",
            "Cyberattack"
          ],
          "tags": [
            "API security",
            "CISA KEV",
            "RCE",
            "buffer overflow",
            "patch management",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-26T15:00:00.000Z",
          "cves": [
            "CVE-2026-12345"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "everest-ransomware-claims-under-armour-breach-leaks-data-of-72m-customers",
        "originalHeadline": "Everest Ransomware Leaks Data of 72 Million Under Armour Customers After Failed Talks",
        "updateTitle": "Update: Everest Ransomware Leaks Data of 72 Million Under Armour Customers After Failed Talks",
        "updateSummary": "A class-action lawsuit has been filed against Under Armour following the Everest ransomware data breach, with additional PII types like gender and date of birth confirmed as exposed.",
        "categories": [
          "Ransomware",
          "Data Breach",
          "Threat Actor"
        ],
        "tags": [
          "Dark Web",
          "Data Breach",
          "Everest",
          "PII",
          "Ransomware",
          "Under Armour"
        ],
        "severity": "high",
        "publishedAt": "2026-01-22T15:00:00.000Z",
        "updatedAt": "2026-01-27T00:00:00.000Z"
      },
      {
        "slug": "zoom-and-gitlab-patch-critical-flaws-including-9-9-cvss-vulnerability",
        "originalHeadline": "Zoom & GitLab Race to Patch Critical Flaws, Including a 9.9 CVSS RCE Bug",
        "updateTitle": "Update: Zoom & GitLab Race to Patch Critical Flaws, Including a 9.9 CVSS RCE Bug",
        "updateSummary": "Zoom RCE (CVE-2026-22844) details: command injection, exploitable by authenticated meeting participant. Affected versions (prior to 5.2.1716.0) and detection methods released.",
        "categories": [
          "Patch Management",
          "Vulnerability"
        ],
        "tags": [
          "Critical",
          "DoS",
          "GitLab",
          "Patching",
          "RCE",
          "Vulnerability",
          "Zoom"
        ],
        "cves": [
          "CVE-2025-13927",
          "CVE-2025-13928",
          "CVE-2026-22844"
        ],
        "severity": "critical",
        "publishedAt": "2026-01-22T15:00:00.000Z",
        "updatedAt": "2026-01-27T00:00:00.000Z"
      },
      {
        "slug": "new-osiris-ransomware-linked-to-medusa-and-inc-gang-ttps",
        "originalHeadline": "New 'Osiris' Ransomware Borrows TTPs from Medusa and Inc Gangs, Uses Signed Driver to Kill AV",
        "updateTitle": "Update: New 'Osiris' Ransomware Borrows TTPs from Medusa and Inc Gangs, Uses Signed Driver to Kill AV",
        "updateSummary": "New details emerge on Osiris ransomware's 'Poortry' driver, which masquerades as a Malwarebytes component to disable security software.",
        "categories": [
          "Ransomware",
          "Malware",
          "Threat Actor"
        ],
        "tags": [
          "BYOVD",
          "Defense Evasion",
          "Double Extortion",
          "Inc",
          "Kernel Driver",
          "Medusa",
          "Ransomware"
        ],
        "malware": [
          "Abyssworker",
          "Medusa",
          "Mimikatz",
          "Osiris",
          "Poortry",
          "Stonestop"
        ],
        "severity": "high",
        "publishedAt": "2026-01-23T15:00:00.000Z",
        "updatedAt": "2026-01-27T00:00:00.000Z"
      },
      {
        "slug": "fully-patched-fortigate-firewalls-compromised-via-sso-bypass",
        "originalHeadline": "Warning: Fully Patched FortiGate Firewalls Are Being Compromised via New SSO Bypass",
        "updateTitle": "Update: Warning: Fully Patched FortiGate Firewalls Are Being Compromised via New SSO Bypass",
        "updateSummary": "Fortinet confirmed active exploitation of FortiCloud SSO bypass on fully patched FortiGate firewalls. Attackers gain admin access and exfiltrate configurations.",
        "categories": [
          "Vulnerability",
          "Cyberattack",
          "Patch Management"
        ],
        "tags": [
          "FortiGate",
          "Fortinet",
          "SAML",
          "SSO",
          "authentication bypass",
          "firewall",
          "zero-day"
        ],
        "cves": [
          "CVE-2025-59718",
          "CVE-2025-59719"
        ],
        "severity": "critical",
        "publishedAt": "2026-01-25T15:00:00.000Z",
        "updatedAt": "2026-01-27T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}