{
  "lastUpdated": "2026-01-21T14:13:28.634Z",
  "runDate": "2026-01-21",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-21",
      "type": "publication-daily",
      "headline": "EU Proposes Ban on High-Risk Tech, AI-Generated Malware Emerges, and Ransomware Hits Apple Supplier Luxshare",
      "articleCount": 12,
      "articles": [
        {
          "slug": "drones-pose-growing-cyber-attack-threat-to-critical-infrastructure",
          "headline": "Drones Emerge as Urgent Cyber Threat to Critical Infrastructure",
          "summary": "A report published on January 21, 2026, by the University of Canberra and Cisco warns of the urgent and escalating cyber threat posed by drones to critical infrastructure. The study highlights that as drone technology becomes more advanced, accessible, and affordable, its potential for use in cyber warfare is growing significantly. Researchers found that drones can be used as platforms to launch sophisticated cyberattacks against targets like data centers and telecommunications networks, exploiting gaps in physical and cybersecurity defenses. The report stresses a significant disconnect between the current level of threat awareness among infrastructure operators and the real-world capabilities of modern drones, urging industries to integrate drone-related risks into their security and resilience programs.",
          "categories": [
            "Cyberattack",
            "Threat Intelligence",
            "Industrial Control Systems"
          ],
          "tags": [
            "Cisco",
            "Critical Infrastructure",
            "Cyberattack",
            "Drone",
            "Physical Security",
            "WIDS",
            "Wireless Security"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z"
        },
        {
          "slug": "nydfs-implements-stricter-cybersecurity-rules-for-financial-firms",
          "headline": "NYDFS Enforces Stricter Cybersecurity Rules for Financial Firms",
          "summary": "The New York Department of Financial Services (NYDFS) has now fully implemented the final amendments to its landmark Part 500 Cybersecurity Regulation. These changes impose significantly more prescriptive and stringent requirements on regulated financial and insurance entities. As of May 2025, firms are mandated to have automated vulnerability scanning, enhanced access controls, and robust logging and monitoring capabilities, including endpoint detection and response (EDR). The amendments also place a strong emphasis on proactive governance of third-party service providers, including cloud and AI vendors. With the rules now fully in effect in 2026, the NYDFS is expected to have lower tolerance for non-compliance and will likely intensify its cybersecurity examinations.",
          "categories": [
            "Regulatory",
            "Policy and Compliance"
          ],
          "tags": [
            "Compliance",
            "EDR",
            "Financial Services",
            "NYDFS",
            "Part 500",
            "Regulation",
            "Third-Party Risk",
            "Vulnerability Management"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z"
        },
        {
          "slug": "axis-survey-ceos-and-cisos-clash-on-ai-risks-and-cyber-workforce",
          "headline": "CEOs and CISOs Divided on AI: Survey Shows 75% Expect to Cut Security Staff",
          "summary": "A survey of 500 CEOs and CISOs by AXIS Capital, released January 20, 2026, reveals a significant disconnect in executive perceptions of AI in cybersecurity. While both groups agree that AI-driven attacks are the top emerging threat, a surprising 75% of all respondents believe that the productivity gains from AI-powered security tools will allow them to reduce their cybersecurity headcount. This suggests a potential clash between the perceived efficiency of AI and the reality of an increasingly complex threat landscape fueled by the same technology. The survey, conducted in the U.S. and UK, also found that nearly 82% of leaders plan to increase their cybersecurity budgets, indicating that while they may hope to cut staff, they recognize the need for greater investment in technology to combat AI-powered threats like advanced ransomware and deepfake social engineering.",
          "categories": [
            "Policy and Compliance",
            "Security Operations"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "CEO",
            "CISO",
            "Cybersecurity Leadership",
            "Risk Management",
            "Survey",
            "Workforce"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z"
        },
        {
          "slug": "eu-proposes-revised-cybersecurity-act-to-ban-high-risk-tech-suppliers",
          "headline": "EU Moves to Ban High-Risk Tech Suppliers from 18 Critical Sectors",
          "summary": "On January 20, 2026, the European Commission introduced a revised EU Cybersecurity Act (CSA 2) aimed at bolstering the bloc's supply chain security. The proposal establishes a framework to identify and exclude high-risk technology suppliers from 18 critical sectors, including energy and telecommunications. This move is widely interpreted as a measure to reduce dependency on Chinese technology providers. The act mandates the derisking of mobile networks by requiring operators to replace equipment from designated high-risk vendors within three years. It also aims to streamline the European Cybersecurity Certification Framework (ECCF) to make compliance faster and more accessible, particularly for SMEs, and strengthens the mandate of the EU's cybersecurity agency, ENISA.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "5G Security",
            "CSA 2",
            "Compliance",
            "ENISA",
            "EU Cybersecurity Act",
            "High-Risk Vendors",
            "Regulation",
            "Supply Chain Security"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z"
        },
        {
          "slug": "everest-ransomware-claims-major-data-breach-at-mcdonalds-india",
          "headline": "Everest Ransomware Claims 861GB Data Breach at McDonald's India",
          "summary": "The Everest ransomware group has claimed a major cyberattack against McDonald's India, alleging the theft of 861 gigabytes of sensitive data. In a post on its dark web leak site on January 20, 2026, the group threatened to publicly release the information if a ransom is not paid. The compromised data reportedly includes a vast amount of personal information on customers and employees, as well as internal corporate documents. This incident, if confirmed, would be the latest in a series of data security issues for the fast-food giant's Indian operations, which suffered previous breaches. The Everest group, a Russian-speaking operation active since 2020, is known for its double-extortion tactics, and the potential leak of customer data poses a significant risk of identity theft and phishing campaigns.",
          "categories": [
            "Ransomware",
            "Data Breach"
          ],
          "tags": [
            "Dark Web",
            "Data Breach",
            "Everest",
            "India",
            "McDonald's",
            "PII",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z"
        },
        {
          "slug": "hackers-target-critical-ics-ot-environments-and-ai-systems",
          "headline": "Hackers Expand Attacks on ICS/OT and Enterprise AI Systems",
          "summary": "Research from Cyble, published January 20, 2026, reveals a dangerous convergence of threats, with adversaries increasingly targeting both industrial control systems (ICS/OT) and enterprise artificial intelligence (AI) systems. The report highlights that hacktivists and cybercriminals are exploiting internet-exposed Human-Machine Interfaces (HMI) and SCADA systems to disrupt critical infrastructure. Simultaneously, they are weaponizing AI workflows through techniques like prompt injection and data poisoning. This dual-front attack creates unprecedented challenges for defenders. The report also notes that ransomware remains the most disruptive threat, with RaaS affiliates collaborating and shifting towards extortion-only models, while the industrialized Phishing-as-a-Service (PhaaS) economy continues to fuel initial access campaigns.",
          "categories": [
            "Industrial Control Systems",
            "Threat Intelligence",
            "Cloud Security"
          ],
          "tags": [
            "AI Security",
            "Cyble",
            "HMI",
            "ICS",
            "OT",
            "PhaaS",
            "Ransomware",
            "SCADA",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z"
        },
        {
          "slug": "over-50-companies-breached-using-old-credentials-from-infostealer-logs",
          "headline": "Old Passwords, No MFA: Threat Actor 'Zestix' Breaches 50+ Companies",
          "summary": "A threat actor known as Zestix (or Sentap) has successfully breached more than 50 multinational companies, including Iberia Airlines, by simply using valid login credentials sourced from old infostealer malware logs. A report from January 21, 2026, details how the attacks required no sophisticated exploits, instead relying on credentials harvested years ago by malware like RedLine and Lumma. The core security failure across all victims was the absence of multi-factor authentication (MFA) on the compromised accounts, which allowed the actor to log in directly to corporate file-sharing portals and other systems. The incidents serve as a stark reminder of the long-tail risk of leaked credentials and the absolute necessity of implementing MFA as a baseline security control.",
          "categories": [
            "Data Breach",
            "Threat Actor",
            "Phishing"
          ],
          "tags": [
            "Credential Stuffing",
            "Data Breach",
            "Infostealer",
            "Lumma",
            "MFA",
            "RedLine",
            "Valid Accounts",
            "Vidar",
            "Zestix"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z",
          "malware": [
            "Lumma",
            "RedLine",
            "Vidar"
          ]
        },
        {
          "slug": "stealthy-pdfsider-malware-deployed-by-ransomware-gangs-using-dll-sideloading",
          "headline": "PDFSider Malware Uses Legitimate PDF App to Evade EDR and Deploy Backdoor",
          "summary": "A new and sophisticated malware, named PDFSider, is being used by ransomware groups like Qilin to deploy a stealthy backdoor by evading security software. Discovered by Resecurity, the malware uses a DLL sideloading technique, hiding a malicious 'cryptbase.dll' alongside a legitimate, signed executable for the 'PDF24 Creator' application. When the user runs the PDF application, it inadvertently loads the malicious DLL, allowing PDFSider to execute with the privileges of a trusted process and bypass AV and EDR solutions. The malware operates primarily in memory, establishes persistence, and uses DNS for encrypted command-and-control communications. Its adoption by financially motivated groups like Qilin highlights a growing trend of ransomware operators using APT-level tradecraft for initial access and espionage.",
          "categories": [
            "Malware",
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "DLL Sideloading",
            "Defense Evasion",
            "EDR",
            "Malware",
            "PDFSider",
            "Qilin",
            "Ransomware",
            "Resecurity"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z",
          "malware": [
            "Agent Tesla",
            "CryptBot",
            "DCRat",
            "Formbook",
            "Lumma Stealer",
            "PDFSider",
            "Quasar RAT",
            "Remcos RAT",
            "Vidar Stealer",
            "XWorm"
          ]
        },
        {
          "slug": "uk-warns-of-pro-russia-hacktivist-groups-targeting-critical-infrastructure",
          "headline": "UK NCSC Warns of Pro-Russia Hacktivist Attacks on Critical Infrastructure",
          "summary": "On January 20, 2026, the United Kingdom's National Cyber Security Centre (NCSC) issued a formal warning regarding persistent denial-of-service (DoS) attacks from pro-Russia hacktivist groups. The alert specifically identifies UK critical national infrastructure (CNI) operators and local government bodies as primary targets. The NCSC named the group NoName057(16) as a key perpetrator, which utilizes its 'DDoSia' tool to orchestrate disruptive campaigns against nations supporting Ukraine. While often low in sophistication, these DoS attacks aim to make essential online services inaccessible, causing significant disruption. The NCSC urges all UK organizations, especially those in targeted sectors, to review and enhance their defensive postures and DoS mitigation strategies immediately.",
          "categories": [
            "Cyberattack",
            "Threat Actor",
            "Industrial Control Systems"
          ],
          "tags": [
            "Critical Infrastructure",
            "DDoS",
            "DDoSia",
            "DoS",
            "Hacktivism",
            "NCSC",
            "NoName057(16)",
            "Russia",
            "UK"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z",
          "malware": [
            "DDoSia"
          ]
        },
        {
          "slug": "voidlink-malware-signals-new-era-of-ai-generated-cyber-threats",
          "headline": "VoidLink: Dawn of Advanced AI-Generated Malware Has Begun",
          "summary": "Cybersecurity researchers have uncovered VoidLink, a highly complex, 88,000-line malware framework targeting Linux cloud environments. Analysis by Check Point Research, following its initial discovery in mid-January 2026, suggests it was created by a single, skilled Chinese-speaking developer who leveraged AI to accelerate the entire development process. This marks a significant milestone, making VoidLink one of the first documented examples of a sophisticated cyberweapon being built almost entirely with AI. Operational security failures by the author exposed development artifacts, including source code and sprint-planning documents, which confirmed the use of an LLM for code generation and project architecture. While no in-the-wild attacks have been observed, VoidLink's existence proves that AI can dramatically lower the barrier to creating complex, industrial-scale malware, enabling lone actors to produce threats that once required well-funded teams.",
          "categories": [
            "Malware",
            "Threat Intelligence",
            "Cloud Security"
          ],
          "tags": [
            "AI-generated malware",
            "Check Point Research",
            "Cloud Security",
            "LLM",
            "Linux",
            "Threat Intelligence",
            "VoidLink",
            "Zig"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z",
          "malware": [
            "VoidLink"
          ]
        },
        {
          "slug": "oracle-january-2026-critical-patch-update-fixes-337-flaws-including-cvss-10-bug",
          "headline": "Oracle Issues Critical Patch for CVSS 10.0 Auth Bypass in WebLogic Server",
          "summary": "Oracle has released its January 2026 Critical Patch Update (CPU), a massive security release containing 337 fixes for vulnerabilities across its product portfolio. The most severe flaw addressed is CVE-2026-21962, a critical authentication bypass vulnerability in the Oracle WebLogic Server Proxy Plug-in with a CVSS score of 10.0. This vulnerability can be exploited remotely by a low-privileged attacker without user interaction, potentially allowing complete takeover of the affected component. The flaw impacts WebLogic Server Proxy Plug-in versions 12.2.1.4.0, 14.1.1.0.0, and 14.1.2.0.0. Oracle strongly urges customers to apply these cumulative patches immediately, highlighting the continued risk of exploitation of previously patched vulnerabilities due to slow enterprise adoption rates.",
          "categories": [
            "Patch Management",
            "Vulnerability"
          ],
          "tags": [
            "Authentication Bypass",
            "CPU",
            "CVE-2026-21962",
            "Critical Patch Update",
            "Oracle",
            "Patch Management",
            "Vulnerability",
            "WebLogic Server"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z",
          "cves": [
            "CVE-2026-21962"
          ]
        },
        {
          "slug": "ransomhub-claims-breach-of-apple-supplier-luxshare-threatens-to-leak-rd-data",
          "headline": "RansomHub Hits Apple Supplier Luxshare, Claims Theft of R&D Data for Apple, Nvidia, and Tesla",
          "summary": "The RansomHub ransomware group has claimed a significant data breach against Luxshare Precision Industry, a major Chinese electronics manufacturer and a critical partner for Apple, Nvidia, Tesla, and other tech giants. In a dark web post on January 21, 2026, the group alleged it had stolen and encrypted sensitive intellectual property, including 3D CAD models and engineering designs for products related to its high-profile clients. RansomHub threatened to leak the data, accusing Luxshare's IT department of attempting to hide the incident. Luxshare is a primary assembler for Apple's iPhone and Vision Pro. Independent analysis of sample data released by the attackers appears to confirm it contains confidential project details, validating the severity of this major supply chain breach.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Supply Chain Attack"
          ],
          "tags": [
            "Apple",
            "Dark Web",
            "Data Breach",
            "Luxshare",
            "Nvidia",
            "RansomHub",
            "Ransomware",
            "Supply Chain Attack",
            "Tesla"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-21T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-20",
      "type": "publication-daily",
      "headline": "Ingram Micro Breach Exposes 42k; UK Warns of Pro-Russia DDoS; New Ransomware Threats Emerge",
      "articleCount": 12,
      "articles": [
        {
          "slug": "ceos-cisos-split-on-ai-cybersecurity-risks-rewards-survey-finds",
          "headline": "CEOs Optimistic, CISOs Wary: Survey Reveals Deep Divide on AI's Cybersecurity Impact",
          "summary": "A new survey by specialty insurer AXIS Capital, released on January 20, 2026, reveals a significant perception gap between CEOs and CISOs regarding the role of artificial intelligence in cybersecurity. While CEOs are largely optimistic about AI's productivity and security benefits, CISOs are more acutely aware of the new risks it introduces, including data leakage, model manipulation, and sophisticated AI-driven attacks. This disconnect could lead to misaligned security strategies and underinvestment in critical risk areas.",
          "categories": [
            "Policy and Compliance",
            "Security Operations",
            "Other"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "CEO",
            "CISO",
            "cybersecurity leadership",
            "risk management",
            "survey"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        },
        {
          "slug": "gtmaritime-launches-gt-identify-to-bolster-maritime-cybersecurity-compliance",
          "headline": "GTMaritime Launches 'GT Identify' to Tackle Maritime Cybersecurity and Compliance",
          "summary": "Maritime technology firm GTMaritime has launched GT Identify, a new cybersecurity system designed to help ship operators comply with increasingly stringent regulations. Announced on January 20, 2026, the system provides fleet-wide hardware and software asset inventory, vulnerability reporting, and aligns with the NIST Cybersecurity Framework. The launch addresses the growing need for robust cyber risk management to meet IMO and IACS E26/E27 requirements.",
          "categories": [
            "Policy and Compliance",
            "Industrial Control Systems",
            "Patch Management"
          ],
          "tags": [
            "IACS",
            "IMO",
            "NIST",
            "asset management",
            "compliance",
            "cybersecurity",
            "maritime",
            "shipping"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        },
        {
          "slug": "dragonforce-emerges-as-new-ransomware-cartel-using-lockbit-and-conti-code",
          "headline": "'DragonForce' Emerges as New Ransomware Cartel Built on LockBit and Conti DNA",
          "summary": "A new Ransomware-as-a-Service (RaaS) operation named DragonForce has emerged, positioning itself as a \"ransomware cartel.\" The group is reportedly building its operations on the leaked source code of the notorious LockBit 3.0 and Conti ransomware variants. Operating a RaaS platform called 'Ransombay,' DragonForce's strategy includes absorbing smaller rival operations, signaling a trend towards consolidation in the cybercrime ecosystem.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "Conti",
            "DragonForce",
            "LockBit",
            "RaaS",
            "Ransombay",
            "cybercrime",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "Conti",
            "LockBit 3.0",
            "Ransombay"
          ]
        },
        {
          "slug": "evelyn-stealer-malware-targets-developers-via-vs-code-extensions",
          "headline": "'Evelyn Stealer' Malware Targets Developers in Malicious VS Code Extensions",
          "summary": "A sophisticated, multi-stage malware campaign is deploying the 'Evelyn' information stealer by hiding it within malicious Visual Studio Code (VSC) extensions. First analyzed by Trend Micro, the malware specifically targets software developers to exfiltrate a wide range of sensitive data, including browser credentials, system information, clipboard data, and cryptocurrency wallets. The campaign highlights the growing risk of supply chain attacks originating from compromised developer environments.",
          "categories": [
            "Malware",
            "Supply Chain Attack",
            "Threat Intelligence"
          ],
          "tags": [
            "Evelyn",
            "Visual Studio Code",
            "developer security",
            "infostealer",
            "malware",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "Evelyn"
          ]
        },
        {
          "slug": "crashfix-campaign-uses-fake-ad-blocker-to-crash-browsers-and-push-malware",
          "headline": "Fake Ad Blocker Crashes Chrome, Tricks Users into Installing 'ModeloRAT' Malware",
          "summary": "A novel malware campaign dubbed \"CrashFix\" is using a malicious Google Chrome extension that impersonates the 'uBlock Origin Lite' ad blocker to intentionally crash victims' browsers. The attack, attributed to a group called 'KongTuke,' then uses social engineering, presenting a fake crash report that tricks users into running a PowerShell command to \"fix\" the issue. This command ultimately downloads and installs 'ModeloRAT,' a previously undocumented Python-based remote access trojan.",
          "categories": [
            "Malware",
            "Phishing",
            "Threat Actor"
          ],
          "tags": [
            "Chrome extension",
            "KongTuke",
            "LOLBAS",
            "ModeloRAT",
            "malware",
            "social engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "CrashFix",
            "ModeloRAT",
            "NexShield"
          ]
        },
        {
          "slug": "ingram-micro-discloses-ransomware-attack-impacting-42000-individuals",
          "headline": "Ingram Micro Breach Exposes Data of 42,000 After Safepay Ransomware Attack",
          "summary": "Global IT distributor Ingram Micro has officially notified 42,521 individuals that their personal and sensitive information, including Social Security numbers, was stolen during a ransomware attack in July 2025. The incident, attributed to the Safepay ransomware group, compromised employment and job applicant records. After Ingram Micro reportedly refused to pay the ransom, the threat actors published the stolen 3.5 terabytes of data on their dark web leak site.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Supply Chain Attack"
          ],
          "tags": [
            "PII",
            "Safepay",
            "Social Security Number",
            "data breach",
            "ransomware",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        },
        {
          "slug": "north-korean-apt-konni-abuses-google-ads-in-operation-poseidon",
          "headline": "North Korean 'Konni' APT Weaponizes Google Ads to Deliver EndRAT Malware",
          "summary": "The North Korean state-sponsored threat group Konni is conducting a sophisticated spear-phishing campaign dubbed \"Operation Poseidon.\" The advanced persistent threat (APT) actor is weaponizing Google advertising URLs to make malicious links appear legitimate, thereby bypassing security filters and tricking users. The campaign's ultimate goal is to deliver the 'EndRAT' malware, a remote access trojan, onto victim systems.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Phishing"
          ],
          "tags": [
            "APT",
            "EndRAT",
            "Google Ads",
            "Konni",
            "North Korea",
            "malvertising",
            "spear-phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "EndRAT"
          ]
        },
        {
          "slug": "pdfsider-backdoor-uses-dll-side-loading-to-evade-defenses",
          "headline": "Stealthy 'PDFSIDER' Backdoor Uses DLL Side-Loading to Bypass EDR and AV",
          "summary": "Security researchers at Resecurity have uncovered a new stealthy backdoor, dubbed 'PDFSIDER,' that uses a DLL side-loading technique to evade EDR and antivirus solutions. The malware masquerades as a legitimate PDF application to load a malicious DLL, establishing an encrypted command-and-control channel for long-term, covert access. The backdoor is already being actively used by ransomware groups, including the notorious Qilin gang, for payload delivery.",
          "categories": [
            "Malware",
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "DLL side-loading",
            "EDR evasion",
            "PDFSIDER",
            "Qilin",
            "Resecurity",
            "backdoor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "PDFSIDER"
          ]
        },
        {
          "slug": "hacktivists-and-cybercriminals-expand-attacks-on-ics-and-ai-systems",
          "headline": "Threat Landscape Converges as Attackers Target ICS and AI Systems",
          "summary": "New research from Cyble highlights a dangerous convergence of threats, as both hacktivists and financially motivated cybercriminals are increasingly targeting Industrial Control Systems (ICS), Operational Technology (OT), and enterprise AI systems. The report, published January 20, 2026, notes that attackers are exploiting exposed HMI and SCADA systems while also leveraging AI to create polymorphic malware and more effective social engineering lures.",
          "categories": [
            "Threat Intelligence",
            "Industrial Control Systems",
            "Cyberattack"
          ],
          "tags": [
            "AI security",
            "ICS",
            "OT",
            "SCADA",
            "cybercrime",
            "hacktivism",
            "threat intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        },
        {
          "slug": "uk-ncsc-warns-of-persistent-pro-russia-hacktivist-ddos-attacks",
          "headline": "UK NCSC Sounds Alarm on Pro-Russia Hacktivist DDoS Attacks Targeting CNI",
          "summary": "The UK's National Cyber Security Centre (NCSC) has issued a formal alert warning of persistent and disruptive denial-of-service (DoS) attacks from Russian-aligned hacktivist groups. The ideologically motivated attacks are primarily targeting UK local government and critical national infrastructure (CNI), including operational technology (OT) systems. The NCSC named the group NoName057(16) as particularly active and urged organizations to bolster their defenses.",
          "categories": [
            "Cyberattack",
            "Threat Actor",
            "Industrial Control Systems"
          ],
          "tags": [
            "CNI",
            "DDoS",
            "NCSC",
            "NoName057(16)",
            "OT",
            "Russia",
            "UK",
            "hacktivism"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z",
          "malware": [
            "DDoSia"
          ]
        },
        {
          "slug": "cyberattack-on-belgian-hospital-forces-shutdown-patient-transfers",
          "headline": "Cyberattack Forces Belgian Hospital to Shut Down, Cancel Surgeries, and Transfer Patients",
          "summary": "A severe cyberattack on the AZ Monica hospital network in Belgium has forced a complete IT shutdown across its two campuses in Deurne and Antwerp. The incident led to the cancellation of all scheduled surgeries, the suspension of most treatments, and the emergency transfer of seven critical care patients to other facilities. The hospital's emergency department is operating at a reduced capacity, and an investigation by the Federal Police's Computer Crime Unit is underway.",
          "categories": [
            "Cyberattack",
            "Ransomware",
            "Industrial Control Systems"
          ],
          "tags": [
            "Belgium",
            "cyberattack",
            "healthcare",
            "hospital",
            "patient safety",
            "ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        },
        {
          "slug": "south-korean-conglomerate-kyowon-hit-by-major-ransomware-attack",
          "headline": "South Korean Giant Kyowon Group Hit by Ransomware, 9.6 Million Accounts at Risk",
          "summary": "The South Korean conglomerate Kyowon Group has confirmed it suffered a significant ransomware attack that disrupted operations and resulted in data exfiltration. The attack, detected on January 10, 2026, compromised approximately 600 of the company's 800 servers. South Korean authorities estimate that up to 9.6 million user accounts (representing 5.5 million unique individuals) may have been affected, as attackers reportedly exploited an open external port to gain initial access.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Kyowon",
            "South Korea",
            "cyberattack",
            "data breach",
            "ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-20T15:00:00.000Z"
        }
      ]
    }
  ],
  "articles": {
    "updated": []
  },
  "pages": {
    "updated": []
  }
}