{
  "lastUpdated": "2025-10-27T17:12:38.744Z",
  "runDate": "2025-10-27",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-10-27",
      "type": "publication-daily",
      "headline": "Microsoft Scrambles to Patch Actively Exploited WSUS Flaw as Qilin Ransomware Surges",
      "articleCount": 10,
      "articles": [
        {
          "slug": "chatgpt-atlas-browser-vulnerability-allows-memory-poisoning",
          "headline": "ChatGPT Flaw Allows 'Memory Poisoning' via CSRF Attack",
          "summary": "A novel vulnerability discovered in OpenAI's ChatGPT Atlas web browser allows attackers to perform 'memory poisoning' through a Cross-Site Request Forgery (CSRF) attack. Researchers at LayerX Security found that this flaw can be used to invisibly inject malicious instructions into ChatGPT's persistent 'Memory' feature. These instructions survive across sessions and devices, and can be triggered by a user's normal prompts to execute malicious code, potentially leading to account takeover or malware deployment.",
          "categories": [
            "Vulnerability",
            "Cloud Security"
          ],
          "tags": [
            "AI Security",
            "CSRF",
            "ChatGPT",
            "Memory Poisoning",
            "OpenAI",
            "Vulnerability"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z"
        },
        {
          "slug": "apt-c-60-intensifies-cyber-espionage-campaign-against-japan",
          "headline": "APT-C-60 Escalates 'SpyGlace' Campaign Against Japan",
          "summary": "The South Korea-aligned cyber-espionage group APT-C-60 has significantly intensified its campaign against Japanese organizations in the third quarter of 2025. According to JPCERT/CC and Cyble, the group has deployed at least three new versions of its custom 'SpyGlace' backdoor. The attackers have evolved their tactics, now attaching malicious VHDX files directly to phishing emails and abusing legitimate services like GitHub and StatCounter for stealthy command-and-control communications and malware delivery, making detection more challenging.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "APT-C-60",
            "Cyber-Espionage",
            "Japan",
            "Living off the Land",
            "SpyGlace",
            "VHDX"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z",
          "malware": [
            "SpyGlace"
          ]
        },
        {
          "slug": "data-breaches-hit-toys-r-us-askul-verisure",
          "headline": "Data Breaches Hit Toys 'R' Us Canada, Askul, and Verisure",
          "summary": "A wave of data breaches has impacted several consumer-facing companies globally. Toys \"R\" Us Canada has had customer records leaked on the dark web. Japanese retailer Askul suffered a disruptive ransomware attack that halted operations and may have resulted in a data leak. Additionally, Swedish security firm Verisure disclosed a breach affecting 35,000 customers via a third-party vendor, and U.S.-based Jewett-Cameron Trading reported the theft of financial documents.",
          "categories": [
            "Data Breach",
            "Ransomware"
          ],
          "tags": [
            "Data Breach",
            "PII",
            "Ransomware",
            "Retail",
            "Supply Chain Attack",
            "Vendor Breach"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z"
        },
        {
          "slug": "healthcare-data-breaches-affect-modmed-lifebridge-right-at-home",
          "headline": "Healthcare Sector Rocked by Breaches at ModMed, LifeBridge, and Right at Home",
          "summary": "The healthcare sector continues to be a prime target for cyberattacks, with recent data breaches announced by Electronic Health Record (EHR) provider Modernizing Medicine (ModMed), home healthcare provider Right at Home, and Baltimore-based LifeBridge Health. The incidents, which include a ransomware attack claimed by the Sinobi group and a third-party breach via Oracle Health, have exposed a vast range of sensitive Protected Health Information (PHI), including Social Security numbers, medical diagnoses, and financial data.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Regulatory"
          ],
          "tags": [
            "Data Breach",
            "HIPAA",
            "Healthcare",
            "PHI",
            "Ransomware",
            "Supply Chain Attack",
            "Vendor Breach"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z"
        },
        {
          "slug": "north-korean-lazarus-group-targets-european-defense-firms-with-new-rat",
          "headline": "Lazarus Group Targets European Defense Firms with New 'ScoringMathTea' RAT",
          "summary": "The North Korean state-sponsored threat actor, Lazarus Group, is behind a sophisticated cyber-espionage campaign targeting European defense manufacturers, with a specific focus on companies producing Unmanned Aerial Vehicles (UAVs). The attackers used social engineering tactics, including fake job offers and trojanized GitHub projects, to gain initial access. Once inside, they deployed a previously unknown Remote Access Trojan (RAT) named 'ScoringMathTea' to exfiltrate sensitive intellectual property, including proprietary drone designs.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Industrial Control Systems"
          ],
          "tags": [
            "APT",
            "Cyber-Espionage",
            "Defense Industry",
            "Lazarus",
            "North Korea",
            "RAT",
            "UAV"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z",
          "malware": [
            "ScoringMathTea"
          ]
        },
        {
          "slug": "china-linked-smishing-campaign-used-194000-domains",
          "headline": "Massive 'Smishing Triad' Campaign Used 194,000+ Domains to Harvest Data",
          "summary": "A massive smishing (SMS phishing) campaign attributed to the China-linked 'Smishing Triad' threat group has used over 194,000 malicious domains since the beginning of 2024. The operation, which escalated significantly in April, impersonates trusted entities like the US Postal Service, the IRS, banks, and toll services to trick victims into divulging sensitive personal information, including Social Security numbers. The campaign's infrastructure is designed for rapid turnover to evade detection, with many domains active for less than two days.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "China",
            "Impersonation",
            "PII",
            "SMS Phishing",
            "Smishing",
            "Social Engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z"
        },
        {
          "slug": "qilin-ransomware-attacks-skyrocket-to-700-in-2025",
          "headline": "Qilin Ransomware Attacks Skyrocket, Becoming 2025's Most Prolific Group",
          "summary": "The Russia-based Qilin ransomware group has become the most active ransomware operation of 2025, claiming 701 victims as of late October. This dramatic surge, representing a 280% increase since April, is largely attributed to the group absorbing affiliates from the defunct RansomHub operation. Qilin employs a double-extortion model, targeting critical infrastructure sectors such as manufacturing, healthcare, finance, and government, with the United States being the most heavily impacted nation. High-profile attacks have resulted in massive data theft and significant financial damages, cementing Qilin's status as a top-tier cyber threat.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Critical Infrastructure",
            "Data Leak",
            "Double Extortion",
            "RaaS",
            "Threat Actor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z"
        },
        {
          "slug": "critical-adobe-commerce-flaw-cve-2025-54236-under-active-exploitation",
          "headline": "Critical Adobe Commerce Flaw Under Active Exploitation, CISA Warns",
          "summary": "A critical improper input validation vulnerability in Adobe Commerce and Magento, tracked as CVE-2025-54236, is being actively exploited in the wild. Dubbed 'SessionReaper,' the flaw allows an unauthenticated remote attacker to hijack user sessions via the REST API, leading to potential web shell deployment and complete store takeover. CISA has added the vulnerability to its KEV catalog, and with reports suggesting over 60% of Magento stores remain unpatched, immediate action is urged for all administrators.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Data Breach"
          ],
          "tags": [
            "Adobe",
            "Improper Input Validation",
            "KEV",
            "Magento",
            "REST API",
            "Session Hijacking",
            "Web Shell"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z",
          "cves": [
            "CVE-2025-54236"
          ]
        },
        {
          "slug": "critical-google-chrome-v8-vulnerability-cve-2025-12036-allows-rce",
          "headline": "Google Rushes Patch for Critical Chrome V8 RCE Flaw",
          "summary": "Google has released an emergency security update for Google Chrome to address a critical vulnerability, CVE-2025-12036, in its V8 JavaScript engine. The flaw, described as an 'inappropriate implementation,' could allow a remote attacker to execute arbitrary code on a victim's system by convincing them to visit a malicious website. The vulnerability was discovered by Google's own AI-driven research project, leading to a rapid patch release. All users of Chrome and other Chromium-based browsers are urged to update immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "Browser Security",
            "Chrome",
            "Google",
            "RCE",
            "V8",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z",
          "cves": [
            "CVE-2025-12036"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-critical-wsus-flaw-cve-2025-59287",
          "headline": "Microsoft Scrambles to Patch Actively Exploited Critical WSUS Flaw",
          "summary": "Microsoft has released an urgent, out-of-band security update for a critical remote code execution (RCE) vulnerability in Windows Server Update Services (WSUS), tracked as CVE-2025-59287. The flaw, which has a CVSS score of 9.8, is being actively exploited in the wild, allowing unauthenticated attackers to achieve complete system control with SYSTEM privileges. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating immediate patching for federal agencies and strongly urging all organizations to apply the update without delay.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "BinaryFormatter",
            "Deserialization",
            "KEV",
            "Out-of-Band Patch",
            "RCE",
            "WSUS",
            "Windows Server"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-27T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-10-26",
      "type": "publication-daily",
      "headline": "Microsoft Scrambles to Patch Actively Exploited WSUS Flaw; Dublin Airport Breach Hits 3.8M",
      "articleCount": 5,
      "articles": [
        {
          "slug": "un-cybercrime-treaty-signed-hanoi-amidst-privacy-concerns",
          "headline": "Nations Sign Landmark UN Cybercrime Treaty Amidst Privacy and Rights Concerns",
          "summary": "In a landmark event in Hanoi, Vietnam, 72 nations have signed the first-ever United Nations Convention against Cybercrime. The treaty aims to establish a global legal framework for international cooperation in fighting digital crime, including provisions for rapid cross-border evidence sharing. While hailed by the UN as a major step in multilateralism, the convention has drawn sharp criticism from over 160 technology firms, including Meta and Dell, and various civil society groups. Critics warn its broad language could be used to criminalize legitimate security research and enable governments to repress dissent under the guise of fighting cybercrime.",
          "categories": [
            "Policy and Compliance",
            "Regulatory"
          ],
          "tags": [
            "Cybercrime Treaty",
            "Hanoi Convention",
            "International Law",
            "Policy",
            "Privacy",
            "Regulation",
            "UN"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-26T15:00:00.000Z"
        },
        {
          "slug": "ddos-attack-russian-food-safety-agency-disrupts-supply-chain",
          "headline": "DDoS Attack on Russian Food Agency Cripples National Supply Chains",
          "summary": "Russia's federal agency for veterinary and phytosanitary surveillance, Rosselkhoznadzor, has been targeted by a large-scale distributed denial-of-service (DDoS) attack starting October 22, 2025. The attack crippled the agency's critical electronic certification systems, including the 'Mercury' platform, which is essential for tracking animal products. The outage caused significant delays in food shipments from major producers of meat, milk, and baby food across the nation, highlighting the vulnerability of critical national infrastructure to cyberattacks. Russian telecom providers are working to mitigate the attack, for which no group has claimed responsibility.",
          "categories": [
            "Cyberattack",
            "Industrial Control Systems",
            "Policy and Compliance"
          ],
          "tags": [
            "Critical Infrastructure",
            "Cyberattack",
            "DDoS",
            "Food Supply Chain",
            "Russia"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-26T15:00:00.000Z"
        },
        {
          "slug": "dublin-airport-data-breach-august-2025-collins-aerospace",
          "headline": "Dublin Airport Breach Exposes 3.8 Million Passengers After Supplier Hack",
          "summary": "Dublin Airport has confirmed a significant data breach impacting up to 3.8 million passengers who traveled in August 2025. The incident stemmed from a ransomware attack on a third-party IT supplier, Collins Aerospace, which provides check-in and boarding software. The Everest ransomware group has claimed responsibility, stating they stole 1.5 million passenger records and published them online. The exposed data includes full names, booking references, and contact information, putting millions of travelers at risk of sophisticated phishing and social engineering attacks. The breach is part of a wider attack on Collins Aerospace that disrupted several major European airports.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Ransomware"
          ],
          "tags": [
            "Aviation",
            "Data Breach",
            "Everest",
            "GDPR",
            "HardBit",
            "PII",
            "Ransomware",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-26T15:00:00.000Z"
        },
        {
          "slug": "safepay-ransomware-targets-german-video-surveillance-firm-xortec",
          "headline": "Safepay Ransomware Hits German Surveillance Firm Xortec, Sparking Supply Chain Fears",
          "summary": "The Safepay ransomware group has claimed responsibility for a cyberattack against Xortec GmbH, a German provider of professional video surveillance solutions. The group has listed Xortec on its data leak site with a payment deadline of October 27, 2025. This attack raises significant supply chain concerns, as a compromise of a value-added distributor like Xortec could potentially lead to backdoored hardware or software being deployed in sensitive client environments. Safepay is a relatively new but aggressive ransomware-as-a-service (RaaS) operation known for its rapid double-extortion attacks.",
          "categories": [
            "Ransomware",
            "Supply Chain Attack",
            "Threat Actor"
          ],
          "tags": [
            "Germany",
            "RaaS",
            "Ransomware",
            "Safepay",
            "Supply Chain Attack",
            "Video Surveillance"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-26T15:00:00.000Z",
          "malware": [
            "Safepay Ransomware"
          ]
        },
        {
          "slug": "critical-microsoft-wsus-flaw-cve-2025-59287-actively-exploited",
          "headline": "Urgent Patch for Critical WSUS Flaw as Attacks Surge",
          "summary": "A critical remote code execution (RCE) vulnerability in Microsoft's Windows Server Update Services (WSUS), tracked as CVE-2025-59287 with a CVSS score of 9.8, is being actively exploited by threat actors. The flaw allows unauthenticated attackers to achieve SYSTEM-level privileges, leading Microsoft to release an emergency out-of-band patch after its initial October fix proved insufficient. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to patch by November 14, 2025. Security researchers have observed in-the-wild attacks leveraging unsafe deserialization in the WSUS `GetCookie()` endpoint, underscoring the urgency for all organizations to apply the update immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA KEV",
            "Deserialization",
            "Emergency Patch",
            "RCE",
            "WSUS",
            "Windows Server"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-26T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ],
          "malware": [
            "ysoserial.net"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "ransomware-attacks-skyrocket-50-percent-in-2025-qilin-emerges-as-leader",
        "originalHeadline": "Ransomware Attacks Surge 50% in 2025; Qilin Group Takes the Lead",
        "updateTitle": "Update: Ransomware Attacks Surge 50% in 2025; Qilin Group Takes the Lead",
        "updateSummary": "Qilin ransomware victim count surges to 701, fueled by RansomHub affiliates, becoming 2025's most prolific group with significant high-profile impacts.",
        "categories": [
          "Ransomware",
          "Threat Actor",
          "Threat Intelligence"
        ],
        "tags": [
          "Industrial Sector",
          "PowerShell",
          "Qilin",
          "RaaS",
          "Ransomware",
          "The Gentlemen",
          "Threat Intelligence"
        ],
        "severity": "high",
        "publishedAt": "2025-10-25T15:00:00.000Z",
        "updatedAt": "2025-10-27T12:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}