{
  "lastUpdated": "2025-10-29T18:53:23.391Z",
  "runDate": "2025-10-29",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-10-29",
      "type": "publication-daily",
      "headline": "Urgent WSUS Patch Mandated Amidst Wave of Zero-Day Exploits Targeting Oracle, Chrome, and AI Agents",
      "articleCount": 10,
      "articles": [
        {
          "slug": "herodotus-android-malware-mimics-human-typing-to-evade-detection",
          "headline": "Herodotus Android Malware Mimics Human Typing to Bypass Biometric Security",
          "summary": "A new Android banking trojan named Herodotus has emerged, offered as a Malware-as-a-Service (MaaS) by a threat actor known as 'K1R0'. The malware is notable for its novel evasion technique: it mimics human typing behavior by introducing random delays during remote control sessions. This method is specifically designed to defeat behavioral biometric security systems that analyze user interaction patterns to detect fraud. Active campaigns have been observed targeting banking and crypto app users in Italy and Brazil.",
          "categories": [
            "Malware",
            "Mobile Security",
            "Phishing"
          ],
          "tags": [
            "Android",
            "Banking Trojan",
            "Behavioral Biometrics",
            "Herodotus",
            "MaaS",
            "Malware",
            "SMiShing"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-10-29T15:00:00.000Z",
          "malware": [
            "Herodotus"
          ]
        },
        {
          "slug": "scattered-spider-tactics-drive-surge-in-vishing-and-retail-breaches",
          "headline": "\"Scattered Spider\" Tactics Drive Surge in Vishing and Massive Retail Breaches",
          "summary": "A new report from KnowBe4 highlights the devastating impact of the \"Scattered Spider\" (UNC3944) cybercrime group and a dramatic rise in voice phishing (vishing) as defining threats of 2025. The group successfully breached high-profile UK retailers, including M&S and Harrods, causing damages in the hundreds of millions of pounds. Their tactics, which blend social engineering, MFA bombing, and deepfake audio, have created a blueprint for modern cybercrime. The report also notes a 449% increase in phone-based vishing attacks, often leveraging AI-generated voices.",
          "categories": [
            "Threat Actor",
            "Phishing",
            "Data Breach"
          ],
          "tags": [
            "MFA Bombing",
            "Phishing",
            "Retail",
            "Scattered Spider",
            "Social Engineering",
            "UNC3944",
            "Vishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-29T15:00:00.000Z"
        },
        {
          "slug": "shadow-escape-zero-click-attack-steals-data-from-ai-agents",
          "headline": "\"Shadow Escape\": New Zero-Click Attack Steals Data from ChatGPT, Claude, and Gemini",
          "summary": "A novel zero-click attack vector named \"Shadow Escape\" has been discovered by researchers at Operant, capable of silently exfiltrating sensitive data from popular AI agents like OpenAI's ChatGPT, Anthropic's Claude, and Google's Gemini. The attack exploits the Model Context Protocol (MCP) by embedding hidden malicious instructions within seemingly benign documents. This allows for the theft of personally identifiable information (PII) without any user interaction, bypassing traditional security tools and posing a significant threat to enterprises adopting agentic AI.",
          "categories": [
            "Cyberattack",
            "Cloud Security",
            "Data Breach"
          ],
          "tags": [
            "AI Security",
            "ChatGPT",
            "Claude",
            "Data Breach",
            "Gemini",
            "MCP",
            "Prompt Injection",
            "Zero-Click"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-29T15:00:00.000Z"
        },
        {
          "slug": "bluenoroff-apt-targets-macos-with-ghostcall-and-ghosthire-campaigns",
          "headline": "BlueNoroff APT Targets macOS Users with \"GhostCall\" & \"GhostHire\" Campaigns",
          "summary": "Researchers at Kaspersky have detailed two sophisticated, ongoing campaigns by the BlueNoroff advanced persistent threat (APT) group, dubbed \"GhostCall\" and \"GhostHire.\" Active since at least April 2025, these operations specifically target macOS users with a complex arsenal of malware. The campaigns leverage at least seven distinct multi-stage execution chains, deploying information stealers and keyloggers through social engineering lures like fake Zoom clients and ChatGPT-enhanced images.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Phishing"
          ],
          "tags": [
            "APT",
            "BlueNoroff",
            "Kaspersky",
            "Lazarus Group",
            "Malware",
            "Social Engineering",
            "macOS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-29T15:00:00.000Z",
          "malware": [
            "CosmicDoor",
            "DownTroy",
            "RooTroy"
          ]
        },
        {
          "slug": "fin11-clop-ransomware-linked-to-oracle-ebs-zero-day-attacks",
          "headline": "FIN11 & Clop Ransomware Hit Industrial Giants with Oracle EBS Zero-Day",
          "summary": "Industrial giants Schneider Electric and Emerson are among the latest high-profile victims of zero-day attacks targeting Oracle E-Business Suite (EBS) applications. The financially motivated threat group FIN11, known for its affiliation with Clop ransomware, is the suspected perpetrator. The Clop leak site claims to have exfiltrated terabytes of sensitive data from the victims, signaling a severe supply chain and critical infrastructure threat that traditional security tools failed to detect.",
          "categories": [
            "Ransomware",
            "Cyberattack",
            "Data Breach"
          ],
          "tags": [
            "Clop",
            "Data Breach",
            "FIN11",
            "Oracle E-Business Suite",
            "Ransomware",
            "Supply Chain Attack",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-29T15:00:00.000Z",
          "malware": [
            "Clop"
          ]
        },
        {
          "slug": "tata-motors-exposes-70tb-of-data-via-misconfigured-aws-keys",
          "headline": "Massive 70TB Data Leak at Tata Motors from Exposed AWS Keys",
          "summary": "A colossal security failure at Tata Motors has resulted in the exposure of over 70 terabytes of sensitive corporate data, customer information, and infrastructure details. The breach, which was first identified in 2023, stemmed from multiple critical misconfigurations, including plaintext Amazon Web Services (AWS) access keys hardcoded on a customer-facing website. These credentials provided unrestricted access to numerous S3 buckets containing a vast trove of data, including customer PII and financial records.",
          "categories": [
            "Data Breach",
            "Cloud Security",
            "Policy and Compliance"
          ],
          "tags": [
            "AWS",
            "Cloud Security",
            "Data Leak",
            "Misconfiguration",
            "PII",
            "S3 Bucket",
            "Tata Motors"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-29T15:00:00.000Z"
        },
        {
          "slug": "airstalk-malware-used-in-suspected-nation-state-supply-chain-attack",
          "headline": "New \"Airstalk\" Malware Abuses VMware API in Nation-State Supply Chain Attack",
          "summary": "A newly identified malware strain, \"Airstalk,\" has been deployed in a sophisticated supply chain attack believed to be sponsored by a nation-state actor. The activity, tracked as the cluster CL-STA-1009, is notable for its novel command-and-control (C2) technique: it misuses the API of VMware's Workspace ONE Unified Endpoint Management (UEM), formerly AirWatch, to communicate covertly. The malware is also signed with a likely stolen digital certificate to evade detection, pointing to a well-resourced and stealthy adversary.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "Airstalk",
            "Code Signing",
            "Malware",
            "Nation-State",
            "Supply Chain Attack",
            "VMware",
            "Workspace ONE"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-29T15:00:00.000Z",
          "malware": [
            "Airstalk"
          ]
        },
        {
          "slug": "cisa-adds-actively-exploited-dassault-systemes-flaws-to-kev-catalog",
          "headline": "CISA KEV Alert: Active Exploits Target Dassault DELMIA Apriso Manufacturing Software",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added two critical vulnerabilities affecting Dassault Systèmes' DELMIA Apriso manufacturing software to its Known Exploited Vulnerabilities (KEV) catalog. The flaws, a code injection (CVE-2025-6204) and a missing authorization bug (CVE-2025-6205), are confirmed to be under active exploitation. This poses a severe risk to global manufacturing operations, potentially leading to operational shutdowns and intellectual property theft.",
          "categories": [
            "Vulnerability",
            "Industrial Control Systems",
            "Patch Management"
          ],
          "tags": [
            "CISA KEV",
            "CVE-2025-6204",
            "CVE-2025-6205",
            "DELMIA Apriso",
            "Dassault Systèmes",
            "ICS",
            "Manufacturing"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-29T15:00:00.000Z",
          "cves": [
            "CVE-2025-6204",
            "CVE-2025-6205"
          ]
        },
        {
          "slug": "chrome-zero-day-exploited-in-espionage-campaign-by-mem3nt0-mori",
          "headline": "Chrome Zero-Day Exploited by \"Mem3nt0 mori\" APT to Deploy Spyware",
          "summary": "A critical zero-day vulnerability in Google Chrome, CVE-2025-2783, has been actively exploited in a targeted espionage campaign dubbed \"Operation ForumTroll.\" The campaign, which began in March 2025, is attributed to the advanced persistent threat (APT) group known as \"Mem3nt0 mori.\" The attackers used the exploit to deliver a sophisticated backdoor called LeetAgent, a spyware tool developed by the Italian vendor Memento Labs, primarily targeting organizations in Russia and Belarus.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "CVE-2025-2783",
            "Chrome",
            "Espionage",
            "Mem3nt0 mori",
            "Memento Labs",
            "Spyware",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-29T15:00:00.000Z",
          "cves": [
            "CVE-2025-2783"
          ],
          "malware": [
            "LeetAgent",
            "Trinper"
          ]
        },
        {
          "slug": "cisa-mandates-urgent-patch-for-actively-exploited-windows-wsus-flaw",
          "headline": "Urgent Patch Mandated for Actively Exploited Windows WSUS RCE Flaw",
          "summary": "A critical, wormable remote code execution (RCE) vulnerability, CVE-2025-59287, in Windows Server Update Services (WSUS) is being actively exploited in the wild. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the flaw to its Known Exploited Vulnerabilities (KEV) catalog and issued a binding directive ordering federal agencies to apply an emergency out-of-band patch from Microsoft by November 14, 2025. The vulnerability allows an unauthenticated, remote attacker to achieve SYSTEM-level privileges. A threat actor tracked as UNC6512 has been linked to attacks leveraging this flaw, escalating the urgency for all organizations to patch immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA KEV",
            "CVE-2025-59287",
            "Microsoft",
            "Patch Management",
            "RCE",
            "WSUS",
            "Wormable"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-29T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-10-28",
      "type": "publication-daily",
      "headline": "Actively Exploited WSUS Flaw Triggers Emergency Patch; Qilin Ransomware Becomes 2025's Top Threat",
      "articleCount": 12,
      "articles": [
        {
          "slug": "ransomware-payments-hit-historic-low-of-23-percent-in-q3-2025",
          "headline": "Ransomware Victim Payments Plummet to Record Low of 23% in Q3 2025",
          "summary": "The rate of ransomware victims paying ransoms fell to a record low of 23% in the third quarter of 2025, according to a report from Coveware. This decline is driven by two key factors: large enterprises are increasingly refusing to pay, recognizing the low utility of doing so in data exfiltration cases, and major RaaS groups like Akira and Qilin are shifting their focus to high-volume attacks on mid-market firms with smaller ransom demands. Despite the lower payment rate, the overall volume of ransomware incidents remains at an all-time high.",
          "categories": [
            "Threat Intelligence",
            "Ransomware",
            "Cyberattack"
          ],
          "tags": [
            "Akira",
            "Coveware",
            "Cybercrime",
            "Qilin",
            "Ransomware",
            "Statistics",
            "Threat Intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "us-coast-guard-receives-billions-in-funding-for-maritime-cybersecurity-overhaul",
          "headline": "U.S. Coast Guard Poised for 'Generational Change' in Maritime Cybersecurity with $25B Funding",
          "summary": "The U.S. Coast Guard (USCG) is set for a 'generational change' in maritime cybersecurity, according to an analysis by the Center for Strategic and International Studies (CSIS). Nearly $25 billion in new funding, combined with expanded regulatory authorities, will allow the USCG to comprehensively modernize its systems, implement a zero-trust architecture, and enforce new cybersecurity standards across the entire U.S. Marine Transportation System. The move signals a major strategic shift, elevating cyberspace to an operational domain on par with air, land, and sea.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Industrial Control Systems"
          ],
          "tags": [
            "CSIS",
            "Critical Infrastructure",
            "Maritime Security",
            "Policy",
            "Regulation",
            "US Coast Guard",
            "Zero Trust"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "183-million-email-credentials-exposed-through-infostealer-malware",
          "headline": "183 Million Email Credentials Exposed in Massive Infostealer Malware Leak",
          "summary": "A massive dataset containing 183 million unique email addresses and their corresponding plaintext passwords has been discovered circulating on the dark web and added to the Have I Been Pwned database. The data, dubbed the \"Synthient Stealer Log Threat Data,\" was not sourced from a breach of any single provider like Gmail, but was compiled from logs harvested by infostealer malware from millions of compromised user devices worldwide. The leak highlights the pervasive threat of infostealers and poses a severe risk of credential stuffing attacks across the internet.",
          "categories": [
            "Data Breach",
            "Malware",
            "Phishing"
          ],
          "tags": [
            "Credential Stuffing",
            "Data Leak",
            "Have I Been Pwned",
            "Infostealer",
            "MFA",
            "Password Security"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "critical-apache-tomcat-flaws-expose-servers-to-rce-and-console-manipulation",
          "headline": "Critical Apache Tomcat Flaws Expose Servers to RCE and Console Hijacking",
          "summary": "The Apache Software Foundation has released patches for two critical vulnerabilities, CVE-2025-55752 and CVE-2025-55754, affecting Apache Tomcat versions 9, 10, and 11. The most severe flaw, CVE-2025-55752, is a directory traversal bug that can be escalated to remote code execution (RCE) if non-default settings like PUT requests are enabled. The second flaw could allow for console manipulation on Windows systems. Administrators are urged to upgrade to the latest versions immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "Apache Tomcat",
            "Directory Traversal",
            "Java",
            "Patch Management",
            "RCE",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z",
          "cves": [
            "CVE-2025-55752",
            "CVE-2025-55754"
          ]
        },
        {
          "slug": "swedish-power-grid-operator-svenska-kraftnat-hit-by-everest-ransomware",
          "headline": "Everest Ransomware Hits Swedish Power Grid Operator, Steals 280GB of Data",
          "summary": "Sweden's national electricity operator, Svenska kraftnät, has confirmed a data breach following a claim by the Everest ransomware group. The attackers alleged on their dark web leak site that they had stolen 280 GB of internal data. Svenska kraftnät stated that the attack was confined to an external file transfer system and that the nation's core power grid operations and electricity supply were not affected. An investigation is underway to determine the scope of the compromised data.",
          "categories": [
            "Cyberattack",
            "Data Breach",
            "Industrial Control Systems"
          ],
          "tags": [
            "Critical Infrastructure",
            "Data Breach",
            "Energy Sector",
            "Everest",
            "ICS",
            "Ransomware",
            "Sweden"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "north-koreas-bluenoroff-apt-deploys-new-macos-malware-in-sophisticated-campaigns",
          "headline": "North Korea's BlueNoroff APT Targets macOS Users with New 'GhostCall' Malware",
          "summary": "The North Korean advanced persistent threat (APT) group BlueNoroff has been linked to two new sophisticated campaigns, 'GhostCall' and 'GhostHire,' which specifically target macOS users. According to Kaspersky, the financially motivated group, a subset of the Lazarus Group, is targeting venture capitalists and Web3 developers with fake Zoom and Microsoft Teams clients, AI-enhanced social engineering, and a new suite of malware designed to steal cryptocurrency. Victims have been identified globally, including in Japan, Italy, France, and Singapore.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Phishing"
          ],
          "tags": [
            "APT38",
            "BlueNoroff",
            "Cryptocurrency",
            "Kaspersky",
            "Lazarus Group",
            "Malware",
            "Social Engineering",
            "macOS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "active-directory-at-risk-from-over-privileged-domain-join-accounts",
          "headline": "Over-Privileged Active Directory Domain-Join Accounts Create Major Security Risk",
          "summary": "A new security analysis reveals that Active Directory (AD) domain-join accounts, even when configured according to official guidance, often inherit excessive privileges that create a reliable pathway for attackers to achieve full domain compromise. These specialized accounts, used for automated machine provisioning, can have their credentials exposed during deployment. Attackers can then abuse the account's powerful default permissions, such as object ownership and rights related to Resource-Based Constrained Delegation (RBCD), to escalate privileges and take over computer objects.",
          "categories": [
            "Security Operations",
            "Vulnerability",
            "Threat Intelligence"
          ],
          "tags": [
            "Active Directory",
            "Kerberos",
            "Misconfiguration",
            "Privilege Escalation",
            "RBCD",
            "Security Operations"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        },
        {
          "slug": "qilin-ransomware-surges-to-become-most-prolific-threat-of-2025",
          "headline": "Qilin Ransomware Claims 700 Victims in 2025, Becoming Top Global Threat",
          "summary": "The Qilin ransomware group has dramatically escalated its activities in 2025, claiming over 700 attacks to become the year's most prolific ransomware operation. Operating a Ransomware-as-a-Service (RaaS) model, the Russia-based group has far surpassed the activity of 2024's leader, RansomHub. A significant surge in Qilin's attacks followed the shutdown of the RansomHub operation in April 2025, suggesting a migration of affiliates. Qilin aggressively targets critical infrastructure sectors worldwide, including healthcare, finance, and government, using double-extortion tactics.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Agenda",
            "AnyDesk",
            "Double Extortion",
            "Qilin",
            "RaaS",
            "Ransomware",
            "Threat Actor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z",
          "malware": [
            "RansomHub"
          ]
        },
        {
          "slug": "critical-microsoft-wsus-rce-flaw-actively-exploited-after-botched-patch",
          "headline": "Actively Exploited WSUS RCE Gets Emergency Patch After Initial Fix Fails",
          "summary": "A critical remote code execution vulnerability in Microsoft's Windows Server Update Services (WSUS), tracked as CVE-2025-59287 with a 9.8 CVSS score, is being actively exploited in the wild. The situation was exacerbated by a failed initial patch, which prompted Microsoft to release an emergency out-of-band update. The flaw allows unauthenticated attackers to achieve SYSTEM-level privileges on vulnerable servers. Due to confirmed in-the-wild attacks, CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating swift action from federal agencies.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "Deserialization",
            "KEV",
            "Patch Management",
            "RCE",
            "WSUS",
            "Windows Server",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ]
        },
        {
          "slug": "cisa-adds-critical-motex-lanscope-vulnerability-to-kev-catalog",
          "headline": "CISA Adds Actively Exploited Motex LANSCOPE RCE Flaw to KEV Catalog",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical vulnerability in Motex's LANSCOPE Endpoint Manager, CVE-2025-61932, to its Known Exploited Vulnerabilities (KEV) catalog following confirmation of active attacks. The flaw, rated 9.3 CVSS, allows for unauthenticated remote code execution on affected endpoints. Attackers have reportedly been weaponizing the vulnerability to install backdoors on victim systems, primarily observed in Japan. Federal agencies are now mandated to patch by November 12, 2025.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA",
            "Endpoint Security",
            "KEV",
            "LANSCOPE",
            "Motex",
            "RCE",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z",
          "cves": [
            "CVE-2025-61932"
          ]
        },
        {
          "slug": "cisa-issues-alert-for-critical-flaws-in-veeder-root-fuel-gauge-systems",
          "headline": "CISA Warns of Critical Flaws in Global Fuel Gauge Systems, Risking Infrastructure Disruption",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued a critical advisory for two vulnerabilities in Veeder-Root's TLS4B Automatic Tank Gauge (ATG) systems, which are used globally to monitor fuel levels. The most severe flaw, CVE-2025-58428, has a CVSS score of 9.9 and could allow a remote, authenticated attacker to execute system-level commands, potentially causing widespread disruption to fuel infrastructure. A second flaw, CVE-2025-55067, relates to the 'Year 2038' problem and could cause denial-of-service conditions.",
          "categories": [
            "Industrial Control Systems",
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "Command Injection",
            "Critical Infrastructure",
            "Energy Sector",
            "ICS",
            "OT",
            "Veeder-Root",
            "Y2038"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z",
          "cves": [
            "CVE-2025-55067",
            "CVE-2025-58428"
          ]
        },
        {
          "slug": "massive-data-breach-at-kenyan-health-platform-m-tiba-hits-millions",
          "headline": "Massive Breach at Kenyan Health Platform M-TIBA Exposes 4.8 Million Patients",
          "summary": "A threat actor named 'Kazu' has claimed responsibility for a catastrophic data breach against M-TIBA, a major mobile health platform in Kenya backed by Safaricom. The hacker alleges the theft of 2.15 terabytes of data, impacting up to 4.8 million users. The compromised information reportedly includes a vast trove of personally identifiable information (PII) and highly sensitive protected health information (PHI), such as patient diagnoses and treatment records from nearly 700 healthcare facilities. A 2GB data sample has already been leaked to substantiate the claim.",
          "categories": [
            "Data Breach",
            "Threat Actor",
            "Cloud Security"
          ],
          "tags": [
            "Dark Web",
            "Data Breach",
            "Healthcare",
            "Kazu",
            "Kenya",
            "M-TIBA",
            "PHI",
            "PII"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-28T15:00:00.000Z"
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "qantas-customer-data-leaked-online-after-ransom-deadline-passes",
        "originalHeadline": "Qantas Data Breach: 5.7M Customer Records Leaked in Salesforce Supply Chain Attack",
        "updateTitle": "Update: Qantas Data Breach: 5.7M Customer Records Leaked in Salesforce Supply Chain Attack",
        "updateSummary": "Scattered Spider tactics, including vishing and MFA bombing, are surging, causing massive losses for UK retailers and highlighting broader campaign impact.",
        "categories": [
          "Data Breach",
          "Supply Chain Attack",
          "Threat Actor"
        ],
        "tags": [
          "Dark Web",
          "Data Breach",
          "PII",
          "Qantas",
          "Salesforce",
          "Scattered Lapsus$ Hunters",
          "Social Engineering",
          "Supply Chain Attack"
        ],
        "severity": "high",
        "publishedAt": "2025-10-12T15:00:00.000Z",
        "updatedAt": "2025-10-29T12:00:00.000Z"
      },
      {
        "slug": "clop-ransomware-breaches-american-airlines-subsidiary-via-oracle-ebs-flaw",
        "originalHeadline": "Clop Ransomware Breaches American Airlines Subsidiary Envoy Air, Exploiting Oracle EBS Flaw",
        "updateTitle": "Update: Clop Ransomware Breaches American Airlines Subsidiary Envoy Air, Exploiting Oracle EBS Flaw",
        "updateSummary": "FIN11/Clop campaign targeting Oracle EBS expands, hitting industrial giants Schneider Electric & Emerson with a zero-day, exfiltrating terabytes of data.",
        "categories": [
          "Ransomware",
          "Data Breach",
          "Vulnerability"
        ],
        "tags": [
          "American Airlines",
          "CVE-2023-21931",
          "Clop",
          "Data Breach",
          "E-Business Suite",
          "Envoy Air",
          "Oracle",
          "Ransomware"
        ],
        "cves": [
          "CVE-2023-21931"
        ],
        "severity": "high",
        "publishedAt": "2025-10-18T15:00:00.000Z",
        "updatedAt": "2025-10-29T00:00:00.000Z"
      },
      {
        "slug": "ai-powered-phishing-emails-prove-4-5-times-more-effective-microsoft-report-finds",
        "originalHeadline": "Microsoft Report: AI-Generated Phishing Now 4.5x More Effective, Bypassing Traditional Defenses",
        "updateTitle": "Update: Microsoft Report: AI-Generated Phishing Now 4.5x More Effective, Bypassing Traditional Defenses",
        "updateSummary": "Massive leak of 183M email credentials from infostealer malware logs, now on HIBP, increasing credential stuffing risk.",
        "categories": [
          "Phishing",
          "Threat Intelligence",
          "Malware"
        ],
        "tags": [
          "AI",
          "ClickFix",
          "Identity Attack",
          "Infostealer",
          "MFA",
          "Microsoft",
          "Phishing",
          "Threat Intelligence"
        ],
        "malware": [
          "Infostealer malware"
        ],
        "severity": "high",
        "publishedAt": "2025-10-18T15:00:00.000Z",
        "updatedAt": "2025-10-28T00:00:00.000Z"
      },
      {
        "slug": "ransomware-automation-cuts-attack-timelines-to-18-minutes",
        "originalHeadline": "18 Minutes to Mayhem: Ransomware Attacks Now Fully Automated, Slashing Defender Response Time",
        "updateTitle": "Update: 18 Minutes to Mayhem: Ransomware Attacks Now Fully Automated, Slashing Defender Response Time",
        "updateSummary": "Ransomware victim payments hit record low of 23% in Q3 2025, as major RaaS groups shift to high-volume attacks on mid-market firms.",
        "categories": [
          "Ransomware",
          "Threat Actor",
          "Threat Intelligence"
        ],
        "tags": [
          "AI",
          "Automation",
          "Breakout Time",
          "Incident Response",
          "LockBit",
          "Qilin",
          "Ransomware",
          "SOAR"
        ],
        "malware": [
          "LockBit 5.0"
        ],
        "severity": "critical",
        "publishedAt": "2025-10-23T15:00:00.000Z",
        "updatedAt": "2025-10-28T00:00:00.000Z"
      },
      {
        "slug": "cisa-adds-new-actively-exploited-vulnerability-to-kev-catalog",
        "originalHeadline": "CISA Orders Federal Agencies to Patch New Actively Exploited Vulnerability",
        "updateTitle": "Update: CISA Orders Federal Agencies to Patch New Actively Exploited Vulnerability",
        "updateSummary": "CISA identifies two critical vulnerabilities (CVE-2025-6204, CVE-2025-6205) in Dassault DELMIA Apriso manufacturing software, actively exploited and added to KEV catalog.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Regulatory"
        ],
        "tags": [
          "BOD 22-01",
          "CISA",
          "KEV",
          "Patch Management",
          "Vulnerability",
          "Zero-Day"
        ],
        "severity": "high",
        "publishedAt": "2025-10-23T15:00:00.000Z",
        "updatedAt": "2025-10-28T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}