{
  "lastUpdated": "2025-12-09T15:47:56.496Z",
  "runDate": "2025-12-09",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-12-09",
      "type": "publication-daily",
      "headline": "Global Patching Scramble as Critical \"React2Shell\" RCE Vulnerability Sees Widespread Exploitation",
      "articleCount": 10,
      "articles": [
        {
          "slug": "ai-threat-hunting-uncovers-ghostpenguin-linux-backdoor",
          "headline": "AI Threat Hunting Exposes 'GhostPenguin,' a Linux Backdoor Undetected for Months",
          "summary": "Researchers at Trend Micro have discovered \"GhostPenguin,\" a sophisticated, multi-threaded Linux backdoor written in C++. The malware remained completely undetected on VirusTotal for over four months after its initial submission. It was ultimately found using an AI-driven automated threat hunting pipeline designed to analyze zero-detection samples. GhostPenguin provides attackers with full remote shell access and file system control over an RC5-encrypted UDP channel, using port 53 to masquerade as DNS traffic, highlighting the growing need for AI in detecting emerging, stealthy threats.",
          "categories": [
            "Malware",
            "Threat Intelligence",
            "Security Operations"
          ],
          "tags": [
            "AI",
            "Backdoor",
            "C++",
            "GhostPenguin",
            "Linux",
            "Stealth",
            "Threat Hunting"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-09T15:00:00.000Z",
          "malware": [
            "GhostPenguin"
          ]
        },
        {
          "slug": "ibm-issues-critical-security-updates-for-enterprise-products",
          "headline": "IBM Rolls Out Critical Patches for AIX, Cloud Pak, and Other Enterprise Software",
          "summary": "IBM has released a wave of security updates addressing vulnerabilities in numerous enterprise products, prompting an advisory from the Canadian Centre for Cyber Security. The bulletins, published between December 1 and December 7, 2025, include critical patches for IBM AIX, VIOS, Aspera Shares, Business Automation Workflow, and Cloud Pak System, among others. Administrators are strongly urged to review the advisories and apply the necessary updates promptly to protect their infrastructure from potential exploitation.",
          "categories": [
            "Patch Management",
            "Vulnerability"
          ],
          "tags": [
            "AIX",
            "Aspera",
            "Cloud Pak",
            "Enterprise Security",
            "IBM",
            "Patch Management",
            "Vulnerability"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-09T15:00:00.000Z"
        },
        {
          "slug": "vishing-campaign-abuses-microsoft-teams-and-quickassist",
          "headline": "Vishing Attackers Impersonate IT on Teams, Trick Users into Running Fileless Malware",
          "summary": "A sophisticated vishing (voice phishing) campaign is abusing trusted enterprise tools to deploy stealthy malware. Attackers impersonate IT support staff on Microsoft Teams, convincing users to initiate a Windows Quick Assist session. Once they have remote access, the attackers direct the user to a malicious site to download a loader. This loader then fetches an encrypted payload and executes it directly in memory using .NET reflection, a fileless technique designed to evade traditional antivirus and endpoint detection solutions. The campaign highlights the increasing trend of blending social engineering with the abuse of legitimate software.",
          "categories": [
            "Phishing",
            "Malware",
            "Security Operations"
          ],
          "tags": [
            ".NET",
            "Fileless Malware",
            "Microsoft Teams",
            "QuickAssist",
            "Social Engineering",
            "Vishing"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-09T15:00:00.000Z"
        },
        {
          "slug": "ibm-and-turing-space-advance-digital-identity-solutions",
          "headline": "Race for Secure Digital Identity Heats Up with New Platforms from IBM and Turing Space",
          "summary": "The digital identity space is seeing rapid innovation as IBM launches \"Verify Digital Credentials,\" a new platform for issuing and authenticating secure digital documents like licenses and academic records. Built on open standards, it aims to reduce breach risk by decentralizing data storage. Concurrently, decentralized identity provider Turing Space is partnering with the IOTA blockchain to enhance its own verification offering, aiming to lower costs for enterprise-scale deployment. These moves highlight an industry-wide push towards verifiable credentials as a foundational defense against the growing threat of AI-powered deepfakes and identity fraud.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Cloud Security"
          ],
          "tags": [
            "Blockchain",
            "Deepfake",
            "Digital Identity",
            "SSI",
            "Self-Sovereign Identity",
            "Verifiable Credentials"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-09T15:00:00.000Z"
        },
        {
          "slug": "iab-storm-0249-evolves-ttps-for-ransomware-deployment",
          "headline": "Access Broker Storm-0249 Shifts to Advanced Stealth Tactics for Ransomware Attacks",
          "summary": "The initial access broker (IAB) known as Storm-0249 is evolving from broad phishing campaigns to more precise, stealthy attacks designed to facilitate ransomware deployment. New analysis from ReliaQuest reveals the group is now using domain spoofing, DLL side-loading, and fileless PowerShell execution via a social engineering tactic called \"ClickFix.\" This method tricks users into running malicious commands that download and execute malware in memory. These advanced TTPs allow the group to gain persistent, undetected access to networks, which it then sells to ransomware affiliates like LockBit and ALPHV, increasing the threat to organizations.",
          "categories": [
            "Threat Actor",
            "Ransomware",
            "Phishing"
          ],
          "tags": [
            "ClickFix",
            "DLL Side-Loading",
            "Fileless Malware",
            "Initial Access Broker",
            "PowerShell",
            "Storm-0249"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-09T15:00:00.000Z",
          "malware": [
            "BruteRatel C4",
            "Latrodectus"
          ]
        },
        {
          "slug": "akira-ransomware-implicated-in-marquis-software-breach",
          "headline": "Akira Ransomware Blamed for Breach at Financial Software Vendor, 74 Banks Affected",
          "summary": "Financial software provider Marquis Software Solutions has disclosed a significant data breach that impacted over 74 of its client banks and credit unions, exposing the personal and financial data of at least 400,000 customers. The Akira ransomware gang is believed to be responsible for the attack. The threat actors reportedly gained initial access by exploiting vulnerabilities in the company's SonicWall firewalls. The compromised data includes highly sensitive information such as Social Security numbers and financial account details, making this a severe supply chain incident for the affected financial institutions.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Supply Chain Attack"
          ],
          "tags": [
            "Akira",
            "Data Breach",
            "Financial Services",
            "Ransomware",
            "SonicWall",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-09T15:00:00.000Z",
          "cves": [
            "CVE-2024-40766"
          ]
        },
        {
          "slug": "code-to-cloud-attack-vector-abuses-github-pats",
          "headline": "Code-to-Cloud Attacks: Leaked GitHub Tokens Become Keys to the Kingdom",
          "summary": "Security researchers at Wiz have detailed an emerging \"code-to-cloud\" attack vector where threat actors leverage compromised GitHub Personal Access Tokens (PATs) to pivot from code repositories directly into production cloud environments. By abusing the trust between GitHub and connected Cloud Service Providers (CSPs), attackers with even basic read permissions can discover secret names, then use write permissions to execute malicious GitHub Actions that exfiltrate CSP credentials. The attack is particularly stealthy as API calls to search for secret names are not logged by GitHub Enterprise, creating a major visibility gap for defenders.",
          "categories": [
            "Cloud Security",
            "Supply Chain Attack",
            "Vulnerability"
          ],
          "tags": [
            "CI/CD",
            "Cloud Security",
            "DevSecOps",
            "GitHub",
            "PAT",
            "Personal Access Token",
            "Supply Chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-09T15:00:00.000Z"
        },
        {
          "slug": "deadlock-ransomware-deploys-byovd-tactic-to-disable-edr",
          "headline": "DeadLock Ransomware Uses Vulnerable Baidu Driver to Blind EDRs",
          "summary": "A new DeadLock ransomware campaign is leveraging a novel \"Bring Your Own Vulnerable Driver\" (BYOVD) loader to exploit a vulnerability (CVE-2024-51324) in a legitimate Baidu Antivirus driver, `BdApiUtil.sys`. This technique allows the threat actors to terminate any process, including endpoint detection and response (EDR) and antivirus solutions, from the kernel level. By blinding security tools, the attackers can deploy the ransomware unimpeded. The attack chain, analyzed by Cisco Talos, also involves PowerShell scripts to disable Windows Defender and delete volume shadow copies, severely hindering detection and recovery efforts.",
          "categories": [
            "Ransomware",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "BYOVD",
            "DeadLock",
            "Defense Evasion",
            "EDR Evasion",
            "Kernel",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-09T15:00:00.000Z",
          "cves": [
            "CVE-2024-51324"
          ],
          "malware": [
            "DeadLock"
          ]
        },
        {
          "slug": "broadside-botnet-targets-maritime-sector-via-dvr-flaw",
          "headline": "New 'Broadside' Botnet Exploits DVRs to Target Maritime Logistics",
          "summary": "A new, sophisticated variant of the Mirai botnet, dubbed \"Broadside,\" is actively exploiting a command injection vulnerability (CVE-2024-3721) in TBK Digital Video Recorder (DVR) devices. According to research from Cydome, the campaign specifically targets the maritime logistics sector, where these DVRs are common. Broadside is more advanced than typical Mirai variants, using stealthier techniques and a custom C2 protocol. Crucially, its goals extend beyond DDoS to include credential harvesting and lateral movement, turning compromised DVRs into strategic footholds on vessel networks.",
          "categories": [
            "Malware",
            "Industrial Control Systems",
            "IoT Security"
          ],
          "tags": [
            "Botnet",
            "Broadside",
            "DVR",
            "ICS",
            "IoT",
            "Maritime Security",
            "Mirai",
            "OT"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-09T15:00:00.000Z",
          "cves": [
            "CVE-2024-3721"
          ],
          "malware": [
            "Broadside",
            "Mirai"
          ]
        },
        {
          "slug": "widespread-exploitation-of-critical-react2shell-rce-vulnerability",
          "headline": "React2Shell RCE Under Active Attack: Global Scramble to Patch Critical Flaw",
          "summary": "A critical, unauthenticated remote code execution (RCE) vulnerability in React Server Components (RSC), dubbed \"React2Shell\" (CVE-2025-55182), is being actively and widely exploited in the wild. The flaw, which has a maximum CVSS score of 10.0, affects popular frameworks like Next.js and is being abused by multiple threat actors for reconnaissance, credential theft, and malware deployment. CISA has added the vulnerability to its KEV catalog, and researchers have observed post-exploitation activity including the deployment of web shells, cryptominers, and Cobalt Strike beacons. A Chinese state-linked initial access broker is among the groups leveraging the flaw, escalating the threat for unpatched organizations globally.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "Insecure Deserialization",
            "KEV",
            "Next.js",
            "RCE",
            "React",
            "Web Security",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-09T15:00:00.000Z",
          "cves": [
            "CVE-2025-55182"
          ],
          "malware": [
            "Cobalt Strike",
            "MeshAgent",
            "Noodle RAT",
            "SNOWLIGHT",
            "VShell"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-12-08",
      "type": "publication-daily",
      "headline": "React2Shell Mass Exploitation: Critical RCE Flaw Hits Web, as Android Zero-Days and FinCEN Report Highlight Escalating Threats",
      "articleCount": 10,
      "articles": [
        {
          "slug": "astaroth-banking-trojan-spreads-via-whatsapp-worm-in-brazil",
          "headline": "WhatsApp Worm Spreads Astaroth Banking Trojan in New Brazilian Campaign",
          "summary": "A new malware campaign, tracked as STAC3150, is targeting banking users in Brazil by using WhatsApp Web as a distribution vector for the Astaroth banking trojan. The attack begins with a social engineering lure sent via WhatsApp, which persuades the victim to download a malicious ZIP archive. The archive contains a VBS or HTA file that, when executed, initiates a multi-stage infection process to deploy the Astaroth trojan. Astaroth is a well-known information stealer designed to capture banking credentials and other sensitive data. This campaign highlights the increasing use of popular messaging platforms for malware delivery.",
          "categories": [
            "Malware",
            "Phishing",
            "Threat Actor"
          ],
          "tags": [
            "Astaroth",
            "Banking Trojan",
            "Brazil",
            "Malware",
            "Phishing",
            "STAC3150",
            "WhatsApp"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "malware": [
            "Astaroth"
          ]
        },
        {
          "slug": "fincen-report-ransomware-payments-top-2-1-billion-since-2022",
          "headline": "FinCEN: Ransomware Payments Skyrocket Past $2.1 Billion, Bitcoin Remains King",
          "summary": "A new report from the U.S. Treasury's Financial Crimes Enforcement Network (FinCEN) indicates that ransomware payments reported under the Bank Secrecy Act (BSA) totaled more than $2.1 billion between January 2022 and December 2024. The analysis shows a significant peak in 2023, with $1.1 billion paid across 1,512 incidents. Despite law enforcement actions against major groups like ALPHV/BlackCat and LockBit, activity remained high in 2024. Bitcoin was the payment method in 97% of cases, with the manufacturing, financial services, and healthcare sectors being the most frequent targets. The report underscores the persistent and lucrative nature of the ransomware ecosystem.",
          "categories": [
            "Ransomware",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "ALPHV",
            "Akira",
            "Bitcoin",
            "Cybercrime",
            "FinCEN",
            "Financial Report",
            "LockBit",
            "Ransomware"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z"
        },
        {
          "slug": "white-house-eo-sets-new-deadlines-for-post-quantum-crypto-transition",
          "headline": "White House Sets 2025 Deadline for Post-Quantum Crypto Readiness",
          "summary": "The White House has issued a new Executive Order to accelerate the U.S. federal government's transition to post-quantum cryptography (PQC). The order sets a critical deadline of December 1, 2025, for several key initiatives. It directs CISA and the NSA to create and maintain a list of commercially available products that support PQC standards, guiding federal procurement. It also mandates the development of new requirements for federal agencies to support TLS 1.3, a necessary precursor for PQC integration. Additionally, NIST is tasked with updating its Secure Software Development Framework (SSDF) to include practices for developing quantum-resistant software.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "CISA",
            "Executive Order",
            "NIST",
            "NSA",
            "PQC",
            "Policy",
            "Post-Quantum Cryptography",
            "TLS 1.3",
            "White House"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z"
        },
        {
          "slug": "android-patches-two-actively-exploited-zero-days-in-december-update",
          "headline": "Android Under Attack: Google Patches Two Actively Exploited Zero-Days in Massive December Update",
          "summary": "Google has released its December 2025 Android Security Bulletin, patching 107 security flaws, including two high-severity zero-day vulnerabilities that are being actively exploited in limited, targeted attacks. The zero-days, CVE-2025-48633 (information disclosure) and CVE-2025-48572 (privilege escalation), both reside in the Android Framework. CISA has promptly added both vulnerabilities to its Known Exploited Vulnerabilities (KEV) catalog, requiring federal agencies to patch by December 23, 2025. The update also fixes seven critical-severity bugs, one of which could lead to remote denial-of-service. Android users are urged to apply the update as soon as it becomes available from their device manufacturer.",
          "categories": [
            "Vulnerability",
            "Mobile Security",
            "Patch Management"
          ],
          "tags": [
            "Android",
            "CISA",
            "Google",
            "KEV",
            "Mobile Security",
            "Patch Management",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "cves": [
            "CVE-2025-48572",
            "CVE-2025-48631",
            "CVE-2025-48633"
          ]
        },
        {
          "slug": "china-linked-hackers-use-stealthy-brickstorm-backdoor-in-vmware-attacks",
          "headline": "Chinese APTs Deploy 'BRICKSTORM' Backdoor to Infiltrate VMware Environments",
          "summary": "A joint advisory from U.S. and Canadian cybersecurity agencies has exposed a sophisticated backdoor named 'BRICKSTORM,' which is being used by Chinese state-affiliated hackers to target VMware vSphere environments. The malware is part of a long-running espionage campaign tracked as 'Salt Typhoon' and provides attackers with stealthy, long-term persistence. BRICKSTORM's capabilities include creating hidden virtual machines, stealing credentials by snapshotting active VMs, and evading detection. The campaign has primarily targeted government and IT sector organizations, demonstrating the adversary's deep expertise in virtualized infrastructure.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "BRICKSTORM",
            "Backdoor",
            "CISA",
            "China",
            "Espionage",
            "Salt Typhoon",
            "VMware",
            "vSphere"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "malware": [
            "BRICKSTORM"
          ]
        },
        {
          "slug": "clop-suspected-in-oracle-zero-day-attacks-on-upenn-and-university-of-phoenix",
          "headline": "Cl0p Implicated in Oracle Zero-Day Attacks, Breaching UPenn and University of Phoenix",
          "summary": "The University of Pennsylvania and the University of Phoenix have both reported data breaches resulting from the exploitation of zero-day vulnerabilities in their Oracle E-Business Suite servers. The attacks have compromised the personal information of at least 1,488 individuals at UPenn and a much larger, unspecified number of students, alumni, and staff at the University of Phoenix. Security researchers suspect the notorious Cl0p ransomware gang is behind the campaign, continuing their pattern of exploiting vulnerabilities in widely used enterprise software for large-scale data theft and extortion. Both institutions are currently notifying affected individuals.",
          "categories": [
            "Data Breach",
            "Threat Actor",
            "Vulnerability"
          ],
          "tags": [
            "Cl0p",
            "Data Breach",
            "Education",
            "Extortion",
            "Oracle",
            "Oracle E-Business Suite",
            "University",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z"
        },
        {
          "slug": "albiriox-new-android-banking-trojan-sold-as-maas",
          "headline": "New Android Banking Trojan 'Albiriox' Targets 400+ Finance Apps via MaaS Model",
          "summary": "A new, highly sophisticated Android banking trojan named 'Albiriox' has been discovered by security researchers. It is being sold on a Malware-as-a-Service (MaaS) basis, enabling widespread distribution by various cybercriminals. The malware is designed to target over 400 distinct financial and cryptocurrency applications worldwide. Albiriox employs advanced techniques to commit on-device fraud, including abusing Android's accessibility services, using VNC for full remote device control, and deploying dynamic overlay attacks to steal credentials. A notable feature is its 'black-screen masking' capability, which conceals the attacker's remote actions from the user, allowing them to perform fraudulent transactions undetected.",
          "categories": [
            "Malware",
            "Mobile Security",
            "Phishing"
          ],
          "tags": [
            "Albiriox",
            "Android",
            "Banking Trojan",
            "MaaS",
            "Malware",
            "Mobile Security",
            "VNC"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "malware": [
            "Albiriox"
          ]
        },
        {
          "slug": "sharepoint-flaws-chained-to-deliver-warlock-ransomware",
          "headline": "SharePoint Flaw Chain Exploited to Deploy Warlock Ransomware",
          "summary": "A new attack campaign attributed to the threat actor Storm-2603 is exploiting a chain of Microsoft SharePoint vulnerabilities (CVE-2025-49706, CVE-2025-49704) for initial access. Post-exploitation, the attackers deploy Velociraptor, a legitimate digital forensics and incident response (DFIR) tool, for reconnaissance and persistence. By abusing a trusted tool, the attackers blend in with normal administrative activity, evading detection. In several confirmed incidents, this attack chain culminates in the deployment of the Warlock ransomware. This 'living-off-the-land' technique highlights a sophisticated approach to facilitating ransomware attacks.",
          "categories": [
            "Ransomware",
            "Vulnerability",
            "Threat Actor"
          ],
          "tags": [
            "Living-off-the-Land",
            "Ransomware",
            "SharePoint",
            "Storm-2603",
            "Velociraptor",
            "Vulnerability",
            "Warlock"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "cves": [
            "CVE-2025-49704",
            "CVE-2025-49706"
          ],
          "malware": [
            "Warlock ransomware"
          ]
        },
        {
          "slug": "marquis-software-breach-exposes-data-from-74-banks-and-credit-unions",
          "headline": "Supply Chain Attack: Marquis Software Breach Hits 74 Banks, Akira Ransomware Suspected",
          "summary": "Marquis Software Solutions, a U.S.-based financial software provider, has suffered a major data breach, compromising the sensitive information of over 400,000 customers across 74 client banks and credit unions. This significant supply chain attack is suspected to be the work of the Akira ransomware gang. According to investigators, the threat actors likely gained initial access by exploiting vulnerabilities in SonicWall firewall devices on Marquis's network. This incident highlights the cascading risk in the financial sector, where a compromise at a single software vendor can have widespread consequences for numerous downstream institutions and their customers.",
          "categories": [
            "Supply Chain Attack",
            "Data Breach",
            "Ransomware"
          ],
          "tags": [
            "Akira",
            "Credit Union",
            "Data Breach",
            "Financial Services",
            "Ransomware",
            "SonicWall",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": true,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "updatedAt": "2025-12-09T00:00:00.000Z"
        },
        {
          "slug": "react2shell-critical-rce-flaw-mass-exploited-by-chinese-apts",
          "headline": "React2Shell Nightmare: CVSS 10.0 Flaw Under Mass Exploitation, CISA Issues Emergency Directive",
          "summary": "A critical remote code execution vulnerability with a CVSS score of 10.0, dubbed 'React2Shell' and tracked as CVE-2025-55182, is being actively and widely exploited. The flaw resides in the React Server Components (RSC) 'Flight' protocol and allows unauthenticated attackers to take complete control of vulnerable servers. Within hours of its public disclosure on December 3, 2025, China-nexus threat actors, including Earth Lamia and Jackpot Panda, began mass scanning and exploitation. The vulnerability affects React 19.x and popular frameworks like Next.js 15.x/16.x. In response to the widespread attacks, CISA has added CVE-2025-55182 to its Known Exploited Vulnerabilities (KEV) catalog, mandating immediate patching for federal agencies.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "APT",
            "Deserialization",
            "KEV",
            "Next.js",
            "RCE",
            "React",
            "React2Shell",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "cves": [
            "CVE-2025-55182"
          ],
          "malware": [
            "Sliver",
            "XMRig"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "marquis-software-breach-exposes-data-from-74-banks-and-credit-unions",
        "originalHeadline": "Supply Chain Attack: Marquis Software Breach Hits 74 Banks, Akira Ransomware Suspected",
        "updateTitle": "Update: Supply Chain Attack: Marquis Software Breach Hits 74 Banks, Akira Ransomware Suspected",
        "updateSummary": "Marquis Software breach update: potential 780K victims, specific CVE-2024-40766 identified, possible ransom payment, and new TTPs including Mimikatz.",
        "categories": [
          "Supply Chain Attack",
          "Data Breach",
          "Ransomware"
        ],
        "tags": [
          "Akira",
          "Credit Union",
          "Data Breach",
          "Financial Services",
          "Ransomware",
          "SonicWall",
          "Supply Chain Attack"
        ],
        "severity": "high",
        "publishedAt": "2025-12-08T15:00:00.000Z",
        "updatedAt": "2025-12-09T00:00:00.000Z"
      },
      {
        "slug": "marquis-software-supply-chain-breach-hits-dozens-of-us-banks",
        "originalHeadline": "Supply Chain Breach at Vendor Marquis Exposes Data From Dozens of US Banks",
        "updateTitle": "Update: Supply Chain Breach at Vendor Marquis Exposes Data From Dozens of US Banks",
        "updateSummary": "Akira ransomware gang suspected in Marquis Software breach, impacting over 400,000 customers across 74 banks via SonicWall vulnerabilities.",
        "categories": [
          "Supply Chain Attack",
          "Data Breach",
          "Ransomware"
        ],
        "tags": [
          "Data Breach",
          "Financial Services",
          "Marquis Software",
          "PII",
          "Ransomware",
          "SSN",
          "Supply Chain Attack"
        ],
        "severity": "high",
        "publishedAt": "2025-11-27T15:00:00.000Z",
        "updatedAt": "2025-12-08T12:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}