{
  "lastUpdated": "2025-12-18T18:52:34.660Z",
  "runDate": "2025-12-18",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-12-18",
      "type": "publication-daily",
      "headline": "Microsoft Patches Actively Exploited Zero-Day as Phishing and Malware Tactics Evolve",
      "articleCount": 10,
      "articles": [
        {
          "slug": "ghostposter-malware-infects-50000-firefox-users-via-malicious-add-ons",
          "headline": "\"GhostPoster\" Malware Infects 50,000+ Firefox Users via Malicious Add-ons",
          "summary": "A stealthy malware campaign named \"GhostPoster\" has infected over 50,000 Mozilla Firefox users by distributing 17 malicious browser extensions. The add-ons, which masqueraded as legitimate tools like VPNs and ad blockers, have been removed from the Firefox store. The malware employed a clever technique, hiding obfuscated JavaScript within the add-on's logo image file. This code would then contact command-and-control (C2) servers to download a final payload designed for hijacking affiliate links and committing ad fraud. The campaign used evasion techniques like randomized and delayed C2 callbacks to avoid detection.",
          "categories": [
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "Ad Fraud",
            "Affiliate Hijacking",
            "Browser Extension",
            "Firefox",
            "GhostPoster",
            "Malware"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "malware": [
            "GhostPoster"
          ]
        },
        {
          "slug": "cloud-security-failing-to-keep-pace-with-ai-and-multicloud-expansion",
          "headline": "Cloud Security Failing to Keep Pace with AI and Multicloud, Report Warns",
          "summary": "A new report from Palo Alto Networks finds that cloud security operations are struggling to keep up with the rapid pace of multicloud adoption and AI integration. Attackers can now compromise cloud environments in minutes, while defenders take weeks to remediate critical issues. The report, which surveyed over 2,800 executives, highlights that identity and APIs are the top risk vectors, with 99% of organizations reporting at least one attack on their AI systems in the past year. It calls for a shift from fragmented security tools to integrated platforms to address the exponentially expanding attack surface.",
          "categories": [
            "Cloud Security",
            "Policy and Compliance",
            "Threat Intelligence"
          ],
          "tags": [
            "AI Security",
            "API Security",
            "CIEM",
            "CNAPP",
            "Cloud Security",
            "Multicloud",
            "Palo Alto Networks"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z"
        },
        {
          "slug": "irleaks-breach-at-iranian-banks-exposes-millions-via-third-party-vendor",
          "headline": "\"IRLeaks\" Supply Chain Attack Hits Iranian Banks, Exposing Millions of Customer Records",
          "summary": "A major supply chain attack dubbed \"IRLeaks\" has resulted in a significant data breach affecting several prominent Iranian banks and millions of their customers. Attackers first compromised a third-party IT vendor in October 2025, using it as a pivot point to infiltrate the banks' networks. Over the following month, they exfiltrated vast amounts of financial data and personally identifiable information (PII), including national IDs and bank account numbers, before the breach was discovered in late November. The incident highlights the critical risks associated with third-party vendor security and inadequate patch management.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Cyberattack"
          ],
          "tags": [
            "Data Breach",
            "Financial Services",
            "IRLeaks",
            "Iran",
            "Supply Chain Attack",
            "Third-Party Risk"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z"
        },
        {
          "slug": "operation-forumtroll-apt-targets-russian-academics-with-new-phishing-campaign",
          "headline": "\"Operation ForumTroll\" APT Targets Russian Academics with Plagiarism Lure",
          "summary": "The Advanced Persistent Threat (APT) group known as Operation ForumTroll has launched a new, highly targeted phishing campaign aimed at Russian political scientists and academics. Active since at least 2022, the group's latest attack uses meticulously crafted emails impersonating a major Russian scientific library, eLibrary.ru. The emails lure victims into downloading a supposed plagiarism report, which is a ZIP archive containing a malicious .LNK file. Executing the shortcut file triggers a PowerShell script that downloads and installs the Tuoni command-and-control (C2) framework, giving the attackers remote access for espionage purposes.",
          "categories": [
            "Threat Actor",
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Espionage",
            "ForumTroll",
            "LNK",
            "Phishing",
            "Russia",
            "Tuoni"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "malware": [
            "Tuoni"
          ]
        },
        {
          "slug": "scripted-sparrow-bec-group-targets-finance-teams-with-disciplined-phishing-attacks",
          "headline": "\"Scripted Sparrow\" BEC Group Targets Finance Teams with Highly Structured Attacks",
          "summary": "A disciplined and persistent Business Email Compromise (BEC) group, newly identified by Fortra as \"Scripted Sparrow,\" has been systematically targeting corporate finance teams since at least June 2024. The group employs a structured and well-researched approach, sending highly credible phishing emails with fake invoices that impersonate professional services firms. To add legitimacy, the attackers often include forged prior email correspondence from a company executive authorizing the payment. The group utilizes a large network of US-based mule accounts for cashing out, indicating a well-organized and persistent financial threat.",
          "categories": [
            "Threat Actor",
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "BEC",
            "Business Email Compromise",
            "Phishing",
            "Scripted Sparrow",
            "Social Engineering",
            "Wire Fraud"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z"
        },
        {
          "slug": "ai-powered-malware-and-petya-successor-emerge-in-h2-2025-threat-landscape",
          "headline": "AI-Powered Ransomware \"PromptLock\" and Petya Successor \"HybridPetya\" Emerge",
          "summary": "ESET's H2 2025 threat report confirms the shift of AI-powered malware from theory to reality with the discovery of \"PromptLock,\" the first known AI-driven ransomware capable of generating malicious scripts on the fly. The report also details the emergence of \"HybridPetya,\" a modern successor to the destructive Petya/NotPetya wiper that is now capable of compromising UEFI-based systems. Other key trends from the second half of 2025 include the dominance of the Akira and Qilin RaaS operations and a massive surge in the CloudEyE (GuLoader) malware downloader, which saw its detections increase almost thirtyfold.",
          "categories": [
            "Malware",
            "Ransomware",
            "Threat Intelligence"
          ],
          "tags": [
            "AI Malware",
            "ESET",
            "HybridPetya",
            "Petya",
            "PromptLock",
            "Ransomware",
            "Threat Report",
            "UEFI"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "malware": [
            "Agent Tesla",
            "Akira",
            "CloudEyE",
            "Formbook",
            "GuLoader",
            "HybridPetya",
            "Lumma Stealer",
            "Petya/NotPetya",
            "PromptLock",
            "Qilin",
            "Rescoms"
          ]
        },
        {
          "slug": "threat-actors-abuse-oauth-device-code-flow-in-microsoft-365-phishing-surge",
          "headline": "Phishing Surge Hits Microsoft 365 via OAuth Device Code Abuse",
          "summary": "Security researchers report a significant rise in phishing campaigns abusing the Microsoft OAuth 2.0 device authorization grant to compromise Microsoft 365 accounts. Both state-aligned groups like UNK_AcademicFlare and financially motivated actors like TA2723 are using this 'device code' phishing technique, often facilitated by Phishing-as-a-Service (PhaaS) kits like SquarePhish2. The attacks trick users into entering a short device code on Microsoft's legitimate 'microsoft.com/devicelogin' page, which inadvertently grants the attacker's malicious application a valid access token and persistent access to the victim's account.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Cloud Security"
          ],
          "tags": [
            "Account Takeover",
            "Device Code Phishing",
            "Microsoft 365",
            "OAuth",
            "PhaaS",
            "TA2723"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "malware": [
            "SquarePhish2"
          ]
        },
        {
          "slug": "ransomware-tactics-evolve-in-2025-with-focus-on-human-operated-attacks",
          "headline": "Ransomware Evolves: \"ClickFix\" Social Engineering and Threat Actor Alliances on the Rise",
          "summary": "A December 2025 threat report from NCC Group indicates that while ransomware attack volumes plateaued in November with 583 incidents, their sophistication markedly increased. Attackers are increasingly adopting the \"ClickFix\" (also known as ClearFake) social engineering technique, which tricks users into manually running malicious commands, bypassing many automated defenses. The report also highlights a trend of collaboration, with groups like DragonForce forming alliances with skilled affiliates from other networks. The Qilin ransomware group remained the most prolific actor, with the industrials sector and North America being the most targeted.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Threat Intelligence"
          ],
          "tags": [
            "ClearFake",
            "ClickFix",
            "Qilin",
            "Ransomware",
            "Social Engineering",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "malware": [
            "ClickFix"
          ]
        },
        {
          "slug": "google-investigates-malicious-code-anomaly-in-search-results-infrastructure",
          "headline": "Google Investigates Malicious Code Found in Search Result Infrastructure",
          "summary": "Google has launched an urgent investigation after cybersecurity analysts discovered anomalous, encrypted code snippets and obfuscated JavaScript embedded within its core search result payloads on December 17, 2025. The malicious code appears designed to exploit browser sandboxing vulnerabilities, which could potentially enable remote code execution or data theft on users' systems. While Google has not confirmed any user impact and states it is neutralizing the threat, the incident represents a highly sophisticated attack against critical global internet infrastructure, prompting the involvement of government agencies.",
          "categories": [
            "Cyberattack",
            "Data Breach",
            "Security Operations"
          ],
          "tags": [
            "Browser Exploit",
            "Google",
            "Infrastructure Attack",
            "Search",
            "Supply Chain Attack"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z"
        },
        {
          "slug": "microsoft-patches-actively-exploited-windows-zero-day-in-december-2025-update",
          "headline": "Microsoft Patches Actively Exploited Windows Zero-Day in Final 2025 Update",
          "summary": "Microsoft's December 2025 Patch Tuesday addresses 57 vulnerabilities, including three zero-days. The most critical, CVE-2025-62221, is a privilege escalation flaw in the Windows Cloud Files Mini Filter Driver that is being actively exploited in the wild. This has prompted the U.S. Cybersecurity and Infrastructure Security Agency (CISA) to add it to its Known Exploited Vulnerabilities (KEV) catalog, mandating a patch by December 30, 2025. The flaw allows a local, authenticated attacker to gain SYSTEM-level privileges. The update also patches other critical RCE flaws in Microsoft Office and publicly disclosed, but not exploited, bugs in PowerShell and GitHub Copilot.",
          "categories": [
            "Patch Management",
            "Vulnerability",
            "Security Operations"
          ],
          "tags": [
            "CISA KEV",
            "Patch Tuesday",
            "Privilege Escalation",
            "RCE",
            "Vulnerability",
            "Windows",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "cves": [
            "CVE-2025-54100",
            "CVE-2025-62221",
            "CVE-2025-62554",
            "CVE-2025-62557",
            "CVE-2025-64671"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-12-17",
      "type": "publication-daily",
      "headline": "Critical React2Shell Flaw Under Widespread Attack, CISA Warns of Fortinet Exploit, and AI Fuels Cloud Risk",
      "articleCount": 10,
      "articles": [
        {
          "slug": "palo-alto-networks-report-ai-driving-massive-expansion-of-cloud-attack-surface",
          "headline": "AI Adoption Fuels 'Massive' Cloud Attack Surface Expansion, Palo Alto Networks Report Warns",
          "summary": "Palo Alto Networks' 2025 'State of Cloud Security Report' reveals that the rapid adoption of AI is creating an unprecedented expansion of the cloud attack surface. The study, surveying 2,800 security leaders, found that 99% of organizations have had their AI systems attacked in the last year. The use of generative AI in coding is producing insecure code faster than security teams can remediate it, creating a significant risk gap. API attacks have surged by 41% year-over-year, and lenient identity and access management (IAM) remains a top vulnerability. The report calls for a unified, platform-based approach to cloud security to counter AI-weaponized threats.",
          "categories": [
            "Cloud Security",
            "Threat Intelligence",
            "Policy and Compliance"
          ],
          "tags": [
            "AI Security",
            "API Security",
            "CNAPP",
            "Cloud Security",
            "DevSecOps",
            "IAM",
            "Palo Alto Networks",
            "Threat Intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-17T15:00:00.000Z"
        },
        {
          "slug": "mitre-extends-d3fend-cybersecurity-framework-to-operational-technology-ot",
          "headline": "MITRE Extends D3FEND Cybersecurity Framework to Operational Technology (OT)",
          "summary": "MITRE has officially extended its D3FEND cybersecurity framework to include Operational Technology (OT), providing a standardized knowledge base of defensive techniques for cyber-physical systems. Announced on December 16, 2025, the NSA-funded initiative aims to create a common language for securing critical infrastructure in sectors like energy, manufacturing, and defense. As OT systems become increasingly connected to IT networks, D3FEND for OT provides a structured ontology of countermeasures tailored to the unique components and risks of industrial environments, mapping defensive techniques to threats against controllers, sensors, and actuators.",
          "categories": [
            "Industrial Control Systems",
            "Policy and Compliance",
            "Security Operations"
          ],
          "tags": [
            "Critical Infrastructure",
            "Cyber-Physical Systems",
            "Cybersecurity Framework",
            "D3FEND",
            "ICS Security",
            "MITRE",
            "NSA",
            "OT Security"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-17T15:00:00.000Z"
        },
        {
          "slug": "push-security-launches-tool-to-block-clickfix-malicious-copy-paste-attacks",
          "headline": "Push Security Launches Tool to Block Malicious 'ClickFix' Copy-Paste Attacks",
          "summary": "Push Security has launched a new 'malicious copy-and-paste detection' feature to combat the rapidly growing threat of 'ClickFix' style attacks. Announced on December 17, 2025, the browser-based tool is designed to stop social engineering attacks where users are tricked into copying malicious code from a website and pasting it into a terminal or command prompt. With reports of a 517% surge in such attacks, the new feature works by analyzing copy events in the browser, blocking malicious scripts from being copied to the clipboard, and effectively disarming the attack before the payload can be executed by the user.",
          "categories": [
            "Security Operations",
            "Phishing",
            "Threat Intelligence"
          ],
          "tags": [
            "Browser Security",
            "ClickFix",
            "Copy-Paste Attack",
            "Cybersecurity Tool",
            "Phishing",
            "Push Security",
            "Social Engineering"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-17T15:00:00.000Z"
        },
        {
          "slug": "operation-moneymount-iso-phishing-campaign-deploys-phantom-stealer",
          "headline": "'Operation MoneyMount-ISO' Phishing Campaign Deploys Phantom Stealer via Malicious ISOs",
          "summary": "A financially motivated, Russian-language phishing campaign dubbed 'Operation MoneyMount-ISO' is actively targeting finance and accounting departments to deploy the Phantom information-stealing malware. According to researchers at Seqrite Labs, the attack uses emails with fake payment confirmations that contain a malicious ISO disk image file. This technique is designed to bypass email security controls. When the user opens the ISO, it mounts a virtual drive with a disguised executable. Running this file triggers a memory-resident infection chain that deploys Phantom Stealer, which then harvests browser credentials, crypto wallets, and other sensitive data for exfiltration.",
          "categories": [
            "Phishing",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "Credential Theft",
            "Finance",
            "ISO file",
            "InfoStealer",
            "Malware",
            "Phantom Stealer",
            "Phishing",
            "Russian"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-17T15:00:00.000Z",
          "malware": [
            "Phantom Stealer"
          ]
        },
        {
          "slug": "apple-and-google-warn-global-users-of-mercenary-spyware-attacks",
          "headline": "Apple and Google Issue Global Warnings Over Mercenary Spyware Attacks",
          "summary": "Apple and Google have issued a new round of threat notifications to users across the globe, warning them of targeted attacks by state-sponsored and mercenary spyware groups. Google's alert on December 3rd specifically called out the continued operations of Intellexa, a sanctioned surveillance vendor, and its 'Predator' spyware, which is being delivered via new zero-day exploits. Google warned several hundred users in countries like Pakistan, Egypt, and Saudi Arabia. Apple also sent a batch of warnings on December 2nd to users in over 150 countries, continuing its policy of notifying high-risk individuals such as journalists and activists who are prime targets for such sophisticated surveillance.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Mobile Security"
          ],
          "tags": [
            "Apple",
            "Google",
            "Intellexa",
            "Mercenary",
            "Mobile Security",
            "Predator",
            "Spyware",
            "Threat Notification",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-17T15:00:00.000Z",
          "malware": [
            "Predator"
          ]
        },
        {
          "slug": "french-interior-ministry-confirms-cyberattack-on-email-servers",
          "headline": "French Interior Ministry Confirms Cyberattack Compromised Email Servers",
          "summary": "The French Ministry of the Interior has confirmed its email servers were compromised in a cyberattack detected between December 11 and 12, 2025. Interior Minister Laurent Nuñez stated that attackers stole staff email passwords, allowing them to access an unknown number of document files. While the government is still assessing the scale, a hacker group named 'Indra' has claimed, without evidence, to have exfiltrated police files on 16.4 million citizens. In response, the ministry is rolling out two-factor authentication and resetting passwords. The attack on the high-value government target, which oversees national police and security, has raised speculation of nation-state involvement, with groups like APT28 being considered.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "APT28",
            "Credential Compromise",
            "Data Breach",
            "Email Security",
            "France",
            "Government",
            "MFA",
            "Nation-State"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-17T15:00:00.000Z"
        },
        {
          "slug": "new-consentfix-phishing-attack-bypasses-mfa-to-hijack-microsoft-accounts",
          "headline": "New 'ConsentFix' Phishing Attack Hijacks Microsoft Accounts, Bypassing MFA via Azure CLI Abuse",
          "summary": "A novel and sophisticated phishing attack dubbed 'ConsentFix' allows attackers to hijack Microsoft accounts without stealing passwords or bypassing multi-factor authentication (MFA). Discovered by Push Security, the browser-native attack tricks users into completing a fake verification process that involves copying a URL containing a sensitive OAuth authorization code from their browser's address bar and pasting it into the attacker's phishing page. The attacker then uses this code to authenticate as the user via the legitimate and trusted Microsoft Azure Command-Line Interface (CLI). Because the Azure CLI is a first-party app, it bypasses many consent restrictions, granting the attacker full account access. The technique is active and circumvents even phishing-resistant authentication like passkeys.",
          "categories": [
            "Phishing",
            "Cloud Security",
            "Threat Actor"
          ],
          "tags": [
            "Account Takeover",
            "Azure CLI",
            "ConsentFix",
            "MFA Bypass",
            "Microsoft Entra ID",
            "OAuth",
            "Phishing",
            "Push Security",
            "Social Engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-17T15:00:00.000Z",
          "malware": [
            "ConsentFix"
          ]
        },
        {
          "slug": "new-zealand-warns-26000-citizens-of-lumma-stealer-malware-infections",
          "headline": "New Zealand Launches Massive Public Alert, Warning 26,000 Citizens of Lumma Stealer Malware Infections",
          "summary": "In a first-of-its-kind campaign, New Zealand's National Cyber Security Centre (NCSC) is emailing approximately 26,000 people to warn them of potential infection by the Lumma Stealer malware. The potent information-stealing software targets Windows devices to covertly harvest sensitive data, including passwords, browser credentials, banking details, and cryptocurrency wallets. Officials have confirmed that some of the stolen credentials were linked to government and banking systems, heightening the risk of fraud. The NCSC's mass notification directs affected individuals to a government website with instructions for malware removal and improving account security.",
          "categories": [
            "Malware",
            "Phishing",
            "Data Breach"
          ],
          "tags": [
            "Credential Theft",
            "Data Theft",
            "InfoStealer",
            "Lumma Stealer",
            "Malware",
            "NCSC",
            "New Zealand",
            "Phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-17T15:00:00.000Z",
          "malware": [
            "Lumma Stealer"
          ]
        },
        {
          "slug": "cisa-adds-actively-exploited-fortinet-sso-vulnerability-to-kev-catalog",
          "headline": "CISA Adds Actively Exploited Fortinet SSO Flaw to KEV Catalog, Urges Immediate Patching",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical Fortinet vulnerability, CVE-2025-59718, to its Known Exploited Vulnerabilities (KEV) catalog, indicating active attacks in the wild. The flaw, rated 9.1 CVSS, allows an unauthenticated attacker to bypass FortiCloud single sign-on (SSO) authentication on multiple products, including FortiOS and FortiProxy, by sending a crafted SAML message. Security firm Arctic Wolf observed attackers exploiting the flaw within days of its disclosure to export device configurations and harvest credentials. CISA has mandated that federal agencies patch by December 23, 2025, and strongly advises all organizations to apply updates or disable the feature immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "Authentication Bypass",
            "CISA",
            "CVE-2025-59718",
            "FortiOS",
            "Fortinet",
            "KEV",
            "Patch Management",
            "SSO",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-17T15:00:00.000Z",
          "cves": [
            "CVE-2025-59718",
            "CVE-2025-59719"
          ]
        },
        {
          "slug": "widespread-exploitation-of-critical-react2shell-vulnerability-triggers-urgent-patching",
          "headline": "React2Shell RCE Flaw (CVSS 10.0) Under Mass Exploitation by State Actors and Cybercriminals",
          "summary": "A critical, unauthenticated remote code execution (RCE) vulnerability in React Server Components, tracked as CVE-2025-55182 and dubbed 'React2Shell,' is being actively and widely exploited. With a CVSS score of 10.0, the flaw allows attackers to take full control of vulnerable servers, including those using popular frameworks like Next.js. Microsoft and Google have observed hundreds of compromises, with threat actors ranging from Chinese state-sponsored espionage groups to financially motivated criminals. Attackers are deploying Linux backdoors like KSwapDoor, crypto miners such as XMRig, and stealing cloud credentials for Azure, AWS, and GCP. Urgent patching is required as exploitation began as early as December 5, 2025.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "CVSS 10.0",
            "China",
            "Insecure Deserialization",
            "KSwapDoor",
            "Nation-State",
            "Next.js",
            "RCE",
            "React2Shell",
            "XMRig",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-17T15:00:00.000Z",
          "cves": [
            "CVE-2025-29927",
            "CVE-2025-55182",
            "CVE-2025-55814",
            "CVE-2025-66478",
            "CVE-2025-67779"
          ],
          "malware": [
            "Cobalt Strike",
            "KSwapDoor",
            "MeshAgent",
            "Minocat",
            "XMRig",
            "ZnDoor"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "2025-the-year-ai-redefines-cyberattacks-and-defense",
        "originalHeadline": "2025: The Year Cybersecurity 'Crossed the AI Rubicon'",
        "updateTitle": "Update: 2025: The Year Cybersecurity 'Crossed the AI Rubicon'",
        "updateSummary": "ESET's H2 2025 report reveals 'PromptLock,' the first AI-driven ransomware, and 'HybridPetya,' a destructive UEFI wiper, escalating AI-powered and destructive threats.",
        "categories": [
          "Threat Intelligence",
          "Other"
        ],
        "tags": [
          "AI",
          "LLM",
          "artificial intelligence",
          "deepfake",
          "generative AI",
          "phishing",
          "threat landscape"
        ],
        "severity": "informational",
        "publishedAt": "2025-12-14T15:00:00.000Z",
        "updatedAt": "2025-12-18T00:00:00.000Z"
      },
      {
        "slug": "access-broker-storm-0249-shifts-to-advanced-ransomware-delivery",
        "originalHeadline": "Storm-0249 Evolves: Access Broker Now Deploys Ransomware with Advanced Stealth Tactics",
        "updateTitle": "Update: Storm-0249 Evolves: Access Broker Now Deploys Ransomware with Advanced Stealth Tactics",
        "updateSummary": "Push Security launches browser tool to block 'ClickFix' copy-paste attacks, directly mitigating a key social engineering tactic.",
        "categories": [
          "Threat Actor",
          "Ransomware",
          "Malware"
        ],
        "tags": [
          "ClickFix",
          "DLL Side-loading",
          "IAB",
          "PowerShell",
          "Ransomware",
          "Storm-0249"
        ],
        "malware": [
          "ALPHV",
          "LockBit"
        ],
        "severity": "medium",
        "publishedAt": "2025-12-10T15:00:00.000Z",
        "updatedAt": "2025-12-17T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}