{
  "lastUpdated": "2026-02-04T14:08:14.129Z",
  "runDate": "2026-02-04",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-02-04",
      "type": "publication-daily",
      "headline": "Russian APT Exploits Patched Office Flaw in Days; Chinese Spies Hijack Notepad++ Updates",
      "articleCount": 12,
      "articles": [
        {
          "slug": "fake-line-installer-spreads-valleyrat-malware",
          "headline": "Fake LINE Messenger Installer Spreads ValleyRAT Malware",
          "summary": "A malware campaign attributed to the Silver Fox APT group is distributing the ValleyRAT remote access trojan by disguising it as an installer for the popular LINE messaging app. The campaign, which primarily targets Chinese-speaking users, uses the trojanized software as a lure to infect systems. Once installed, ValleyRAT establishes persistence and focuses on stealing user credentials, leveraging advanced evasion techniques to remain undetected.",
          "categories": [
            "Malware",
            "Threat Actor",
            "Phishing"
          ],
          "tags": [
            "APT",
            "LINE",
            "Malware",
            "Silver Fox",
            "Trojan",
            "ValleyRAT"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z",
          "malware": [
            "ValleyRAT"
          ]
        },
        {
          "slug": "linkedin-private-messages-abused-in-phishing-campaign-targeting-execs",
          "headline": "LinkedIn Phishing Campaign Targets Executives Using Legitimate Pen-Testing Tools",
          "summary": "A new phishing campaign discovered by ReliaQuest is abusing LinkedIn's private messaging feature to target executives and IT professionals. The attackers use social engineering to trick victims into downloading and running a malicious archive file. The attack's novelty lies in its use of a legitimate, open-source Python script designed for penetration testing. This 'living off the land' technique makes the malicious activity difficult to distinguish from normal administrative tasks, significantly reducing the risk of detection by security software.",
          "categories": [
            "Phishing",
            "Security Operations"
          ],
          "tags": [
            "LinkedIn",
            "Living off the Land",
            "Phishing",
            "Python",
            "Social Engineering"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z"
        },
        {
          "slug": "cisa-under-fire-for-quietly-updating-ransomware-vulnerability-data",
          "headline": "CISA Criticized for Silently Updating KEV Catalog with Ransomware Data",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) is facing criticism for its practice of silently updating its Known Exploited Vulnerability (KEV) catalog. In 2025, the agency updated 59 entries to indicate that the flaws were being used in ransomware attacks, but it did not issue any notifications for these changes. Security experts argue that this lack of communication is a significant missed opportunity for defenders, who use the ransomware designation as a key factor in prioritizing patching.",
          "categories": [
            "Policy and Compliance",
            "Threat Intelligence",
            "Vulnerability"
          ],
          "tags": [
            "CISA",
            "KEV",
            "Policy",
            "Ransomware",
            "Threat Intelligence",
            "Vulnerability Management"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z"
        },
        {
          "slug": "uk-law-criminalizing-ai-generated-intimate-images-takes-effect",
          "headline": "UK Law Criminalizing AI-Generated Deepfake Intimate Images Takes Effect",
          "summary": "A new law in the United Kingdom is set to come into force on February 6, 2026, making it a criminal offense to create or share AI-generated 'deepfake' intimate images of an adult without their consent. The law, part of the Data (Use and Access) Act 2025, amends the Sexual Offences Act 2003 to specifically address the malicious use of artificial intelligence to create harmful and abusive content. This legislative action is a direct response to the growing problem of non-consensual deepfake pornography.",
          "categories": [
            "Regulatory",
            "Policy and Compliance"
          ],
          "tags": [
            "AI",
            "Deepfake",
            "Law",
            "Policy",
            "Regulation",
            "UK"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z"
        },
        {
          "slug": "google-issues-february-2026-security-update-for-pixel-devices",
          "headline": "Google Patches Multiple Vulnerabilities in February 2026 Pixel Update",
          "summary": "Google has released its monthly security update for all supported Pixel devices as part of its February 2026 patch cycle. The update addresses numerous security vulnerabilities detailed in the Android and Pixel-specific security bulletins. Installing the update will bring all supported Pixel devices to the 2026-02-05 patch level, ensuring they are protected against the latest discovered threats. The update also includes various functional improvements.",
          "categories": [
            "Patch Management",
            "Mobile Security"
          ],
          "tags": [
            "Android",
            "Google",
            "Mobile Security",
            "Patch Management",
            "Pixel",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z"
        },
        {
          "slug": "massive-att-dataset-with-social-security-numbers-resurfaces-online",
          "headline": "Massive AT&T Customer Dataset with 148M SSNs Resurfaces in Criminal Circles",
          "summary": "A massive and highly sensitive dataset allegedly containing the personal information of AT&T customers has resurfaced and is being circulated in criminal forums. The data trove reportedly includes approximately 176 million records, featuring over 133 million full names and addresses, and, most critically, up to 148 million full and partial Social Security numbers. The re-emergence of this consolidated data poses a severe and renewed risk of identity theft, phishing, and fraud for millions of individuals.",
          "categories": [
            "Data Breach",
            "Phishing"
          ],
          "tags": [
            "AT&T",
            "Data Breach",
            "Identity Theft",
            "PII",
            "Phishing",
            "SSN"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z"
        },
        {
          "slug": "chinese-apt-hijacks-notepad-plus-plus-updates-in-supply-chain-attack",
          "headline": "Notepad++ Updates Hijacked by Chinese APT in 6-Month Supply Chain Attack",
          "summary": "The popular open-source text editor Notepad++ was the target of a sophisticated, six-month supply chain attack attributed to a Chinese state-sponsored group. From June to December 2025, the attackers compromised the editor's hosting infrastructure, allowing them to hijack the software update mechanism. By controlling an update script, they selectively delivered trojanized installers to a small number of high-value targets in government and finance across several countries. Users are urged to manually update to the latest version.",
          "categories": [
            "Supply Chain Attack",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "APT",
            "China",
            "Espionage",
            "Malware",
            "Notepad++",
            "Supply Chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z"
        },
        {
          "slug": "pro-russian-hackers-launch-coordinated-ddos-attacks-across-europe",
          "headline": "Pro-Russian Group NoName057(16) Unleashes Massive DDoS Campaign Across Europe",
          "summary": "The pro-Russian hacktivist group NoName057(16) conducted a large-scale, coordinated Distributed Denial-of-Service (DDoS) campaign targeting multiple European countries between January 26 and February 1, 2026. The attacks, powered by the group's 'DDoSia' tool, hit 160 unique domains, with the United Kingdom bearing the brunt of the assault (55%). The campaign also heavily targeted Ukraine and Czechia, focusing on critical infrastructure, government services, and key economic assets.",
          "categories": [
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "Cyberattack",
            "DDoS",
            "Hacktivism",
            "NoName057(16)",
            "Russia",
            "UK",
            "Ukraine"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z",
          "malware": [
            "DDoSia"
          ]
        },
        {
          "slug": "samsung-rolls-out-february-2026-security-update-with-37-patches",
          "headline": "Samsung's February 2026 Update Fixes 37 Flaws in Galaxy Devices",
          "summary": "Samsung has released its February 2026 security update for its Galaxy smartphones, tablets, and foldable devices. The update addresses a total of 37 vulnerabilities. This includes 25 patches from Google for the core Android OS and 12 Samsung-specific patches (SVEs) for its One UI software. The Samsung-specific fixes address flaws rated as high and moderate severity, including an access control vulnerability in the 'Emergency Sharing' feature. Users are advised to install the update promptly.",
          "categories": [
            "Patch Management",
            "Mobile Security"
          ],
          "tags": [
            "Android",
            "Mobile Security",
            "Patch Management",
            "Samsung",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z"
        },
        {
          "slug": "russian-hackers-exploit-microsoft-office-zero-day-cve-2026-21509",
          "headline": "APT28 Weaponizes Patched Office Zero-Day in Days, Targeting European Entities",
          "summary": "Within days of an emergency patch from Microsoft, the Russian-linked threat group APT28 (Fancy Bear) began actively exploiting the critical Office vulnerability CVE-2026-21509. The campaign, dubbed 'Operation Neusploit,' uses malicious RTF files in spearphishing emails to target entities in Central and Eastern Europe. The attack deploys backdoors, including the MiniDoor email-stealing implant and the Grunt C2 agent, for espionage purposes, highlighting the extreme speed at which state-sponsored actors can operationalize newly disclosed vulnerabilities.",
          "categories": [
            "Threat Actor",
            "Vulnerability",
            "Cyberattack"
          ],
          "tags": [
            "APT28",
            "CVE-2026-21509",
            "Espionage",
            "Fancy Bear",
            "Microsoft Office",
            "Russia",
            "Spearphishing",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z",
          "cves": [
            "CVE-2026-21509"
          ],
          "malware": [
            "Grunt",
            "MiniDoor",
            "PixyNetLoader"
          ]
        },
        {
          "slug": "critical-django-vulnerabilities-enable-dos-and-sql-injection",
          "headline": "Critical Flaws in Django Framework Expose Sites to DoS and SQL Injection",
          "summary": "The maintainers of the Django web framework have released important security updates to address critical vulnerabilities. The flaws could allow remote attackers to conduct Denial-of-Service (DoS) and potential SQL injection attacks against web applications built with the framework. Due to the severity of these issues, which could lead to service disruption and data compromise, administrators are strongly urged to patch their Django instances immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "Django",
            "DoS",
            "Patch Management",
            "Python",
            "SQL Injection",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z"
        },
        {
          "slug": "ingress-nginx-vulnerability-allows-arbitrary-code-execution",
          "headline": "Critical RCE Flaw in Ingress-NGINX Threatens Kubernetes Clusters",
          "summary": "A critical vulnerability has been discovered in the widely used Ingress-NGINX controller for Kubernetes. The flaw could allow a remote attacker to achieve arbitrary code execution within the context of the ingress controller. A successful exploit could lead to a full compromise of the ingress, enabling traffic interception, data theft, and providing a powerful foothold for lateral movement into the underlying Kubernetes cluster environment. Users are urged to patch immediately.",
          "categories": [
            "Vulnerability",
            "Cloud Security",
            "Patch Management"
          ],
          "tags": [
            "Cloud Security",
            "Ingress",
            "Kubernetes",
            "NGINX",
            "RCE",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-04T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-02-03",
      "type": "publication-daily",
      "headline": "Notepad++ Supply Chain Attack by Chinese APT; Russian Group Exploits Office Zero-Day",
      "articleCount": 12,
      "articles": [
        {
          "slug": "multi-stage-phishing-campaign-uses-pdfs-and-dropbox-lures",
          "headline": "Sophisticated Phishing Attack Uses PDF Lures and Cloud Services to Steal Dropbox Credentials",
          "summary": "A new, multi-stage phishing campaign is using procurement-themed emails with benign-looking PDF attachments to bypass email security filters. The attack chain redirects victims through a legitimate cloud service, Vercel Blob, before presenting a convincing fake Dropbox login page. The goal is to harvest corporate credentials, which are then exfiltrated to an attacker-controlled Telegram bot. This layered approach is designed to appear legitimate and evade detection by both automated systems and wary users.",
          "categories": [
            "Phishing",
            "Data Breach"
          ],
          "tags": [
            "Dropbox",
            "Telegram",
            "Vercel",
            "credential theft",
            "phishing"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "fcc-warns-telecoms-of-increasing-ransomware-threats",
          "headline": "FCC Warns Telecoms of 4x Increase in Ransomware, Urges Better Security",
          "summary": "The U.S. Federal Communications Commission (FCC) has issued a formal alert to the telecommunications industry regarding the escalating threat of ransomware. Citing data that shows a fourfold increase in attacks on the sector between 2022 and 2025, the FCC's Public Safety and Homeland Security Bureau is urging providers to adopt fundamental cybersecurity best practices. The warning emphasizes that vulnerable communications networks pose a significant risk to national security and public safety, and calls for actions like patching, MFA, and network segmentation.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Ransomware"
          ],
          "tags": [
            "FCC",
            "national security",
            "ransomware",
            "regulation",
            "telecom"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "health-isac-reports-55-percent-surge-in-cyber-incidents",
          "headline": "Healthcare Cyber Incidents Surged 55% in 2025, Ransomware Top Threat",
          "summary": "The Health Information Sharing and Analysis Center (Health-ISAC) has reported a staggering 55% year-over-year increase in cyber incidents across all sectors in 2025, with the healthcare sector alone seeing a 21% rise. Ransomware was ranked as the number one threat by healthcare security professionals in 2025, causing significant disruptions. Looking ahead, the industry's top concern for 2026 has shifted to AI-enabled attacks, signaling an evolving and increasingly complex threat landscape for healthcare organizations.",
          "categories": [
            "Threat Intelligence",
            "Policy and Compliance",
            "Ransomware"
          ],
          "tags": [
            "AI",
            "H-ISAC",
            "data breach",
            "healthcare",
            "ransomware",
            "threat report"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "canada-computers-discloses-data-breach-affecting-guest-checkout-customers",
          "headline": "Canada Computers Discloses Data Breach Affecting Guest Checkout Customers",
          "summary": "Canada Computers Inc., a major Canadian electronics retailer, has announced a data breach that exposed the personal and credit card information of customers. The incident affected individuals who used the 'guest' checkout feature on the company's website between December 29, 2025, and January 22, 2026. The company discovered the breach on January 22 and has since launched an investigation with law enforcement. Customers who were logged into member accounts are not believed to be affected.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Ransomware"
          ],
          "tags": [
            "Magecart",
            "credit card fraud",
            "data breach",
            "retail",
            "web skimming"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "inc-ransomware-targets-two-us-law-firms",
          "headline": "INC Ransomware Group Breaches Two U.S. Law Firms, Leaks Sensitive Client Data",
          "summary": "The INC ransomware group is actively targeting the U.S. legal sector, claiming responsibility for attacks on at least two law firms: Hawk Law Group and Eisenberg Lowrance Lundell Lofgren. The group alleges it has stolen highly sensitive client information, including data related to civil and criminal litigation cases, government-issued IDs, and personal details. These attacks highlight the significant risk faced by law firms, which are high-value targets for cybercriminals due to the confidential nature of the data they hold.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "INC ransomware",
            "attorney-client privilege",
            "data breach",
            "legal",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "redkitten-campaign-targets-iranian-activists-with-sloppymio-malware",
          "headline": "New 'RedKitten' Campaign Uses SloppyMIO Malware to Spy on Iranian Activists",
          "summary": "A new cyber-espionage campaign, dubbed 'RedKitten,' is targeting Iranian activists and non-governmental organizations (NGOs) with a previously unseen C# implant called 'SloppyMIO.' The campaign shows signs of being assisted by Large Language Models (LLMs) and uses password-protected Excel files as its initial lure. The malware is highly evasive, using steganography, AppDomain Manager injection, and leveraging legitimate services like Telegram, GitHub, and Google Drive for C2 and payload delivery, indicating a sophisticated operation focused on political intelligence gathering.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "C#",
            "Telegram",
            "espionage",
            "malware",
            "steganography"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z",
          "malware": [
            "SloppyMIO"
          ]
        },
        {
          "slug": "notepad-plus-plus-supply-chain-attack-lotus-blossom-apt",
          "headline": "Notepad++ Update Mechanism Hijacked in 6-Month Supply Chain Attack by Chinese APT",
          "summary": "The maintainers of the widely-used Notepad++ text editor have disclosed a major supply chain attack that compromised their update infrastructure for six months in 2025. The attack, attributed to the Chinese espionage group Lotus Blossom (Billbug), involved hijacking update requests to selectively deliver a custom backdoor named 'Chrysalis' and other malware like Cobalt Strike to a targeted set of organizations. Victims were primarily located in Southeast Asia and included government and financial entities, highlighting a sophisticated, long-running espionage campaign.",
          "categories": [
            "Supply Chain Attack",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "APT",
            "backdoor",
            "code signing",
            "espionage",
            "open source",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z",
          "malware": [
            "Chrysalis",
            "Cobalt Strike"
          ]
        },
        {
          "slug": "open-vsx-marketplace-supply-chain-attack-glassworm-malware",
          "headline": "Open VSX Marketplace Hit by Supply Chain Attack Spreading 'GlassWorm' Malware",
          "summary": "The Open VSX Registry, a popular open-source alternative to the VS Code Marketplace, has suffered a supply chain attack. An attacker compromised the credentials of a legitimate developer and used their account to publish malicious versions of four popular extensions. These tainted updates, which collectively had over 22,000 downloads, were embedded with a malware loader known as 'GlassWorm.' The incident highlights the growing threat of attacks targeting developer ecosystems and software repositories.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "Open VSX",
            "VS Code",
            "developer tools",
            "malware",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z",
          "malware": [
            "GlassWorm"
          ]
        },
        {
          "slug": "play-ransomware-targets-manufacturing-firm-deatak",
          "headline": "Play Ransomware Hits US Instrument Manufacturer Deatak in Data Breach",
          "summary": "The Play ransomware group has claimed another victim in the manufacturing sector, listing U.S.-based instrument maker Deatak on its data breach forum. The attackers allege they have compromised and exfiltrated a wide range of private and confidential data, including client documents, employee payroll details, and financial information. This attack underscores the persistent threat that ransomware poses to specialized manufacturing firms, which often possess valuable intellectual property and sensitive corporate data.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Play",
            "data breach",
            "manufacturing",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "qilin-ransomware-claims-attack-on-tulsa-international-airport",
          "headline": "Qilin Ransomware Claims Breach of Tulsa International Airport, Leaks Data",
          "summary": "The Russian-affiliated Qilin ransomware group has claimed responsibility for a cyberattack against Tulsa International Airport. The group has listed the airport on its data leak site, alleging the theft of sensitive data including financial records and employee information. While airport operations reportedly remain unaffected, the incident highlights the ongoing trend of ransomware gangs targeting critical infrastructure. Qilin has been identified as a highly active group, responsible for a significant number of recent attacks.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Qilin",
            "aviation",
            "critical infrastructure",
            "data breach",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "new-britain-connecticut-disrupted-by-ransomware-attack",
          "headline": "Ransomware Attack Cripples City of New Britain, CT, Forcing Manual Operations",
          "summary": "A ransomware attack has caused significant and ongoing disruption to the municipal network systems of New Britain, Connecticut. The attack, which began last week and was later confirmed as ransomware, has impacted the city's entire internet server. As a result, city departments have been forced to abandon digital systems and revert to manual 'pen and paper' operations. Federal authorities have been called in to assist with the investigation and response efforts.",
          "categories": [
            "Ransomware",
            "Cyberattack",
            "Incident Response"
          ],
          "tags": [
            "government",
            "incident response",
            "municipality",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "apt28-exploits-microsoft-office-zero-day-cve-2026-21509",
          "headline": "Russian APT28 Exploits Critical Microsoft Office Zero-Day CVE-2026-21509",
          "summary": "The Russian state-sponsored threat group APT28 is actively exploiting a new Microsoft Office security bypass vulnerability, CVE-2026-21509 (CVSS 7.8), just days after an emergency patch was released. The campaign, dubbed 'Operation Neusploit,' targets government-related entities in Ukraine, Slovakia, and Romania using malicious RTF documents. The exploit delivers malware droppers, including one that deploys 'MiniDoor,' an email-stealing implant, and another that delivers a Covenant Grunt payload. CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT28",
            "KEV",
            "Microsoft Office",
            "espionage",
            "patch management",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z",
          "cves": [
            "CVE-2026-21509"
          ],
          "malware": [
            "MiniDoor",
            "PixyNetLoader"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "health-isac-report-highlights-ai-driven-attacks-as-top-concern-for-2026",
        "originalHeadline": "Health-ISAC Report: AI-Enabled Attacks Named Top Threat to Healthcare Sector in 2026",
        "updateTitle": "Update: Health-ISAC Report: AI-Enabled Attacks Named Top Threat to Healthcare Sector in 2026",
        "updateSummary": "New statistics reveal a 55% surge in cyber incidents in 2025, with healthcare up 21%, and ransomware confirmed as 2025's top threat.",
        "categories": [
          "Threat Intelligence",
          "Policy and Compliance",
          "Ransomware"
        ],
        "tags": [
          "AI",
          "Health-ISAC",
          "Healthcare",
          "Ransomware",
          "Supply Chain Attack",
          "Threat Intelligence"
        ],
        "severity": "informational",
        "publishedAt": "2026-01-27T15:00:00.000Z",
        "updatedAt": "2026-02-03T00:00:00.000Z"
      },
      {
        "slug": "microsoft-issues-emergency-patch-for-actively-exploited-office-zero-day",
        "originalHeadline": "Microsoft Patches Actively Exploited Office Zero-Day (CVE-2026-21509) Under Targeted Attack",
        "updateTitle": "Update: Microsoft Patches Actively Exploited Office Zero-Day (CVE-2026-21509) Under Targeted Attack",
        "updateSummary": "Russian state-sponsored APT28 attributed to 'Operation Neusploit' exploiting CVE-2026-21509, targeting government entities in Ukraine, Slovakia, and Romania with MiniDoor and Covenant Grunt malware.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Cyberattack"
        ],
        "tags": [
          "CISA KEV",
          "CVE-2026-21509",
          "Microsoft Office",
          "OLE",
          "out-of-band patch",
          "security feature bypass",
          "zero-day"
        ],
        "cves": [
          "CVE-2026-20805",
          "CVE-2026-21509"
        ],
        "severity": "critical",
        "publishedAt": "2026-01-28T15:00:00.000Z",
        "updatedAt": "2026-02-03T00:00:00.000Z"
      },
      {
        "slug": "open-vsx-marketplace-compromised-to-spread-glassworm-malware",
        "originalHeadline": "Open VSX Marketplace Hit by Supply Chain Attack Spreading \"GlassWorm\" Malware",
        "updateTitle": "Update: Open VSX Marketplace Hit by Supply Chain Attack Spreading \"GlassWorm\" Malware",
        "updateSummary": "New analysis provides a detailed attack flow, additional MITRE ATT&CK and D3FEND techniques, and expanded impact assessment for the GlassWorm supply chain attack.",
        "categories": [
          "Supply Chain Attack",
          "Malware",
          "Cloud Security"
        ],
        "tags": [
          "GlassWorm",
          "Open VSX",
          "VS Code",
          "developer tools",
          "malware loader",
          "supply chain"
        ],
        "malware": [
          "GlassWorm"
        ],
        "severity": "high",
        "publishedAt": "2026-02-02T15:00:00.000Z",
        "updatedAt": "2026-02-03T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}