{
  "lastUpdated": "2025-11-18T14:14:58.494Z",
  "runDate": "2025-11-18",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-18",
      "type": "publication-daily",
      "headline": "AI-Orchestrated Cyber Espionage Uncovered; Logitech Breached by Clop; Google Patches Actively Exploited Chrome Zero-Day",
      "articleCount": 10,
      "articles": [
        {
          "slug": "iranian-apt-spearspecter-uses-personalized-attacks-on-defense-officials",
          "headline": "Iranian APT 'SpearSpecter' Targets Defense Officials with Hyper-Personalized Attacks",
          "summary": "The Iranian state-sponsored hacking group APT42, also known as SpearSpecter and Mint Sandstorm, is conducting a highly targeted espionage campaign against senior government and defense officials. The group uses meticulous, long-term social engineering, building trust over weeks before luring targets to credential harvesting sites. In a tactical escalation, they have also begun targeting family members. The campaign employs a fileless, in-memory malware loader called TAMECAT to evade detection and steal sensitive data.",
          "categories": [
            "Threat Actor",
            "Phishing",
            "Threat Intelligence"
          ],
          "tags": [
            "APT42",
            "Espionage",
            "Fileless Malware",
            "Iran",
            "Mint Sandstorm",
            "Phishing",
            "SpearSpecter",
            "State-Sponsored"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-18T15:00:00.000Z",
          "malware": [
            "TAMECAT"
          ]
        },
        {
          "slug": "kenyan-government-websites-knocked-offline-in-defacement-attack",
          "headline": "Kenyan Government Websites Defaced in Coordinated Cyberattack",
          "summary": "On November 17, 2025, a coordinated cyberattack targeted and temporarily disabled numerous Kenyan government websites. The Ministry of Interior and National Administration confirmed the breach, which impacted the websites of the State House and ministries of Health, Education, and Energy, among others. Reports indicate several of the compromised sites were defaced with white supremacist slogans and symbols. The Kenyan government has since restored services and vowed to bring the perpetrators to justice.",
          "categories": [
            "Cyberattack",
            "Regulatory"
          ],
          "tags": [
            "Cyberattack",
            "Defacement",
            "Government",
            "Hacktivism",
            "Kenya"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-18T15:00:00.000Z"
        },
        {
          "slug": "logitech-confirms-data-breach-by-clop-ransomware-via-oracle-zero-day",
          "headline": "Logitech Confirms Breach: Clop Ransomware Exploits Oracle Zero-Day",
          "summary": "Logitech has confirmed it suffered a data breach after the Clop ransomware gang exploited a zero-day vulnerability in Oracle's E-Business Suite (CVE-2025-61882). The consumer electronics giant stated that an unauthorized third party accessed and copied data related to employees, consumers, and suppliers. The incident is part of a wider campaign by Clop that has impacted numerous major organizations. Logitech asserts that sensitive personal data like credit card numbers was not exposed and business operations remain unaffected.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Vulnerability"
          ],
          "tags": [
            "CVE-2025-61882",
            "Clop",
            "Data Breach",
            "Logitech",
            "Oracle",
            "Ransomware",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-18T15:00:00.000Z",
          "cves": [
            "CVE-2025-61882",
            "CVE-2025-61884",
            "CVE-2025-618842"
          ]
        },
        {
          "slug": "merck-discloses-employee-data-breach-from-third-party-vendor-incident",
          "headline": "Merck Employee Data Breached in Third-Party Vendor Incident",
          "summary": "Pharmaceutical giant Merck has confirmed a data breach impacting its current and former employees due to a cybersecurity incident at a third-party service provider, Graebel Companies. The breach, which occurred in September 2025, was disclosed on November 17. Exposed data includes sensitive PII such as names, Social Security numbers, and financial account information. Merck is offering 24 months of complimentary credit monitoring services to affected individuals.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack"
          ],
          "tags": [
            "Data Breach",
            "Merck",
            "PII",
            "Supply Chain Attack",
            "Third-Party Risk"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-18T15:00:00.000Z"
        },
        {
          "slug": "nsfocus-details-mitigation-of-massive-800-gbps-ddos-attack-on-critical-infrastructure",
          "headline": "NSFOCUS Mitigates Massive 843 Gbps DDoS Attack on Critical Infrastructure",
          "summary": "Security vendor NSFOCUS has detailed its successful effort to mitigate a massive multi-vector DDoS attack that targeted a critical infrastructure operator in October 2025. The attack peaked at an enormous 843.4 Gbps and 73.6 million packets per second, sustaining high volumes for over 30 minutes. The assault was dominated by a UDP flood, accounting for over 600 Gbps of the traffic. NSFOCUS's Cloud DDoS Protection Service successfully filtered over 99.9% of the malicious traffic, keeping the operator's services online.",
          "categories": [
            "Cyberattack",
            "Industrial Control Systems",
            "Threat Intelligence"
          ],
          "tags": [
            "Critical Infrastructure",
            "Cyberattack",
            "DDoS",
            "NSFOCUS",
            "Threat Intelligence",
            "UDP Flood"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-18T15:00:00.000Z"
        },
        {
          "slug": "ransomhouse-ransomware-group-hits-fashion-supplier-fulgar",
          "headline": "RansomHouse Claims Attack on Major Fashion Supplier Fulgar",
          "summary": "The RansomHouse cyber-extortion group has claimed responsibility for a cyberattack against Fulgar, a prominent fabric supplier for major fashion brands like H&M and Adidas. The incident underscores the vulnerability of the global retail supply chain, as attackers compromised sensitive financial and client data. This breach highlights how cybercriminals are increasingly targeting critical third-party vendors to disrupt operations and gain leverage over larger corporate clients.",
          "categories": [
            "Ransomware",
            "Supply Chain Attack",
            "Data Breach"
          ],
          "tags": [
            "Data Extortion",
            "Manufacturing",
            "RansomHouse",
            "Ransomware",
            "Retail",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-18T15:00:00.000Z"
        },
        {
          "slug": "anthropic-uncovers-first-ai-orchestrated-state-sponsored-cyber-espionage-campaign",
          "headline": "AI-Powered Espionage: Chinese Hackers Weaponize Claude LLM in Landmark Attack",
          "summary": "AI safety company Anthropic has uncovered and disrupted the first known cyber espionage campaign orchestrated and largely executed by an AI agent. A Chinese state-sponsored threat actor, designated GTG-1002, weaponized Anthropic's Claude large language model to automate attacks against approximately 30 global organizations in the technology, finance, and manufacturing sectors. The AI agent autonomously conducted reconnaissance, post-exploitation activities, and data exfiltration with minimal human oversight, marking a significant escalation in the use of artificial intelligence in offensive cyber operations. Anthropic detected the activity, banned the accounts, and notified all affected parties.",
          "categories": [
            "Cyberattack",
            "Threat Actor",
            "Threat Intelligence"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "Autonomous Attack",
            "China",
            "Cyber Espionage",
            "LLM",
            "State-Sponsored"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-18T15:00:00.000Z"
        },
        {
          "slug": "google-issues-emergency-patch-for-actively-exploited-chrome-zero-day-flaw",
          "headline": "Google Patches Actively Exploited Chrome Zero-Day Flaw",
          "summary": "Google has issued an emergency security update for the Chrome browser to address a high-severity zero-day vulnerability, CVE-2025-13223. The flaw, a type confusion bug in the V8 JavaScript engine, is confirmed to be actively exploited in the wild. This marks the seventh Chrome zero-day patched by Google in 2025. The vulnerability could allow for arbitrary code execution if a user visits a malicious website. All users are urged to update their browsers to the latest version immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-13223",
            "Google Chrome",
            "Patch Management",
            "RCE",
            "V8",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-18T15:00:00.000Z",
          "cves": [
            "CVE-2025-13223"
          ]
        },
        {
          "slug": "critical-rce-flaw-in-w3-total-cache-wordpress-plugin-endangers-1-million-sites",
          "headline": "Urgent Patch Required: Critical RCE Flaw in W3 Total Cache WordPress Plugin",
          "summary": "A critical command injection vulnerability, CVE-2025-9501, with a CVSS score of 9.0, has been found in the W3 Total Cache WordPress plugin, which is active on over one million websites. The flaw allows unauthenticated attackers to achieve remote code execution (RCE) by simply submitting a malicious comment. This enables a complete site takeover. All versions prior to 2.8.13 are affected, and administrators are urged to update immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-9501",
            "Patch Management",
            "RCE",
            "Vulnerability",
            "W3 Total Cache",
            "WordPress"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-18T15:00:00.000Z",
          "cves": [
            "CVE-2025-9501"
          ]
        },
        {
          "slug": "wordpress-security-plugin-anti-malware-security-has-critical-file-read-flaw",
          "headline": "WordPress Security Plugin Ironically Contains Critical File-Read Flaw",
          "summary": "A critical vulnerability, CVE-2025-11705, has been discovered in the 'Anti-Malware Security and Brute-Force Firewall' WordPress plugin, which is active on over 100,000 sites. The flaw allows any authenticated user, including low-privilege subscribers, to read arbitrary files from the server. This can be exploited to access the sensitive wp-config.php file, leading to a full database compromise and site takeover. Users are urged to update the plugin immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "Arbitrary File Read",
            "CVE-2025-11705",
            "GOTMLS",
            "Patch Management",
            "Vulnerability",
            "WordPress"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-18T15:00:00.000Z",
          "cves": [
            "CVE-2025-11705"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-17",
      "type": "publication-daily",
      "headline": "Jaguar Land Rover Reels from £680M Cyberattack Loss; Cl0p Exploits Oracle Zero-Day in Massive Campaign",
      "articleCount": 10,
      "articles": [
        {
          "slug": "pro-russian-hackers-launch-ddos-attacks-on-danish-government",
          "headline": "Pro-Russian Hackers Target Denmark with DDoS Attacks Ahead of Elections",
          "summary": "The pro-Russian hacktivist group NoName057(16) has claimed responsibility for a series of Distributed Denial-of-Service (DDoS) attacks that targeted Danish government websites, political parties, and defense-related entities. The attacks, which occurred just before Denmark's municipal and regional elections, were designed to cause disruption and informational noise. Targets included the Danish Ministry of Transport and the national citizen portal, Borger.dk. While the outages were brief, the incident aligns with a pattern of politically motivated cyber activity by the group against European nations supporting Ukraine.",
          "categories": [
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "DDoS",
            "Denmark",
            "NoName057(16)",
            "elections",
            "hacktivism",
            "pro-Russian"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "uk-introduces-sweeping-cyber-security-bill-expanding-regulation-to-data-centers-and-msps",
          "headline": "UK Overhauls Cyber Law, Bringing Data Centers and MSPs Under New Regulatory Scrutiny",
          "summary": "The United Kingdom government has published the new Cyber Security and Resilience Bill, a landmark piece of legislation that significantly expands the country's 2018 Network and Information Systems (NIS) Regulations. The bill extends cybersecurity mandates to previously unregulated sectors, designating operators of data centers and Managed Service Providers (MSPs) as 'operators of essential services.' These entities will now face stricter security requirements, mandatory incident reporting within 24 hours, and alignment with the NCSC's Cyber Assessment Framework, backed by enhanced regulatory powers and higher fines for non-compliance.",
          "categories": [
            "Policy and Compliance",
            "Regulatory"
          ],
          "tags": [
            "MSP",
            "NIS regulations",
            "UK",
            "compliance",
            "cybersecurity law",
            "data center",
            "regulation"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "amazon-uncovers-150000-malicious-npm-packages-in-crypto-farming-campaign",
          "headline": "Amazon Finds 150,000 Malicious NPM Packages in Massive Crypto-Farming Scheme",
          "summary": "Security researchers at Amazon have uncovered one of the largest package-flooding incidents in open-source history, identifying over 150,000 malicious packages published to the npm registry. This massive campaign was not designed to spread traditional malware but to abuse the tea.xyz protocol, which rewards open-source contributors with TEA cryptocurrency tokens. Threat actors used automation to publish a flood of non-functional, self-replicating packages to fraudulently farm these tokens, polluting the ecosystem and posing a significant dependency confusion risk to developers.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "Amazon",
            "automation",
            "cryptocurrency",
            "npm",
            "open source",
            "supply chain attack",
            "token farming"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "doordash-discloses-data-breach-after-employee-falls-for-social-engineering-scam",
          "headline": "DoorDash Hit by Data Breach After Employee Targeted in Social Engineering Scam",
          "summary": "Food delivery service DoorDash has confirmed a data breach after an employee was compromised by a social engineering scam, allowing an unauthorized third party to access internal systems. The breach exposed the names, physical addresses, phone numbers, and email addresses of an undisclosed number of customers in the United States, Canada, Australia, and New Zealand. The company has stated that financial information was not accessed. This incident highlights the persistent threat of attackers targeting the 'human element' to bypass technical security controls.",
          "categories": [
            "Data Breach",
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "DoorDash",
            "data breach",
            "human element",
            "phishing",
            "social engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "iranian-apt-spearspecter-targets-officials-families-in-sophisticated-spy-campaign",
          "headline": "Iranian APT 'SpearSpecter' Targets Officials' Families in Sophisticated Espionage Campaign",
          "summary": "The Iranian state-sponsored group APT42, also known by aliases like SpearSpecter, is conducting a highly sophisticated and ongoing espionage campaign targeting senior defense and government officials. According to the Israel National Digital Agency, the threat actors are using advanced social engineering tactics, including building trust over weeks and targeting victims' family members to apply psychological pressure. The campaign's technical core is 'TameCat,' a modular PowerShell-based backdoor that operates in-memory and uses legitimate services like Telegram and Discord for stealthy command-and-control.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT42",
            "Iran",
            "PowerShell",
            "SpearSpecter",
            "TameCat",
            "espionage",
            "social engineering",
            "threat actor"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z",
          "malware": [
            "TameCat"
          ]
        },
        {
          "slug": "fashion-supply-chain-disrupted-as-hm-adidas-supplier-fulgar-hit-by-ransomware",
          "headline": "RansomHouse Hits H&M and Adidas Supplier 'Fulgar' in Fashion Supply Chain Attack",
          "summary": "The global fashion supply chain has been hit by a ransomware attack on Fulgar S.p.A., a major Italian textile manufacturer and key yarn supplier for brands like H&M, Adidas, and Wolford. The RansomHouse cybercrime group has claimed responsibility, posting samples of allegedly stolen data on its dark web leak site and threatening a full release. The attack, detected on November 3, forced Fulgar to shut down systems, highlighting the significant risk posed by single points of failure in the interconnected fashion industry.",
          "categories": [
            "Ransomware",
            "Supply Chain Attack",
            "Data Breach"
          ],
          "tags": [
            "Adidas",
            "H&M",
            "RansomHouse",
            "fashion",
            "manufacturing",
            "ransomware",
            "supply chain attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "cl0p-ransomware-breaches-logitech-via-oracle-e-business-suite-zero-day",
          "headline": "Cl0p Gang Exploits Oracle Zero-Day to Breach Logitech, Washington Post, and More",
          "summary": "The notorious Cl0p cyber extortion gang has orchestrated a massive data breach campaign by exploiting a zero-day vulnerability in Oracle's E-Business Suite (EBS), tracked as CVE-2025-61882. Swiss electronics giant Logitech has confirmed it was a victim, filing a data breach notification with the SEC. The campaign has also compromised other major organizations, including The Washington Post, Allianz UK, and GlobalLogic. Cl0p is known for exploiting vulnerabilities in widely-used enterprise software to simultaneously hit a large number of high-value targets, exfiltrating data for double extortion.",
          "categories": [
            "Data Breach",
            "Vulnerability",
            "Ransomware"
          ],
          "tags": [
            "CVE-2025-61882",
            "Cl0p",
            "Logitech",
            "Oracle",
            "The Washington Post",
            "data breach",
            "ransomware",
            "zero day"
          ],
          "severity": "critical",
          "isUpdate": true,
          "publishedAt": "2025-11-17T15:00:00.000Z",
          "updatedAt": "2025-11-18T12:00:00.000Z",
          "cves": [
            "CVE-2025-61882"
          ]
        },
        {
          "slug": "eurofiber-breach-exposes-data-from-thales-orange-and-french-government",
          "headline": "Eurofiber Breach Exposes Thales, Orange, and French Government Data in Major Supply Chain Incident",
          "summary": "European digital infrastructure provider Eurofiber has confirmed a major data breach in its French division, potentially exposing sensitive data from over 3,600 clients, including major corporations like Thales and Orange, and several French government ministries. A threat actor known as 'ByteToBreach' claims to have exploited vulnerabilities (CVE-2024-29889, CVE-2025-24799) in Eurofiber's GLPI IT asset management software via SQL injection. The stolen data, now for sale on the dark web, allegedly includes highly sensitive information such as SSH private keys, VPN configurations, and API keys, posing a severe supply chain risk.",
          "categories": [
            "Data Breach",
            "Vulnerability",
            "Supply Chain Attack"
          ],
          "tags": [
            "CVE-2025-24799",
            "Eurofiber",
            "France",
            "GLPI",
            "SQL injection",
            "data breach",
            "supply chain attack",
            "vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z",
          "cves": [
            "CVE-2024-29889",
            "CVE-2025-24799"
          ]
        },
        {
          "slug": "jaguar-land-rover-discloses-680-million-loss-from-crippling-cyberattack",
          "headline": "Jaguar Land Rover Reveals Staggering £680 Million Loss from Production-Halting Cyberattack",
          "summary": "Jaguar Land Rover (JLR) has quantified the massive financial fallout from a recent cyberattack, reporting a total impact of £680 million for the quarter ending in September. The incident, believed to be ransomware, forced a complete halt to vehicle production, resulting in a £485 million operational loss and an additional £196 million in direct response costs. The attack created a 'cyber shockwave' that disrupted JLR's vast supply chain, affecting over 5,000 partner organizations and prompting UK government intervention.",
          "categories": [
            "Cyberattack",
            "Ransomware",
            "Supply Chain Attack"
          ],
          "tags": [
            "UK",
            "automotive",
            "economic impact",
            "manufacturing",
            "ransomware",
            "supply chain"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z"
        },
        {
          "slug": "microsoft-patches-actively-exploited-windows-kernel-zero-day-cve-2025-62215",
          "headline": "Microsoft Patches Actively Exploited Windows Kernel Zero-Day in November Update",
          "summary": "As part of its November 2025 Patch Tuesday release, Microsoft has addressed over 60 vulnerabilities, including a zero-day flaw in the Windows Kernel (CVE-2025-62215) that is being actively exploited in the wild. The 'Important' rated vulnerability is a privilege escalation bug that allows a local attacker to gain SYSTEM-level privileges. The update also includes patches for several critical Remote Code Execution (RCE) vulnerabilities, including a 9.8 CVSS flaw in the Windows GDI+ component (CVE-2025-60274), making this a high-priority patch cycle for administrators.",
          "categories": [
            "Patch Management",
            "Vulnerability"
          ],
          "tags": [
            "CVE-2025-62215",
            "Microsoft",
            "Patch Tuesday",
            "RCE",
            "Windows Kernel",
            "vulnerability",
            "zero day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-17T15:00:00.000Z",
          "cves": [
            "CVE-2025-60274",
            "CVE-2025-62199",
            "CVE-2025-62215"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "cl0p-ransomware-breaches-logitech-via-oracle-e-business-suite-zero-day",
        "originalHeadline": "Cl0p Gang Exploits Oracle Zero-Day to Breach Logitech, Washington Post, and More",
        "updateTitle": "Update: Cl0p Gang Exploits Oracle Zero-Day to Breach Logitech, Washington Post, and More",
        "updateSummary": "Logitech confirms 1.8 TB data exfiltration; Harvard University added as new victim in Cl0p Oracle EBS campaign.",
        "categories": [
          "Data Breach",
          "Vulnerability",
          "Ransomware"
        ],
        "tags": [
          "CVE-2025-61882",
          "Cl0p",
          "Logitech",
          "Oracle",
          "The Washington Post",
          "data breach",
          "ransomware",
          "zero day"
        ],
        "cves": [
          "CVE-2025-61882"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-17T15:00:00.000Z",
        "updatedAt": "2025-11-18T12:00:00.000Z"
      },
      {
        "slug": "microsoft-patches-actively-exploited-windows-kernel-flaw",
        "originalHeadline": "Microsoft Patches Actively Exploited Windows Kernel Zero-Day in November Update",
        "updateTitle": "Update: Microsoft Patches Actively Exploited Windows Kernel Zero-Day in November Update",
        "updateSummary": "Update highlights additional critical RCE vulnerabilities, including a 9.8 CVSS flaw in Windows GDI+, and provides enhanced detection guidance.",
        "categories": [
          "Vulnerability",
          "Patch Management"
        ],
        "tags": [
          "CVE-2025-62215",
          "Microsoft",
          "Patch Tuesday",
          "Windows",
          "privilege escalation",
          "vulnerability",
          "zero-day"
        ],
        "cves": [
          "CVE-2025-62215"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-14T15:00:00.000Z",
        "updatedAt": "2025-11-17T12:00:00.000Z"
      },
      {
        "slug": "washington-post-confirms-breach-in-massive-oracle-software-attack",
        "originalHeadline": "Washington Post Breached by Clop Ransomware via Oracle Flaws",
        "updateTitle": "Update: Washington Post Breached by Clop Ransomware via Oracle Flaws",
        "updateSummary": "Clop gang exploited Oracle EBS zero-day CVE-2025-61882, breaching Logitech, Allianz UK, and GlobalLogic, confirming active exploitation for months.",
        "categories": [
          "Ransomware",
          "Data Breach",
          "Cyberattack"
        ],
        "tags": [
          "Clop",
          "Data Breach",
          "E-Business Suite",
          "Extortion",
          "Oracle",
          "Ransomware",
          "TA505"
        ],
        "severity": "high",
        "publishedAt": "2025-11-09T15:00:00.000Z",
        "updatedAt": "2025-11-17T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}