{
  "lastUpdated": "2025-11-04T17:16:24.489Z",
  "runDate": "2025-11-04",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-04",
      "type": "publication-daily",
      "headline": "Insider Threats, Zero-Days, and Ransomware Shake Global Cybersecurity Landscape",
      "articleCount": 10,
      "articles": [
        {
          "slug": "philippine-police-on-high-alert-for-anticipated-ddos-attacks",
          "headline": "Philippine Police Brace for Coordinated DDoS Attacks on Government Websites",
          "summary": "The Philippine National Police (PNP) has mobilized its cybersecurity units and placed them on high alert in anticipation of a potential large-scale distributed denial-of-service (DDoS) campaign targeting government websites. According to intelligence, the attacks are slated to begin on November 5, 2025. The PNP is coordinating with the Department of Information and Communications Technology (DICT) and other national agencies to harden critical digital infrastructure and prepare rapid response teams to mitigate any disruption to public services.",
          "categories": [
            "Cyberattack",
            "Security Operations",
            "Policy and Compliance"
          ],
          "tags": [
            "DDoS",
            "Philippines",
            "alert",
            "cyberattack",
            "government",
            "threat intelligence"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        },
        {
          "slug": "eu-tests-joint-cyber-crisis-response-in-blueolex-2025-exercise",
          "headline": "EU Stress-Tests Cyber Defenses in Large-Scale Crisis Simulation",
          "summary": "The European Union has concluded its 2025 'Blueprint Operational Level Exercise' (BlueOLEx), a large-scale simulation designed to test and improve the bloc's collective response to major cybersecurity crises. Hosted in Cyprus with support from the EU's cybersecurity agency, ENISA, the exercise brought together senior officials from all member states to role-play a significant cyber incident affecting critical sectors. The drill was the first to test the new EU Cyber Blueprint, which aims to clarify roles and streamline coordination between national authorities and the European Commission during a cross-border attack.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Security Operations"
          ],
          "tags": [
            "BlueOLEx",
            "ENISA",
            "EU",
            "NIS 2",
            "crisis response",
            "cyber exercise",
            "policy"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        },
        {
          "slug": "dragonforce-ransomware-emerges-from-leaked-conti-code-with-cartel-model",
          "headline": "Conti's Ghost: New 'DragonForce' Ransomware Adopts Cartel Model",
          "summary": "A new ransomware operation named DragonForce has been identified by security researchers, notable for its use of leaked source code from the infamous Conti ransomware. Instead of a traditional Ransomware-as-a-Service (RaaS) model, DragonForce operates with a 'cartel-like' structure, providing affiliates with a builder to create their own branded ransomware variants. This approach facilitates the rapid proliferation of new threats, with groups like 'Devman' already seen deploying malware created with the DragonForce builder. The core malware retains Conti's technical features, including its encryption scheme and ability to spread via SMB.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "Conti",
            "DragonForce",
            "RaaS",
            "cartel",
            "malware",
            "ransomware",
            "source code leak"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        },
        {
          "slug": "everest-ransomware-claims-attacks-on-att-dublin-airport-and-svenska-kraftnat",
          "headline": "Everest Ransomware Claims Hits on AT&T, Dublin Airport, and Swedish Power Grid",
          "summary": "The Everest ransomware group has made bold claims of responsibility for a series of high-profile cyberattacks, alleging the theft of massive amounts of data from major international entities. The targets reportedly include U.S. telecom giant AT&T, Dublin Airport, the airline Air Arabia, and Sweden's power grid operator, Svenska kraftn채t. The group claims to have exfiltrated millions of customer and employee records and hundreds of gigabytes of internal data, highlighting a focus on critical infrastructure and data-rich organizations.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Everest",
            "aviation",
            "critical infrastructure",
            "data exfiltration",
            "energy",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        },
        {
          "slug": "us-homeland-security-warns-of-rising-cyber-threats-amid-shutdown",
          "headline": "Homeland Security Warns Gov't Shutdown and Lapsed Law Cripple U.S. Cyber Defenses",
          "summary": "The U.S. House Committee on Homeland Security has issued a stark warning in its latest 'Cyber Threat Snapshot,' stating that the nation's ability to defend against cyber threats is being severely hampered. The report cites a dual crisis: a federal government shutdown that furloughs key cybersecurity personnel, and the lapse of the Cybersecurity Information Sharing Act of 2015. This creates 'dangerous blind spots' at a time of heightened threat activity from nation-state actors like China and Iran, and a surge in attacks against U.S. critical infrastructure.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "CISA",
            "Homeland Security",
            "critical infrastructure",
            "government shutdown",
            "information sharing",
            "nation-state",
            "policy"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        },
        {
          "slug": "cybersecurity-professionals-indicted-for-blackcat-ransomware-attacks",
          "headline": "Insider Threat: Cybersecurity Pros Charged in BlackCat Ransomware Spree",
          "summary": "In a shocking case of insider threat, U.S. federal prosecutors have indicted two cybersecurity professionals, Ryan Clifford Goldberg and Kevin Tyler Martin, for their role in a series of ALPHV/BlackCat ransomware attacks. The individuals, who worked in incident response and ransomware negotiation, allegedly used their specialized knowledge to extort at least five U.S. companies between May and November 2023. The attacks targeted organizations across multiple sectors, including healthcare and manufacturing, with one victim paying over $1.2 million in ransom. This case highlights the grave risks posed by malicious insiders within the cybersecurity industry itself.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Data Breach"
          ],
          "tags": [
            "ALPHV",
            "BlackCat",
            "DOJ",
            "extortion",
            "incident response",
            "insider threat",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z",
          "malware": [
            "ALPHV/BlackCat"
          ]
        },
        {
          "slug": "cl0p-ransomware-exploits-oracle-e-business-suite-zero-day-cve-2025-61882",
          "headline": "Cl0p Ransomware Exploits Oracle E-Business Suite Zero-Day, Hits Major Corporations",
          "summary": "The notorious Cl0p ransomware gang is the primary suspect behind a new wave of attacks exploiting a zero-day remote code execution (RCE) vulnerability in Oracle E-Business Suite. The flaw, tracked as CVE-2025-61882, affects the Oracle Concurrent Processing component and has allegedly been used to breach several major corporations. Victims include mining company Pan American Silver, energy giant Schneider Electric, and communications conglomerate Cox Enterprises. Data from the latter two has already been leaked on Cl0p's dark web site, demonstrating the group's continued proficiency in weaponizing zero-day vulnerabilities in enterprise software.",
          "categories": [
            "Ransomware",
            "Vulnerability",
            "Data Breach"
          ],
          "tags": [
            "Cl0p",
            "E-Business Suite",
            "Oracle",
            "RCE",
            "ransomware",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z",
          "cves": [
            "CVE-2025-61882"
          ]
        },
        {
          "slug": "critical-rce-vulnerability-in-react-native-npm-package-cve-2025-11953",
          "headline": "Millions of Devs at Risk: Critical RCE Flaw in Popular React Native Package",
          "summary": "A critical remote code execution (RCE) vulnerability, CVE-2025-11953, has been discovered in a popular React Native command-line tool, putting millions of developers at risk. The flaw, rated 9.8 on the CVSS scale, exists in the '@react-native-community/cli' NPM package and allows an unauthenticated attacker to execute arbitrary code on a developer's machine by sending a malicious request to the Metro development server. This could lead to source code theft, malware injection, or a full-blown supply chain attack. Meta has released a patch, and developers are strongly urged to update their dependencies.",
          "categories": [
            "Vulnerability",
            "Supply Chain Attack",
            "Patch Management"
          ],
          "tags": [
            "NPM",
            "RCE",
            "React Native",
            "developer security",
            "supply chain",
            "vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z",
          "cves": [
            "CVE-2025-11953"
          ]
        },
        {
          "slug": "critical-android-zero-click-rce-flaw-cve-2025-48593",
          "headline": "Patch Now: Critical Zero-Click RCE Flaw Hits Billions of Android Devices",
          "summary": "Google's November 2025 Android Security Bulletin has put users on high alert with the disclosure of CVE-2025-48593, a critical zero-click remote code execution (RCE) vulnerability. The flaw, residing in the Android System component, affects Android versions 13, 14, 15, and 16. Its most dangerous characteristic is that it can be exploited remotely without any user interaction, potentially allowing an attacker to take full control of a device. Google has released patches, and users are urged to update their devices to the 2025-11-01 security patch level or later immediately.",
          "categories": [
            "Vulnerability",
            "Mobile Security",
            "Patch Management"
          ],
          "tags": [
            "Android",
            "RCE",
            "mobile security",
            "patch management",
            "vulnerability",
            "zero-click"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z",
          "cves": [
            "CVE-2025-48581",
            "CVE-2025-48593"
          ]
        },
        {
          "slug": "sk-telecom-profits-plummet-90-percent-after-massive-data-breach",
          "headline": "SK Telecom Profit Plummets 90% After Data Breach Hits 27M Customers",
          "summary": "South Korean telecommunications giant SK Telecom has suffered a catastrophic financial blow, reporting a 90% drop in its third-quarter operating profit. The dramatic decline is a direct result of a massive data breach disclosed in April, which compromised the sensitive personal data of approximately 27 million customers. The costs, stemming from a record regulatory fine of $96.5 million and a $349 million 'customer appreciation package,' underscore the devastating and long-lasting financial consequences of major cybersecurity failures.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Regulatory"
          ],
          "tags": [
            "APT",
            "South Korea",
            "data breach",
            "dwell time",
            "financial impact",
            "telecom"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-04T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-03",
      "type": "publication-daily",
      "headline": "Chinese APT 'Airstalk' Malware Targets BPO Supply Chains; Insider Threats and Cl0p Zero-Day Exploits Escalate",
      "articleCount": 10,
      "articles": [
        {
          "slug": "china-amends-cybersecurity-law-massively-increasing-penalties",
          "headline": "China Amends Cybersecurity Law, Massively Increasing Fines and Adding AI Governance Clause",
          "summary": "China has passed major amendments to its 2016 Cybersecurity Law, set to take effect on January 1, 2026. The changes dramatically increase financial penalties for non-compliance, raising the maximum fine for Critical Information Infrastructure Operators (CIIOs) tenfold to RMB 10 million (approx. $1.41M) and for non-CIIOs to RMB 2 million. The amendments also introduce a new, general clause on Artificial Intelligence governance, signaling tighter regulatory control over technology and data security within the country.",
          "categories": [
            "Policy and Compliance",
            "Regulatory"
          ],
          "tags": [
            "AI",
            "CIIO",
            "China",
            "Compliance",
            "Cybersecurity Law",
            "Data Privacy",
            "Regulation"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-03T15:00:00.000Z"
        },
        {
          "slug": "europe-is-2-global-ransomware-target-attacks-accelerating-crowdstrike-report",
          "headline": "Europe Now #2 Global Ransomware Target, Attacks Accelerating to 24-Hour Deployments",
          "summary": "Europe is now the second-largest global target for ransomware, accounting for 22% of all victims, according to CrowdStrike's 2025 European Threat Landscape Report. The report highlights a dramatic increase in attack speed, with groups like SCATTERED SPIDER now able to deploy ransomware in just 24 hours from initial access. The threat is fueled by a thriving initial access broker (IAB) market and escalating geopolitical tensions involving Russian, Chinese, and North Korean state-sponsored actors targeting critical sectors.",
          "categories": [
            "Threat Intelligence",
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "CrowdStrike",
            "Europe",
            "Geopolitics",
            "Ransomware",
            "SCATTERED SPIDER",
            "Threat Intelligence",
            "Threat Report"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-03T15:00:00.000Z"
        },
        {
          "slug": "chinese-apt-airstalk-malware-bpo-supply-chain-attacks",
          "headline": "Chinese APT 'Airstalk' Malware Abuses MDM APIs in BPO Supply Chain Attacks",
          "summary": "A new malware family named 'Airstalk', attributed to the suspected Chinese state-sponsored group CL-STA-1009, is being used in sophisticated supply chain attacks against the Business Process Outsourcing (BPO) industry. The malware, with both PowerShell and .NET variants, uniquely abuses the AirWatch/Workspace ONE MDM API for covert command-and-control (C2) communications and data exfiltration. It is designed for long-term persistence and targets browser data from Chrome, Edge, and the Island Browser, posing a significant risk of access to BPO clients' systems.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Supply Chain Attack"
          ],
          "tags": [
            ".NET",
            "APT",
            "AirWatch",
            "Airstalk",
            "BPO",
            "CL-STA-1009",
            "MDM",
            "PowerShell",
            "Supply Chain Attack",
            "Workspace ONE"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-03T15:00:00.000Z",
          "malware": [
            "Airstalk"
          ]
        },
        {
          "slug": "everest-ransomware-group-claims-multiple-high-profile-breaches",
          "headline": "Everest Ransomware Claims Massive Data Breaches at AT&T, Dublin Airport, and Swedish Power Grid",
          "summary": "The Everest ransomware group has claimed responsibility for a series of high-profile cyberattacks, alleging the theft of vast amounts of data. Victims reportedly include AT&T (576,000 applicant records), Dublin Airport (1.5 million passenger files), Air Arabia (18,000 employee records), and, most critically, Sweden's national power grid operator, Svenska kraftn채t (280 GB of internal data). These unverified claims highlight a significant and widespread threat to critical infrastructure and major multinational corporations.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Industrial Control Systems"
          ],
          "tags": [
            "AT&T",
            "Aviation",
            "Critical Infrastructure",
            "Data Breach",
            "Everest",
            "Ransomware",
            "Svenska kraftn채t"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-03T15:00:00.000Z"
        },
        {
          "slug": "incident-responders-indicted-for-alphv-blackcat-ransomware-attacks",
          "headline": "Insider Threat Shocker: Cybersecurity Pros Indicted for Wielding ALPHV/BlackCat Ransomware",
          "summary": "In a severe breach of trust, two cybersecurity professionals, Ryan Clifford Goldberg and Kevin Tyler Martin, have been indicted for allegedly conducting ALPHV/BlackCat ransomware attacks against at least five U.S. companies. The individuals, who held roles in incident response and ransomware negotiation, are accused of conspiring to extort nearly $1.3 million from a Florida medical company. This case highlights a critical insider threat risk within the cybersecurity industry itself, where trusted professionals abuse their knowledge and access for criminal gain.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Incident Response"
          ],
          "tags": [
            "ALPHV",
            "BlackCat",
            "Cybersecurity Ethics",
            "Incident Response",
            "Indictment",
            "Insider Threat",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-03T15:00:00.000Z",
          "malware": [
            "ALPHV / BlackCat"
          ]
        },
        {
          "slug": "microsoft-uncovers-sesameop-backdoor-using-openai-api-for-c2",
          "headline": "Microsoft Discovers 'SesameOp' Backdoor Using OpenAI API for Covert C2",
          "summary": "Microsoft's Detection and Response Team (DART) has discovered a novel backdoor named 'SesameOp' that uniquely uses the OpenAI Assistants API for its command-and-control (C2) communications. Found during an espionage investigation, the malware hides its malicious traffic within legitimate API calls to the OpenAI platform, making it extremely difficult to detect. The attackers also used .NET AppDomainManager injection by compromising Microsoft Visual Studio utilities to achieve persistence.",
          "categories": [
            "Malware",
            "Threat Actor",
            "Cloud Security"
          ],
          "tags": [
            "API",
            "AppDomainManager",
            "Backdoor",
            "C2",
            "Espionage",
            "Malware",
            "Microsoft",
            "OpenAI",
            "SesameOp"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-03T15:00:00.000Z",
          "malware": [
            "SesameOp"
          ]
        },
        {
          "slug": "sk-telecom-profit-drops-90-percent-after-massive-data-breach",
          "headline": "SK Telecom Profit Plummets 90% Following Massive Data Breach Affecting 27 Million Customers",
          "summary": "South Korean telecom giant SK Telecom has reported a catastrophic 90% drop in its Q3 operating profit, directly attributing the loss to the massive costs of a data breach that exposed the personal data of 27 million customers. The breach, which went undetected for nearly three years, involved 25 different malware types and led to a record $96.5 million (134 billion won) fine from regulators. This incident serves as a stark illustration of the severe and tangible financial consequences of long-term cybersecurity failures and inadequate threat detection.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Regulatory"
          ],
          "tags": [
            "Data Breach",
            "Dwell Time",
            "Financial Impact",
            "SK Telecom",
            "South Korea",
            "Telecommunications"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-03T15:00:00.000Z"
        },
        {
          "slug": "linkedin-dm-phishing-attacks-abuse-google-microsoft-services",
          "headline": "Sophisticated Phishing Attacks on LinkedIn Bypass MFA Using Google & Microsoft Redirects",
          "summary": "A sophisticated phishing campaign is using LinkedIn direct messages to initiate attacks that steal Microsoft session tokens, effectively bypassing multi-factor authentication (MFA). The attack leverages a complex redirect chain using trusted services like Google Sites, Firebase, and Microsoft Dynamics to evade detection before presenting an adversary-in-the-middle (AiTM) phishing page. This page is further protected by a Cloudflare Turnstile challenge, hindering automated analysis and increasing the campaign's success rate.",
          "categories": [
            "Phishing",
            "Cyberattack",
            "Cloud Security"
          ],
          "tags": [
            "AiTM",
            "Cloudflare",
            "Google",
            "LinkedIn",
            "MFA Bypass",
            "Microsoft",
            "Phishing",
            "Session Hijacking"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-03T15:00:00.000Z"
        },
        {
          "slug": "unpatched-windows-lnk-flaw-cve-2025-9491-actively-exploited",
          "headline": "Unpatched Windows LNK Flaw (CVE-2025-9491) Actively Exploited by APTs to Deploy PlugX",
          "summary": "A long-standing and unpatched vulnerability in how Windows handles .LNK shortcut files (CVE-2025-9491) is being actively exploited by threat actors, including the APT group UNC6384, to deliver the PlugX RAT. The flaw allows attackers to hide malicious commands within a shortcut's properties, tricking users into execution. Despite ongoing exploitation and a public disclosure in March 2025, Microsoft has reiterated its position not to issue a direct patch, instead advising customers to rely on existing defenses like Microsoft Defender and to avoid opening files from unknown sources.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "APT",
            "CVE-2025-9491",
            "LNK",
            "PlugX",
            "UNC6384",
            "Unpatched",
            "Windows",
            "Zero Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-03T15:00:00.000Z",
          "cves": [
            "CVE-2025-9491"
          ],
          "malware": [
            "PlugX"
          ]
        },
        {
          "slug": "cl0p-ransomware-exploits-oracle-zero-day-cve-2025-61882",
          "headline": "Cl0p Ransomware Exploits Oracle E-Business Suite Zero-Day in Attacks on Major Corporations",
          "summary": "The Cl0p ransomware group is actively exploiting a zero-day remote code execution vulnerability (CVE-2025-61882) in Oracle's E-Business Suite. The attacks have targeted major corporations including Schneider Electric, Cox Enterprises, and Pan American Silver Corp, with data from the first two already leaked on Cl0p's extortion site. This campaign underscores the group's continued strategy of leveraging unpatched flaws in critical, widely-used enterprise software for initial access and data exfiltration.",
          "categories": [
            "Ransomware",
            "Vulnerability",
            "Threat Actor"
          ],
          "tags": [
            "CVE-2025-61882",
            "Cl0p",
            "E-Business Suite",
            "Oracle",
            "RCE",
            "Ransomware",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-03T15:00:00.000Z",
          "cves": [
            "CVE-2025-61882"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "key-us-cyber-information-sharing-law-expires-sparking-concerns",
        "originalHeadline": "US Cyber Threat Sharing Law 'CISA 2015' Expires, Creating Potential Intelligence Gap",
        "updateTitle": "Update: US Cyber Threat Sharing Law 'CISA 2015' Expires, Creating Potential Intelligence Gap",
        "updateSummary": "House Committee warns US cyber defenses crippled by CISA 2015 lapse & government shutdown, citing increased nation-state threats and AI-driven attacks.",
        "categories": [
          "Policy and Compliance",
          "Regulatory",
          "Threat Intelligence"
        ],
        "tags": [
          "CISA",
          "US government",
          "cybersecurity law",
          "information sharing",
          "policy",
          "threat intelligence"
        ],
        "severity": "medium",
        "publishedAt": "2025-10-10T15:00:00.000Z",
        "updatedAt": "2025-11-04T00:00:00.000Z"
      },
      {
        "slug": "clop-ransomware-exploits-oracle-e-business-suite-zero-day",
        "originalHeadline": "Cl0p Ransomware Exploits Oracle EBS Zero-Day in Active Attacks",
        "updateTitle": "Update: Cl0p Ransomware Exploits Oracle EBS Zero-Day in Active Attacks",
        "updateSummary": "New major corporate victims identified, including Schneider Electric and Cox Enterprises, with confirmed data leaks on Cl0p's site.",
        "categories": [
          "Vulnerability",
          "Ransomware",
          "Threat Actor"
        ],
        "tags": [
          "CVE-2025-61882",
          "Cl0p",
          "E-Business Suite",
          "Oracle",
          "RCE",
          "Ransomware",
          "Zero-day"
        ],
        "cves": [
          "CVE-2025-61882"
        ],
        "malware": [
          "Cl0p Ransomware"
        ],
        "severity": "critical",
        "publishedAt": "2025-10-20T15:00:00.000Z",
        "updatedAt": "2025-11-03T12:00:00.000Z"
      },
      {
        "slug": "swedish-power-grid-operator-svenska-kraftnat-hit-by-everest-ransomware",
        "originalHeadline": "Everest Ransomware Hits Swedish Power Grid Operator, Steals 280GB of Data",
        "updateTitle": "Update: Everest Ransomware Hits Swedish Power Grid Operator, Steals 280GB of Data",
        "updateSummary": "Everest ransomware claims multiple new victims including AT&T and Dublin Airport, placing Svenska kraftn채t breach within a wider campaign.",
        "categories": [
          "Cyberattack",
          "Data Breach",
          "Industrial Control Systems"
        ],
        "tags": [
          "Critical Infrastructure",
          "Data Breach",
          "Energy Sector",
          "Everest",
          "ICS",
          "Ransomware",
          "Sweden"
        ],
        "severity": "high",
        "publishedAt": "2025-10-28T15:00:00.000Z",
        "updatedAt": "2025-11-03T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}