{
  "lastUpdated": "2026-02-02T16:42:54.818Z",
  "runDate": "2026-02-02",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-02-02",
      "type": "publication-daily",
      "headline": "Russian Hackers Target Polish Grid, Multiple Supply Chain Attacks, and Two Critical Zero-Days Under Active Exploitation",
      "articleCount": 12,
      "articles": [
        {
          "slug": "new-pulsar-rat-windows-malware-uses-in-memory-execution",
          "headline": "New \"Pulsar RAT\" Evades Detection with In-Memory Execution and LoTL Techniques",
          "summary": "Security researchers have uncovered a new, stealthy Remote Access Trojan (RAT) targeting Windows systems, named 'Pulsar RAT'. This modular, .NET-based malware utilizes a multi-stage infection chain that heavily relies on in-memory execution and living-off-the-land techniques to evade detection. It features advanced anti-analysis capabilities, including anti-VM and anti-debugging checks. Once active, Pulsar RAT provides operators with live, interactive control for credential harvesting and data exfiltration, using legitimate services like Discord and Telegram for command-and-control.",
          "categories": [
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            ".NET",
            "Discord",
            "RAT",
            "Telegram",
            "in-memory",
            "living-off-the-land",
            "malware"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "malware": [
            "Pulsar RAT"
          ]
        },
        {
          "slug": "malicious-chatgpt-chrome-extensions-hijack-user-sessions",
          "headline": "Warning: Malicious ChatGPT Chrome Extensions Steal Session Tokens to Hijack Accounts",
          "summary": "Researchers have identified 16 malicious Google Chrome extensions that masquerade as helpful tools for OpenAI's ChatGPT. Once installed, these extensions inject malicious scripts into the ChatGPT web application. The scripts are designed to monitor outbound requests, intercept sensitive data such as authorization details and session tokens, and exfiltrate them to an attacker-controlled server. This allows the attackers to hijack active user sessions, granting them full access to the victim's account and chat history.",
          "categories": [
            "Malware",
            "Phishing",
            "Cloud Security"
          ],
          "tags": [
            "ChatGPT",
            "Chrome",
            "browser extension",
            "data theft",
            "malware",
            "session hijacking"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "law-enforcement-cracks-down-on-black-basta-ransomware-group",
          "headline": "Law Enforcement Closes In on Black Basta Ransomware Group Members",
          "summary": "In January 2026, a coordinated international law enforcement effort targeted key operators of the Black Basta ransomware group. Ukrainian police conducted searches at the homes of two suspected 'hash-crackers' for the gang, seizing digital evidence. Simultaneously, German federal police publicly identified and issued a warrant for a key member, Oleg Evgenievich Nefedov, who has been added to Europol's EU Most Wanted list. These actions follow the 2025 collapse and internal data leak of the group, which had amassed over $107 million in ransom payments.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Regulatory"
          ],
          "tags": [
            "Black Basta",
            "Europol",
            "Germany",
            "Ukraine",
            "law enforcement",
            "ransomware",
            "takedown"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "forescout-report-details-rise-in-ot-and-iot-attacks",
          "headline": "OT/IoT Attacks Surge, with 84% Increase in OT Protocol Exploits, Forescout Reports",
          "summary": "A new threat report from Forescout Vedere Labs, analyzing over 900 million attacks throughout 2025, reveals a dramatic increase in attacks targeting Operational Technology (OT) and the Internet of Things (IoT). The report highlights an 84% year-over-year increase in attacks leveraging OT-specific protocols, with Modbus being the most abused. Exploitation of IoT devices like IP cameras also grew. Critically, the report found that 71% of vulnerabilities exploited in the wild were not listed in CISA's Known Exploited Vulnerabilities (KEV) catalog, complicating prioritization for defenders.",
          "categories": [
            "Industrial Control Systems",
            "IoT Security",
            "Threat Intelligence"
          ],
          "tags": [
            "Forescout",
            "IoT",
            "KEV",
            "Modbus",
            "OT",
            "critical infrastructure",
            "threat report",
            "vulnerability management"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "over-80-percent-of-email-scams-now-use-ai-catalan-agency-warns",
          "headline": "Over 80% of Malicious Emails Now Use AI, Catalan Agency Warns",
          "summary": "A new report from the Catalan Cybersecurity Agency has issued a stark warning about the weaponization of artificial intelligence in phishing attacks. According to their 'Cybersecurity Outlook Report for 2026,' a staggering 82.6% of emails containing malicious links are now crafted using generative AI. The agency's director, Laura Caballero, stated that AI makes scams 'much more sophisticated' and 'almost perfect,' significantly lowering the bar for criminals and making fraudulent emails harder for the average user to detect. The agency advocates for using AI-powered defenses to combat the threat.",
          "categories": [
            "Phishing",
            "Threat Intelligence",
            "Policy and Compliance"
          ],
          "tags": [
            "AI",
            "email security",
            "generative AI",
            "phishing",
            "scams",
            "threat intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "redkitten-campaign-uses-ai-assisted-malware-to-target-iranian-activists",
          "headline": "\"RedKitten\" Campaign Deploys AI-Assisted Malware Against Iranian Activists",
          "summary": "A new cyber-espionage campaign in 2026, dubbed 'RedKitten,' has been identified targeting Iranian activists and non-governmental organizations (NGOs). The campaign is notable for using malware that shows signs of being developed with assistance from Large Language Models (LLMs). The attack delivers a C# implant called 'SloppyMIO' via password-protected Excel spreadsheets. The malware is highly sophisticated, using Telegram for C2, leveraging GitHub and Google Drive for payload hosting, and employing steganography to hide its configuration.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Phishing"
          ],
          "tags": [
            "AI-generated malware",
            "Iran",
            "LLM",
            "RedKitten",
            "SloppyMIO",
            "cyber-espionage",
            "steganography"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "malware": [
            "SloppyMIO"
          ]
        },
        {
          "slug": "moltbook-ai-social-network-breach-exposes-1-5-million-api-keys",
          "headline": "AI Social Network \"Moltbook\" Breach Exposes 1.5M API Keys and 29k User Emails",
          "summary": "A significant data breach at the AI-focused social network 'Moltbook' has exposed 1.5 million API keys, 29,000 user emails, and other sensitive data tables. The investigation, conducted by security firm Wiz, not only uncovered the data exposure but also revealed systemic security flaws, such as a lack of rate-limiting on agent registration. The breach also provided a skewed insight into the platform's user base, showing that its 1.5 million 'agents' were owned by only 17,000 human users. Moltbook has since deployed fixes to secure the exposed data.",
          "categories": [
            "Data Breach",
            "Cloud Security"
          ],
          "tags": [
            "AI",
            "API security",
            "Wiz",
            "data breach",
            "misconfiguration",
            "rate limiting",
            "social media"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "open-vsx-marketplace-compromised-to-spread-glassworm-malware",
          "headline": "Open VSX Marketplace Hit by Supply Chain Attack Spreading \"GlassWorm\" Malware",
          "summary": "On January 30, 2026, the Open VSX Registry, a popular marketplace for Visual Studio Code extensions, fell victim to a supply chain attack. Threat actors compromised the account of a legitimate developer, 'oorzc', and published malicious updates to four of their popular extensions. These updates embedded the 'GlassWorm' malware loader. The compromised extensions had been downloaded over 22,000 times, exposing a large number of developers to the malware before the malicious versions were removed by the Open VSX security team.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "GlassWorm",
            "Open VSX",
            "VS Code",
            "developer tools",
            "malware loader",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "malware": [
            "GlassWorm"
          ]
        },
        {
          "slug": "russian-linked-sandworm-targets-polish-energy-grid-with-wiper-malware",
          "headline": "Sandworm's Failed Wiper Attack on Polish Grid Highlights Critical Infrastructure Risk",
          "summary": "On December 29, 2025, the Russian-linked threat actor Sandworm launched a coordinated destructive cyberattack against approximately 30 Polish renewable energy facilities and a manufacturing company. The attackers exploited vulnerable internet-exposed Fortinet FortiGate devices that used default credentials and lacked MFA. After gaining access, they deployed wiper malware, including DynoWiper and LazyWiper, with the intent to cause widespread damage. While the attack was thwarted by EDR software at a major combined heat and power (CHP) plant and ultimately failed to disrupt the power grid, it caused permanent damage to some Industrial Control System (ICS) devices and underscored the significant risk of cyberattacks against distributed energy resources.",
          "categories": [
            "Industrial Control Systems",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "Fortinet",
            "ICS",
            "OT security",
            "Sandworm",
            "critical infrastructure",
            "default credentials",
            "state-sponsored",
            "wiper malware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "malware": [
            "DynoWiper",
            "LazyWiper"
          ]
        },
        {
          "slug": "escan-antivirus-update-servers-compromised-in-supply-chain-attack",
          "headline": "eScan Antivirus Update Servers Hijacked to Push Malware in Supply Chain Attack",
          "summary": "On January 20, 2026, the update infrastructure of eScan antivirus, a product by Indian firm MicroWorld Technologies, was compromised in a sophisticated supply chain attack. For a two-hour period, threat actors used a regional update server to push a malicious file named 'Reload.exe' to a subset of enterprise and consumer customers. This file acted as a multi-stage downloader designed to establish persistence, enable remote access, and disable the antivirus product's own protective features. MicroWorld Technologies has since isolated the affected servers and released a patch to remediate the issue.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "MicroWorld",
            "antivirus",
            "downloader",
            "eScan",
            "malware delivery",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "fortinet-patches-critical-forticloud-sso-zero-day-cve-2026-24858",
          "headline": "Fortinet Scrambles to Patch Actively Exploited SSO Zero-Day in FortiGate Firewalls",
          "summary": "Fortinet is urgently rolling out patches for a critical zero-day vulnerability, CVE-2026-24858, that affects the FortiCloud single sign-on (SSO) functionality in FortiGate firewalls. The flaw is being actively exploited in the wild. On January 20th, multiple customers reported that attackers had successfully exploited the vulnerability to gain unauthorized access to their firewalls and create new local administrator accounts. The attacks were successful even on devices running the latest firmware, confirming it as a zero-day. All administrators are urged to patch immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CVE-2026-24858",
            "FortiGate",
            "Fortinet",
            "KEV",
            "SSO",
            "firewall",
            "patch",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "cves": [
            "CVE-2026-24858"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-office-zero-day-cve-2026-21509",
          "headline": "Microsoft Issues Emergency Patch for Actively Exploited Office Zero-Day (CVE-2026-21509)",
          "summary": "Microsoft has released an emergency, out-of-band security update to address a zero-day vulnerability in Microsoft Office and Microsoft 365, tracked as CVE-2026-21509. The flaw is a security feature bypass that allows an attacker to circumvent OLE (Object Linking and Embedding) protections by tricking a user into opening a specially crafted file. Microsoft has confirmed that the vulnerability is being actively exploited in targeted attacks in the wild. All users are urged to apply the updates immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2026-21509",
            "KEV",
            "Microsoft Office",
            "OLE",
            "patch",
            "security feature bypass",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "cves": [
            "CVE-2026-21509"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-02-01",
      "type": "publication-daily",
      "headline": "Ivanti Zero-Days Under Active Attack as Polish Energy Grid Hit by Destructive Wiper Malware",
      "articleCount": 12,
      "articles": [
        {
          "slug": "whisperpair-bluetooth-flaw-exposes-millions-of-audio-devices",
          "headline": "'WhisperPair' Bluetooth Flaw Exposes Millions of Headphones and Speakers to Eavesdropping",
          "summary": "A newly discovered vulnerability named 'WhisperPair' affects millions of Bluetooth audio devices from major brands, including Sony, JBL, and Logitech. The flaw allows a nearby attacker to bypass standard Bluetooth pairing security protocols. Successful exploitation could enable an attacker to eavesdrop on private audio streams or inject malicious audio commands into the connected device. This discovery highlights significant security and privacy risks in widely used consumer electronics and the persistent challenges of securing wireless communication protocols.",
          "categories": [
            "Vulnerability",
            "IoT Security",
            "Mobile Security"
          ],
          "tags": [
            "Bluetooth",
            "Eavesdropping",
            "IoT",
            "JBL",
            "Logitech",
            "Privacy",
            "Sony",
            "Vulnerability",
            "WhisperPair"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-01T15:00:00.000Z"
        },
        {
          "slug": "automated-extortion-attacks-wipe-exposed-mongodb-databases",
          "headline": "Automated Attacks Wipe Exposed MongoDB Databases, Demanding $500 Ransom",
          "summary": "An automated data extortion campaign is actively targeting publicly exposed and misconfigured MongoDB databases. A threat actor is systematically wiping data from these unsecured servers and leaving a ransom note demanding approximately $500 in Bitcoin for its return. Research from Flare identified over 3,100 MongoDB instances accessible without authentication, with nearly half (1,400) already compromised by this attacker. This campaign highlights the persistent threat of automated scanning and exploitation of basic security misconfigurations, demonstrating that even with lower ransom demands, such attacks remain a profitable venture for criminals preying on low-hanging fruit.",
          "categories": [
            "Cyberattack",
            "Data Breach",
            "Cloud Security"
          ],
          "tags": [
            "Data Breach",
            "Database Security",
            "Extortion",
            "Misconfiguration",
            "MongoDB"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-01T15:00:00.000Z"
        },
        {
          "slug": "fallout-from-2024-trizetto-data-breach-expands-to-oregon-residents",
          "headline": "Long-Tail of TriZetto Breach: More Oregon Residents Notified of 2024 PHI Exposure",
          "summary": "The consequences of a major 2024 data breach at healthcare insurance verification provider TriZetto Provider Solutions (TPS) are still expanding, with thousands more residents in Oregon now receiving notification letters. The original breach, which occurred in November 2024, involved an intruder accessing sensitive protected health information (PHI) on TriZetto's network. The company did not discover the intrusion for nearly a year. This latest wave of notifications highlights the long and complex tail of supply chain breaches in the healthcare sector and the prolonged risk of identity theft and fraud faced by patients whose data was compromised.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Regulatory"
          ],
          "tags": [
            "Data Breach",
            "HIPAA",
            "Healthcare",
            "PHI",
            "Supply Chain Attack",
            "TriZetto"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-01T15:00:00.000Z"
        },
        {
          "slug": "iran-linked-redkitten-campaign-targets-human-rights-ngos",
          "headline": "New Iran-Linked 'RedKitten' Group Targets Human Rights NGOs with AI-Suspected Malware",
          "summary": "A new cyber-espionage campaign by a Farsi-speaking threat actor dubbed 'RedKitten' is targeting human rights NGOs and activists documenting abuses in Iran. The campaign, observed by HarfangLab in January 2026, uses phishing emails with macro-laced Excel files as an initial vector. The malware is notable for its modularity and its use of legitimate public services like GitHub, Google Drive, and Telegram for C2 and payload delivery, a technique to evade detection. Researchers suspect the attackers may have used Large Language Models (LLMs) to assist in the development of their sophisticated tooling, marking a potential new trend in malware creation.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Phishing"
          ],
          "tags": [
            "AI",
            "Espionage",
            "Iran",
            "Malware",
            "NGO",
            "Phishing",
            "RedKitten",
            "Telegram"
          ],
          "severity": "medium",
          "isUpdate": true,
          "publishedAt": "2026-02-01T15:00:00.000Z",
          "updatedAt": "2026-02-02T12:00:00.000Z"
        },
        {
          "slug": "mentoring-platform-ustrive-exposes-data-of-238000-users-including-minors",
          "headline": "UStrive Mentoring Platform Exposes Data of 238,000 Users, Including Minors, via Leaky API",
          "summary": "The non-profit mentoring platform UStrive has inadvertently exposed the sensitive personal data of over 238,000 users due to a misconfigured GraphQL API endpoint. A significant portion of the exposed user base includes minors, elevating the severity and privacy implications of the incident. The leaky API could have allowed unauthorized individuals to query and retrieve vast amounts of user data. This breach highlights the critical need for robust cybersecurity practices and secure API implementation, particularly for organizations in the non-profit sector that handle sensitive information, including that of children.",
          "categories": [
            "Data Breach",
            "Policy and Compliance",
            "Cloud Security"
          ],
          "tags": [
            "API Security",
            "Data Breach",
            "GraphQL",
            "Minors Data",
            "Non-profit",
            "UStrive"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-01T15:00:00.000Z"
        },
        {
          "slug": "blue-star-reports-data-security-incident-involving-product-data",
          "headline": "Air Conditioning Giant Blue Star Discloses Data Breach Affecting Product Installation Data",
          "summary": "Blue Star, a major Indian multinational specializing in air conditioning and commercial refrigeration, has announced it experienced a data security incident. The company reported unauthorized access to its product installation data. The breach was reported to its Compliance Officer on January 31, 2026. Blue Star has engaged external cybersecurity experts to investigate the incident's scope, perform a root cause analysis, and strengthen its security posture. Further details on the extent of the compromise and the responsible party have not yet been released as the investigation is ongoing.",
          "categories": [
            "Data Breach",
            "Incident Response",
            "Industrial Control Systems"
          ],
          "tags": [
            "Blue Star",
            "Data Breach",
            "Incident Response",
            "Manufacturing"
          ],
          "severity": "low",
          "isUpdate": false,
          "publishedAt": "2026-02-01T15:00:00.000Z"
        },
        {
          "slug": "partial-us-government-shutdown-heightens-national-cybersecurity-risks",
          "headline": "Cybersecurity Risks Mount as Partial US Government Shutdown Begins",
          "summary": "A partial U.S. government shutdown began at midnight on January 31, 2026, after funding for several federal agencies, including the Department of Homeland Security (DHS), lapsed. Security experts are warning that such shutdowns create a period of heightened cybersecurity risk for the nation. With reduced staffing and coordination at key agencies like CISA, the government's ability to detect, respond to, and share intelligence about threats is diminished. Threat actors, both criminal and nation-state, are known to exploit these periods of disruption to launch targeted phishing, credential harvesting, and ransomware campaigns against government agencies and adjacent sectors.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "CISA",
            "Cybersecurity Risk",
            "DHS",
            "Government Shutdown",
            "Phishing",
            "Ransomware"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-01T15:00:00.000Z"
        },
        {
          "slug": "fbi-seizes-ramp-ransomware-forum-in-major-takedown-operation",
          "headline": "FBI Shuts Down RAMP, a Notorious Ransomware Recruitment and Trading Hub",
          "summary": "In a significant blow to the ransomware ecosystem, the U.S. Federal Bureau of Investigation (FBI) has seized the RAMP (Russian Anonymous MarketPlace) forum. The Russian-language site, which operated on both the clear and dark web, was a central hub for ransomware-as-a-service (RaaS) operations. It served as a recruitment ground for affiliates for major gangs like ALPHV/BlackCat and Qilin, a marketplace for initial access brokers, and a trading post for stolen data. The takedown, conducted with the DOJ, disrupts a key piece of infrastructure that enabled numerous high-profile cyberattacks.",
          "categories": [
            "Security Operations",
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "ALPHV",
            "Cybercrime",
            "DarkSide",
            "FBI",
            "Qilin",
            "RAMP",
            "Ransomware",
            "Takedown"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-01T15:00:00.000Z"
        },
        {
          "slug": "escan-antivirus-compromised-in-supply-chain-attack-delivers-malware",
          "headline": "Supply Chain Attack: eScan Antivirus Update Server Compromised to Distribute Malware",
          "summary": "Indian antivirus provider eScan, a product of MicroWorld Technologies, has suffered a supply chain attack. On January 20, 2026, a regional update server was compromised, causing it to push a malicious file named 'Reload.exe' to enterprise and consumer customers. According to security firm Morphisec, the malware disables the antivirus product by modifying the local HOSTS file to block future updates and then proceeds with a multi-stage infection to download additional payloads. While MicroWorld Technologies acknowledged the breach and isolated the server, it has disputed the 'supply chain attack' label. Affected users require a manual cleaning utility from eScan support for remediation.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Incident Response"
          ],
          "tags": [
            "Antivirus",
            "HOSTS file",
            "Malware",
            "Reload.exe",
            "Supply Chain Attack",
            "eScan"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-01T15:00:00.000Z",
          "malware": [
            "Reload.exe"
          ]
        },
        {
          "slug": "shinyhunters-style-vishing-campaign-bypasses-mfa-to-breach-saas-platforms",
          "headline": "Vishing Campaign Linked to ShinyHunters Bypasses MFA to Steal Data from SaaS Apps",
          "summary": "A sophisticated threat campaign, with links to the notorious extortion group ShinyHunters (UNC6240), is using voice phishing (vishing) and custom credential harvesting sites to bypass multi-factor authentication (MFA). Tracked by Mandiant as UNC6661 and UNC6671, the attackers call employees, trick them into entering their single sign-on (SSO) credentials and MFA codes into a fake portal, and then register their own device for persistent access. The goal is to infiltrate corporate networks to steal data from SaaS applications like SharePoint and OneDrive for subsequent extortion. The campaign demonstrates a continued evolution in social engineering tactics designed to defeat modern security controls.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Data Breach"
          ],
          "tags": [
            "MFA",
            "Mandiant",
            "Phishing",
            "SSO",
            "SaaS",
            "ShinyHunters",
            "UNC6240",
            "Vishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-01T15:00:00.000Z"
        },
        {
          "slug": "ivanti-epmm-critical-zero-day-vulnerabilities-under-active-attack",
          "headline": "CISA Orders Patching for Critical Ivanti EPMM Zero-Days Under Active Exploitation",
          "summary": "Ivanti has released emergency patches for two critical unauthenticated remote code execution (RCE) vulnerabilities, CVE-2026-1281 and CVE-2026-1340, in its Endpoint Manager Mobile (EPMM) solution. Both flaws are rated 9.8 on the CVSS scale and allow attackers to execute arbitrary code without authentication. With confirmation of active exploitation in the wild, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added CVE-2026-1281 to its Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to apply mitigations by February 1, 2026. The vulnerabilities affect multiple versions of EPMM and pose a severe risk to organizations using the platform for mobile device management.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA",
            "EPMM",
            "Ivanti",
            "KEV",
            "MobileIron",
            "RCE",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-01T15:00:00.000Z",
          "cves": [
            "CVE-2026-1281",
            "CVE-2026-1340"
          ]
        },
        {
          "slug": "polish-energy-sector-hit-by-destructive-sandworm-linked-wiper-attack",
          "headline": "Russian State Actors Suspected in Destructive Wiper Attack on Polish Energy Infrastructure",
          "summary": "On December 29, 2025, a coordinated cyberattack deployed two novel wiper malware variants, DynoWiper and LazyWiper, against more than 30 Polish wind and solar farms and a major combined heat and power (CHP) plant. The attack, aimed at sabotage during severe winter weather, damaged both IT and OT systems. While CERT Polska attributed the incident to the FSB-linked 'Static Tundra' group, other security firms like ESET and Dragos suggest the GRU-backed 'Sandworm' (APT44) is a more likely culprit, noting similarities to previous attacks against Ukrainian infrastructure. The operation involved long-term data theft preceding the destructive phase, with attackers showing interest in SCADA and OT network modernization plans.",
          "categories": [
            "Cyberattack",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "APT44",
            "Critical Infrastructure",
            "Energy Sector",
            "Malware",
            "OT",
            "Poland",
            "Sandworm",
            "Static Tundra",
            "Wiper"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-01T15:00:00.000Z",
          "malware": [
            "DynoWiper",
            "LazyWiper"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "fortinet-fixes-actively-exploited-sso-authentication-bypass-flaw",
        "originalHeadline": "Fortinet Scrambles to Fix Actively Exploited SSO Auth Bypass (CVE-2026-24858) Hijacking Devices",
        "updateTitle": "Update: Fortinet Scrambles to Fix Actively Exploited SSO Auth Bypass (CVE-2026-24858) Hijacking Devices",
        "updateSummary": "Fortinet confirms CVE-2026-24858 as a zero-day, with active exploitation observed since January 20, 2026, targeting FortiGate firewalls.",
        "categories": [
          "Vulnerability",
          "Cyberattack",
          "Patch Management"
        ],
        "tags": [
          "CISA KEV",
          "CVE-2026-24858",
          "FortiCloud",
          "Fortinet",
          "SSO",
          "authentication bypass",
          "zero-day"
        ],
        "cves": [
          "CVE-2025-59718",
          "CVE-2025-59719",
          "CVE-2026-24858"
        ],
        "severity": "critical",
        "publishedAt": "2026-01-28T15:00:00.000Z",
        "updatedAt": "2026-02-02T12:00:00.000Z"
      },
      {
        "slug": "iran-linked-redkitten-campaign-targets-human-rights-ngos",
        "originalHeadline": "New Iran-Linked 'RedKitten' Group Targets Human Rights NGOs with AI-Suspected Malware",
        "updateTitle": "Update: New Iran-Linked 'RedKitten' Group Targets Human Rights NGOs with AI-Suspected Malware",
        "updateSummary": "New details on RedKitten campaign reveal C# implant 'SloppyMIO' using password-protected Excel, steganography, and AppDomain Manager injection for stealth.",
        "categories": [
          "Threat Actor",
          "Malware",
          "Phishing"
        ],
        "tags": [
          "AI",
          "Espionage",
          "Iran",
          "Malware",
          "NGO",
          "Phishing",
          "RedKitten",
          "Telegram"
        ],
        "severity": "medium",
        "publishedAt": "2026-02-01T15:00:00.000Z",
        "updatedAt": "2026-02-02T12:00:00.000Z"
      },
      {
        "slug": "microsoft-office-zero-day-cve-2026-21509-actively-exploited",
        "originalHeadline": "Microsoft Office Zero-Day Under Active Attack Bypasses Security Features",
        "updateTitle": "Update: Microsoft Office Zero-Day Under Active Attack Bypasses Security Features",
        "updateSummary": "Microsoft confirms its threat intelligence discovered the Office zero-day exploitation, providing more specific attack details and detection methods.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Cyberattack"
        ],
        "tags": [
          "KEV",
          "OLE",
          "out-of-band patch",
          "security feature bypass",
          "zero-day"
        ],
        "cves": [
          "CVE-2026-21509"
        ],
        "severity": "critical",
        "publishedAt": "2026-01-29T15:00:00.000Z",
        "updatedAt": "2026-02-02T10:00:00.000Z"
      },
      {
        "slug": "experian-forecasts-ai-agents-to-become-top-cause-of-data-breaches",
        "originalHeadline": "AI to Overtake Human Error as Top Cause of Breaches, Experian Predicts",
        "updateTitle": "Update: AI to Overtake Human Error as Top Cause of Breaches, Experian Predicts",
        "updateSummary": "New report confirms over 80% of malicious emails now use generative AI, making phishing attacks 'almost perfect' and harder to detect.",
        "categories": [
          "Threat Intelligence",
          "Policy and Compliance"
        ],
        "tags": [
          "AI",
          "Artificial Intelligence",
          "Polymorphic Malware",
          "Quantum Computing",
          "Synthetic Identity",
          "Threat Forecast"
        ],
        "malware": [
          "Metamorphic malware",
          "Polymorphic malware"
        ],
        "severity": "informational",
        "publishedAt": "2026-01-13T15:00:00.000Z",
        "updatedAt": "2026-02-02T00:00:00.000Z"
      },
      {
        "slug": "industrial-control-systems-face-escalating-cyber-threats",
        "originalHeadline": "Attacks on Industrial Environments Doubled in 2025, Report Warns",
        "updateTitle": "Update: Attacks on Industrial Environments Doubled in 2025, Report Warns",
        "updateSummary": "Forescout report reveals 84% surge in OT protocol attacks, with 71% of exploited vulnerabilities not in CISA KEV catalog, complicating defense.",
        "categories": [
          "Industrial Control Systems",
          "Cyberattack",
          "Threat Intelligence"
        ],
        "tags": [
          "Critical Infrastructure",
          "Cyble",
          "HMI",
          "ICS",
          "OT Security",
          "Ransomware",
          "SCADA"
        ],
        "severity": "high",
        "publishedAt": "2026-01-16T15:00:00.000Z",
        "updatedAt": "2026-02-02T00:00:00.000Z"
      },
      {
        "slug": "cognizant-faces-class-action-lawsuits-over-trizetto-data-breach",
        "originalHeadline": "Cognizant Sued in Class-Action Lawsuits After TriZetto Data Breach",
        "updateTitle": "Update: Cognizant Sued in Class-Action Lawsuits After TriZetto Data Breach",
        "updateSummary": "New details emerge on TriZetto breach timeline, including nearly year-long discovery delay and recent notifications to Oregon residents.",
        "categories": [
          "Data Breach",
          "Regulatory",
          "Security Operations"
        ],
        "tags": [
          "Class Action Lawsuit",
          "Cognizant",
          "Data Breach",
          "HIPAA",
          "Healthcare",
          "TriZetto"
        ],
        "severity": "medium",
        "publishedAt": "2026-01-04T15:00:00.000Z",
        "updatedAt": "2026-02-01T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}