{
  "lastUpdated": "2025-12-19T15:07:12.521Z",
  "runDate": "2025-12-19",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-12-19",
      "type": "publication-daily",
      "headline": "Critical Zero-Days in Cisco, Chrome, and WatchGuard Actively Exploited; React2Shell Weaponized for Ransomware",
      "articleCount": 10,
      "articles": [
        {
          "slug": "uk-proposes-major-overhaul-of-cybersecurity-laws-with-new-bill",
          "headline": "UK Introduces Major New Cybersecurity Bill with Stricter Rules and Hefty Fines",
          "summary": "The UK government has introduced the Cyber Security and Resilience Bill, a landmark piece of legislation designed to significantly update the 2018 Network and Information Systems (NIS) Regulations. The new bill expands the scope of regulated organizations, mandating stricter cybersecurity duties for a wider segment of British industry. Key changes include a stringent 24-hour initial incident reporting deadline and a 72-hour full reporting requirement. Furthermore, the bill dramatically increases penalties for non-compliance, with potential fines reaching up to £17 million or 4% of global turnover, bringing the UK's regulatory framework more in line with the EU's NIS2 Directive.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "Compliance",
            "Cybersecurity Law",
            "Incident Reporting",
            "NCSC",
            "NIS Regulations",
            "Regulatory",
            "UK"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-19T15:00:00.000Z"
        },
        {
          "slug": "700credit-breach-exposes-sensitive-data-of-5-8-million-consumers",
          "headline": "700Credit Breach Exposes SSNs and Personal Data of 5.8M Consumers",
          "summary": "700Credit, a major technology provider for the U.S. auto finance industry, has revealed a data breach that exposed the highly sensitive personal information of nearly 5.8 million consumers. The incident, discovered in October 2025, involved an unauthorized party gaining access to the company's 700Dealer.com platform. The compromised data includes full names, mailing addresses, dates of birth, and Social Security numbers. This breach places millions of individuals at significant risk of identity theft and financial fraud, highlighting the severe downstream risks associated with vendor security in the financial services ecosystem.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Phishing"
          ],
          "tags": [
            "700Credit",
            "Automotive",
            "Data Breach",
            "Finance",
            "Identity Theft",
            "PII",
            "SSN"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-19T15:00:00.000Z"
        },
        {
          "slug": "industrial-ransomware-attacks-surged-in-q3-2025-dragos-reports",
          "headline": "Industrial Ransomware Attacks Surge in Q3 2025, Manufacturing Sector Hit Hardest",
          "summary": "A new report from industrial cybersecurity firm Dragos reveals a significant surge in ransomware attacks targeting industrial organizations in the third quarter of 2025. The firm tracked 742 global incidents, an increase from 657 in the previous quarter. The manufacturing sector was the most heavily impacted, accounting for 72% of all attacks. North America was the most targeted region. The report identifies the Qilin ransomware group as the most prolific, responsible for 138 incidents alone. The rise in attacks highlights the growing threat to operational technology (OT) environments as attackers exploit IT/OT convergence to disrupt critical operations.",
          "categories": [
            "Ransomware",
            "Industrial Control Systems",
            "Threat Intelligence"
          ],
          "tags": [
            "Dragos",
            "ICS",
            "Manufacturing",
            "OT Security",
            "Qilin",
            "Ransomware",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-19T15:00:00.000Z",
          "malware": [
            "Akira",
            "INC Ransom",
            "Play"
          ]
        },
        {
          "slug": "manufacturers-targeted-in-supply-chain-attacks-via-web-portals",
          "headline": "Manufacturing Web Portals Are a Weak Link in Supply Chain Attacks",
          "summary": "A new report reveals that cybercriminals are increasingly targeting manufacturers through their public-facing web portals, such as supplier and customer forms, to execute supply chain attacks. Attackers are using bots and SQL injection to compromise these forms, which often run on legacy systems with weak security. The goal is to steal sensitive data, including credentials and intellectual property, or to gain a foothold to attack more heavily regulated downstream customers in defense, healthcare, and finance. A survey found that 85% of manufacturing firms experienced a security incident related to web forms, and 42% confirmed a resulting data breach.",
          "categories": [
            "Supply Chain Attack",
            "Cyberattack",
            "Data Breach"
          ],
          "tags": [
            "Bots",
            "Data Breach",
            "Manufacturing",
            "SQL Injection",
            "Supply Chain",
            "Web Security"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-19T15:00:00.000Z"
        },
        {
          "slug": "soundcloud-data-breach-exposes-data-of-28-million-users",
          "headline": "SoundCloud Data Breach Exposes 28 Million Users' Information",
          "summary": "Music streaming service SoundCloud announced on December 18, 2025, that it suffered a data breach exposing the information of approximately 28 million users. The company discovered the incident after detecting unauthorized access to an internal dashboard. The compromised data includes user email addresses and public profile information. SoundCloud has confirmed that more sensitive data, such as passwords and financial details, were not accessed. The company has secured the affected systems and is warning users to be vigilant for phishing attacks that may result from the exposed email addresses.",
          "categories": [
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Cyberattack",
            "Data Breach",
            "PII",
            "Phishing",
            "SoundCloud"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-19T15:00:00.000Z"
        },
        {
          "slug": "watchguard-warns-of-actively-exploited-critical-firewall-rce-flaw",
          "headline": "Actively Exploited RCE Flaw in WatchGuard Firewalls Puts Networks at Risk",
          "summary": "WatchGuard has issued an urgent advisory for customers to patch CVE-2025-14733, a critical remote code execution vulnerability in its Fireware OS that is confirmed to be under active exploitation. The flaw, an out-of-bounds write issue in the IKEv2 process, has a CVSS score of 9.3 and can be exploited by an unauthenticated remote attacker. The vulnerability affects Firebox firewalls with specific IKEv2 VPN configurations enabled. Given that firewalls are prime targets for initial access, immediate application of the provided security updates is crucial to protect network perimeters from compromise.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "Active Exploitation",
            "Firewall",
            "IKEv2",
            "KEV",
            "RCE",
            "VPN",
            "WatchGuard"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-19T15:00:00.000Z",
          "cves": [
            "CVE-2025-14733"
          ]
        },
        {
          "slug": "china-linked-apt-exploits-cisco-email-gateway-zero-day",
          "headline": "China-Linked Hackers Exploit Critical Cisco Email Gateway Zero-Day",
          "summary": "Cisco has revealed that a China-affiliated advanced persistent threat (APT) group, tracked as UAT-9686, is actively exploiting a critical zero-day vulnerability in its email security products. The flaw, CVE-2025-20393, is a remote code execution vulnerability with a maximum CVSS score of 10.0, affecting Cisco Secure Email Gateway and Secure Email and Web Manager appliances. The attackers have been exploiting the flaw since late November 2025 to gain root-level access and have deployed persistence mechanisms on compromised devices. Due to active exploitation by a nation-state actor, CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating immediate patching for federal agencies.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "CISA",
            "China",
            "Cisco",
            "KEV",
            "RCE",
            "UAT-9686",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-19T15:00:00.000Z",
          "cves": [
            "CVE-2025-20393"
          ]
        },
        {
          "slug": "actively-exploited-chrome-zero-day-allows-full-system-takeover",
          "headline": "Chrome Zero-Day Under Active Attack, Allows Full System Takeover",
          "summary": "Pakistan's National Computer Emergency Response Team (NCERT) has issued a high-alert advisory for a critical zero-day vulnerability in Google Chrome that is being actively exploited. The flaw, with a CVSS score of 9.8, affects all desktop versions (Windows, macOS, Linux) and can be triggered simply by a user visiting a malicious website. Successful exploitation allows for remote code execution that can bypass the browser's sandbox, potentially leading to a full system compromise. Users are at risk of malware installation, data theft, and credential loss. All users are urged to update to the latest stable version of Chrome immediately.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Malware"
          ],
          "tags": [
            "Active Exploitation",
            "Browser Security",
            "Google Chrome",
            "RCE",
            "Sandbox Escape",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-19T15:00:00.000Z"
        },
        {
          "slug": "hpe-patches-critical-10-0-cvss-flaw-in-oneview-management-tool",
          "headline": "HPE Issues Urgent Patch for 10.0 CVSS RCE Flaw in OneView",
          "summary": "Hewlett Packard Enterprise (HPE) has released an urgent security advisory for CVE-2025-37164, a critical vulnerability in its OneView infrastructure management software with a maximum CVSS score of 10.0. The flaw allows a remote, unauthenticated attacker to achieve complete remote code execution on affected systems. HPE OneView versions 5.20 through 10.20 are impacted. Given that OneView serves as a central control plane for enterprise server, storage, and firmware management, a compromise could give an attacker control over vast segments of IT infrastructure. HPE is urging customers to upgrade to the patched version 11.0 or apply an emergency hotfix immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Industrial Control Systems"
          ],
          "tags": [
            "CVSS 10",
            "HPE",
            "Infrastructure",
            "OneView",
            "Patch Management",
            "RCE",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-19T15:00:00.000Z",
          "cves": [
            "CVE-2025-37164"
          ]
        },
        {
          "slug": "react2shell-vulnerability-exploited-for-ransomware-deployment",
          "headline": "React2Shell Flaw Now a Gateway for Ransomware Attacks",
          "summary": "The critical unauthenticated remote code execution vulnerability known as React2Shell (CVE-2025-55182) is now being actively and widely exploited by multiple threat actors. Initially used for deploying cryptominers and backdoors, the attacks have escalated significantly. Microsoft reports hundreds of compromised machines across various organizations. Most alarmingly, security firm S-RM has confirmed an incident where the flaw was used as the initial access vector to deploy Weaxor ransomware, a likely rebrand of the Mallox family, in under a minute. This development marks a shift from opportunistic attacks to targeted, financially motivated cyber extortion, demonstrating the high-risk and tangible impact of this easily exploitable vulnerability on corporate networks.",
          "categories": [
            "Vulnerability",
            "Ransomware",
            "Cyberattack"
          ],
          "tags": [
            "Initial Access",
            "Mallox",
            "RCE",
            "Ransomware",
            "React2Shell",
            "Vulnerability",
            "Weaxor"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-19T15:00:00.000Z",
          "cves": [
            "CVE-2025-55182"
          ],
          "malware": [
            "Mallox",
            "Weaxor"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-12-18",
      "type": "publication-daily",
      "headline": "Microsoft Patches Actively Exploited Zero-Day as Phishing and Malware Tactics Evolve",
      "articleCount": 10,
      "articles": [
        {
          "slug": "ghostposter-malware-infects-50000-firefox-users-via-malicious-add-ons",
          "headline": "\"GhostPoster\" Malware Infects 50,000+ Firefox Users via Malicious Add-ons",
          "summary": "A stealthy malware campaign named \"GhostPoster\" has infected over 50,000 Mozilla Firefox users by distributing 17 malicious browser extensions. The add-ons, which masqueraded as legitimate tools like VPNs and ad blockers, have been removed from the Firefox store. The malware employed a clever technique, hiding obfuscated JavaScript within the add-on's logo image file. This code would then contact command-and-control (C2) servers to download a final payload designed for hijacking affiliate links and committing ad fraud. The campaign used evasion techniques like randomized and delayed C2 callbacks to avoid detection.",
          "categories": [
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "Ad Fraud",
            "Affiliate Hijacking",
            "Browser Extension",
            "Firefox",
            "GhostPoster",
            "Malware"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "malware": [
            "GhostPoster"
          ]
        },
        {
          "slug": "cloud-security-failing-to-keep-pace-with-ai-and-multicloud-expansion",
          "headline": "Cloud Security Failing to Keep Pace with AI and Multicloud, Report Warns",
          "summary": "A new report from Palo Alto Networks finds that cloud security operations are struggling to keep up with the rapid pace of multicloud adoption and AI integration. Attackers can now compromise cloud environments in minutes, while defenders take weeks to remediate critical issues. The report, which surveyed over 2,800 executives, highlights that identity and APIs are the top risk vectors, with 99% of organizations reporting at least one attack on their AI systems in the past year. It calls for a shift from fragmented security tools to integrated platforms to address the exponentially expanding attack surface.",
          "categories": [
            "Cloud Security",
            "Policy and Compliance",
            "Threat Intelligence"
          ],
          "tags": [
            "AI Security",
            "API Security",
            "CIEM",
            "CNAPP",
            "Cloud Security",
            "Multicloud",
            "Palo Alto Networks"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z"
        },
        {
          "slug": "irleaks-breach-at-iranian-banks-exposes-millions-via-third-party-vendor",
          "headline": "\"IRLeaks\" Supply Chain Attack Hits Iranian Banks, Exposing Millions of Customer Records",
          "summary": "A major supply chain attack dubbed \"IRLeaks\" has resulted in a significant data breach affecting several prominent Iranian banks and millions of their customers. Attackers first compromised a third-party IT vendor in October 2025, using it as a pivot point to infiltrate the banks' networks. Over the following month, they exfiltrated vast amounts of financial data and personally identifiable information (PII), including national IDs and bank account numbers, before the breach was discovered in late November. The incident highlights the critical risks associated with third-party vendor security and inadequate patch management.",
          "categories": [
            "Data Breach",
            "Supply Chain Attack",
            "Cyberattack"
          ],
          "tags": [
            "Data Breach",
            "Financial Services",
            "IRLeaks",
            "Iran",
            "Supply Chain Attack",
            "Third-Party Risk"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z"
        },
        {
          "slug": "operation-forumtroll-apt-targets-russian-academics-with-new-phishing-campaign",
          "headline": "\"Operation ForumTroll\" APT Targets Russian Academics with Plagiarism Lure",
          "summary": "The Advanced Persistent Threat (APT) group known as Operation ForumTroll has launched a new, highly targeted phishing campaign aimed at Russian political scientists and academics. Active since at least 2022, the group's latest attack uses meticulously crafted emails impersonating a major Russian scientific library, eLibrary.ru. The emails lure victims into downloading a supposed plagiarism report, which is a ZIP archive containing a malicious .LNK file. Executing the shortcut file triggers a PowerShell script that downloads and installs the Tuoni command-and-control (C2) framework, giving the attackers remote access for espionage purposes.",
          "categories": [
            "Threat Actor",
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Espionage",
            "ForumTroll",
            "LNK",
            "Phishing",
            "Russia",
            "Tuoni"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "malware": [
            "Tuoni"
          ]
        },
        {
          "slug": "scripted-sparrow-bec-group-targets-finance-teams-with-disciplined-phishing-attacks",
          "headline": "\"Scripted Sparrow\" BEC Group Targets Finance Teams with Highly Structured Attacks",
          "summary": "A disciplined and persistent Business Email Compromise (BEC) group, newly identified by Fortra as \"Scripted Sparrow,\" has been systematically targeting corporate finance teams since at least June 2024. The group employs a structured and well-researched approach, sending highly credible phishing emails with fake invoices that impersonate professional services firms. To add legitimacy, the attackers often include forged prior email correspondence from a company executive authorizing the payment. The group utilizes a large network of US-based mule accounts for cashing out, indicating a well-organized and persistent financial threat.",
          "categories": [
            "Threat Actor",
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "BEC",
            "Business Email Compromise",
            "Phishing",
            "Scripted Sparrow",
            "Social Engineering",
            "Wire Fraud"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z"
        },
        {
          "slug": "ai-powered-malware-and-petya-successor-emerge-in-h2-2025-threat-landscape",
          "headline": "AI-Powered Ransomware \"PromptLock\" and Petya Successor \"HybridPetya\" Emerge",
          "summary": "ESET's H2 2025 threat report confirms the shift of AI-powered malware from theory to reality with the discovery of \"PromptLock,\" the first known AI-driven ransomware capable of generating malicious scripts on the fly. The report also details the emergence of \"HybridPetya,\" a modern successor to the destructive Petya/NotPetya wiper that is now capable of compromising UEFI-based systems. Other key trends from the second half of 2025 include the dominance of the Akira and Qilin RaaS operations and a massive surge in the CloudEyE (GuLoader) malware downloader, which saw its detections increase almost thirtyfold.",
          "categories": [
            "Malware",
            "Ransomware",
            "Threat Intelligence"
          ],
          "tags": [
            "AI Malware",
            "ESET",
            "HybridPetya",
            "Petya",
            "PromptLock",
            "Ransomware",
            "Threat Report",
            "UEFI"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "malware": [
            "Agent Tesla",
            "Akira",
            "CloudEyE",
            "Formbook",
            "GuLoader",
            "HybridPetya",
            "Lumma Stealer",
            "Petya/NotPetya",
            "PromptLock",
            "Qilin",
            "Rescoms"
          ]
        },
        {
          "slug": "threat-actors-abuse-oauth-device-code-flow-in-microsoft-365-phishing-surge",
          "headline": "Phishing Surge Hits Microsoft 365 via OAuth Device Code Abuse",
          "summary": "Security researchers report a significant rise in phishing campaigns abusing the Microsoft OAuth 2.0 device authorization grant to compromise Microsoft 365 accounts. Both state-aligned groups like UNK_AcademicFlare and financially motivated actors like TA2723 are using this 'device code' phishing technique, often facilitated by Phishing-as-a-Service (PhaaS) kits like SquarePhish2. The attacks trick users into entering a short device code on Microsoft's legitimate 'microsoft.com/devicelogin' page, which inadvertently grants the attacker's malicious application a valid access token and persistent access to the victim's account.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Cloud Security"
          ],
          "tags": [
            "Account Takeover",
            "Device Code Phishing",
            "Microsoft 365",
            "OAuth",
            "PhaaS",
            "TA2723"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "malware": [
            "SquarePhish2"
          ]
        },
        {
          "slug": "ransomware-tactics-evolve-in-2025-with-focus-on-human-operated-attacks",
          "headline": "Ransomware Evolves: \"ClickFix\" Social Engineering and Threat Actor Alliances on the Rise",
          "summary": "A December 2025 threat report from NCC Group indicates that while ransomware attack volumes plateaued in November with 583 incidents, their sophistication markedly increased. Attackers are increasingly adopting the \"ClickFix\" (also known as ClearFake) social engineering technique, which tricks users into manually running malicious commands, bypassing many automated defenses. The report also highlights a trend of collaboration, with groups like DragonForce forming alliances with skilled affiliates from other networks. The Qilin ransomware group remained the most prolific actor, with the industrials sector and North America being the most targeted.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Threat Intelligence"
          ],
          "tags": [
            "ClearFake",
            "ClickFix",
            "Qilin",
            "Ransomware",
            "Social Engineering",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "malware": [
            "ClickFix"
          ]
        },
        {
          "slug": "google-investigates-malicious-code-anomaly-in-search-results-infrastructure",
          "headline": "Google Investigates Malicious Code Found in Search Result Infrastructure",
          "summary": "Google has launched an urgent investigation after cybersecurity analysts discovered anomalous, encrypted code snippets and obfuscated JavaScript embedded within its core search result payloads on December 17, 2025. The malicious code appears designed to exploit browser sandboxing vulnerabilities, which could potentially enable remote code execution or data theft on users' systems. While Google has not confirmed any user impact and states it is neutralizing the threat, the incident represents a highly sophisticated attack against critical global internet infrastructure, prompting the involvement of government agencies.",
          "categories": [
            "Cyberattack",
            "Data Breach",
            "Security Operations"
          ],
          "tags": [
            "Browser Exploit",
            "Google",
            "Infrastructure Attack",
            "Search",
            "Supply Chain Attack"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z"
        },
        {
          "slug": "microsoft-patches-actively-exploited-windows-zero-day-in-december-2025-update",
          "headline": "Microsoft Patches Actively Exploited Windows Zero-Day in Final 2025 Update",
          "summary": "Microsoft's December 2025 Patch Tuesday addresses 57 vulnerabilities, including three zero-days. The most critical, CVE-2025-62221, is a privilege escalation flaw in the Windows Cloud Files Mini Filter Driver that is being actively exploited in the wild. This has prompted the U.S. Cybersecurity and Infrastructure Security Agency (CISA) to add it to its Known Exploited Vulnerabilities (KEV) catalog, mandating a patch by December 30, 2025. The flaw allows a local, authenticated attacker to gain SYSTEM-level privileges. The update also patches other critical RCE flaws in Microsoft Office and publicly disclosed, but not exploited, bugs in PowerShell and GitHub Copilot.",
          "categories": [
            "Patch Management",
            "Vulnerability",
            "Security Operations"
          ],
          "tags": [
            "CISA KEV",
            "Patch Tuesday",
            "Privilege Escalation",
            "RCE",
            "Vulnerability",
            "Windows",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-18T15:00:00.000Z",
          "cves": [
            "CVE-2025-54100",
            "CVE-2025-62221",
            "CVE-2025-62554",
            "CVE-2025-62557",
            "CVE-2025-64671"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "sans-report-shows-rising-ot-ics-cyber-incidents-driven-by-ransomware",
        "originalHeadline": "SANS Report: OT/ICS Cyber Incidents Rising, 40% Cause Downtime",
        "updateTitle": "Update: SANS Report: OT/ICS Cyber Incidents Rising, 40% Cause Downtime",
        "updateSummary": "Industrial ransomware attacks surged in Q3 2025, with 742 incidents, manufacturing hit hardest, and Qilin group most active.",
        "categories": [
          "Industrial Control Systems",
          "Threat Intelligence",
          "Ransomware"
        ],
        "tags": [
          "Critical Infrastructure",
          "ICS Security",
          "OT Security",
          "Ransomware",
          "SANS",
          "Threat Report"
        ],
        "malware": [
          "Ransomware"
        ],
        "severity": "informational",
        "publishedAt": "2025-11-21T15:00:00.000Z",
        "updatedAt": "2025-12-18T00:00:00.000Z"
      },
      {
        "slug": "2025-the-year-ai-redefines-cyberattacks-and-defense",
        "originalHeadline": "2025: The Year Cybersecurity 'Crossed the AI Rubicon'",
        "updateTitle": "Update: 2025: The Year Cybersecurity 'Crossed the AI Rubicon'",
        "updateSummary": "ESET's H2 2025 report reveals 'PromptLock,' the first AI-driven ransomware, and 'HybridPetya,' a destructive UEFI wiper, escalating AI-powered and destructive threats.",
        "categories": [
          "Threat Intelligence",
          "Other"
        ],
        "tags": [
          "AI",
          "LLM",
          "artificial intelligence",
          "deepfake",
          "generative AI",
          "phishing",
          "threat landscape"
        ],
        "severity": "informational",
        "publishedAt": "2025-12-14T15:00:00.000Z",
        "updatedAt": "2025-12-18T00:00:00.000Z"
      },
      {
        "slug": "soundcloud-and-pornhub-disclose-user-data-breaches",
        "originalHeadline": "SoundCloud and Pornhub Confirm User Data Exposure in Separate Breaches, One Via Third-Party",
        "updateTitle": "Update: SoundCloud and Pornhub Confirm User Data Exposure in Separate Breaches, One Via Third-Party",
        "updateSummary": "SoundCloud offers deeper analysis of its data breach, detailing potential attack vectors and enhanced user mitigation advice.",
        "categories": [
          "Data Breach",
          "Supply Chain Attack",
          "Threat Actor"
        ],
        "tags": [
          "DDoS",
          "Data Breach",
          "Extortion",
          "Mixpanel",
          "Pornhub",
          "ShinyHunters",
          "SoundCloud",
          "Supply Chain Attack"
        ],
        "severity": "high",
        "publishedAt": "2025-12-16T15:00:00.000Z",
        "updatedAt": "2025-12-18T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}