{
  "lastUpdated": "2025-12-12T19:50:34.933Z",
  "runDate": "2025-12-12",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-12-12",
      "type": "publication-daily",
      "headline": "Microsoft and Google Patch Actively Exploited Zero-Days Amidst Major Healthcare Breaches and Sophisticated Supply Chain Attacks",
      "articleCount": 10,
      "articles": [
        {
          "slug": "ransomware-expands-to-new-regions-and-industries-report-finds",
          "headline": "Ransomware Goes Global, Targeting New Regions and Industries with Weaker Defenses",
          "summary": "Ransomware is becoming a more globalized and unpredictable threat, according to the H2 2025 Global Threat Briefing from cyber analytics firm CyberCube. The report warns that ransomware groups are actively expanding into new geographic regions and industry sectors that have historically seen fewer attacks, often targeting those with less mature cyber defenses. The highly active LockBit ransomware-as-a-service (RaaS) group is a key driver of this trend. The findings suggest that traditional risk models based on geography or industry are becoming less reliable predictors of attack likelihood.",
          "categories": [
            "Threat Intelligence",
            "Ransomware"
          ],
          "tags": [
            "CyberCube",
            "Global Threat",
            "LockBit",
            "RaaS",
            "Ransomware Trends",
            "Threat Intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-12T15:00:00.000Z"
        },
        {
          "slug": "battering-ram-hardware-attack-defeats-intel-sgx-amd-sev",
          "headline": "\"Battering RAM\": $50 Hardware Attack Cracks Intel and AMD Secure CPU Enclaves",
          "summary": "At the Black Hat Europe 2025 conference, researchers from KU Leuven University demonstrated \"Battering RAM,\" a novel hardware attack that completely undermines modern confidential computing technologies. Using a custom-built DDR4 interposer costing just $50, the attack can bypass the memory encryption of secure enclaves like Intel SGX and AMD SEV. This allows an attacker with physical access to read encrypted memory at runtime, extract secret keys, and defeat protections previously thought to be secure against physical threats.",
          "categories": [
            "Cyberattack",
            "Threat Intelligence",
            "Supply Chain Attack"
          ],
          "tags": [
            "AMD SEV",
            "Black Hat",
            "Confidential Computing",
            "Hardware Attack",
            "Intel SGX",
            "Side-channel Attack",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-12T15:00:00.000Z",
          "malware": [
            "Battering RAM"
          ]
        },
        {
          "slug": "conduent-data-breach-impacts-10-million-in-major-healthcare-incident",
          "headline": "Conduent Breach Exposes 10.5M Patients, Ranks as 8th Largest US Healthcare Breach",
          "summary": "Business services giant Conduent has disclosed a massive data breach that exposed the personal and medical information of over 10.5 million people, making it the 8th largest healthcare data breach in U.S. history. The breach, which was active for months between October 2024 and January 2025, has already cost the company $25 million in response efforts. The compromised data includes names, Social Security numbers, and health information, leading to multiple class-action lawsuits against the company.",
          "categories": [
            "Data Breach",
            "Regulatory",
            "Incident Response"
          ],
          "tags": [
            "Class Action",
            "Conduent",
            "HIPAA",
            "Healthcare Breach",
            "PHI",
            "PII"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-12T15:00:00.000Z"
        },
        {
          "slug": "hamas-affiliated-apt-ashen-lepus-targets-middle-east-with-ashtag-malware",
          "headline": "Hamas-Affiliated \"Ashen Lepus\" APT Deploys New \"AshTag\" Malware in Middle East Espionage Campaign",
          "summary": "A Hamas-affiliated advanced persistent threat (APT) group, tracked as Ashen Lepus and WIRTE, is conducting a multi-year espionage campaign against government and diplomatic entities in the Middle East. According to research from Palo Alto Networks' Unit 42, the group has expanded its targeting to Oman and Morocco and is deploying a previously undocumented custom malware suite named \"AshTag.\" The campaign's primary goal is intelligence collection, and it has remained active through recent regional conflicts and ceasefires.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "AshTag",
            "Espionage",
            "Hamas",
            "Middle East",
            "WIRTE"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-12T15:00:00.000Z",
          "malware": [
            "AshTag",
            "AshenLoader"
          ]
        },
        {
          "slug": "new-droidlock-android-ransomware-issues-24-hour-ultimatum",
          "headline": "New \"DroidLock\" Android Ransomware Locks Devices, Streams from Camera",
          "summary": "A new Android ransomware strain, dubbed \"DroidLock,\" is spreading via phishing websites and using deceptive tactics to gain powerful device permissions. Researchers at Zimperium report that the malware tricks users into granting it Accessibility Service permissions, which it then abuses to perform a \"total takeover\" of the device. DroidLock locks the screen, threatens to permanently destroy all files within 24 hours if a ransom isn't paid, and includes an invasive feature that streams live video from the phone's front-facing camera to its operators.",
          "categories": [
            "Ransomware",
            "Mobile Security",
            "Phishing"
          ],
          "tags": [
            "Accessibility Services",
            "Android Ransomware",
            "DroidLock",
            "Mobile Security",
            "Phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-12T15:00:00.000Z",
          "malware": [
            "DroidLock"
          ]
        },
        {
          "slug": "react-server-components-vulnerable-to-dos-and-source-code-exposure",
          "headline": "New DoS and Source Code Exposure Flaws Found in React Server Components",
          "summary": "Just one week after patching the critical \"React2Shell\" RCE vulnerability, the React core team has disclosed new flaws in React Server Components. Discovered by researchers analyzing the initial fix, the new issues include a high-severity Denial-of-Service (DoS) vulnerability (CVE-2025-55184, CVE-2025-67779) and a medium-severity source code exposure flaw (CVE-2025-55183). Developers using affected versions are urged to update their packages immediately, as systems patched for React2Shell are still vulnerable to these new attacks.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "DoS",
            "Information Disclosure",
            "React",
            "React2Shell",
            "Server Components",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-12T15:00:00.000Z",
          "cves": [
            "CVE-2025-55183",
            "CVE-2025-55184",
            "CVE-2025-67779"
          ]
        },
        {
          "slug": "trizetto-discloses-year-long-data-breach-exposing-patient-phi",
          "headline": "TriZetto Discloses Year-Long Data Breach Exposing Patient PHI",
          "summary": "TriZetto Provider Solutions, a healthcare revenue management company owned by Cognizant, has started notifying clients about a major data breach. An unauthorized party had access to patient data for nearly a full year, from November 2024 until the breach was detected on October 2, 2025. The attackers accessed historical reports containing sensitive Protected Health Information (PHI), including patient names, Social Security numbers, dates of birth, and health insurance details. The cybersecurity firm Mandiant was brought in to investigate the long-running intrusion.",
          "categories": [
            "Data Breach",
            "Incident Response",
            "Regulatory"
          ],
          "tags": [
            "Cognizant",
            "Dwell Time",
            "HIPAA",
            "Healthcare Breach",
            "PHI",
            "TriZetto"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-12T15:00:00.000Z"
        },
        {
          "slug": "google-patches-actively-exploited-chrome-zero-day-december-2025",
          "headline": "Google Patches Eighth Chrome Zero-Day of 2025 Under Active Attack",
          "summary": "Google has released an emergency, out-of-band security update for its Chrome browser, patching its eighth zero-day vulnerability of 2025. The high-severity flaw, tracked as issue 466192044, is confirmed to be actively exploited in the wild. To prevent further abuse, Google has withheld technical details but analysis suggests it may be a buffer overflow in the ANGLE graphics library. All 3.4 billion Chrome users are urged to update their browsers immediately to version 143.0.7499.109 or later.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "ANGLE",
            "Browser Security",
            "Chrome",
            "Emergency Patch",
            "Google",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-12T15:00:00.000Z"
        },
        {
          "slug": "microsoft-patches-actively-exploited-zero-day-cve-2025-62221-december-2025",
          "headline": "Microsoft Patches Actively Exploited Zero-Day in December 2025 Patch Tuesday",
          "summary": "Microsoft's final Patch Tuesday of 2025 addressed 57 vulnerabilities, including two zero-day flaws. The most critical, CVE-2025-62221, is a privilege escalation vulnerability in the Windows Cloud Files Mini Filter Driver that is confirmed to be under active exploitation. The flaw allows a local attacker to gain SYSTEM-level privileges. Due to its active use in attacks, CISA has added it to its Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to patch by December 30, 2025. A second, publicly disclosed zero-day, CVE-2025-54100, an RCE in PowerShell, was also patched but is not known to be exploited.",
          "categories": [
            "Patch Management",
            "Vulnerability"
          ],
          "tags": [
            "CISA KEV",
            "CVE-2025-62221",
            "Patch Tuesday",
            "Privilege Escalation",
            "Windows Security",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-12T15:00:00.000Z",
          "cves": [
            "CVE-2025-54100",
            "CVE-2025-62221",
            "CVE-2025-62554",
            "CVE-2025-62557",
            "CVE-2025-64671"
          ]
        },
        {
          "slug": "microsoft-warns-of-shai-hulud-2-0-supply-chain-worm-on-github",
          "headline": "Microsoft Warns of \"Shai-Hulud 2.0\" Worm Stealing Cloud Credentials via npm",
          "summary": "Microsoft has issued a critical alert about \"Shai-Hulud 2.0,\" a highly aggressive, self-replicating worm conducting a major supply chain attack. The malware targets developers by compromising npm packages and uses a malicious `pre-install` script to activate before installation. It steals a wide range of cloud service and developer credentials (AWS, Azure, GCP) and exfiltrates them to public GitHub repositories, enabling rapid and widespread compromise. Microsoft is urging all organizations to act quickly to rotate potentially exposed credentials.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "Cloud Security",
            "Credential Theft",
            "GitHub",
            "Shai-Hulud",
            "Supply Chain Attack",
            "Worm",
            "npm"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-12T15:00:00.000Z",
          "malware": [
            "Shai-Hulud 2.0"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-12-11",
      "type": "publication-daily",
      "headline": "Microsoft Patches Actively Exploited Zero-Day as Gogs Git Service Reels from Unpatched Flaw",
      "articleCount": 10,
      "articles": [
        {
          "slug": "report-reveals-critical-lack-of-ot-cybersecurity-training",
          "headline": "Critical Infrastructure at Risk Due to \"Deficient\" OT Cybersecurity Training",
          "summary": "A new report from Australian cybersecurity firm Secolve has exposed significant deficiencies in operational technology (OT) cybersecurity training across critical infrastructure sectors. The survey of senior professionals in industries like energy, manufacturing, and water found that training is often generic, infrequent, or completely ignored. This lack of specialized training is creating a dangerously immature security culture and leaving vital industrial environments unprepared for cyberattacks.",
          "categories": [
            "Industrial Control Systems",
            "Policy and Compliance",
            "Security Operations"
          ],
          "tags": [
            "Australia",
            "Critical Infrastructure",
            "Cybersecurity Training",
            "ICS",
            "OT Security",
            "Report"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-11T15:00:00.000Z"
        },
        {
          "slug": "nato-tests-cyber-defenses-in-large-scale-cyber-coalition-exercise",
          "headline": "NATO Sharpens Cyber Defenses in Massive \"Cyber Coalition\" War Game",
          "summary": "NATO has successfully concluded its largest annual cyber defense exercise, \"Cyber Coalition,\" in Tallinn, Estonia. The week-long event involved approximately 1,500 military and civilian personnel from 29 NATO members and seven partner nations. Participants collaborated to defend a fictional nation's critical infrastructure against a series of realistic, hybrid cyberattacks, enhancing their collective ability to respond to modern threats.",
          "categories": [
            "Security Operations",
            "Policy and Compliance",
            "Industrial Control Systems"
          ],
          "tags": [
            "Critical Infrastructure",
            "Cyber Coalition",
            "Cyber Exercise",
            "Estonia",
            "Hybrid Warfare",
            "NATO"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-11T15:00:00.000Z"
        },
        {
          "slug": "operation-dupehike-cyber-espionage-campaign-targets-russian-companies",
          "headline": "\"Operation DupeHike\" Espionage Campaign Targets Russian Corporate HR Depts",
          "summary": "A highly targeted cyber-espionage campaign, dubbed \"Operation DupeHike,\" has been identified targeting employees in Russian corporations. Attributed to the threat actor cluster UNG0902, the campaign uses convincing social engineering lures, such as decoy documents about employee bonuses, to infiltrate networks. The primary targets are staff in HR, payroll, and administrative departments, with the goal of achieving persistent surveillance and exfiltrating sensitive corporate data.",
          "categories": [
            "Threat Actor",
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Cyber Espionage",
            "Operation DupeHike",
            "Phishing",
            "Russia",
            "UNG0902"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-11T15:00:00.000Z"
        },
        {
          "slug": "fake-movie-torrent-spreads-agent-tesla-malware",
          "headline": "Fake Leonardo DiCaprio Movie Torrent Used as Bait to Spread Agent Tesla Trojan",
          "summary": "Cybercriminals are luring victims with a fake torrent for a new Leonardo DiCaprio movie to distribute the Agent Tesla information-stealing trojan. Security researchers at Bitdefender analyzed the campaign, revealing a complex, multi-stage attack chain that uses a malicious .lnk shortcut, hidden batch commands in subtitle files, and multiple layers of PowerShell to execute the final payload. The malware runs only in memory and establishes persistence through a fake audio diagnostic task, making it highly evasive.",
          "categories": [
            "Malware",
            "Phishing"
          ],
          "tags": [
            "Agent Tesla",
            "InfoStealer",
            "Malware",
            "Phishing",
            "PowerShell",
            "Torrent"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-11T15:00:00.000Z",
          "malware": [
            "Agent Tesla"
          ]
        },
        {
          "slug": "hp-report-cybercriminals-using-sophisticated-social-engineering-lures",
          "headline": "Hackers Use Animated Lures and Fake Legal Warnings to Spread Malware",
          "summary": "HP's latest Threat Insights Report reveals a significant evolution in social engineering tactics, with cybercriminals using highly convincing lures such as professional animations and fake legal warnings to trick users into downloading malware. The report highlights a campaign impersonating the Colombian Prosecutor's Office to deliver PureRAT. It also details the abuse of trusted platforms like Discord for hosting malicious payloads like the Phantom Stealer and notes the rising threat of session cookie hijacking.",
          "categories": [
            "Phishing",
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "HP",
            "InfoStealer",
            "Phantom Stealer",
            "Phishing",
            "PureRAT",
            "Social Engineering",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-11T15:00:00.000Z",
          "malware": [
            "Phantom Stealer",
            "PureRAT"
          ]
        },
        {
          "slug": "hamas-affiliated-apt-ashen-lepus-deploys-new-ashtag-malware",
          "headline": "Hamas-Linked APT \"Ashen Lepus\" Targets Middle East with New \"AshTag\" Malware",
          "summary": "The Hamas-affiliated advanced persistent threat (APT) group known as Ashen Lepus (or WIRTE) is conducting an ongoing espionage campaign targeting governmental and diplomatic entities in the Middle East. Researchers have identified a new, modular .NET malware suite named AshTag being used in these attacks. The campaign marks a significant evolution in the group's sophistication, incorporating enhanced encryption, in-memory payload execution, and the use of legitimate-looking subdomains to evade detection.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "AshTag",
            "Ashen Lepus",
            "Cyber Espionage",
            "Malware",
            "Middle East",
            "WIRTE"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-11T15:00:00.000Z",
          "malware": [
            "AshTag"
          ]
        },
        {
          "slug": "droidlock-android-malware-gains-full-device-control-via-phishing",
          "headline": "New \"DroidLock\" Android Malware Hijacks Devices, Steals Credentials",
          "summary": "A sophisticated new Android malware strain, named DroidLock, is actively targeting users in Spain through phishing websites. The malware tricks users into granting extensive permissions, including Accessibility Services and device administrator rights. Once active, DroidLock can lock the device, display fake update screens, steal credentials using overlay attacks, capture screen activity, and access the device's camera, representing a significant threat to mobile users.",
          "categories": [
            "Malware",
            "Mobile Security",
            "Phishing"
          ],
          "tags": [
            "Accessibility Services",
            "Android",
            "Credential Theft",
            "Malware",
            "Mobile Security",
            "Phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-11T15:00:00.000Z",
          "malware": [
            "DroidLock"
          ]
        },
        {
          "slug": "new-dos-and-source-code-exposure-vulnerabilities-found-in-react",
          "headline": "New Flaws in React Server Components Expose Apps to DoS, Source Code Leaks",
          "summary": "Following last week's critical \"React2Shell\" vulnerability, the React team has disclosed two additional vulnerabilities affecting React Server Components. The new flaws include a high-severity Denial of Service (DoS) vulnerability (CVE-2025-55184, CVE-2025-67779) and a medium-severity Source Code Exposure vulnerability (CVE-2025-55183). Developers who recently patched for React2Shell are urged to update their dependencies again immediately to protect against these new threats.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "Denial of Service",
            "DoS",
            "Patch Management",
            "React",
            "Source Code Leak",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-11T15:00:00.000Z",
          "cves": [
            "CVE-2025-55183",
            "CVE-2025-55184",
            "CVE-2025-67779"
          ]
        },
        {
          "slug": "microsoft-december-2025-patch-tuesday-exploited-zero-day-cve-2025-62221",
          "headline": "Microsoft Patches Actively Exploited Zero-Day in Final 2025 Update",
          "summary": "Microsoft's December 2025 Patch Tuesday release addresses 57 vulnerabilities, including a critical, actively exploited zero-day privilege escalation flaw in the Windows Cloud Files Mini Filter Driver. Tracked as CVE-2025-62221, the vulnerability allows a local attacker to gain SYSTEM-level privileges and has been added to CISA's Known Exploited Vulnerabilities (KEV) catalog. The update also patches two other publicly disclosed vulnerabilities in GitHub Copilot and Windows PowerShell, alongside critical RCE flaws in Microsoft Office.",
          "categories": [
            "Patch Management",
            "Vulnerability",
            "Cyberattack"
          ],
          "tags": [
            "CISA KEV",
            "Patch Tuesday",
            "Privilege Escalation",
            "RCE",
            "Windows",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-11T15:00:00.000Z",
          "cves": [
            "CVE-2025-54100",
            "CVE-2025-62221",
            "CVE-2025-62554",
            "CVE-2025-62557",
            "CVE-2025-64671"
          ]
        },
        {
          "slug": "unpatched-gogs-git-service-zero-day-cve-2025-8110-actively-exploited",
          "headline": "Unpatched Zero-Day in Gogs Git Service Actively Exploited to Gain SSH Access",
          "summary": "A critical, unpatched zero-day vulnerability in Gogs, a popular self-hosted Git service, is being actively exploited in the wild. Tracked as CVE-2025-8110 with a CVSS score of 8.7, the flaw is a bypass of a previously patched RCE and allows an attacker to overwrite arbitrary files, ultimately leading to SSH access on the server. Researchers at Wiz have identified over 700 compromised instances, with attackers deploying the Supershell C2 framework.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Cloud Security"
          ],
          "tags": [
            "Git",
            "Gogs",
            "RCE",
            "Supershell",
            "Supply Chain",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-11T15:00:00.000Z",
          "cves": [
            "CVE-2024-55947",
            "CVE-2025-8110"
          ],
          "malware": [
            "Supershell"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "critical-react2shell-rce-vulnerability-in-react-and-nextjs-sparks-emergency-patching",
        "originalHeadline": "React2Shell: Critical 10.0 CVSS RCE Flaw in React and Next.js Under Active Exploitation",
        "updateTitle": "Update: React2Shell: Critical 10.0 CVSS RCE Flaw in React and Next.js Under Active Exploitation",
        "updateSummary": "New DoS and source code leak flaws discovered in React Server Components, requiring immediate re-patching for users who addressed React2Shell.",
        "categories": [
          "Vulnerability",
          "Cyberattack",
          "Threat Intelligence"
        ],
        "tags": [
          "CVE-2025-55182",
          "Deserialization",
          "KEV",
          "Next.js",
          "RCE",
          "React",
          "Web Security",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-55182",
          "CVE-2025-66478"
        ],
        "severity": "critical",
        "publishedAt": "2025-12-04T15:00:00.000Z",
        "updatedAt": "2025-12-11T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}