{
  "lastUpdated": "2026-01-26T01:42:36.612Z",
  "runDate": "2026-01-25",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-25",
      "type": "publication-daily",
      "headline": "Massive 149M Credential Leak, Sandworm's 'DynoWiper' Targets Poland, and FortiGate Firewalls Breached Despite Patches",
      "articleCount": 12,
      "articles": [
        {
          "slug": "microsoft-releases-emergency-update-to-fix-outlook-freezing-issue",
          "headline": "Microsoft Rushes Out Emergency Fix for Outlook Freezing Bug",
          "summary": "Microsoft has released an emergency out-of-band (OOB) update to fix a bug causing the Microsoft Outlook client to freeze. The issue, which is separate from the recent Windows 11 boot failures, primarily affects users who store their PST (Personal Storage Table) files on cloud services like OneDrive or Dropbox. The problem was reported to be more prevalent in enterprise environments. Users experiencing the freezing issue are advised to apply the emergency patch immediately.",
          "categories": [
            "Patch Management",
            "Security Operations"
          ],
          "tags": [
            "Dropbox",
            "Microsoft Outlook",
            "OOB update",
            "OneDrive",
            "PST file",
            "bug"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "microsoft-investigates-windows-11-boot-failures-after-january-2026-updates",
          "headline": "Windows 11 Fails to Boot for Some Users After Installing January 2026 Security Updates",
          "summary": "Microsoft is investigating widespread reports of Windows 11 devices failing to boot after installing the January 2026 security updates, including cumulative update KB5074109. Affected users are met with a black screen and an 'UNMOUNTABLE_BOOT_VOLUME' stop error. The issue primarily impacts physical devices running Windows 11 versions 25H2 and 24H2. Microsoft has acknowledged the reports and is gathering information via the Feedback Hub to determine the root cause and develop a fix.",
          "categories": [
            "Patch Management",
            "Security Operations"
          ],
          "tags": [
            "KB5074109",
            "Patch Tuesday",
            "Windows 11",
            "boot failure",
            "bug"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "everest-ransomware-group-leaks-343gb-of-under-armour-customer-data",
          "headline": "Everest Ransomware Group Leaks 343GB of Under Armour Customer Data",
          "summary": "The Russia-linked Everest ransomware group has leaked 343 GB of data allegedly stolen from global sportswear brand Under Armour. The massive data dump, which occurred on January 24, 2026, followed a failed extortion attempt. The leaked data is reported to contain the personally identifiable information (PII) of millions of customers, highlighting the 'double extortion' tactic where data publication is the primary threat. Under Armour has not yet commented on the incident.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Everest",
            "PII",
            "Under Armour",
            "data leak",
            "double extortion",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "massive-149m-credential-leak-exposes-gmail-facebook-financial-services",
          "headline": "Massive 149 Million Credential Leak Exposes Gmail, Facebook, and Financial Service Users",
          "summary": "A publicly accessible, unencrypted 96 GB database containing 149.4 million unique login credentials has been discovered by a security researcher. The data, believed to be compiled from various infostealer malware logs and past breaches, impacts an estimated 48 million Gmail accounts, alongside users of Facebook, financial services, government portals, and numerous other online platforms. The leak includes usernames, passwords, and the direct login URLs, posing a significant risk of account takeover and fraud for millions of individuals globally.",
          "categories": [
            "Data Breach",
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "account takeover",
            "credential leak",
            "data exposure",
            "infostealer",
            "password security"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "malware": [
            "Infostealer malware"
          ]
        },
        {
          "slug": "microsoft-warns-of-aitm-phishing-and-bec-attacks-targeting-energy-firms",
          "headline": "Microsoft Warns of Sophisticated Phishing Attacks on Energy Sector",
          "summary": "The Microsoft Defender Security Research Team has issued a warning about a sophisticated, multi-stage phishing campaign targeting organizations in the energy sector. The attack begins with phishing emails sent from trusted, previously compromised accounts and abuses Microsoft SharePoint for payload delivery. After initial compromise, attackers use Adversary-in-the-Middle (AitM) techniques and create inbox rules for persistence. The campaign then evolves into Business Email Compromise (BEC) activity to expand its reach.",
          "categories": [
            "Phishing",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "AitM",
            "BEC",
            "Microsoft 365",
            "SharePoint",
            "energy sector",
            "phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "nike-investigates-data-breach-claim-from-worldleaks-extortion-group",
          "headline": "Nike Probes Data Breach Claim by 'WorldLeaks' Extortion Group",
          "summary": "Global apparel giant Nike has launched an investigation into a potential data breach after being listed as a victim by the 'WorldLeaks' data extortion group. The group, which emerged in 2025 and focuses on data theft without deploying ransomware, threatened to publish stolen Nike data on January 24. Nike has confirmed it is assessing the situation. The type and volume of the allegedly stolen data have not been disclosed by the attackers.",
          "categories": [
            "Data Breach",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "WorldLeaks",
            "cybercrime",
            "data theft",
            "extortion",
            "retail"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "multi-stage-phishing-campaign-targets-russia-with-amnesia-rat-and-ransomware",
          "headline": "Phishing Campaign Hits Russia with Amnesia RAT, Uses GitHub and Dropbox for Payload Delivery",
          "summary": "A sophisticated, multi-stage phishing campaign is targeting users in Russia, delivering a combination of the Amnesia remote access trojan (RAT) and ransomware. The attack, analyzed by Fortinet FortiGuard Labs, is notable for its use of public cloud services like GitHub and Dropbox to host payloads and its use of a tool called 'defendnot' to disable Microsoft Defender antivirus. The campaign relies on social engineering and abuse of native Windows features rather than software exploits to achieve system compromise.",
          "categories": [
            "Phishing",
            "Malware",
            "Ransomware"
          ],
          "tags": [
            "Amnesia RAT",
            "Dropbox",
            "GitHub",
            "Microsoft Defender",
            "defense evasion",
            "phishing",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "malware": [
            "Amnesia RAT",
            "defendnot"
          ]
        },
        {
          "slug": "shinyhunters-claims-breaches-of-crunchbase-betterment-via-okta-vishing",
          "headline": "ShinyHunters Claims Breach of Crunchbase, Betterment via Okta Vishing Attacks",
          "summary": "The notorious cyber extortion syndicate ShinyHunters has claimed responsibility for breaching business intelligence firm Crunchbase and financial advisory company Betterment. According to the threat actor, the initial access was gained by using sophisticated voice phishing (vishing) attacks to socially engineer employees and compromise their Okta single sign-on (SSO) credentials. This method allows attackers to bypass weaker forms of multi-factor authentication. Neither of the targeted companies has publicly confirmed the breach.",
          "categories": [
            "Phishing",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Betterment",
            "Crunchbase",
            "MFA bypass",
            "Okta",
            "ShinyHunters",
            "social engineering",
            "vishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z"
        },
        {
          "slug": "trend-micro-details-new-rce-exploit-for-metagpt-cve-2026-0761",
          "headline": "Trend Micro Details New RCE Flaw in MetaGPT (CVE-2026-0761)",
          "summary": "Trend Micro has published details and a detection rule for a new high-severity remote code execution (RCE) vulnerability in Foundation Agents MetaGPT, tracked as CVE-2026-0761. The exploit, which occurs over HTTP, can be leveraged by an attacker for initial access into a network or for lateral movement. Trend Micro has released DDI RULE 5627 to detect exploitation attempts and advises organizations to update security products and scan for signs of compromise.",
          "categories": [
            "Vulnerability",
            "Threat Intelligence"
          ],
          "tags": [
            "CVE-2026-0761",
            "MetaGPT",
            "RCE",
            "Trend Micro",
            "exploit",
            "vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "cves": [
            "CVE-2026-0761"
          ]
        },
        {
          "slug": "critical-11-year-old-telnet-vulnerability-cve-2026-24061-disclosed",
          "headline": "Critical 11-Year-Old Telnet Flaw (CVE-2026-24061) with 9.8 CVSS Score Disclosed",
          "summary": "A critical, 11-year-old authentication bypass vulnerability in the GNU InetUtils telnet daemon (telnetd) has been disclosed. Tracked as CVE-2026-24061, the flaw carries a CVSS score of 9.8 out of 10.0 and allows a remote attacker to gain root access on affected systems without authentication. The vulnerability impacts GNU InetUtils versions 1.9.3 through 2.7, posing a severe risk to legacy enterprise systems and embedded devices where the outdated Telnet protocol may still be in use.",
          "categories": [
            "Vulnerability"
          ],
          "tags": [
            "CVE-2026-24061",
            "GNU InetUtils",
            "Telnet",
            "authentication bypass",
            "legacy systems",
            "vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "cves": [
            "CVE-2026-24061"
          ]
        },
        {
          "slug": "sandworm-deploys-new-dynowiper-malware-in-attack-on-polish-power-grid",
          "headline": "Sandworm Deploys New 'DynoWiper' Malware in Failed Attack on Polish Power Grid",
          "summary": "The Russian state-sponsored hacking group Sandworm has been attributed with a major, albeit unsuccessful, cyberattack against Poland's power system in late December 2025. Poland's energy minister described it as the 'largest cyber attack' on their energy infrastructure in years. Cybersecurity firm ESET linked the attack to Sandworm and discovered the use of a previously undocumented destructive malware, which has been named 'DynoWiper'. This incident underscores Sandworm's continued focus on targeting critical infrastructure with new cyber weapons.",
          "categories": [
            "Cyberattack",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "DynoWiper",
            "ICS",
            "OT",
            "Poland",
            "Russia",
            "Sandworm",
            "critical infrastructure",
            "nation-state",
            "wiper malware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "malware": [
            "DynoWiper"
          ]
        },
        {
          "slug": "fully-patched-fortigate-firewalls-compromised-via-sso-bypass",
          "headline": "Warning: Fully Patched FortiGate Firewalls Are Being Compromised via New SSO Bypass",
          "summary": "Security analysts are warning of a new wave of attacks compromising even fully patched Fortinet FortiGate firewalls. The activity, observed since January 15, 2026, allows attackers to bypass SAML-based single sign-on (SSO) authentication to gain administrative access. The attacks result in unauthorized configuration changes, creation of persistent user accounts, and exfiltration of device configurations. Fortinet has reportedly identified a new, distinct attack path related to previously disclosed vulnerabilities (CVE-2025-59718, CVE-2025-59719), suggesting existing patches may not be fully effective.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "FortiGate",
            "Fortinet",
            "SAML",
            "SSO",
            "authentication bypass",
            "firewall",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-25T15:00:00.000Z",
          "cves": [
            "CVE-2025-59718",
            "CVE-2025-59719"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-24",
      "type": "publication-daily",
      "headline": "Critical 11-Year-Old Telnet Flaw Under Active Exploit; Pwn2Own Exposes Major Automotive Zero-Days",
      "articleCount": 11,
      "articles": [
        {
          "slug": "microsoft-releases-emergency-oob-updates-to-fix-january-patch-tuesday-issues",
          "headline": "Microsoft Issues Emergency Out-of-Band Patches for Flawed January Updates",
          "summary": "Microsoft has released several emergency out-of-band (OOB) updates on January 24, 2026, to address significant bugs introduced by its January 13 Patch Tuesday release. The faulty updates caused a range of issues, including Remote Desktop connection failures, application hangs when accessing cloud storage like OneDrive, and system restart failures. The new cumulative updates, including KB5078136 and KB5078238, are available for various Windows versions and are intended to restore stability and functionality for affected users.",
          "categories": [
            "Patch Management",
            "Security Operations"
          ],
          "tags": [
            "Bug Fix",
            "KB5078136",
            "KB5078238",
            "Microsoft",
            "Out-of-Band",
            "Patch Tuesday",
            "Remote Desktop",
            "Windows Update"
          ],
          "severity": "medium",
          "isUpdate": true,
          "publishedAt": "2026-01-24T15:00:00.000Z",
          "updatedAt": "2026-01-25T00:00:00.000Z"
        },
        {
          "slug": "inc-ransomware-opsec-failure-leads-to-data-recovery-for-12-us-organizations",
          "headline": "OpSec Fail: INC Ransomware Gang's Mistake Leads to Data Recovery for a Dozen Victims",
          "summary": "A significant operational security (OpSec) failure by the INC ransomware gang has allowed a digital forensics firm, Cyber Centaurs, to recover data stolen from at least twelve U.S. organizations. During an investigation, researchers discovered that the attackers had left behind PowerShell scripts and configuration files for a legitimate backup tool called Restic. These artifacts contained hardcoded information that pointed the investigators to the cloud repository where the attackers were storing the exfiltrated data, enabling its recovery. The victims spanned multiple industries, including healthcare and manufacturing.",
          "categories": [
            "Incident Response",
            "Ransomware",
            "Threat Intelligence"
          ],
          "tags": [
            "Cyber Centaurs",
            "DFIR",
            "Data Recovery",
            "INC Ransomware",
            "OpSec",
            "Operational Security",
            "Ransomware",
            "Restic"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-24T15:00:00.000Z",
          "malware": [
            "RainINC ransomware"
          ]
        },
        {
          "slug": "uk-proposes-cyber-security-and-resilience-bill-to-regulate-msps",
          "headline": "UK Advances New Bill to Regulate Managed Service Providers (MSPs)",
          "summary": "The United Kingdom government is advancing a new Cyber Security and Resilience Bill aimed at strengthening the nation's digital supply chain. A key provision of the bill is to bring Managed Service Providers (MSPs) under direct regulatory oversight for the first time. Citing the systemic risk demonstrated by attacks like the one on Synnovis that impacted the NHS, the legislation will impose security duties on MSPs similar to those already applied to essential services. The goal is to establish a higher baseline of security across the thousands of organizations that rely on MSPs for their IT and security operations.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "Compliance",
            "MSP",
            "Managed Service Provider",
            "NIS Regulations",
            "Policy",
            "Regulation",
            "Supply Chain Security",
            "UK"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-24T15:00:00.000Z"
        },
        {
          "slug": "cisa-adds-four-actively-exploited-vulnerabilities-to-kev-catalog",
          "headline": "CISA Adds Four Actively Exploited Flaws in Prettier, Vite, Versa, and Zimbra to KEV Catalog",
          "summary": "On January 23, 2026, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) added four new vulnerabilities to its Known Exploited Vulnerabilities (KEV) catalog, confirming they are under active exploitation. The flaws affect a diverse range of products: the code formatter `eslint-config-prettier`, the front-end build tool `Vite`, the Versa Concerto SD-WAN platform, and the Synacor Zimbra Collaboration Suite. Federal agencies are now required to patch these vulnerabilities by a specified deadline, and CISA strongly urges all organizations to prioritize remediation to mitigate significant risk.",
          "categories": [
            "Vulnerability",
            "Threat Intelligence",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "KEV",
            "Known Exploited Vulnerability",
            "Patch Management",
            "Prettier",
            "Versa Networks",
            "Vite",
            "Zimbra"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-24T15:00:00.000Z"
        },
        {
          "slug": "dragonforce-ransomware-claims-attack-on-us-bank-uinta-bank",
          "headline": "DragonForce Ransomware Claims Attack on U.S. Bank, Threatens Data Leak",
          "summary": "The DragonForce ransomware group has claimed responsibility for a cyberattack against Uinta Bank, a community bank based in Wyoming, USA. In a post on their data leak site on January 23, 2026, the threat actors announced the breach and threatened to publish a \"full dump\" of the bank's data if negotiations are not initiated. This double extortion tactic, which involves both data encryption and data exfiltration, puts significant pressure on the victim organization. The incident underscores the ongoing threat ransomware poses to the financial services sector, regardless of the institution's size.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Cyberattack",
            "Data Breach",
            "Double Extortion",
            "DragonForce",
            "Financial Services",
            "Ransomware",
            "Uinta Bank"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-24T15:00:00.000Z"
        },
        {
          "slug": "microsoft-uncovers-aitm-phishing-campaign-targeting-energy-sector-via-sharepoint",
          "headline": "Energy Sector Targeted by Sophisticated AiTM Phishing Attack Abusing SharePoint",
          "summary": "Microsoft has identified a highly sophisticated, multi-stage adversary-in-the-middle (AiTM) phishing campaign specifically targeting organizations in the energy sector. The attackers abuse trusted SharePoint links in phishing emails to bypass security filters and steal session cookies, allowing them to circumvent multi-factor authentication (MFA). Once inside a victim's mailbox, they create malicious inbox rules to maintain persistence and facilitate Business Email Compromise (BEC) attacks. This campaign's combination of AiTM techniques and abuse of a trusted Microsoft service makes it particularly dangerous and difficult to detect.",
          "categories": [
            "Phishing",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "Adversary-in-the-Middle",
            "AiTM",
            "BEC",
            "Energy Sector",
            "MFA Bypass",
            "Phishing",
            "Session Hijacking",
            "SharePoint"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-24T15:00:00.000Z"
        },
        {
          "slug": "lastpass-warns-of-phishing-campaign-impersonating-maintenance-alerts",
          "headline": "LastPass Users Targeted in Phishing Campaign to Steal Master Passwords",
          "summary": "Password manager service LastPass is warning its users of an active phishing campaign aimed at stealing their master passwords. Attackers are sending fraudulent emails that impersonate official LastPass maintenance alerts, creating a false sense of urgency to trick users into 'backing up' their password vaults. The links in these emails lead to a convincing but malicious clone of the LastPass login page designed to capture user credentials. LastPass has confirmed it is working to take down the attacker infrastructure and advises users to be vigilant.",
          "categories": [
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "Credential Harvesting",
            "Cybersecurity Alert",
            "LastPass",
            "Master Password",
            "Phishing",
            "Social Engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-24T15:00:00.000Z"
        },
        {
          "slug": "linkedin-phishing-campaign-distributes-rat-malware-via-dll-sideloading",
          "headline": "LinkedIn Messages Used to Spread RAT Malware in DLL Sideloading Campaign",
          "summary": "A broad and opportunistic phishing campaign is using LinkedIn private messages to distribute Remote Access Trojan (RAT) malware to high-value individuals. Attackers build trust with targets before sending them a malicious WinRAR self-extracting (SFX) archive. When opened, the file executes a sophisticated DLL sideloading attack, using a legitimate PDF reader to load a malicious DLL. This multi-stage process installs the RAT, giving attackers persistent remote access to the victim's system for espionage and data theft. The use of a trusted platform like LinkedIn makes the campaign particularly effective at bypassing traditional security.",
          "categories": [
            "Phishing",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "DLL Sideloading",
            "LinkedIn",
            "Malware",
            "Phishing",
            "RAT",
            "Remote Access Trojan",
            "Social Engineering"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-24T15:00:00.000Z"
        },
        {
          "slug": "osiris-ransomware-variant-emerges-in-southeast-asia-with-links-to-inc-gang",
          "headline": "New 'Osiris' Ransomware Hits Southeast Asia, Uses BYOVD to Kill Security Tools",
          "summary": "A new ransomware family, dubbed 'Osiris', is being used in active campaigns targeting organizations across Southeast Asia. Security researchers have identified strong links between Osiris and the notorious 'Inc' ransomware group, based on shared tools and attack techniques. Notably, the attackers are using a Bring-Your-Own-Vulnerable-Driver (BYOVD) technique, leveraging the 'Poortry' driver to terminate endpoint security products like EDR and antivirus before deploying the ransomware. This allows the malware to encrypt files unimpeded, highlighting an increasing level of sophistication among ransomware operators.",
          "categories": [
            "Ransomware",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "BYOVD",
            "Defense Evasion",
            "Inc Ransomware",
            "Malware",
            "Osiris",
            "Poortry",
            "Ransomware",
            "Southeast Asia"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-24T15:00:00.000Z",
          "malware": [
            "Mimikatz",
            "Osiris Ransomware",
            "Poortry"
          ]
        },
        {
          "slug": "researchers-earn-over-1-million-for-hacking-tesla-at-pwn2own-automotive-2026",
          "headline": "Pwn2Own Automotive: Hackers Earn $1M+ Exposing 76 Zero-Days in Tesla and Other Vehicle Systems",
          "summary": "At the Pwn2Own Automotive 2026 event, security researchers earned over $1 million by successfully demonstrating 76 unique zero-day exploits against a range of modern vehicle systems. A major focus was Tesla, where researchers chained multiple vulnerabilities to gain root access to an infotainment system, accounting for $516,500 of the total prize money. The competition also targeted EV chargers and other in-vehicle infotainment (IVI) systems, highlighting the expanding and critical attack surface of the connected automotive industry. Vendors have been given a 90-day disclosure deadline to patch the flaws.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "Automotive Security",
            "Car Hacking",
            "EV Charger",
            "Infotainment",
            "Pwn2Own",
            "Tesla",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-24T15:00:00.000Z"
        },
        {
          "slug": "critical-11-year-old-telnetd-flaw-cve-2026-24061-actively-exploited-for-root-access",
          "headline": "Urgent Patch Required: 11-Year-Old Critical Telnetd Flaw (CVE-2026-24061) Now Under Active Exploit",
          "summary": "A critical, 11-year-old vulnerability in the GNU InetUtils `telnetd` service, tracked as CVE-2026-24061 with a CVSS score of 9.8, is now being actively exploited by attackers. The flaw, present in versions 1.9.3 through 2.7, allows an unauthenticated remote attacker to gain root-level privileges. Following the public release of a proof-of-concept (PoC) exploit, threat actors are leveraging this vulnerability to compromise unpatched systems. System administrators are urged to immediately disable the `telnetd` service or apply updates where available to mitigate this severe risk.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "Active Exploitation",
            "CVE-2026-24061",
            "GNU InetUtils",
            "Legacy Protocol",
            "Patch Management",
            "Remote Code Execution",
            "Root Access",
            "Zero-Day",
            "telnetd"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-24T15:00:00.000Z",
          "cves": [
            "CVE-2026-24061"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "microsoft-releases-emergency-oob-updates-to-fix-january-patch-tuesday-issues",
        "originalHeadline": "Microsoft Issues Emergency Out-of-Band Patches for Flawed January Updates",
        "updateTitle": "Update: Microsoft Issues Emergency Out-of-Band Patches for Flawed January Updates",
        "updateSummary": "New critical boot failures reported on Windows 11 after January updates, Microsoft investigating.",
        "categories": [
          "Patch Management",
          "Security Operations"
        ],
        "tags": [
          "Bug Fix",
          "KB5078136",
          "KB5078238",
          "Microsoft",
          "Out-of-Band",
          "Patch Tuesday",
          "Remote Desktop",
          "Windows Update"
        ],
        "severity": "medium",
        "publishedAt": "2026-01-24T15:00:00.000Z",
        "updatedAt": "2026-01-25T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}