{
  "lastUpdated": "2026-01-12T16:37:25.920Z",
  "runDate": "2026-01-12",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-12",
      "type": "publication-daily",
      "headline": "CrazyHunter Ransomware Hits Taiwanese Healthcare, G7 Warns on Quantum Threats, and Malicious npm Packages Target n8n",
      "articleCount": 12,
      "articles": [
        {
          "slug": "instagram-denies-breach-amid-password-reset-bug-and-data-leak-confusion",
          "headline": "Instagram Denies Breach After Password Bug Sparks Widespread Panic",
          "summary": "Instagram's parent company, Meta, has denied that its systems were breached after a bug caused a wave of legitimate but unsolicited password reset emails to be sent to users, sparking fears of a mass compromise. The incident coincided with the circulation of a 17.5 million user dataset on a hacker forum, which further fueled breach speculation. However, Meta clarified the password emails were due to a now-fixed bug that did not expose accounts. Security researchers have assessed the leaked data as a repackaged version of an old dataset from 2017, not the result of a new breach. Despite the lack of a new intrusion, the events increase the risk of targeted phishing attacks against users.",
          "categories": [
            "Data Breach",
            "Phishing",
            "Cloud Security"
          ],
          "tags": [
            "Cybernews",
            "Data Breach",
            "Instagram",
            "Meta",
            "Password Reset",
            "Phishing",
            "Social Media"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        },
        {
          "slug": "wef-report-cyber-fraud-overtakes-ransomware-as-top-threat",
          "headline": "Cyber-Fraud Now Top Global Threat, Surpassing Ransomware, WEF Report Finds",
          "summary": "The World Economic Forum's (WEF) 'Global Cybersecurity Outlook 2026' report, produced with Accenture, reveals a major shift in the threat landscape: cyber-enabled fraud and phishing have now surpassed ransomware as the top concern for global business leaders. The report highlights that fraud has reached 'record highs,' with 77% of leaders reporting an increase. It also identifies Artificial Intelligence as the most consequential force shaping cybersecurity in 2026, with 94% of leaders agreeing it will be the biggest factor. AI is seen as a double-edged sword, accelerating both offensive capabilities and defensive solutions, while growing concerns about data leaks from generative AI persist.",
          "categories": [
            "Policy and Compliance",
            "Threat Intelligence",
            "Regulatory"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "Cyber Fraud",
            "Cybersecurity Outlook",
            "Phishing",
            "Ransomware",
            "WEF"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        },
        {
          "slug": "g7-issues-roadmap-for-post-quantum-cryptography-in-financial-sector",
          "headline": "G7 Urges Financial Sector to Prepare for Quantum Computing Threat",
          "summary": "The G7 Cyber Expert Group (CEG), co-chaired by the U.S. Department of the Treasury and the Bank of England, has issued a public statement and roadmap advising the global financial sector to begin a coordinated transition to quantum-resilient technology. The guidance warns that advanced quantum computers will eventually be able to break the public-key cryptography that secures the world's financial transactions. The roadmap encourages financial institutions to start assessing their quantum risks and developing formal plans for migrating to post-quantum cryptography (PQC) standards, such as those being developed by NIST, to counter 'harvest now, decrypt later' attacks.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "Banking",
            "Finance",
            "G7",
            "NIST",
            "PQC",
            "Post-Quantum Cryptography",
            "Quantum Computing",
            "U.S. Treasury"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        },
        {
          "slug": "crazyhunter-ransomware-cripples-taiwanese-hospitals-with-advanced-tactics",
          "headline": "CrazyHunter Ransomware Cripples Taiwanese Hospitals with Advanced Tactics",
          "summary": "The CrazyHunter ransomware, a sophisticated fork of the open-source Prince ransomware, has actively targeted and compromised at least six healthcare organizations in Taiwan. Security researchers from Trellix report the Go-developed malware uses advanced evasion and propagation techniques, including Group Policy Object (GPO) abuse and Bring Your Own Vulnerable Driver (BYOVD) attacks to disable security software. The attackers operate a dedicated data leak site, employing a double-extortion model that puts immense pressure on critical healthcare providers to pay ransoms and prevent the release of sensitive patient data.",
          "categories": [
            "Ransomware",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "Active Directory",
            "BYOVD",
            "CrazyHunter",
            "GPO Abuse",
            "Go",
            "Healthcare",
            "Ransomware",
            "Taiwan",
            "Trellix"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "malware": [
            "Prince Ransomware"
          ]
        },
        {
          "slug": "gobuteforcer-botnet-exploits-weak-credentials-on-linux-servers",
          "headline": "GoBruteforcer Botnet Exploits Weak Credentials on Linux Servers to Target Crypto Wallets",
          "summary": "A modular Go-based botnet named GoBruteforcer is actively compromising internet-facing Linux servers by brute-forcing weak credentials for services like FTP, MySQL, and PostgreSQL. According to Check Point Research, the campaign's success is fueled by the widespread use of default or weak passwords, often found in AI-generated server deployment examples. Once compromised, servers are added to an IRC-controlled botnet and used to scan for more victims. The attackers have a clear financial motive, as they have been observed deploying tools on compromised hosts to scan for and drain TRON and Binance Smart Chain cryptocurrency wallets.",
          "categories": [
            "Malware",
            "Cyberattack",
            "Cloud Security"
          ],
          "tags": [
            "Botnet",
            "Brute Force",
            "Check Point",
            "Cryptocurrency",
            "GoBruteforcer",
            "Linux",
            "Malware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "malware": [
            "GoBruteforcer"
          ]
        },
        {
          "slug": "high-severity-code-injection-flaw-in-open-webui-disclosed",
          "headline": "High-Severity Code Injection Flaw in Open WebUI (CVE-2025-64496) Allows RCE",
          "summary": "A high-severity vulnerability, tracked as CVE-2025-64496, has been discovered in Open WebUI, a popular self-hosted interface for large language models (LLMs). The flaw, found by Cato Networks, allows a malicious AI server to inject arbitrary JavaScript code into a user's browser session. This can be exploited to steal authentication tokens and take over the user's account. If the compromised user has specific permissions enabled, the vulnerability can be escalated to achieve full remote code execution (RCE) on the host server. The issue affects Open WebUI versions 0.6.34 and older and was patched in version 0.6.35.",
          "categories": [
            "Vulnerability",
            "Cloud Security",
            "Threat Intelligence"
          ],
          "tags": [
            "AI",
            "Account Takeover",
            "CVE-2025-64496",
            "LLM",
            "Open WebUI",
            "RCE",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "cves": [
            "CVE-2025-64496"
          ]
        },
        {
          "slug": "black-axe-cyber-fraud-network-dismantled-in-spain",
          "headline": "International 'Black Axe' Cybercrime Gang Disrupted in Spain, 34 Arrested",
          "summary": "A joint international law enforcement operation involving Spanish and German police, with support from Europol, has resulted in the arrest of 34 individuals in Spain suspected of belonging to the notorious 'Black Axe' criminal organization. The highly structured, Nigerian-origin network is accused of a wide range of cyber-enabled fraud, including business email compromise (BEC) and romance scams. This specific cell is believed to be responsible for over €5.9 million in fraud losses and was actively recruiting money mules in Spain to launder the proceeds of their global criminal activities.",
          "categories": [
            "Threat Actor",
            "Policy and Compliance",
            "Phishing"
          ],
          "tags": [
            "BEC",
            "Black Axe",
            "Cybercrime",
            "Europol",
            "Fraud",
            "Spain",
            "Takedown"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        },
        {
          "slug": "margaritaville-at-sea-sued-over-customer-data-breach",
          "headline": "Margaritaville at Sea Faces Class Action Lawsuit Over 2025 Data Breach",
          "summary": "A class action lawsuit has been filed against Classica Cruise Operator Ltd., the operator of Margaritaville at Sea, following a data breach in September 2025. The lawsuit alleges the cruise line was negligent in protecting customer data, which resulted in the compromise of extensive Personally Identifiable Information (PII) and Protected Health Information (PHI). The breach, reportedly carried out by the Lynx ransomware group, is said to have exposed names, passport details, Social Security numbers, and financial data. The plaintiff seeks damages for affected customers, who now face an increased risk of identity theft and fraud.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Regulatory"
          ],
          "tags": [
            "Data Breach",
            "Lawsuit",
            "Margaritaville at Sea",
            "Negligence",
            "PHI",
            "PII",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "malware": [
            "Lynx Ransomware"
          ]
        },
        {
          "slug": "pro-russian-hacktivists-target-uk-with-massive-ddos-campaign",
          "headline": "Pro-Russian Hacktivist Group NoName057(16) Unleashes Massive DDoS Campaign Against UK",
          "summary": "The pro-Russian hacktivist group NoName057(16) conducted a highly coordinated and intensive Distributed Denial-of-Service (DDoS) campaign against United Kingdom infrastructure between January 5 and 11, 2026. A report from SOCRadar details 1,812 attack entries targeting 86 unique domains, with 85% of the attacks focused on the UK. The primary targets were government services (55%), but the campaign also hit critical infrastructure, including major seaports and rail networks. The attacks are coordinated through the group's 'DDoSia' project, which uses a volunteer-driven botnet managed via Telegram.",
          "categories": [
            "Cyberattack",
            "Threat Actor",
            "Industrial Control Systems"
          ],
          "tags": [
            "Critical Infrastructure",
            "DDoS",
            "DDoSia",
            "Hacktivism",
            "NoName057(16)",
            "SOCRadar",
            "United Kingdom"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "malware": [
            "DDoSia"
          ]
        },
        {
          "slug": "malicious-npm-packages-target-n8n-automation-platform-in-supply-chain-attack",
          "headline": "Supply Chain Attack: Malicious npm Packages Steal Credentials from n8n Automation Platform",
          "summary": "A novel supply chain attack discovered by Endor Labs is targeting users of the n8n workflow automation platform. Attackers are publishing malicious packages to the npm registry, disguised as legitimate 'community nodes' for popular services. When an unsuspecting user installs one of these nodes and enters their credentials (e.g., OAuth tokens, API keys), the malicious code exfiltrates the entire credential store from the n8n instance to an attacker-controlled server. This gives the attackers access to all services connected to the victim's n8n workflows, such as Salesforce and Stripe, creating a significant risk of widespread data breaches and financial fraud.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "CVE-2026-21858",
            "Credential Theft",
            "Endor Labs",
            "Supply Chain Attack",
            "Workflow Automation",
            "n8n",
            "npm"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z",
          "cves": [
            "CVE-2026-21858"
          ]
        },
        {
          "slug": "everest-ransomware-group-claims-major-breach-of-nissan",
          "headline": "Everest Hacking Group Claims Major Breach of Nissan, Alleges 900GB Data Theft",
          "summary": "The Everest hacking group has claimed responsibility for a significant cyberattack against Japanese automaker Nissan, alleging the exfiltration of approximately 900 GB of sensitive corporate data. On January 10, 2026, the group posted its claims and sample data on its dark web leak site. The published samples, which include screenshots and directory listings, suggest the stolen data contains proprietary designs, financial information, employee records, and customer data. Everest is a Ransomware-as-a-Service (RaaS) group known for its double-extortion tactics. Nissan has not yet publicly confirmed the breach.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Automotive",
            "Data Breach",
            "Everest",
            "Manufacturing",
            "Nissan",
            "RaaS",
            "Ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        },
        {
          "slug": "new-zealand-manage-my-health-patient-portal-suffers-major-data-breach",
          "headline": "Manage My Health Breach: 126,000 New Zealand Patients' Data Exposed",
          "summary": "Manage My Health, New Zealand's largest online patient portal, has confirmed it suffered a major cyberattack in late December 2025. The breach may have exposed the health documents of between 108,000 and 126,000 patients. An attacker using the alias 'Kazu' has claimed responsibility on a cybercrime forum, demanding a US$60,000 ransom and threatening to leak over 400,000 stolen health documents. The company states the breach was limited to its 'Health Documents' module and that its core patient database and user credentials were not accessed. The incident has prompted a government review in New Zealand.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "Data Breach",
            "Healthcare",
            "Kazu",
            "Manage My Health",
            "New Zealand",
            "PHI",
            "Patient Data"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-12T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-11",
      "type": "publication-daily",
      "headline": "Instagram Denies Breach Amid Data Leak Panic; Ransomware Hits French and Japanese Giants",
      "articleCount": 12,
      "articles": [
        {
          "slug": "french-bank-customers-targeted-in-quishing-scam-with-fake-cards",
          "headline": "French Bank Customers Hit by 'Quishing' Scam Using Fake Physical Cards",
          "summary": "A highly deceptive phishing campaign, dubbed 'quishing,' is targeting bank customers in France using a blend of physical and digital tactics. Scammers are sending official-looking letters by postal mail that contain a high-quality counterfeit bank card. The letter instructs the recipient to 'activate' the new card by scanning an included QR code. This QR code directs the victim to a fraudulent website designed to mimic their bank's portal, where their banking credentials and personal information are harvested. This hybrid attack method is effective at bypassing traditional email security filters.",
          "categories": [
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "Bank Fraud",
            "France",
            "Phishing",
            "QR Code",
            "Quishing",
            "Social Engineering"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z"
        },
        {
          "slug": "vulnerability-in-mailpit-dev-tool-cve-2026-22689-allows-email-interception",
          "headline": "High-Severity Flaw in Mailpit Dev Tool Allows Email Interception",
          "summary": "A high-severity vulnerability, tracked as CVE-2026-22689, has been discovered in Mailpit, a popular email testing tool for developers. The flaw is a Cross-Site WebSocket Hijacking (CSWSH) issue affecting all versions prior to 1.28.2. It allows a remote attacker to intercept sensitive data, including the full content of test emails, by tricking a developer running a vulnerable Mailpit instance into visiting a specially crafted malicious website. Users are strongly urged to upgrade to the patched version to mitigate the risk of data exposure.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Security Operations"
          ],
          "tags": [
            "CSWSH",
            "CVE",
            "Developer Tool",
            "Patch",
            "Vulnerability",
            "WebSocket"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z",
          "cves": [
            "CVE-2026-22689"
          ]
        },
        {
          "slug": "yara-x-updated-to-warn-analysts-of-flawed-detection-rules",
          "headline": "YARA-X Update Helps Analysts Avoid Flawed Detection Rules",
          "summary": "Version 1.11.0 of YARA-X, a popular tool for malware analysis, has been released with a key enhancement aimed at improving the accuracy of detection rules. The update introduces 'hash function warnings,' a feature that alerts security analysts when they make common errors in hash string comparisons, such as providing a SHA1 hash where a SHA256 hash is expected. This quality-of-life improvement helps prevent silent false negatives, where a flawed rule fails to detect malware without providing any error, thereby strengthening threat hunting and security operations.",
          "categories": [
            "Security Operations",
            "Patch Management",
            "Threat Intelligence"
          ],
          "tags": [
            "Detection Engineering",
            "False Negatives",
            "Malware Analysis",
            "SecOps",
            "Threat Hunting",
            "YARA"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z"
        },
        {
          "slug": "respawn-patches-remote-control-exploit-in-apex-legends",
          "headline": "Apex Legends 'Remote Control' Hack Patched After Streamers Hijacked",
          "summary": "Respawn Entertainment, the developer of the popular battle royale game Apex Legends, rapidly deployed a patch on January 10, 2026, to fix a significant security exploit. The vulnerability allowed a malicious actor to remotely take control of other players' characters during a live match, an incident that affected several high-profile streamers. The developer was quick to reassure the community that the exploit was not a Remote Code Execution (RCE) vulnerability, meaning attackers could not execute malicious code on victims' computers. The issue was resolved within a day of being publicly acknowledged.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Other"
          ],
          "tags": [
            "Anti-Cheat",
            "Cheating",
            "Exploit",
            "Gaming",
            "Input Hijacking",
            "Respawn"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z"
        },
        {
          "slug": "everest-ransomware-group-claims-major-breach-at-nissan",
          "headline": "Everest Ransomware Claims 900 GB Data Theft from Nissan",
          "summary": "The Everest ransomware group has claimed a massive data breach against Japanese automotive giant Nissan Motor Co., Ltd. In a post on its dark web leak site on January 10, 2026, the group alleged it had stolen approximately 900 GB of sensitive corporate data. To back up its claim, Everest published screenshots showing internal directory structures and file names related to dealerships, finance, and audits. The group, which employs a double-extortion model, has given Nissan a five-day deadline to respond before it threatens to release the data publicly. Nissan has not yet officially confirmed the breach.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Automotive",
            "Dark Web",
            "Data Exfiltration",
            "Japan",
            "Manufacturing",
            "RaaS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z"
        },
        {
          "slug": "financial-sector-faces-systemic-supply-chain-risk-and-indirect-ransomware",
          "headline": "Financial Sector Warned of Systemic Supply Chain Risk and 'Indirect Ransomware'",
          "summary": "A new threat intelligence report for 2025-2026 reveals a perilous cyber landscape for the financial sector, dominated by systemic supply chain risks and evolving ransomware tactics. Citing data that 97% of U.S. banks were breached via third-party suppliers in 2024, the report underscores the critical vulnerability posed by partners. It also highlights the rise of 'indirect ransomware,' where attackers compromise a supplier to bypass a bank's defenses. Geopolitical threats also persist, with pro-Russian hacktivists targeting European banks and the North Korean Lazarus Group remaining a primary state-aligned threat.",
          "categories": [
            "Threat Intelligence",
            "Supply Chain Attack",
            "Policy and Compliance"
          ],
          "tags": [
            "DORA",
            "Financial Services",
            "Indirect Ransomware",
            "Supply Chain",
            "Third-Party Risk",
            "Threat Report"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z"
        },
        {
          "slug": "instagram-denies-breach-after-17-5m-user-data-leak-sparks-password-reset-scares",
          "headline": "Instagram Denies Breach as 17.5M User Data Leak Sparks Password Reset Panic",
          "summary": "A dataset containing 17.5 million Instagram user records, including names, emails, and phone numbers, was published on a hacking forum, triggering a wave of password reset emails and widespread breach fears. The data was allegedly posted by a threat actor named 'Solonik'. Instagram's parent company, Meta, denied its systems were compromised, stating the unsolicited emails were caused by a bug that allowed mass password reset requests. While no passwords were leaked, the exposed personally identifiable information (PII) creates a significant risk for targeted phishing, identity theft, and SIM swapping attacks against the affected users. The data is believed to have been scraped via an insecure API during 2024.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Other"
          ],
          "tags": [
            "API Security",
            "Data Scraping",
            "PII",
            "Password Reset",
            "Phishing",
            "Social Media"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z"
        },
        {
          "slug": "iran-linked-muddywater-apt-deploys-rustywater-rat-in-middle-east",
          "headline": "Iran's MuddyWater APT Unveils 'RustyWater' RAT in Middle East Espionage",
          "summary": "The Iranian state-sponsored advanced persistent threat (APT) group MuddyWater, also known as Mango Sandstorm and TA450, has been observed deploying a new, custom-built Remote Access Trojan (RAT) named 'RustyWater'. According to research from CloudSEK, this new implant, written in the Rust programming language, is being used in a spear-phishing campaign targeting diplomatic, maritime, financial, and telecom entities across the Middle East. The shift to a Rust-based tool marks a significant evolution in the group's capabilities, aimed at enhancing stealth and evading detection during long-term espionage operations.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Cyber Espionage",
            "Iran",
            "Middle East",
            "RAT",
            "Rust",
            "Spear-phishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z",
          "malware": [
            "RustyWater"
          ]
        },
        {
          "slug": "new-zealand-manage-my-health-portal-breached-hacker-demands-ransom",
          "headline": "NZ Health Portal Breached; Hacker 'Kazu' Demands Ransom for Patient Data",
          "summary": "New Zealand's largest patient health portal, 'Manage My Health', has suffered a significant data breach affecting between 86,000 and 125,000 users, with a large concentration in the Northland region. A threat actor using the name 'Kazu' has claimed responsibility, stating they have stolen hundreds of thousands of sensitive medical files and are demanding a US$60,000 ransom. The compromised data includes highly sensitive protected health information (PHI), causing widespread distress among patients. In response, Manage My Health has secured a High Court injunction to prevent the publication of the stolen data.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Industrial Control Systems"
          ],
          "tags": [
            "Extortion",
            "Healthcare Breach",
            "New Zealand",
            "PHI",
            "Patient Data",
            "Ransom Demand"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z"
        },
        {
          "slug": "vida-y-salud-health-systems-breach-exposes-data-of-34000-patients",
          "headline": "Texas Health System Breach Exposes Data of Over 34,000 Patients",
          "summary": "Vida Y Salud Health Systems Inc., a nonprofit health center serving rural communities in South Texas, has reported a data breach that exposed the sensitive personal and medical information of 34,504 patients. The organization detected unauthorized access to its network in October 2025, where an attacker copied files containing names, Social Security numbers, driver's license numbers, and protected health information (PHI). Vida Y Salud is notifying affected individuals and offering complimentary credit monitoring services as law firms begin to investigate the incident.",
          "categories": [
            "Data Breach",
            "Industrial Control Systems"
          ],
          "tags": [
            "Data Breach",
            "Healthcare Breach",
            "PHI",
            "Patient Data",
            "SSN",
            "Texas"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z"
        },
        {
          "slug": "chinese-apt-salt-typhoon-linked-to-hack-of-us-congressional-staff-emails",
          "headline": "Chinese APT 'Salt Typhoon' Breaches U.S. Congressional Staff Emails",
          "summary": "The Chinese state-affiliated hacking group 'Salt Typhoon' has been linked to a significant cyber-espionage operation that breached the email systems of staffers on several influential U.S. House of Representatives committees. The intrusion, detected in December 2025, targeted aides on the foreign affairs, intelligence, and armed services committees, as well as the select committee on China. U.S. officials have linked Salt Typhoon to China's Ministry of State Security (MSS), and the breach is viewed as an alarming effort to gain insight into U.S. policy discussions on national security and foreign relations.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Policy and Compliance"
          ],
          "tags": [
            "APT",
            "China",
            "Cyber Espionage",
            "Government",
            "Nation-State",
            "US Congress"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z"
        },
        {
          "slug": "qilin-ransomware-claims-attack-on-french-giant-bouygues",
          "headline": "Qilin Ransomware Hits French Infra Giant Bouygues, Claims 80GB Data Theft",
          "summary": "The prolific Qilin ransomware group has listed French multinational infrastructure firm Bouygues Energies & Services as its latest victim on its dark web leak site. The group claims to have exfiltrated 80 GB of highly sensitive data, comprising 31,000 files. Most alarmingly, the threat actors allege the stolen data includes documents related to industrial control systems (ICS), such as SCADA interfaces and network plans for critical infrastructure projects like tunnels and tramways. This attack highlights the severe risk ransomware poses to physical safety and national security, extending beyond simple data encryption.",
          "categories": [
            "Ransomware",
            "Industrial Control Systems",
            "Cyberattack"
          ],
          "tags": [
            "Critical Infrastructure",
            "Data Leak",
            "Double Extortion",
            "France",
            "ICS",
            "SCADA"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-11T15:00:00.000Z"
        }
      ]
    }
  ],
  "articles": {
    "updated": []
  },
  "pages": {
    "updated": []
  }
}