{
  "lastUpdated": "2026-02-03T15:19:54.646Z",
  "runDate": "2026-02-03",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-02-03",
      "type": "publication-daily",
      "headline": "Notepad++ Supply Chain Attack by Chinese APT; Russian Group Exploits Office Zero-Day",
      "articleCount": 12,
      "articles": [
        {
          "slug": "multi-stage-phishing-campaign-uses-pdfs-and-dropbox-lures",
          "headline": "Sophisticated Phishing Attack Uses PDF Lures and Cloud Services to Steal Dropbox Credentials",
          "summary": "A new, multi-stage phishing campaign is using procurement-themed emails with benign-looking PDF attachments to bypass email security filters. The attack chain redirects victims through a legitimate cloud service, Vercel Blob, before presenting a convincing fake Dropbox login page. The goal is to harvest corporate credentials, which are then exfiltrated to an attacker-controlled Telegram bot. This layered approach is designed to appear legitimate and evade detection by both automated systems and wary users.",
          "categories": [
            "Phishing",
            "Data Breach"
          ],
          "tags": [
            "Dropbox",
            "Telegram",
            "Vercel",
            "credential theft",
            "phishing"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "fcc-warns-telecoms-of-increasing-ransomware-threats",
          "headline": "FCC Warns Telecoms of 4x Increase in Ransomware, Urges Better Security",
          "summary": "The U.S. Federal Communications Commission (FCC) has issued a formal alert to the telecommunications industry regarding the escalating threat of ransomware. Citing data that shows a fourfold increase in attacks on the sector between 2022 and 2025, the FCC's Public Safety and Homeland Security Bureau is urging providers to adopt fundamental cybersecurity best practices. The warning emphasizes that vulnerable communications networks pose a significant risk to national security and public safety, and calls for actions like patching, MFA, and network segmentation.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Ransomware"
          ],
          "tags": [
            "FCC",
            "national security",
            "ransomware",
            "regulation",
            "telecom"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "health-isac-reports-55-percent-surge-in-cyber-incidents",
          "headline": "Healthcare Cyber Incidents Surged 55% in 2025, Ransomware Top Threat",
          "summary": "The Health Information Sharing and Analysis Center (Health-ISAC) has reported a staggering 55% year-over-year increase in cyber incidents across all sectors in 2025, with the healthcare sector alone seeing a 21% rise. Ransomware was ranked as the number one threat by healthcare security professionals in 2025, causing significant disruptions. Looking ahead, the industry's top concern for 2026 has shifted to AI-enabled attacks, signaling an evolving and increasingly complex threat landscape for healthcare organizations.",
          "categories": [
            "Threat Intelligence",
            "Policy and Compliance",
            "Ransomware"
          ],
          "tags": [
            "AI",
            "H-ISAC",
            "data breach",
            "healthcare",
            "ransomware",
            "threat report"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "canada-computers-discloses-data-breach-affecting-guest-checkout-customers",
          "headline": "Canada Computers Discloses Data Breach Affecting Guest Checkout Customers",
          "summary": "Canada Computers Inc., a major Canadian electronics retailer, has announced a data breach that exposed the personal and credit card information of customers. The incident affected individuals who used the 'guest' checkout feature on the company's website between December 29, 2025, and January 22, 2026. The company discovered the breach on January 22 and has since launched an investigation with law enforcement. Customers who were logged into member accounts are not believed to be affected.",
          "categories": [
            "Data Breach",
            "Cyberattack",
            "Ransomware"
          ],
          "tags": [
            "Magecart",
            "credit card fraud",
            "data breach",
            "retail",
            "web skimming"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "inc-ransomware-targets-two-us-law-firms",
          "headline": "INC Ransomware Group Breaches Two U.S. Law Firms, Leaks Sensitive Client Data",
          "summary": "The INC ransomware group is actively targeting the U.S. legal sector, claiming responsibility for attacks on at least two law firms: Hawk Law Group and Eisenberg Lowrance Lundell Lofgren. The group alleges it has stolen highly sensitive client information, including data related to civil and criminal litigation cases, government-issued IDs, and personal details. These attacks highlight the significant risk faced by law firms, which are high-value targets for cybercriminals due to the confidential nature of the data they hold.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "INC ransomware",
            "attorney-client privilege",
            "data breach",
            "legal",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "redkitten-campaign-targets-iranian-activists-with-sloppymio-malware",
          "headline": "New 'RedKitten' Campaign Uses SloppyMIO Malware to Spy on Iranian Activists",
          "summary": "A new cyber-espionage campaign, dubbed 'RedKitten,' is targeting Iranian activists and non-governmental organizations (NGOs) with a previously unseen C# implant called 'SloppyMIO.' The campaign shows signs of being assisted by Large Language Models (LLMs) and uses password-protected Excel files as its initial lure. The malware is highly evasive, using steganography, AppDomain Manager injection, and leveraging legitimate services like Telegram, GitHub, and Google Drive for C2 and payload delivery, indicating a sophisticated operation focused on political intelligence gathering.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "C#",
            "Telegram",
            "espionage",
            "malware",
            "steganography"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z",
          "malware": [
            "SloppyMIO"
          ]
        },
        {
          "slug": "notepad-plus-plus-supply-chain-attack-lotus-blossom-apt",
          "headline": "Notepad++ Update Mechanism Hijacked in 6-Month Supply Chain Attack by Chinese APT",
          "summary": "The maintainers of the widely-used Notepad++ text editor have disclosed a major supply chain attack that compromised their update infrastructure for six months in 2025. The attack, attributed to the Chinese espionage group Lotus Blossom (Billbug), involved hijacking update requests to selectively deliver a custom backdoor named 'Chrysalis' and other malware like Cobalt Strike to a targeted set of organizations. Victims were primarily located in Southeast Asia and included government and financial entities, highlighting a sophisticated, long-running espionage campaign.",
          "categories": [
            "Supply Chain Attack",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "APT",
            "backdoor",
            "code signing",
            "espionage",
            "open source",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z",
          "malware": [
            "Chrysalis",
            "Cobalt Strike"
          ]
        },
        {
          "slug": "open-vsx-marketplace-supply-chain-attack-glassworm-malware",
          "headline": "Open VSX Marketplace Hit by Supply Chain Attack Spreading 'GlassWorm' Malware",
          "summary": "The Open VSX Registry, a popular open-source alternative to the VS Code Marketplace, has suffered a supply chain attack. An attacker compromised the credentials of a legitimate developer and used their account to publish malicious versions of four popular extensions. These tainted updates, which collectively had over 22,000 downloads, were embedded with a malware loader known as 'GlassWorm.' The incident highlights the growing threat of attacks targeting developer ecosystems and software repositories.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "Open VSX",
            "VS Code",
            "developer tools",
            "malware",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z",
          "malware": [
            "GlassWorm"
          ]
        },
        {
          "slug": "play-ransomware-targets-manufacturing-firm-deatak",
          "headline": "Play Ransomware Hits US Instrument Manufacturer Deatak in Data Breach",
          "summary": "The Play ransomware group has claimed another victim in the manufacturing sector, listing U.S.-based instrument maker Deatak on its data breach forum. The attackers allege they have compromised and exfiltrated a wide range of private and confidential data, including client documents, employee payroll details, and financial information. This attack underscores the persistent threat that ransomware poses to specialized manufacturing firms, which often possess valuable intellectual property and sensitive corporate data.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Play",
            "data breach",
            "manufacturing",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "qilin-ransomware-claims-attack-on-tulsa-international-airport",
          "headline": "Qilin Ransomware Claims Breach of Tulsa International Airport, Leaks Data",
          "summary": "The Russian-affiliated Qilin ransomware group has claimed responsibility for a cyberattack against Tulsa International Airport. The group has listed the airport on its data leak site, alleging the theft of sensitive data including financial records and employee information. While airport operations reportedly remain unaffected, the incident highlights the ongoing trend of ransomware gangs targeting critical infrastructure. Qilin has been identified as a highly active group, responsible for a significant number of recent attacks.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Qilin",
            "aviation",
            "critical infrastructure",
            "data breach",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "new-britain-connecticut-disrupted-by-ransomware-attack",
          "headline": "Ransomware Attack Cripples City of New Britain, CT, Forcing Manual Operations",
          "summary": "A ransomware attack has caused significant and ongoing disruption to the municipal network systems of New Britain, Connecticut. The attack, which began last week and was later confirmed as ransomware, has impacted the city's entire internet server. As a result, city departments have been forced to abandon digital systems and revert to manual 'pen and paper' operations. Federal authorities have been called in to assist with the investigation and response efforts.",
          "categories": [
            "Ransomware",
            "Cyberattack",
            "Incident Response"
          ],
          "tags": [
            "government",
            "incident response",
            "municipality",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z"
        },
        {
          "slug": "apt28-exploits-microsoft-office-zero-day-cve-2026-21509",
          "headline": "Russian APT28 Exploits Critical Microsoft Office Zero-Day CVE-2026-21509",
          "summary": "The Russian state-sponsored threat group APT28 is actively exploiting a new Microsoft Office security bypass vulnerability, CVE-2026-21509 (CVSS 7.8), just days after an emergency patch was released. The campaign, dubbed 'Operation Neusploit,' targets government-related entities in Ukraine, Slovakia, and Romania using malicious RTF documents. The exploit delivers malware droppers, including one that deploys 'MiniDoor,' an email-stealing implant, and another that delivers a Covenant Grunt payload. CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT28",
            "KEV",
            "Microsoft Office",
            "espionage",
            "patch management",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-03T15:00:00.000Z",
          "cves": [
            "CVE-2026-21509"
          ],
          "malware": [
            "MiniDoor",
            "PixyNetLoader"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-02-02",
      "type": "publication-daily",
      "headline": "Russian Hackers Target Polish Grid, Multiple Supply Chain Attacks, and Two Critical Zero-Days Under Active Exploitation",
      "articleCount": 12,
      "articles": [
        {
          "slug": "new-pulsar-rat-windows-malware-uses-in-memory-execution",
          "headline": "New \"Pulsar RAT\" Evades Detection with In-Memory Execution and LoTL Techniques",
          "summary": "Security researchers have uncovered a new, stealthy Remote Access Trojan (RAT) targeting Windows systems, named 'Pulsar RAT'. This modular, .NET-based malware utilizes a multi-stage infection chain that heavily relies on in-memory execution and living-off-the-land techniques to evade detection. It features advanced anti-analysis capabilities, including anti-VM and anti-debugging checks. Once active, Pulsar RAT provides operators with live, interactive control for credential harvesting and data exfiltration, using legitimate services like Discord and Telegram for command-and-control.",
          "categories": [
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            ".NET",
            "Discord",
            "RAT",
            "Telegram",
            "in-memory",
            "living-off-the-land",
            "malware"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "malware": [
            "Pulsar RAT"
          ]
        },
        {
          "slug": "malicious-chatgpt-chrome-extensions-hijack-user-sessions",
          "headline": "Warning: Malicious ChatGPT Chrome Extensions Steal Session Tokens to Hijack Accounts",
          "summary": "Researchers have identified 16 malicious Google Chrome extensions that masquerade as helpful tools for OpenAI's ChatGPT. Once installed, these extensions inject malicious scripts into the ChatGPT web application. The scripts are designed to monitor outbound requests, intercept sensitive data such as authorization details and session tokens, and exfiltrate them to an attacker-controlled server. This allows the attackers to hijack active user sessions, granting them full access to the victim's account and chat history.",
          "categories": [
            "Malware",
            "Phishing",
            "Cloud Security"
          ],
          "tags": [
            "ChatGPT",
            "Chrome",
            "browser extension",
            "data theft",
            "malware",
            "session hijacking"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "law-enforcement-cracks-down-on-black-basta-ransomware-group",
          "headline": "Law Enforcement Closes In on Black Basta Ransomware Group Members",
          "summary": "In January 2026, a coordinated international law enforcement effort targeted key operators of the Black Basta ransomware group. Ukrainian police conducted searches at the homes of two suspected 'hash-crackers' for the gang, seizing digital evidence. Simultaneously, German federal police publicly identified and issued a warrant for a key member, Oleg Evgenievich Nefedov, who has been added to Europol's EU Most Wanted list. These actions follow the 2025 collapse and internal data leak of the group, which had amassed over $107 million in ransom payments.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Regulatory"
          ],
          "tags": [
            "Black Basta",
            "Europol",
            "Germany",
            "Ukraine",
            "law enforcement",
            "ransomware",
            "takedown"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "forescout-report-details-rise-in-ot-and-iot-attacks",
          "headline": "OT/IoT Attacks Surge, with 84% Increase in OT Protocol Exploits, Forescout Reports",
          "summary": "A new threat report from Forescout Vedere Labs, analyzing over 900 million attacks throughout 2025, reveals a dramatic increase in attacks targeting Operational Technology (OT) and the Internet of Things (IoT). The report highlights an 84% year-over-year increase in attacks leveraging OT-specific protocols, with Modbus being the most abused. Exploitation of IoT devices like IP cameras also grew. Critically, the report found that 71% of vulnerabilities exploited in the wild were not listed in CISA's Known Exploited Vulnerabilities (KEV) catalog, complicating prioritization for defenders.",
          "categories": [
            "Industrial Control Systems",
            "IoT Security",
            "Threat Intelligence"
          ],
          "tags": [
            "Forescout",
            "IoT",
            "KEV",
            "Modbus",
            "OT",
            "critical infrastructure",
            "threat report",
            "vulnerability management"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "over-80-percent-of-email-scams-now-use-ai-catalan-agency-warns",
          "headline": "Over 80% of Malicious Emails Now Use AI, Catalan Agency Warns",
          "summary": "A new report from the Catalan Cybersecurity Agency has issued a stark warning about the weaponization of artificial intelligence in phishing attacks. According to their 'Cybersecurity Outlook Report for 2026,' a staggering 82.6% of emails containing malicious links are now crafted using generative AI. The agency's director, Laura Caballero, stated that AI makes scams 'much more sophisticated' and 'almost perfect,' significantly lowering the bar for criminals and making fraudulent emails harder for the average user to detect. The agency advocates for using AI-powered defenses to combat the threat.",
          "categories": [
            "Phishing",
            "Threat Intelligence",
            "Policy and Compliance"
          ],
          "tags": [
            "AI",
            "email security",
            "generative AI",
            "phishing",
            "scams",
            "threat intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "redkitten-campaign-uses-ai-assisted-malware-to-target-iranian-activists",
          "headline": "\"RedKitten\" Campaign Deploys AI-Assisted Malware Against Iranian Activists",
          "summary": "A new cyber-espionage campaign in 2026, dubbed 'RedKitten,' has been identified targeting Iranian activists and non-governmental organizations (NGOs). The campaign is notable for using malware that shows signs of being developed with assistance from Large Language Models (LLMs). The attack delivers a C# implant called 'SloppyMIO' via password-protected Excel spreadsheets. The malware is highly sophisticated, using Telegram for C2, leveraging GitHub and Google Drive for payload hosting, and employing steganography to hide its configuration.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Phishing"
          ],
          "tags": [
            "AI-generated malware",
            "Iran",
            "LLM",
            "RedKitten",
            "SloppyMIO",
            "cyber-espionage",
            "steganography"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "malware": [
            "SloppyMIO"
          ]
        },
        {
          "slug": "moltbook-ai-social-network-breach-exposes-1-5-million-api-keys",
          "headline": "AI Social Network \"Moltbook\" Breach Exposes 1.5M API Keys and 29k User Emails",
          "summary": "A significant data breach at the AI-focused social network 'Moltbook' has exposed 1.5 million API keys, 29,000 user emails, and other sensitive data tables. The investigation, conducted by security firm Wiz, not only uncovered the data exposure but also revealed systemic security flaws, such as a lack of rate-limiting on agent registration. The breach also provided a skewed insight into the platform's user base, showing that its 1.5 million 'agents' were owned by only 17,000 human users. Moltbook has since deployed fixes to secure the exposed data.",
          "categories": [
            "Data Breach",
            "Cloud Security"
          ],
          "tags": [
            "AI",
            "API security",
            "Wiz",
            "data breach",
            "misconfiguration",
            "rate limiting",
            "social media"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "open-vsx-marketplace-compromised-to-spread-glassworm-malware",
          "headline": "Open VSX Marketplace Hit by Supply Chain Attack Spreading \"GlassWorm\" Malware",
          "summary": "On January 30, 2026, the Open VSX Registry, a popular marketplace for Visual Studio Code extensions, fell victim to a supply chain attack. Threat actors compromised the account of a legitimate developer, 'oorzc', and published malicious updates to four of their popular extensions. These updates embedded the 'GlassWorm' malware loader. The compromised extensions had been downloaded over 22,000 times, exposing a large number of developers to the malware before the malicious versions were removed by the Open VSX security team.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "GlassWorm",
            "Open VSX",
            "VS Code",
            "developer tools",
            "malware loader",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": true,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "updatedAt": "2026-02-03T00:00:00.000Z",
          "malware": [
            "GlassWorm"
          ]
        },
        {
          "slug": "russian-linked-sandworm-targets-polish-energy-grid-with-wiper-malware",
          "headline": "Sandworm's Failed Wiper Attack on Polish Grid Highlights Critical Infrastructure Risk",
          "summary": "On December 29, 2025, the Russian-linked threat actor Sandworm launched a coordinated destructive cyberattack against approximately 30 Polish renewable energy facilities and a manufacturing company. The attackers exploited vulnerable internet-exposed Fortinet FortiGate devices that used default credentials and lacked MFA. After gaining access, they deployed wiper malware, including DynoWiper and LazyWiper, with the intent to cause widespread damage. While the attack was thwarted by EDR software at a major combined heat and power (CHP) plant and ultimately failed to disrupt the power grid, it caused permanent damage to some Industrial Control System (ICS) devices and underscored the significant risk of cyberattacks against distributed energy resources.",
          "categories": [
            "Industrial Control Systems",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "Fortinet",
            "ICS",
            "OT security",
            "Sandworm",
            "critical infrastructure",
            "default credentials",
            "state-sponsored",
            "wiper malware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "malware": [
            "DynoWiper",
            "LazyWiper"
          ]
        },
        {
          "slug": "escan-antivirus-update-servers-compromised-in-supply-chain-attack",
          "headline": "eScan Antivirus Update Servers Hijacked to Push Malware in Supply Chain Attack",
          "summary": "On January 20, 2026, the update infrastructure of eScan antivirus, a product by Indian firm MicroWorld Technologies, was compromised in a sophisticated supply chain attack. For a two-hour period, threat actors used a regional update server to push a malicious file named 'Reload.exe' to a subset of enterprise and consumer customers. This file acted as a multi-stage downloader designed to establish persistence, enable remote access, and disable the antivirus product's own protective features. MicroWorld Technologies has since isolated the affected servers and released a patch to remediate the issue.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "MicroWorld",
            "antivirus",
            "downloader",
            "eScan",
            "malware delivery",
            "supply chain"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z"
        },
        {
          "slug": "fortinet-patches-critical-forticloud-sso-zero-day-cve-2026-24858",
          "headline": "Fortinet Scrambles to Patch Actively Exploited SSO Zero-Day in FortiGate Firewalls",
          "summary": "Fortinet is urgently rolling out patches for a critical zero-day vulnerability, CVE-2026-24858, that affects the FortiCloud single sign-on (SSO) functionality in FortiGate firewalls. The flaw is being actively exploited in the wild. On January 20th, multiple customers reported that attackers had successfully exploited the vulnerability to gain unauthorized access to their firewalls and create new local administrator accounts. The attacks were successful even on devices running the latest firmware, confirming it as a zero-day. All administrators are urged to patch immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CVE-2026-24858",
            "FortiGate",
            "Fortinet",
            "KEV",
            "SSO",
            "firewall",
            "patch",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "cves": [
            "CVE-2026-24858"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-office-zero-day-cve-2026-21509",
          "headline": "Microsoft Issues Emergency Patch for Actively Exploited Office Zero-Day (CVE-2026-21509)",
          "summary": "Microsoft has released an emergency, out-of-band security update to address a zero-day vulnerability in Microsoft Office and Microsoft 365, tracked as CVE-2026-21509. The flaw is a security feature bypass that allows an attacker to circumvent OLE (Object Linking and Embedding) protections by tricking a user into opening a specially crafted file. Microsoft has confirmed that the vulnerability is being actively exploited in targeted attacks in the wild. All users are urged to apply the updates immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2026-21509",
            "KEV",
            "Microsoft Office",
            "OLE",
            "patch",
            "security feature bypass",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-02T15:00:00.000Z",
          "cves": [
            "CVE-2026-21509"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "health-isac-report-highlights-ai-driven-attacks-as-top-concern-for-2026",
        "originalHeadline": "Health-ISAC Report: AI-Enabled Attacks Named Top Threat to Healthcare Sector in 2026",
        "updateTitle": "Update: Health-ISAC Report: AI-Enabled Attacks Named Top Threat to Healthcare Sector in 2026",
        "updateSummary": "New statistics reveal a 55% surge in cyber incidents in 2025, with healthcare up 21%, and ransomware confirmed as 2025's top threat.",
        "categories": [
          "Threat Intelligence",
          "Policy and Compliance",
          "Ransomware"
        ],
        "tags": [
          "AI",
          "Health-ISAC",
          "Healthcare",
          "Ransomware",
          "Supply Chain Attack",
          "Threat Intelligence"
        ],
        "severity": "informational",
        "publishedAt": "2026-01-27T15:00:00.000Z",
        "updatedAt": "2026-02-03T00:00:00.000Z"
      },
      {
        "slug": "microsoft-issues-emergency-patch-for-actively-exploited-office-zero-day",
        "originalHeadline": "Microsoft Patches Actively Exploited Office Zero-Day (CVE-2026-21509) Under Targeted Attack",
        "updateTitle": "Update: Microsoft Patches Actively Exploited Office Zero-Day (CVE-2026-21509) Under Targeted Attack",
        "updateSummary": "Russian state-sponsored APT28 attributed to 'Operation Neusploit' exploiting CVE-2026-21509, targeting government entities in Ukraine, Slovakia, and Romania with MiniDoor and Covenant Grunt malware.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Cyberattack"
        ],
        "tags": [
          "CISA KEV",
          "CVE-2026-21509",
          "Microsoft Office",
          "OLE",
          "out-of-band patch",
          "security feature bypass",
          "zero-day"
        ],
        "cves": [
          "CVE-2026-20805",
          "CVE-2026-21509"
        ],
        "severity": "critical",
        "publishedAt": "2026-01-28T15:00:00.000Z",
        "updatedAt": "2026-02-03T00:00:00.000Z"
      },
      {
        "slug": "open-vsx-marketplace-compromised-to-spread-glassworm-malware",
        "originalHeadline": "Open VSX Marketplace Hit by Supply Chain Attack Spreading \"GlassWorm\" Malware",
        "updateTitle": "Update: Open VSX Marketplace Hit by Supply Chain Attack Spreading \"GlassWorm\" Malware",
        "updateSummary": "New analysis provides a detailed attack flow, additional MITRE ATT&CK and D3FEND techniques, and expanded impact assessment for the GlassWorm supply chain attack.",
        "categories": [
          "Supply Chain Attack",
          "Malware",
          "Cloud Security"
        ],
        "tags": [
          "GlassWorm",
          "Open VSX",
          "VS Code",
          "developer tools",
          "malware loader",
          "supply chain"
        ],
        "malware": [
          "GlassWorm"
        ],
        "severity": "high",
        "publishedAt": "2026-02-02T15:00:00.000Z",
        "updatedAt": "2026-02-03T00:00:00.000Z"
      },
      {
        "slug": "fortinet-fixes-actively-exploited-sso-authentication-bypass-flaw",
        "originalHeadline": "Fortinet Scrambles to Fix Actively Exploited SSO Auth Bypass (CVE-2026-24858) Hijacking Devices",
        "updateTitle": "Update: Fortinet Scrambles to Fix Actively Exploited SSO Auth Bypass (CVE-2026-24858) Hijacking Devices",
        "updateSummary": "Fortinet confirms CVE-2026-24858 as a zero-day, with active exploitation observed since January 20, 2026, targeting FortiGate firewalls.",
        "categories": [
          "Vulnerability",
          "Cyberattack",
          "Patch Management"
        ],
        "tags": [
          "CISA KEV",
          "CVE-2026-24858",
          "FortiCloud",
          "Fortinet",
          "SSO",
          "authentication bypass",
          "zero-day"
        ],
        "cves": [
          "CVE-2025-59718",
          "CVE-2025-59719",
          "CVE-2026-24858"
        ],
        "severity": "critical",
        "publishedAt": "2026-01-28T15:00:00.000Z",
        "updatedAt": "2026-02-02T12:00:00.000Z"
      },
      {
        "slug": "iran-linked-redkitten-campaign-targets-human-rights-ngos",
        "originalHeadline": "New Iran-Linked 'RedKitten' Group Targets Human Rights NGOs with AI-Suspected Malware",
        "updateTitle": "Update: New Iran-Linked 'RedKitten' Group Targets Human Rights NGOs with AI-Suspected Malware",
        "updateSummary": "New details on RedKitten campaign reveal C# implant 'SloppyMIO' using password-protected Excel, steganography, and AppDomain Manager injection for stealth.",
        "categories": [
          "Threat Actor",
          "Malware",
          "Phishing"
        ],
        "tags": [
          "AI",
          "Espionage",
          "Iran",
          "Malware",
          "NGO",
          "Phishing",
          "RedKitten",
          "Telegram"
        ],
        "severity": "medium",
        "publishedAt": "2026-02-01T15:00:00.000Z",
        "updatedAt": "2026-02-02T12:00:00.000Z"
      },
      {
        "slug": "microsoft-office-zero-day-cve-2026-21509-actively-exploited",
        "originalHeadline": "Microsoft Office Zero-Day Under Active Attack Bypasses Security Features",
        "updateTitle": "Update: Microsoft Office Zero-Day Under Active Attack Bypasses Security Features",
        "updateSummary": "Microsoft confirms its threat intelligence discovered the Office zero-day exploitation, providing more specific attack details and detection methods.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Cyberattack"
        ],
        "tags": [
          "KEV",
          "OLE",
          "out-of-band patch",
          "security feature bypass",
          "zero-day"
        ],
        "cves": [
          "CVE-2026-21509"
        ],
        "severity": "critical",
        "publishedAt": "2026-01-29T15:00:00.000Z",
        "updatedAt": "2026-02-02T10:00:00.000Z"
      },
      {
        "slug": "experian-forecasts-ai-agents-to-become-top-cause-of-data-breaches",
        "originalHeadline": "AI to Overtake Human Error as Top Cause of Breaches, Experian Predicts",
        "updateTitle": "Update: AI to Overtake Human Error as Top Cause of Breaches, Experian Predicts",
        "updateSummary": "New report confirms over 80% of malicious emails now use generative AI, making phishing attacks 'almost perfect' and harder to detect.",
        "categories": [
          "Threat Intelligence",
          "Policy and Compliance"
        ],
        "tags": [
          "AI",
          "Artificial Intelligence",
          "Polymorphic Malware",
          "Quantum Computing",
          "Synthetic Identity",
          "Threat Forecast"
        ],
        "malware": [
          "Metamorphic malware",
          "Polymorphic malware"
        ],
        "severity": "informational",
        "publishedAt": "2026-01-13T15:00:00.000Z",
        "updatedAt": "2026-02-02T00:00:00.000Z"
      },
      {
        "slug": "industrial-control-systems-face-escalating-cyber-threats",
        "originalHeadline": "Attacks on Industrial Environments Doubled in 2025, Report Warns",
        "updateTitle": "Update: Attacks on Industrial Environments Doubled in 2025, Report Warns",
        "updateSummary": "Forescout report reveals 84% surge in OT protocol attacks, with 71% of exploited vulnerabilities not in CISA KEV catalog, complicating defense.",
        "categories": [
          "Industrial Control Systems",
          "Cyberattack",
          "Threat Intelligence"
        ],
        "tags": [
          "Critical Infrastructure",
          "Cyble",
          "HMI",
          "ICS",
          "OT Security",
          "Ransomware",
          "SCADA"
        ],
        "severity": "high",
        "publishedAt": "2026-01-16T15:00:00.000Z",
        "updatedAt": "2026-02-02T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}