{
  "lastUpdated": "2026-02-08T21:05:11.990Z",
  "runDate": "2026-02-08",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-02-08",
      "type": "publication-daily",
      "headline": "CISA Warns of Actively Exploited SmarterMail RCE Flaw; BridgePay Payment Gateway Crippled by Ransomware",
      "articleCount": 12,
      "articles": [
        {
          "slug": "cisa-mandates-removal-of-unsupported-edge-devices-from-federal-networks",
          "headline": "CISA Issues Directive 26-02, Mandating Removal of End-of-Support Edge Devices from Federal Networks",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued Binding Operational Directive (BOD) 26-02, a mandate requiring U.S. federal civilian agencies to identify, and ultimately decommission, all network edge devices that have reached their end-of-support (EOS) date. The directive addresses the 'disproportionate and unacceptable risks' posed by unpatched hardware and software, which are frequently targeted by advanced threat actors. The BOD establishes a multi-phase timeline: agencies have three months to inventory devices on CISA's EOS list, 12 months to decommission devices already past their EOS date, and 18 months to replace all identified EOS equipment. This move aims to reduce the federal government's attack surface and drive down technical debt.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Patch Management"
          ],
          "tags": [
            "BOD 26-02",
            "CISA",
            "Compliance",
            "EOS",
            "End-of-Support",
            "Federal Government",
            "Policy"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z"
        },
        {
          "slug": "european-commission-contains-cyberattack-on-mobile-device-management-system",
          "headline": "European Commission Contains Cyberattack on its Mobile Device Management (MDM) System",
          "summary": "The European Commission disclosed on February 5, 2026, that it had identified and contained a cyberattack against its central infrastructure for managing mobile devices. The attack, detected on January 30, was reportedly contained and the system cleaned within nine hours. The Commission stated that the incident may have resulted in unauthorized access to some staff names and mobile numbers, but there is no evidence that any mobile devices themselves were compromised. The incident comes shortly after the Commission proposed a new, comprehensive cybersecurity package (CSA2) to strengthen security across the EU.",
          "categories": [
            "Cyberattack",
            "Incident Response",
            "Mobile Security"
          ],
          "tags": [
            "CERT-EU",
            "Cyberattack",
            "European Commission",
            "Incident Response",
            "MDM",
            "Mobile Security"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z"
        },
        {
          "slug": "us-finalizes-rules-to-ban-chinese-and-russian-tech-from-connected-vehicles",
          "headline": "U.S. Finalizes Ban on Chinese and Russian Tech in Connected Vehicles, Forcing Massive Supply Chain Overhaul",
          "summary": "The United States has finalized new regulations from the Commerce Department that will ban hardware and software from China and Russia in connected vehicles sold in the U.S. The rules are designed to mitigate national security risks, preventing foreign adversaries from collecting sensitive data or manipulating vehicle functions. The ban will be phased in, starting with software for the 2027 model year and extending to hardware by 2029. The auto industry is facing what is being called 'one of the most consequential and complex auto regulations in decades,' forcing a massive and difficult overhaul of their deeply embedded global software and hardware supply chains.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "Automotive",
            "China",
            "Connected Vehicle",
            "National Security",
            "Policy",
            "Regulation",
            "Russia",
            "Supply Chain"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z"
        },
        {
          "slug": "global-cybersecurity-regulations-tighten-with-new-mandates-in-hong-kong-and-europe",
          "headline": "Global Cybersecurity Regulations Tighten as Hong Kong, Europe Push Stricter Breach Reporting Rules",
          "summary": "A global trend towards stricter cybersecurity regulation is accelerating. Hong Kong has announced plans to revive amendments to its Personal Data Privacy Ordinance (PDPO) to include mandatory data breach reporting and administrative fines. This follows recent moves in the U.S. that mandate rapid incident disclosure for critical infrastructure and public companies. Concurrently, enforcement of Europe's NIS2 directive and the Digital Operational Resilience Act (DORA) is intensifying, compelling financial services and critical sector organizations to adopt more dynamic, decision-driven incident response frameworks and standardized reporting. The European Commission has also proposed a new Cybersecurity Act (CSA2) to harmonize ICT supply chain security.",
          "categories": [
            "Policy and Compliance",
            "Regulatory"
          ],
          "tags": [
            "Compliance",
            "DORA",
            "Data Breach Reporting",
            "NIS2",
            "Policy",
            "Regulation",
            "SEC"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z"
        },
        {
          "slug": "chinese-apt-amaranth-dragon-targets-southeast-asian-governments",
          "headline": "China-Linked APT 'Amaranth-Dragon' Targets Southeast Asian Governments with New RAT",
          "summary": "A China-linked cyber-espionage group, newly dubbed 'Amaranth-Dragon,' has been conducting targeted campaigns against government and law enforcement agencies across Southeast Asia. A report from Check Point Research reveals the group has significant operational and toolset overlaps with the notorious APT41. Amaranth-Dragon has demonstrated agility by rapidly weaponizing new vulnerabilities, such as a flaw in WinRAR (CVE-2025-8088), less than ten days after its disclosure. The group uses phishing emails and legitimate cloud services like Dropbox for initial access, deploying custom loaders and the Havoc C2 Framework. More recently, they have added a new Telegram-based RAT, 'TGAmaranth RAT,' to their arsenal.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Phishing"
          ],
          "tags": [
            "APT",
            "APT41",
            "Amaranth-Dragon",
            "China",
            "Espionage",
            "Havoc C2",
            "Southeast Asia",
            "TGAmaranth RAT"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z",
          "cves": [
            "CVE-2025-8088"
          ],
          "malware": [
            "Amaranth Loader",
            "Havoc C2 Framework",
            "TGAmaranth RAT"
          ]
        },
        {
          "slug": "attackers-weaponize-decade-old-encase-driver-to-terminate-edr-products",
          "headline": "EDR-Killer Malware Weaponizes Decade-Old EnCase Driver in BYOVD Attacks",
          "summary": "Threat actors are using a new EDR-killing malware that leverages a 'Bring Your Own Vulnerable Driver' (BYOVD) technique to disable endpoint security products. Researchers at Huntress discovered the malware during an intrusion that began with compromised SonicWall SSL VPN credentials. The attackers abuse `EnPortv.sys`, a legitimate but long-revoked kernel driver from Guidance Software's EnCase forensic toolkit. Despite its certificate being revoked in 2010, a gap in Windows' driver signature enforcement allows it to be loaded, granting the attackers kernel-level privileges. The malware uses these privileges to terminate 59 different processes associated with major EDR vendors like CrowdStrike, SentinelOne, and Microsoft, clearing the way for ransomware deployment.",
          "categories": [
            "Malware",
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "BYOVD",
            "Defense Evasion",
            "EDR",
            "EnCase",
            "EnPortv.sys",
            "Huntress",
            "Malware",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z"
        },
        {
          "slug": "malicious-clawdbot-agent-in-vs-code-marketplace-deployed-rat-malware",
          "headline": "Malicious VS Code Extension 'ClawdBot Agent' Deployed ScreenConnect RAT via Marketplace",
          "summary": "A malicious extension named 'ClawdBot Agent' was discovered in the official Visual Studio Code Marketplace, impersonating a popular AI coding assistant to trick developers. The trojanized extension was fully functional, helping it evade suspicion while its malicious payload executed in the background upon VS Code launch. The attack chain fetched a remote configuration file that initiated the deployment of a weaponized version of the legitimate remote support tool, ConnectWise ScreenConnect, effectively turning it into a Remote Access Tool (RAT). This gave attackers full remote control over compromised developer machines. The extension was quickly removed by Microsoft, but the incident highlights the growing risk of supply chain attacks targeting developer ecosystems.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Cloud Security"
          ],
          "tags": [
            "Developer Security",
            "Malware",
            "RAT",
            "ScreenConnect",
            "Supply Chain Attack",
            "VS Code"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z",
          "malware": [
            "ClawdBot Agent"
          ]
        },
        {
          "slug": "notepad-plus-plus-supply-chain-attack-attributed-to-chinese-apt-group-lotus-blossom",
          "headline": "Notepad++ Supply Chain Attack Attributed to Chinese APT 'Lotus Blossom' (Billbug)",
          "summary": "A sophisticated supply chain attack that hijacked the update mechanism of the popular Notepad++ text editor has been attributed with medium confidence to 'Lotus Blossom' (also known as Billbug), a China-linked advanced persistent threat (APT) group. The attack, which ran from June to December 2025, compromised Notepad++'s hosting provider, allowing the attackers to selectively redirect update traffic for older, vulnerable versions of the software. The threat actors deployed a custom backdoor named 'Chrysalis' and utilized a multi-stage infection chain involving Metasploit and Cobalt Strike. The Notepad++ developer has since secured the update infrastructure and patched the vulnerability in version 8.8.9.",
          "categories": [
            "Supply Chain Attack",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "APT",
            "Billbug",
            "Chrysalis",
            "Cobalt Strike",
            "Lotus Blossom",
            "Notepad++",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z",
          "malware": [
            "Chrysalis",
            "Cobalt Strike"
          ]
        },
        {
          "slug": "shinyhunters-group-bypasses-mfa-in-widespread-social-engineering-attacks",
          "headline": "ShinyHunters Bypasses MFA Using Vishing; Breaches Panera Bread, Match Group, Harvard University",
          "summary": "The cybercrime group ShinyHunters is conducting a large-scale data breach campaign by using voice-phishing (vishing) and social engineering to defeat multi-factor authentication (MFA). Attackers impersonate internal IT staff, tricking employees into visiting a credential harvesting site and providing their username, password, and real-time MFA code. This allows the attackers to enroll their own device and gain persistent access. Recent high-profile victims include Panera Bread (5.1 million records leaked), Match Group (Tinder, Hinge), Bumble, and Harvard University's alumni department (115,000 records exposed). The group, operating as 'Scattered LAPSUS$ Hunters,' has reportedly prepared infrastructure to target over 100 additional organizations.",
          "categories": [
            "Phishing",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Data Breach",
            "Harvard University",
            "MFA",
            "Match Group",
            "Panera Bread",
            "ShinyHunters",
            "Social Engineering",
            "Vishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z"
        },
        {
          "slug": "apt28-exploits-freshly-patched-office-flaw-in-espionage-campaign",
          "headline": "APT28 Exploits Patched Office Flaw (CVE-2026-21509) in Espionage Campaign Days After Fix",
          "summary": "The Russian state-sponsored group APT28 (Fancy Bear) is actively exploiting a recently patched Microsoft Office vulnerability, CVE-2026-21509, just days after an emergency fix was released. The espionage campaign, dubbed 'Operation Neusploit,' targets government, military, and transport organizations in Europe with sophisticated phishing lures. The flaw is a security feature bypass that attackers trigger with malicious RTF documents. The multi-stage infection chain deploys backdoors like 'MiniDoor' for email exfiltration and a C++ implant called 'BeardShell,' using legitimate cloud services like filen.io for C2 to evade detection. Microsoft released an out-of-band patch on January 26, 2026, and organizations are urged to apply it immediately.",
          "categories": [
            "Threat Actor",
            "Vulnerability",
            "Phishing"
          ],
          "tags": [
            "APT28",
            "CVE-2026-21509",
            "Espionage",
            "Fancy Bear",
            "Microsoft Office",
            "Phishing",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z",
          "cves": [
            "CVE-2026-21509"
          ],
          "malware": [
            "BeardShell",
            "MiniDoor",
            "PixyNetLoader"
          ]
        },
        {
          "slug": "cisa-warns-of-actively-exploited-smartermail-flaw-fueling-ransomware-attacks",
          "headline": "CISA KEV Alert: Critical SmarterMail RCE Flaw (CVE-2026-24423) Actively Exploited in Ransomware Attacks",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical remote code execution (RCE) vulnerability in SmarterMail, CVE-2026-24423, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, which has a CVSS score of 9.3, allows for unauthenticated RCE and is being actively weaponized by ransomware groups. The vulnerability exists in the `ConnectToHub` API endpoint, enabling attackers to execute arbitrary commands with system privileges. SmarterTools has released a patch (build 9511), and CISA has mandated that federal agencies apply it by February 26, 2026. This marks the third SmarterMail vulnerability added to the KEV list in two weeks, indicating a concentrated effort by threat actors to target the platform.",
          "categories": [
            "Vulnerability",
            "Ransomware",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "CVE-2026-24423",
            "KEV",
            "Patch Management",
            "RCE",
            "Ransomware",
            "SmarterMail"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z",
          "cves": [
            "CVE-2026-24423"
          ]
        },
        {
          "slug": "ransomware-attack-cripples-bridgepay-payment-gateway-causing-nationwide-outages",
          "headline": "Nationwide Outage: BridgePay Payment Gateway Confirms Ransomware Attack Crippled Production Systems",
          "summary": "U.S. payment gateway provider BridgePay Network Solutions has confirmed a ransomware attack was the cause of a massive service outage that began on February 6, 2026. The attack took down numerous production systems, including the BridgePay Gateway API, virtual terminals, and hosted payment pages, disrupting credit and debit card processing for merchants across the United States in sectors like retail, hospitality, and government. Many businesses were forced to revert to cash-only operations. BridgePay has engaged the FBI and U.S. Secret Service. While the company states that an initial investigation suggests no usable payment card data was exposed due to encryption, a timeline for full service restoration has not been provided, and the process is expected to be lengthy.",
          "categories": [
            "Ransomware",
            "Cyberattack",
            "Data Breach"
          ],
          "tags": [
            "BridgePay",
            "Cyberattack",
            "Financial Services",
            "Outage",
            "Payment Gateway",
            "Ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-08T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-02-07",
      "type": "publication-daily",
      "headline": "CISA Warns of Actively Exploited SmarterMail RCE; Asian APT Hits 70 Orgs; 'Shai-Hulud' Worm Automates Supply Chain Attacks",
      "articleCount": 12,
      "articles": [
        {
          "slug": "threat-actors-deploy-rmm-tools-using-windows-screensaver-files",
          "headline": "Attackers Abuse Windows Screensaver (.scr) Files to Drop RMM Tools for Persistent Access",
          "summary": "A novel attack technique has been observed where threat actors are abusing Windows screensaver (.scr) files as droppers for legitimate remote monitoring and management (RMM) tools. By tricking users into executing a malicious screensaver file, attackers can bypass security controls that might block direct RMM installation. Because .scr files are executables, they can be weaponized to install the RMM software, providing the attacker with persistent, stealthy remote access to the compromised machine for data theft, surveillance, or lateral movement. This method highlights the ongoing trend of attackers using living-off-the-land techniques.",
          "categories": [
            "Malware",
            "Phishing",
            "Security Operations"
          ],
          "tags": [
            "Dropper",
            "Living off the Land",
            "LoTL",
            "RMM",
            "Screensaver",
            "Windows"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-07T15:00:00.000Z"
        },
        {
          "slug": "telegram-phishing-campaign-re-emerges-abusing-authorization-prompts",
          "headline": "Evolving Telegram Phishing Campaign Tricks Users into Approving Account Takeover",
          "summary": "A sophisticated phishing campaign targeting Telegram users has re-emerged, using the platform's own features to hijack accounts. As reported by CYFIRMA, the attack tricks users with fake security alerts, directing them to a malicious site or bot that mimics an official Telegram service. The core of the attack is manipulating the user into approving a legitimate-looking authorization prompt for a 'new device' within their own Telegram app. Approving this prompt grants the attacker's device full session access, enabling them to take over the account, read private chats, and exfiltrate data. The campaign highlights the effectiveness of social engineering attacks that exploit user trust in a platform's native functions.",
          "categories": [
            "Phishing",
            "Mobile Security"
          ],
          "tags": [
            "2FA",
            "Account Takeover",
            "Phishing",
            "Session Hijacking",
            "Social Engineering",
            "Telegram"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-02-07T15:00:00.000Z"
        },
        {
          "slug": "ransomware-attacks-on-education-sector-slowed-in-2025-says-report",
          "headline": "Ransomware Attacks on Education Sector Slowed in 2025, But U.S. Remains Top Target",
          "summary": "A 2025 report from Comparitech indicates a slowdown in the growth of ransomware attacks against the global education sector. There were 251 attacks recorded worldwide, a slight 2% increase from the previous year. These incidents resulted in at least 3.96 million breached records. The United States was the most affected country with 130 attacks, though this marked a 9% decrease for the nation year-over-year. High-profile incidents included demands of $400,000 against school districts by the Medusa ransomware gang, highlighting the continued financial and operational strain these attacks place on educational institutions.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Data Breach"
          ],
          "tags": [
            "Data Breach",
            "Education",
            "K-12",
            "Statistics",
            "University"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-02-07T15:00:00.000Z",
          "malware": [
            "Medusa"
          ]
        },
        {
          "slug": "new-odyssey-stealer-malware-campaign-rapidly-infects-macos-users",
          "headline": "Aggressive Odyssey Stealer Malware Campaign Targets macOS Users Globally",
          "summary": "A new and aggressive campaign featuring the Odyssey Stealer malware is actively targeting Apple macOS users across the globe. Initially focused on the US and Europe, the attack's reach expanded within 24 hours to South America, Africa, and Asia. Odyssey Stealer is an info-stealer designed to harvest browser credentials, crypto wallets, and system data. This latest variant uses builders to automatically generate unique, obfuscated samples, making it difficult for signature-based antivirus to detect. The malware spreads via social engineering, using fake or cracked software downloads and phishing lures to trick users into installing it.",
          "categories": [
            "Malware",
            "Phishing",
            "Mobile Security"
          ],
          "tags": [
            "Credential Theft",
            "Cryptocurrency",
            "InfoStealer",
            "Polymorphic Malware",
            "macOS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-07T15:00:00.000Z",
          "malware": [
            "Odyssey Stealer"
          ]
        },
        {
          "slug": "cisa-mandates-removal-of-unsupported-edge-devices-from-federal-networks",
          "headline": "CISA Issues Directive 26-02, Forcing Federal Agencies to Remove End-of-Support Edge Devices",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued Binding Operational Directive (BOD) 26-02, compelling Federal Civilian Executive Branch (FCEB) agencies to identify and remove all network edge devices that are no longer supported by their manufacturers. The directive aims to mitigate significant security risks posed by unpatched hardware and software like firewalls, routers, and VPNs. Agencies have three months to inventory devices, 12 months to replace currently unsupported products, and two years to establish a permanent lifecycle management process. CISA emphasizes that these devices are prime targets for threat actors and strongly recommends private sector organizations adopt similar policies.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Patch Management"
          ],
          "tags": [
            "BOD 26-02",
            "Edge Device",
            "End-of-Support",
            "EoS",
            "Federal Mandate",
            "Lifecycle Management"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-07T15:00:00.000Z"
        },
        {
          "slug": "threat-intelligence-report-reveals-new-milkyway-ransomware-strain",
          "headline": "New 'Milkyway' Ransomware Strain Discovered Targeting Windows Systems",
          "summary": "Cybersecurity firm CYFIRMA has identified a new ransomware strain named 'Milkyway' found on underground forums. The malware is designed to target Windows environments, systematically encrypting files and appending a '.milkyway' extension. After encryption, it displays a full-screen ransom note that threatens to leak stolen data and report the victim to tax and law enforcement authorities if the ransom is not paid. As with most ransomware, recovery without paying the ransom depends on the availability of secure, offline backups, as decryption is typically not possible.",
          "categories": [
            "Ransomware",
            "Malware"
          ],
          "tags": [
            "Data Encryption",
            "Double Extortion",
            "Underground Forum",
            "Windows"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-07T15:00:00.000Z",
          "malware": [
            "Milkyway Ransomware"
          ]
        },
        {
          "slug": "researchers-detail-covert-pulsar-remote-administration-trojan",
          "headline": "Pulsar RAT: Covert, Fileless Trojan for Windows Evolves from Quasar RAT",
          "summary": "Researchers have detailed Pulsar RAT, a highly covert and modular Remote Administration Trojan (RAT) for Windows that evolved from the open-source Quasar RAT. Prioritizing stealth, Pulsar RAT uses fileless techniques, deploying its payload directly into system memory to evade disk-based antivirus scanning. It leverages legitimate Windows processes to blend in with normal activity, allowing for long-term persistence. Pulsar RAT is a powerful espionage tool with features like encrypted C2, credential harvesting, anti-debugging, and the ability to access webcams and microphones, making it a significant threat for silent, long-term network exploitation.",
          "categories": [
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "Espionage",
            "Fileless Malware",
            "In-Memory",
            "Quasar RAT",
            "RAT",
            "Windows"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-07T15:00:00.000Z",
          "malware": [
            "Donut",
            "Pulsar RAT",
            "Quasar RAT"
          ]
        },
        {
          "slug": "bulletproof-hosters-abuse-legitimate-isp-software-for-cybercrime-ops",
          "headline": "Ransomware Gangs Like LockBit and BlackCat Use Legitimate ISP Software for Anonymous Server Provisioning",
          "summary": "Researchers at Sophos have discovered how bulletproof hosting (BPH) providers are abusing legitimate server management software from ISPsystem to anonymously provision virtual machines for cybercriminals. The software, VMmanager, leaves a default hostname fingerprint (`WIN-J9D866ESIJ2`) that allowed researchers to link thousands of malicious servers to BPH providers like Stark Industries Solutions and MasterRDP. This infrastructure is actively being used to support operations for top-tier ransomware groups, including LockBit, BlackCat (ALPHV), and Conti, highlighting a critical link between legitimate tools and the cybercrime underworld.",
          "categories": [
            "Threat Intelligence",
            "Ransomware",
            "Cyberattack"
          ],
          "tags": [
            "BPH",
            "Bulletproof Hosting",
            "Cybercrime",
            "Infrastructure",
            "RDP",
            "RaaS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-07T15:00:00.000Z",
          "malware": [
            "BlackCat",
            "LockBit",
            "Qilin"
          ]
        },
        {
          "slug": "vast-cyber-espionage-campaign-by-asian-apt-hits-70-orgs-in-37-nations",
          "headline": "State-Aligned Asian APT 'TGR-STA-1030' Implicated in Massive Espionage Campaign Targeting 70 Organizations Globally",
          "summary": "Palo Alto Networks' Unit 42 has exposed a massive, long-running cyber-espionage campaign attributed to TGR-STA-1030, a state-aligned threat actor operating from Asia. The group has successfully compromised at least 70 organizations across 37 countries, focusing on government agencies, law enforcement, and critical infrastructure. The campaign's primary objective appears to be intelligence gathering related to geopolitical and economic matters, with attackers stealing sensitive data on diplomatic, financial, and military operations. Researchers note potential links between TGR-STA-1030 and other known groups like 'Amaranth-Dragon' and the notorious Chinese APT, APT41, highlighting the scale and sophistication of modern state-sponsored threats.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "Critical Infrastructure",
            "Cyber Espionage",
            "Geopolitics",
            "Intelligence Gathering",
            "State-Sponsored"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-07T15:00:00.000Z"
        },
        {
          "slug": "transparent-tribe-apt-pivots-to-target-indias-startup-ecosystem",
          "headline": "Transparent Tribe (APT36) Shifts Focus, Targeting Indian Startups with Crimson RAT",
          "summary": "The Pakistan-aligned APT group Transparent Tribe (also known as APT36) has strategically shifted its targeting from Indian government and military entities to the country's growing startup sector. A new campaign, identified by researchers, uses the group's signature Crimson RAT malware delivered via malicious ISO files in phishing emails. The lures are themed around startups, with some attacks leveraging scraped personal information of real founders to appear more legitimate. The focus on startups in the cybersecurity and intelligence fields suggests the group aims to steal intellectual property and potentially use compromised companies as a supply chain vector to attack their government clients.",
          "categories": [
            "Threat Actor",
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Crimson RAT",
            "ISO file",
            "India",
            "Pakistan",
            "Phishing",
            "Startup"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-02-07T15:00:00.000Z",
          "malware": [
            "Crimson RAT"
          ]
        },
        {
          "slug": "cisa-warns-of-actively-exploited-smartermail-rce-in-ransomware-attacks",
          "headline": "CISA Adds Critical SmarterMail RCE Flaw to KEV Catalog Amid Active Ransomware Attacks",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical remote code execution (RCE) vulnerability in SmarterTools' SmarterMail, CVE-2026-24423, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, which allows for unauthenticated RCE, is being actively weaponized by ransomware operators. The vulnerability stems from a missing authentication check in an API endpoint, enabling attackers to execute arbitrary commands on vulnerable email servers. CISA has directed all federal agencies to apply patches by February 26, 2026, and strongly urges all organizations using the affected software to update immediately to mitigate the significant risk of compromise.",
          "categories": [
            "Vulnerability",
            "Ransomware",
            "Patch Management"
          ],
          "tags": [
            "API Security",
            "CWE-306",
            "Email Server",
            "KEV",
            "RCE",
            "Unauthenticated"
          ],
          "severity": "critical",
          "isUpdate": true,
          "publishedAt": "2026-02-07T15:00:00.000Z",
          "updatedAt": "2026-02-08T00:00:00.000Z",
          "cves": [
            "CVE-2025-52691",
            "CVE-2026-23760",
            "CVE-2026-24423"
          ]
        },
        {
          "slug": "analysis-of-shai-hulud-worm-marks-new-era-of-supply-chain-attacks",
          "headline": "‘Shai-Hulud’ Worm Automates npm Supply Chain Attacks, Actively Spreading by Stealing Developer Credentials",
          "summary": "A new malware worm named 'Shai-Hulud' signals a dangerous evolution in software supply chain attacks, moving from passive typosquatting to active, self-propagating threats. First seen in late 2025, the worm compromises developer machines, steals credentials like NPM tokens and GitHub secrets, and then uses those credentials to automatically infect and re-publish other legitimate packages maintained by the developer. This creates an exponential infection cycle within the npm ecosystem. An advanced variant, Shai-Hulud 2.0, targets the `pre-install` phase to bypass scanners and guarantee execution, representing a scalable and devastating new risk to software development pipelines worldwide.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "CI/CD Security",
            "Credential Theft",
            "Developer Security",
            "Open Source",
            "Worm",
            "npm"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-02-07T15:00:00.000Z",
          "malware": [
            "Shai-Hulud"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "european-commission-proposes-revisions-to-strengthen-eu-cybersecurity-act",
        "originalHeadline": "EU Proposes Revised Cybersecurity Act to Bolster Supply Chain Security & ENISA's Role",
        "updateTitle": "Update: EU Proposes Revised Cybersecurity Act to Bolster Supply Chain Security & ENISA's Role",
        "updateSummary": "EU's revised Cybersecurity Act and NIS2 are part of a global trend towards stricter cyber regulations, with DORA enforcement intensifying.",
        "categories": [
          "Policy and Compliance",
          "Regulatory",
          "Supply Chain Attack"
        ],
        "tags": [
          "Cybersecurity Act",
          "ENISA",
          "EU",
          "NIS2",
          "compliance",
          "regulation",
          "supply chain"
        ],
        "severity": "informational",
        "publishedAt": "2026-01-28T15:00:00.000Z",
        "updatedAt": "2026-02-08T00:00:00.000Z"
      },
      {
        "slug": "cisa-warns-of-actively-exploited-smartermail-rce-in-ransomware-attacks",
        "originalHeadline": "CISA Adds Critical SmarterMail RCE Flaw to KEV Catalog Amid Active Ransomware Attacks",
        "updateTitle": "Update: CISA Adds Critical SmarterMail RCE Flaw to KEV Catalog Amid Active Ransomware Attacks",
        "updateSummary": "New details for SmarterMail RCE (CVE-2026-24423) include CVSS 9.3 score, clarification of API endpoint, and impact on 15M users.",
        "categories": [
          "Vulnerability",
          "Ransomware",
          "Patch Management"
        ],
        "tags": [
          "API Security",
          "CWE-306",
          "Email Server",
          "KEV",
          "RCE",
          "Unauthenticated"
        ],
        "cves": [
          "CVE-2025-52691",
          "CVE-2026-23760",
          "CVE-2026-24423"
        ],
        "severity": "critical",
        "publishedAt": "2026-02-07T15:00:00.000Z",
        "updatedAt": "2026-02-08T00:00:00.000Z"
      },
      {
        "slug": "cisa-warns-of-actively-exploited-smartermail-rce-flaw-in-ransomware-attacks",
        "originalHeadline": "CISA: Critical SmarterMail RCE Flaw Actively Exploited in Ransomware Attacks",
        "updateTitle": "Update: CISA: Critical SmarterMail RCE Flaw Actively Exploited in Ransomware Attacks",
        "updateSummary": "New technical details for SmarterMail RCE (CVE-2026-24423) include precise API endpoint, related CVEs, and D3FEND techniques for enhanced detection and mitigation.",
        "categories": [
          "Vulnerability",
          "Ransomware",
          "Patch Management"
        ],
        "tags": [
          "CISA",
          "CVE-2026-24423",
          "KEV",
          "RCE",
          "Ransomware",
          "SmarterMail"
        ],
        "cves": [
          "CVE-2026-24423"
        ],
        "severity": "critical",
        "publishedAt": "2026-02-06T15:00:00.000Z",
        "updatedAt": "2026-02-07T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}