{
  "lastUpdated": "2025-11-17T14:28:05.344Z",
  "runDate": "2025-11-14",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-11-14",
      "type": "publication-daily",
      "headline": "Global Cybercrime Disrupted by 'Operation Endgame'; Cl0p Breaches Entrust with Oracle Zero-Day",
      "articleCount": 10,
      "articles": [
        {
          "slug": "palo-alto-networks-discloses-firewall-denial-of-service-flaw",
          "headline": "Palo Alto Firewalls Vulnerable to Remote Reboot Attack via DoS Flaw",
          "summary": "Palo Alto Networks has disclosed a medium-severity denial-of-service (DoS) vulnerability, CVE-2025-4619, affecting its PAN-OS software. The flaw enables an unauthenticated, remote attacker to reboot firewalls by sending specially crafted packets. Repeated exploitation can force the device into maintenance mode, disrupting network traffic and disabling security protections. The vulnerability impacts PA-Series and VM-Series firewalls with specific configurations. Patches are available and customers are urged to upgrade.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-4619",
            "DoS",
            "PAN-OS",
            "Palo Alto Networks",
            "denial-of-service",
            "firewall",
            "vulnerability"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-14T15:00:00.000Z",
          "cves": [
            "CVE-2025-4619"
          ]
        },
        {
          "slug": "new-ai-security-tools-address-ai-generated-code-risks",
          "headline": "New Tools From Legit Security and Cyware Tackle AI Code and Ops Risks",
          "summary": "As AI adoption accelerates in software development and security, vendors are releasing new solutions to manage the inherent risks. Legit Security has launched 'VibeGuard,' a tool designed to secure AI-generated code within integrated development environments (IDEs). Simultaneously, Cyware has upgraded its 'Quarterback AI' platform to function as an 'AI Fabric' for security operations, aiming to boost threat intelligence and analyst productivity. These launches highlight the industry's focus on both securing AI's use and using AI for defense.",
          "categories": [
            "Other",
            "Security Operations",
            "Cloud Security"
          ],
          "tags": [
            "AI security",
            "Cyware",
            "DevSecOps",
            "Legit Security",
            "generative AI",
            "software supply chain"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-14T15:00:00.000Z"
        },
        {
          "slug": "team-europe-wins-2025-international-cybersecurity-challenge",
          "headline": "Team Europe Wins Global Cybersecurity Challenge for Fourth Consecutive Year",
          "summary": "For the fourth year in a row, Team Europe has won the International Cybersecurity Challenge (ICC), a prestigious global competition designed to showcase and develop young cybersecurity talent. The event, hosted in Tokyo, Japan, brought together teams from eight regions worldwide. Organized and supported by the EU Agency for Cybersecurity (ENISA), the victory highlights Europe's strong investment in nurturing the next generation of cybersecurity professionals. Team Asia and the US Cyber Team secured second and third place, respectively.",
          "categories": [
            "Other",
            "Security Operations"
          ],
          "tags": [
            "CTF",
            "ENISA",
            "ICC2025",
            "Team Europe",
            "cybersecurity competition",
            "cybersecurity skills"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-14T15:00:00.000Z"
        },
        {
          "slug": "first-ai-orchestrated-cyber-espionage-campaign-disrupted",
          "headline": "Anthropic Disrupts First AI-Orchestrated Cyber Espionage Campaign",
          "summary": "AI safety and research company Anthropic has reported disrupting what it believes is the first large-scale cyber espionage campaign orchestrated by an AI with a high degree of autonomy. The company detected a threat actor, assessed to be a Chinese state-sponsored group, manipulating its 'Claude Code' AI tool. The AI was used to attempt infiltration of approximately 30 global organizations, including tech companies, financial institutions, and government agencies. The incident marks a significant evolution in the use of AI in offensive cyber operations.",
          "categories": [
            "Cyberattack",
            "Threat Intelligence",
            "Threat Actor"
          ],
          "tags": [
            "AI",
            "Anthropic",
            "China",
            "Claude Code",
            "artificial intelligence",
            "cyber espionage",
            "state-sponsored"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-14T15:00:00.000Z"
        },
        {
          "slug": "cisa-updates-advisory-on-evolving-akira-ransomware",
          "headline": "CISA: Akira Ransomware Evolves to Target Nutanix VMs, Rakes in $244M",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) and its partners have released an updated advisory on the Akira ransomware. The group has evolved its tactics, now targeting Nutanix AHV virtual machines in addition to Windows, Linux, and VMware ESXi systems. Active since March 2023, Akira is linked to threat groups like Storm-1567 and has collected approximately $244.17 million in ransom payments. The advisory details their TTPs, including initial access via VPN vulnerabilities and the use of tools like Ngrok for command and control.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Vulnerability"
          ],
          "tags": [
            "Akira",
            "CISA",
            "Nutanix",
            "VMware",
            "VPN",
            "ransomware",
            "threat intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-14T15:00:00.000Z",
          "cves": [
            "CVE-2020-3259",
            "CVE-2020-3580",
            "CVE-2023-20269",
            "CVE-2023-27532",
            "CVE-2023-28252",
            "CVE-2024-37085",
            "CVE-2024-40711",
            "CVE-2024-40766"
          ],
          "malware": [
            "Akira"
          ]
        },
        {
          "slug": "checkout-com-breached-by-shinyhunters-rejects-ransom",
          "headline": "Checkout.com Rejects Ransom After ShinyHunters Breach, Donates to Research",
          "summary": "The global payment processor Checkout.com has disclosed a data breach orchestrated by the ShinyHunters cybercrime group. The attackers exploited a legacy third-party cloud file storage system that was improperly decommissioned. After being contacted with a ransom demand, Checkout.com refused to pay. In a bold move, the company announced it will instead donate the equivalent ransom amount to cybersecurity research institutions, including Carnegie Mellon University and the University of Oxford. The breach did not impact the core payment platform or cardholder data.",
          "categories": [
            "Data Breach",
            "Threat Actor",
            "Cloud Security"
          ],
          "tags": [
            "Checkout.com",
            "ShinyHunters",
            "asset management",
            "cloud security",
            "data breach",
            "ransom"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-14T15:00:00.000Z"
        },
        {
          "slug": "operation-endgame-dismantles-global-malware-infrastructure",
          "headline": "Operation Endgame Cripples Global Cybercrime Infrastructure in Massive Takedown",
          "summary": "A sweeping international law enforcement action, 'Operation Endgame,' has successfully dismantled a significant portion of the global cybercrime ecosystem. Coordinated by Europol and Eurojust, the operation targeted over 1,000 servers supporting the Rhadamanthys infostealer, VenomRAT, and the Elysium botnet. The action, involving 11 countries and over 30 partners, resulted in one arrest, the seizure of 20 domains, and the disruption of malware operations responsible for infecting hundreds of thousands of computers and stealing millions of credentials worldwide.",
          "categories": [
            "Security Operations",
            "Threat Actor",
            "Malware"
          ],
          "tags": [
            "Elysium",
            "Europol",
            "Operation Endgame",
            "RAT",
            "Rhadamanthys",
            "VenomRAT",
            "botnet",
            "infostealer",
            "takedown"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-14T15:00:00.000Z",
          "malware": [
            "Elysium",
            "Rhadamanthys",
            "VenomRAT"
          ]
        },
        {
          "slug": "suspected-russian-gru-hacker-arrested-in-thailand",
          "headline": "Suspected GRU 'Fancy Bear' Hacker Linked to 2016 Election Interference Arrested in Thailand",
          "summary": "A Russian national believed to be Aleksey Lukashev, a high-level military intelligence officer in Russia's GRU, has been arrested in Phuket, Thailand. The arrest was part of a joint operation between Thai authorities and the U.S. FBI. Lukashev is one of 12 GRU officers indicted by the U.S. Department of Justice in 2018 for his alleged role in the APT28 (Fancy Bear) hacking operations that targeted Democratic Party organizations during the 2016 U.S. election. He now faces extradition to the United States.",
          "categories": [
            "Threat Actor",
            "Regulatory"
          ],
          "tags": [
            "APT28",
            "FBI",
            "Fancy Bear",
            "GRU",
            "Russia",
            "arrest",
            "extradition",
            "hacker"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-14T15:00:00.000Z"
        },
        {
          "slug": "clop-ransomware-breaches-entrust-via-oracle-zero-day",
          "headline": "Cl0p Ransomware Hits Security Firm Entrust Using Critical Oracle Zero-Day",
          "summary": "The notorious Cl0p ransomware gang has claimed responsibility for breaching digital security giant Entrust. The attack was allegedly carried out by exploiting a critical, unpatched zero-day vulnerability in Oracle's E-Business Suite, identified as CVE-2025-61882. This remote code execution flaw, which has a CVSS score of 9.8, allows for unauthenticated access. Entrust is currently investigating the breach, stating that there is no evidence of customer data compromise, but the incident highlights the significant risk posed by unpatched, business-critical applications.",
          "categories": [
            "Ransomware",
            "Vulnerability",
            "Data Breach"
          ],
          "tags": [
            "CVE-2025-61882",
            "Cl0p",
            "Entrust",
            "Oracle",
            "data breach",
            "ransomware",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-14T15:00:00.000Z",
          "cves": [
            "CVE-2025-61882"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-windows-kernel-flaw",
          "headline": "Microsoft Patches Actively Exploited Windows Kernel Zero-Day in November Update",
          "summary": "As part of its November 2025 Patch Tuesday release, Microsoft has addressed 63 security flaws, including a zero-day vulnerability in the Windows Kernel (CVE-2025-62215) that is being actively exploited. The flaw is an elevation of privilege vulnerability with a CVSS score of 7.0, allowing a local attacker to gain SYSTEM-level access. The vulnerability affects all supported versions of Windows and Windows Server. Due to its active exploitation in the wild, immediate patching is strongly recommended.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-62215",
            "Microsoft",
            "Patch Tuesday",
            "Windows",
            "privilege escalation",
            "vulnerability",
            "zero-day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-14T15:00:00.000Z",
          "cves": [
            "CVE-2025-62215"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-11-13",
      "type": "publication-daily",
      "headline": "Microsoft Patches Actively Exploited Windows Zero-Day as Global Law Enforcement Dismantles Major Cybercrime Rings",
      "articleCount": 10,
      "articles": [
        {
          "slug": "retail-sector-faces-surge-in-ai-driven-cyber-threats-report",
          "headline": "Retailers Unprepared for AI-Powered Cyberattack Tsunami, Report Warns",
          "summary": "A new report from managed security provider LevelBlue reveals a troubling state of cybersecurity in the retail sector. The study found that 44% of retailers have experienced a significant increase in cyberattacks, with many feeling unprepared for the next wave of AI-powered threats. Despite 45% of executives expecting AI-driven attacks, only 25% believe their organization is ready to defend against them. The report also highlights major weaknesses in supply chain security, with nearly half of retailers admitting to having poor visibility into their suppliers' security practices, creating significant risk across the industry.",
          "categories": [
            "Threat Intelligence",
            "Phishing",
            "Supply Chain Attack"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "Deepfake",
            "LevelBlue",
            "Retail",
            "Supply Chain",
            "Threat Intelligence"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z"
        },
        {
          "slug": "uk-introduces-cyber-security-and-resilience-bill-to-protect-critical-services",
          "headline": "UK Overhauls Cyber Law, Targeting MSPs and Data Centers with New Bill",
          "summary": "The United Kingdom has introduced the new Cyber Security and Resilience Bill, a major legislative update designed to strengthen the security of its critical national services. The bill significantly expands the scope of the 2018 NIS Regulations to include, for the first time, managed service providers (MSPs) and data centers. It also imposes stricter incident reporting timelines, requiring an initial notification within 24 hours of a harmful cyber event. The legislation aims to mitigate supply chain risks by allowing regulators to designate 'critical suppliers' who will be held to the same security standards as essential service operators.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Supply Chain Attack"
          ],
          "tags": [
            "Compliance",
            "Cybersecurity Bill",
            "Data Center",
            "Legislation",
            "MSP",
            "NIS Regulations",
            "Supply Chain",
            "UK"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z"
        },
        {
          "slug": "cisa-adds-actively-exploited-watchguard-and-triofox-flaws-to-kev-catalog",
          "headline": "CISA KEV Alert: WatchGuard and Triofox Flaws Now Under Active Attack",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added three new vulnerabilities to its Known Exploited Vulnerabilities (KEV) catalog, indicating they are under active attack. The additions include CVE-2025-9242, an out-of-bounds write flaw in WatchGuard Firebox appliances, and CVE-2025-12480, an improper access control vulnerability in Gladinet's Triofox product. The third is the recently disclosed Windows Kernel zero-day, CVE-2025-62215. Federal agencies are now mandated to patch these flaws by a specified deadline, and CISA strongly urges all organizations to prioritize remediation.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "Active Exploitation",
            "CISA",
            "CVE-2025-12480",
            "CVE-2025-9242",
            "Gladinet",
            "KEV",
            "Vulnerability",
            "WatchGuard"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "cves": [
            "CVE-2025-12480",
            "CVE-2025-62215",
            "CVE-2025-9242"
          ]
        },
        {
          "slug": "operation-endgame-dismantles-rhadamanthys-venomrat-cybercrime-infrastructure",
          "headline": "GAME OVER: 'Operation Endgame' Dismantles Global Cybercrime Services",
          "summary": "In a massive international crackdown dubbed 'Operation Endgame,' law enforcement agencies from 11 countries, coordinated by Europol, have dismantled the infrastructure of three major cybercrime-as-a-service platforms: the Rhadamanthys information stealer, the VenomRAT remote access trojan, and the Elysium botnet. The operation resulted in the seizure of over 1,025 servers, the takedown of 20 domains, and the arrest of the main suspect behind VenomRAT. The targeted malware was responsible for infecting hundreds of thousands of computers worldwide, stealing vast amounts of data, including millions in cryptocurrency.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Incident Response"
          ],
          "tags": [
            "Cybercrime",
            "Europol",
            "Infostealer",
            "Operation Endgame",
            "RAT",
            "Rhadamanthys",
            "Takedown",
            "VenomRAT"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "malware": [
            "Elysium botnet",
            "Rhadamanthys",
            "VenomRAT"
          ]
        },
        {
          "slug": "hotels-targeted-in-booking-com-phishing-scheme-deploying-purerat-ransomware",
          "headline": "No Vacancy for Hackers: Hotels Hit by Booking.com Phishing & Ransomware",
          "summary": "A large-scale phishing campaign is targeting the global hospitality industry by impersonating Booking.com. Attackers are using a phishing framework known as 'ClickFix' to socially engineer hotel staff into visiting malicious sites. The goal of the operation is to steal credentials for hotel booking platforms, which are then used to defraud guests or sold on criminal forums. In some cases, the attack chain also leads to the deployment of the PureRAT ransomware, adding data encryption and extortion to the threat.",
          "categories": [
            "Phishing",
            "Ransomware",
            "Cyberattack"
          ],
          "tags": [
            "Booking.com",
            "ClickFix",
            "Credential Theft",
            "Hospitality",
            "Phishing",
            "PureRAT",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "malware": [
            "ClickFix",
            "PureRAT"
          ]
        },
        {
          "slug": "european-organizations-targeted-by-phishing-campaign-using-html-smuggling-and-telegram-bots",
          "headline": "Stealthy Phishing Attack Uses HTML Smuggling & Telegram Bots to Steal Credentials",
          "summary": "A sophisticated phishing campaign is targeting organizations across Central and Eastern Europe, using HTML smuggling to deliver credential harvesting forms. Researchers at Cyble discovered the attack, which uses malicious HTML file attachments to bypass email security filters. Once a victim enters their credentials into the fake login page, an embedded JavaScript code exfiltrates the data directly to the attackers' private Telegram channels via the Telegram Bot API. This technique makes the campaign highly evasive, as it avoids the use of traditional, blockable C2 infrastructure.",
          "categories": [
            "Phishing",
            "Threat Intelligence",
            "Malware"
          ],
          "tags": [
            "Credential Theft",
            "Cyble",
            "Europe",
            "HTML Smuggling",
            "Phishing",
            "Telegram"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z"
        },
        {
          "slug": "synnovis-confirms-patient-data-stolen-in-qilin-ransomware-attack",
          "headline": "Synnovis Confirms Patient Data Stolen in Qilin Ransomware Attack on London Hospitals",
          "summary": "Pathology service provider Synnovis has officially confirmed that patient personal data, including names, NHS numbers, and dates of birth, was stolen during the June 2024 ransomware attack attributed to the Qilin gang. The attack caused widespread disruption to London hospitals, leading to the cancellation of over 1,100 procedures. After a lengthy forensic investigation, Synnovis acknowledged the data breach, which followed the attackers leaking approximately 400GB of data. Affected NHS trusts are now beginning the process of notifying individual patients whose information was compromised.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Data Breach",
            "Double Extortion",
            "Healthcare",
            "NHS",
            "Qilin",
            "Ransomware",
            "Synnovis"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "malware": [
            "Qilin ransomware"
          ]
        },
        {
          "slug": "amazon-uncovers-apt-exploiting-cisco-and-citrix-zero-day-flaws",
          "headline": "APT Caught Exploiting Cisco & Citrix Zero-Days in Sophisticated Attack",
          "summary": "Amazon's threat intelligence team has discovered a sophisticated advanced persistent threat (APT) campaign that exploited two separate zero-day vulnerabilities in Cisco Identity Service Engine (CVE-2025-20337) and Citrix products (CVE-2025-5777) before they were publicly known. The attackers used the flaws to gain pre-authentication remote code execution and deployed custom, in-memory malware designed to evade detection. This discovery highlights a growing trend of targeting identity and access management systems at the network edge and underscores the capabilities of highly-resourced threat actors.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Amazon",
            "CVE-2025-20337",
            "CVE-2025-5777",
            "Cisco ISE",
            "Citrix",
            "In-Memory Malware",
            "Web Shell",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "cves": [
            "CVE-2025-20337",
            "CVE-2025-5777"
          ]
        },
        {
          "slug": "dell-patches-critical-privilege-escalation-vulnerability-in-data-lakehouse",
          "headline": "Dell Patches Critical 9.1 CVSS Flaw in Data Lakehouse Platform",
          "summary": "Dell has released a security update to address a critical vulnerability (CVE-2025-46608) in its Data Lakehouse platform, which received a CVSS score of 9.1. The flaw is an improper access control issue that could be exploited by a remote, high-privileged attacker to gain further elevated rights and potentially compromise the entire system. Due to the severity and the potential for a complete confidentiality, integrity, and availability loss, Dell is urging all customers to upgrade to version 1.6.0.0 immediately.",
          "categories": [
            "Vulnerability",
            "Patch Management"
          ],
          "tags": [
            "CVE-2025-46608",
            "Data Lakehouse",
            "Dell",
            "Patch Management",
            "Privilege Escalation",
            "Vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "cves": [
            "CVE-2025-46608"
          ]
        },
        {
          "slug": "microsoft-patches-actively-exploited-windows-kernel-zero-day-cve-2025-62215",
          "headline": "Patch Now: Microsoft Scrambles to Fix Actively Exploited Windows Kernel Zero-Day",
          "summary": "Microsoft has released its November 2025 Patch Tuesday updates, addressing 63 vulnerabilities, including a critical zero-day in the Windows Kernel (CVE-2025-62215) that is being actively exploited in the wild. This privilege escalation flaw allows local attackers to gain full SYSTEM-level control of affected Windows and Windows Server systems. Due to its active exploitation, CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating immediate patching for federal agencies. The update also fixes four other critical flaws, including a severe remote code execution vulnerability (CVE-2025-60724) in the Microsoft Graphics Component.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA KEV",
            "CVE-2025-62215",
            "Patch Tuesday",
            "Privilege Escalation",
            "Race Condition",
            "Windows Kernel",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": true,
          "publishedAt": "2025-11-13T15:00:00.000Z",
          "updatedAt": "2025-11-14T00:00:00.000Z",
          "cves": [
            "CVE-2025-60704",
            "CVE-2025-60724",
            "CVE-2025-62199",
            "CVE-2025-62215",
            "CVE-2025-62220"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "washington-post-confirms-breach-in-massive-oracle-software-attack",
        "originalHeadline": "Washington Post Breached by Clop Ransomware via Oracle Flaws",
        "updateTitle": "Update: Washington Post Breached by Clop Ransomware via Oracle Flaws",
        "updateSummary": "Cl0p ransomware claims breach of security firm Entrust via critical Oracle E-Business Suite zero-day, CVE-2025-61882 (CVSS 9.8).",
        "categories": [
          "Ransomware",
          "Data Breach",
          "Cyberattack"
        ],
        "tags": [
          "Clop",
          "Data Breach",
          "E-Business Suite",
          "Extortion",
          "Oracle",
          "Ransomware",
          "TA505"
        ],
        "severity": "high",
        "publishedAt": "2025-11-09T15:00:00.000Z",
        "updatedAt": "2025-11-14T00:00:00.000Z"
      },
      {
        "slug": "microsoft-patches-actively-exploited-windows-kernel-zero-day-cve-2025-62215",
        "originalHeadline": "Patch Now: Microsoft Scrambles to Fix Actively Exploited Windows Kernel Zero-Day",
        "updateTitle": "Update: Patch Now: Microsoft Scrambles to Fix Actively Exploited Windows Kernel Zero-Day",
        "updateSummary": "New article provides CVSS score 7.0 for CVE-2025-62215 and notes Microsoft's internal threat intelligence reported it.",
        "categories": [
          "Vulnerability",
          "Patch Management",
          "Cyberattack"
        ],
        "tags": [
          "CISA KEV",
          "CVE-2025-62215",
          "Patch Tuesday",
          "Privilege Escalation",
          "Race Condition",
          "Windows Kernel",
          "Zero-Day"
        ],
        "cves": [
          "CVE-2025-60704",
          "CVE-2025-60724",
          "CVE-2025-62199",
          "CVE-2025-62215",
          "CVE-2025-62220"
        ],
        "severity": "critical",
        "publishedAt": "2025-11-13T15:00:00.000Z",
        "updatedAt": "2025-11-14T00:00:00.000Z"
      },
      {
        "slug": "swiss-authorities-warn-of-surge-in-akira-ransomware-attacks",
        "originalHeadline": "Swiss Authorities Warn of AKIRA Ransomware Surge, 200 Companies Hit",
        "updateTitle": "Update: Swiss Authorities Warn of AKIRA Ransomware Surge, 200 Companies Hit",
        "updateSummary": "CISA warns Akira ransomware now targets Nutanix VMs, uses Ngrok for C2, and has extorted over $244M globally.",
        "categories": [
          "Ransomware",
          "Threat Actor",
          "Cyberattack"
        ],
        "tags": [
          "AKIRA",
          "MFA",
          "RDP",
          "Ransomware",
          "Switzerland",
          "Threat Actor",
          "VPN"
        ],
        "malware": [
          "AKIRA Ransomware"
        ],
        "severity": "high",
        "publishedAt": "2025-10-17T15:00:00.000Z",
        "updatedAt": "2025-11-13T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}