{
  "lastUpdated": "2025-12-08T17:07:33.754Z",
  "runDate": "2025-12-08",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-12-08",
      "type": "publication-daily",
      "headline": "React2Shell Mass Exploitation: Critical RCE Flaw Hits Web, as Android Zero-Days and FinCEN Report Highlight Escalating Threats",
      "articleCount": 10,
      "articles": [
        {
          "slug": "astaroth-banking-trojan-spreads-via-whatsapp-worm-in-brazil",
          "headline": "WhatsApp Worm Spreads Astaroth Banking Trojan in New Brazilian Campaign",
          "summary": "A new malware campaign, tracked as STAC3150, is targeting banking users in Brazil by using WhatsApp Web as a distribution vector for the Astaroth banking trojan. The attack begins with a social engineering lure sent via WhatsApp, which persuades the victim to download a malicious ZIP archive. The archive contains a VBS or HTA file that, when executed, initiates a multi-stage infection process to deploy the Astaroth trojan. Astaroth is a well-known information stealer designed to capture banking credentials and other sensitive data. This campaign highlights the increasing use of popular messaging platforms for malware delivery.",
          "categories": [
            "Malware",
            "Phishing",
            "Threat Actor"
          ],
          "tags": [
            "Astaroth",
            "Banking Trojan",
            "Brazil",
            "Malware",
            "Phishing",
            "STAC3150",
            "WhatsApp"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "malware": [
            "Astaroth"
          ]
        },
        {
          "slug": "fincen-report-ransomware-payments-top-2-1-billion-since-2022",
          "headline": "FinCEN: Ransomware Payments Skyrocket Past $2.1 Billion, Bitcoin Remains King",
          "summary": "A new report from the U.S. Treasury's Financial Crimes Enforcement Network (FinCEN) indicates that ransomware payments reported under the Bank Secrecy Act (BSA) totaled more than $2.1 billion between January 2022 and December 2024. The analysis shows a significant peak in 2023, with $1.1 billion paid across 1,512 incidents. Despite law enforcement actions against major groups like ALPHV/BlackCat and LockBit, activity remained high in 2024. Bitcoin was the payment method in 97% of cases, with the manufacturing, financial services, and healthcare sectors being the most frequent targets. The report underscores the persistent and lucrative nature of the ransomware ecosystem.",
          "categories": [
            "Ransomware",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "ALPHV",
            "Akira",
            "Bitcoin",
            "Cybercrime",
            "FinCEN",
            "Financial Report",
            "LockBit",
            "Ransomware"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z"
        },
        {
          "slug": "white-house-eo-sets-new-deadlines-for-post-quantum-crypto-transition",
          "headline": "White House Sets 2025 Deadline for Post-Quantum Crypto Readiness",
          "summary": "The White House has issued a new Executive Order to accelerate the U.S. federal government's transition to post-quantum cryptography (PQC). The order sets a critical deadline of December 1, 2025, for several key initiatives. It directs CISA and the NSA to create and maintain a list of commercially available products that support PQC standards, guiding federal procurement. It also mandates the development of new requirements for federal agencies to support TLS 1.3, a necessary precursor for PQC integration. Additionally, NIST is tasked with updating its Secure Software Development Framework (SSDF) to include practices for developing quantum-resistant software.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Threat Intelligence"
          ],
          "tags": [
            "CISA",
            "Executive Order",
            "NIST",
            "NSA",
            "PQC",
            "Policy",
            "Post-Quantum Cryptography",
            "TLS 1.3",
            "White House"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z"
        },
        {
          "slug": "android-patches-two-actively-exploited-zero-days-in-december-update",
          "headline": "Android Under Attack: Google Patches Two Actively Exploited Zero-Days in Massive December Update",
          "summary": "Google has released its December 2025 Android Security Bulletin, patching 107 security flaws, including two high-severity zero-day vulnerabilities that are being actively exploited in limited, targeted attacks. The zero-days, CVE-2025-48633 (information disclosure) and CVE-2025-48572 (privilege escalation), both reside in the Android Framework. CISA has promptly added both vulnerabilities to its Known Exploited Vulnerabilities (KEV) catalog, requiring federal agencies to patch by December 23, 2025. The update also fixes seven critical-severity bugs, one of which could lead to remote denial-of-service. Android users are urged to apply the update as soon as it becomes available from their device manufacturer.",
          "categories": [
            "Vulnerability",
            "Mobile Security",
            "Patch Management"
          ],
          "tags": [
            "Android",
            "CISA",
            "Google",
            "KEV",
            "Mobile Security",
            "Patch Management",
            "Vulnerability",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "cves": [
            "CVE-2025-48572",
            "CVE-2025-48631",
            "CVE-2025-48633"
          ]
        },
        {
          "slug": "china-linked-hackers-use-stealthy-brickstorm-backdoor-in-vmware-attacks",
          "headline": "Chinese APTs Deploy 'BRICKSTORM' Backdoor to Infiltrate VMware Environments",
          "summary": "A joint advisory from U.S. and Canadian cybersecurity agencies has exposed a sophisticated backdoor named 'BRICKSTORM,' which is being used by Chinese state-affiliated hackers to target VMware vSphere environments. The malware is part of a long-running espionage campaign tracked as 'Salt Typhoon' and provides attackers with stealthy, long-term persistence. BRICKSTORM's capabilities include creating hidden virtual machines, stealing credentials by snapshotting active VMs, and evading detection. The campaign has primarily targeted government and IT sector organizations, demonstrating the adversary's deep expertise in virtualized infrastructure.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "BRICKSTORM",
            "Backdoor",
            "CISA",
            "China",
            "Espionage",
            "Salt Typhoon",
            "VMware",
            "vSphere"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "malware": [
            "BRICKSTORM"
          ]
        },
        {
          "slug": "clop-suspected-in-oracle-zero-day-attacks-on-upenn-and-university-of-phoenix",
          "headline": "Cl0p Implicated in Oracle Zero-Day Attacks, Breaching UPenn and University of Phoenix",
          "summary": "The University of Pennsylvania and the University of Phoenix have both reported data breaches resulting from the exploitation of zero-day vulnerabilities in their Oracle E-Business Suite servers. The attacks have compromised the personal information of at least 1,488 individuals at UPenn and a much larger, unspecified number of students, alumni, and staff at the University of Phoenix. Security researchers suspect the notorious Cl0p ransomware gang is behind the campaign, continuing their pattern of exploiting vulnerabilities in widely used enterprise software for large-scale data theft and extortion. Both institutions are currently notifying affected individuals.",
          "categories": [
            "Data Breach",
            "Threat Actor",
            "Vulnerability"
          ],
          "tags": [
            "Cl0p",
            "Data Breach",
            "Education",
            "Extortion",
            "Oracle",
            "Oracle E-Business Suite",
            "University",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z"
        },
        {
          "slug": "albiriox-new-android-banking-trojan-sold-as-maas",
          "headline": "New Android Banking Trojan 'Albiriox' Targets 400+ Finance Apps via MaaS Model",
          "summary": "A new, highly sophisticated Android banking trojan named 'Albiriox' has been discovered by security researchers. It is being sold on a Malware-as-a-Service (MaaS) basis, enabling widespread distribution by various cybercriminals. The malware is designed to target over 400 distinct financial and cryptocurrency applications worldwide. Albiriox employs advanced techniques to commit on-device fraud, including abusing Android's accessibility services, using VNC for full remote device control, and deploying dynamic overlay attacks to steal credentials. A notable feature is its 'black-screen masking' capability, which conceals the attacker's remote actions from the user, allowing them to perform fraudulent transactions undetected.",
          "categories": [
            "Malware",
            "Mobile Security",
            "Phishing"
          ],
          "tags": [
            "Albiriox",
            "Android",
            "Banking Trojan",
            "MaaS",
            "Malware",
            "Mobile Security",
            "VNC"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "malware": [
            "Albiriox"
          ]
        },
        {
          "slug": "sharepoint-flaws-chained-to-deliver-warlock-ransomware",
          "headline": "SharePoint Flaw Chain Exploited to Deploy Warlock Ransomware",
          "summary": "A new attack campaign attributed to the threat actor Storm-2603 is exploiting a chain of Microsoft SharePoint vulnerabilities (CVE-2025-49706, CVE-2025-49704) for initial access. Post-exploitation, the attackers deploy Velociraptor, a legitimate digital forensics and incident response (DFIR) tool, for reconnaissance and persistence. By abusing a trusted tool, the attackers blend in with normal administrative activity, evading detection. In several confirmed incidents, this attack chain culminates in the deployment of the Warlock ransomware. This 'living-off-the-land' technique highlights a sophisticated approach to facilitating ransomware attacks.",
          "categories": [
            "Ransomware",
            "Vulnerability",
            "Threat Actor"
          ],
          "tags": [
            "Living-off-the-Land",
            "Ransomware",
            "SharePoint",
            "Storm-2603",
            "Velociraptor",
            "Vulnerability",
            "Warlock"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "cves": [
            "CVE-2025-49704",
            "CVE-2025-49706"
          ],
          "malware": [
            "Warlock ransomware"
          ]
        },
        {
          "slug": "marquis-software-breach-exposes-data-from-74-banks-and-credit-unions",
          "headline": "Supply Chain Attack: Marquis Software Breach Hits 74 Banks, Akira Ransomware Suspected",
          "summary": "Marquis Software Solutions, a U.S.-based financial software provider, has suffered a major data breach, compromising the sensitive information of over 400,000 customers across 74 client banks and credit unions. This significant supply chain attack is suspected to be the work of the Akira ransomware gang. According to investigators, the threat actors likely gained initial access by exploiting vulnerabilities in SonicWall firewall devices on Marquis's network. This incident highlights the cascading risk in the financial sector, where a compromise at a single software vendor can have widespread consequences for numerous downstream institutions and their customers.",
          "categories": [
            "Supply Chain Attack",
            "Data Breach",
            "Ransomware"
          ],
          "tags": [
            "Akira",
            "Credit Union",
            "Data Breach",
            "Financial Services",
            "Ransomware",
            "SonicWall",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z"
        },
        {
          "slug": "react2shell-critical-rce-flaw-mass-exploited-by-chinese-apts",
          "headline": "React2Shell Nightmare: CVSS 10.0 Flaw Under Mass Exploitation, CISA Issues Emergency Directive",
          "summary": "A critical remote code execution vulnerability with a CVSS score of 10.0, dubbed 'React2Shell' and tracked as CVE-2025-55182, is being actively and widely exploited. The flaw resides in the React Server Components (RSC) 'Flight' protocol and allows unauthenticated attackers to take complete control of vulnerable servers. Within hours of its public disclosure on December 3, 2025, China-nexus threat actors, including Earth Lamia and Jackpot Panda, began mass scanning and exploitation. The vulnerability affects React 19.x and popular frameworks like Next.js 15.x/16.x. In response to the widespread attacks, CISA has added CVE-2025-55182 to its Known Exploited Vulnerabilities (KEV) catalog, mandating immediate patching for federal agencies.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "APT",
            "Deserialization",
            "KEV",
            "Next.js",
            "RCE",
            "React",
            "React2Shell",
            "Zero-Day"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-08T15:00:00.000Z",
          "cves": [
            "CVE-2025-55182"
          ],
          "malware": [
            "Sliver",
            "XMRig"
          ]
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-12-07",
      "type": "publication-daily",
      "headline": "React2Shell Exploitation Surges as CISA Adds to KEV; Clop Hits NHS via Oracle Zero-Day",
      "articleCount": 10,
      "articles": [
        {
          "slug": "2025-government-shutdown-exposed-critical-federal-cyber-gaps",
          "headline": "2025 Government Shutdown Exposed Critical Federal Cybersecurity Gaps",
          "summary": "A Forbes analysis published on December 6, 2025, reveals that the record-breaking 43-day U.S. government shutdown created severe gaps in national cybersecurity. The shutdown led to widespread furloughs and operational disruptions at the Cybersecurity and Infrastructure Security Agency (CISA), significantly impairing the federal government's ability to perform threat hunting and network monitoring. The timing was especially poor, as it coincided with the Department of Defense implementing new, mandatory Cybersecurity Maturity Model Certification (CMMC) rules for defense contractors, creating a paradox of weakened federal defenses alongside stricter private sector requirements.",
          "categories": [
            "Policy and Compliance",
            "Security Operations"
          ],
          "tags": [
            "CISA",
            "CMMC",
            "Cyber Policy",
            "DoD",
            "Government Shutdown",
            "National Security"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-07T15:00:00.000Z"
        },
        {
          "slug": "indonesian-gambling-network-doubles-as-malicious-c2-infrastructure",
          "headline": "Indonesian Gambling Network Abused as Malicious C2 Infrastructure",
          "summary": "Researchers have uncovered a vast, dual-use cybercrime infrastructure in Indonesia. A sprawling network, primarily created to support illegal online gambling, is also being rented out or used as a command-and-control (C2) and anonymity service for malware operators. By routing their malicious traffic through the high-volume gambling network, threat actors can effectively hide their C2 communications and obscure their origins. This co-opting of a gray-market infrastructure presents a significant and complex challenge for threat detection and attribution, providing a resilient and hidden platform for various malware campaigns.",
          "categories": [
            "Threat Intelligence",
            "Cyberattack"
          ],
          "tags": [
            "C2 Infrastructure",
            "Cybercrime",
            "Indonesia",
            "Online Gambling",
            "Proxy"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-07T15:00:00.000Z"
        },
        {
          "slug": "wireshark-vulnerabilities-pose-denial-of-service-risk",
          "headline": "Wireshark Vulnerabilities Create Denial-of-Service Risk for Security Teams",
          "summary": "France's national cybersecurity agency, CERT-FR, has issued a security advisory for two critical vulnerabilities in Wireshark, the world's most popular network protocol analyzer. The flaws, identified as CVE-2025-13945 and CVE-2025-13946, can be exploited by a remote attacker to cause a denial-of-service (DoS) condition. This poses a significant risk to security operations, as an attacker could crash the tool during a live incident investigation, effectively blinding security analysts. Users are urged to update to the patched versions (4.4.12 and 4.6.2) to mitigate the risk.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Security Operations"
          ],
          "tags": [
            "CERT-FR",
            "Denial of Service",
            "DoS",
            "Patch Management",
            "Security Tools",
            "Wireshark"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-12-07T15:00:00.000Z",
          "cves": [
            "CVE-2025-13945",
            "CVE-2025-13946"
          ]
        },
        {
          "slug": "maguen-group-launches-fortem-cybersecurity-to-global-market",
          "headline": "Mexico's Maguen Group Launches Global Cybersecurity Brand 'Fortem'",
          "summary": "Maguen Group, a leading private security firm based in Mexico, has officially launched Fortem Cybersecurity, its new global cybersecurity brand, on December 7, 2025. The new entity is an evolution of the company's existing cybersecurity arm, MT Cyber, which it acquired in 2019. With Fortem, Maguen Group aims to 'democratize cybersecurity' by offering enterprise-level protection to companies of all sizes. The launch marks a strategic push for global expansion, leveraging its existing presence in Mexico, Ecuador, and Germany, with the United States targeted as the next major market.",
          "categories": [
            "Other"
          ],
          "tags": [
            "Corporate News",
            "Cybersecurity Industry",
            "MSSP",
            "Market Expansion",
            "Mexico"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-12-07T15:00:00.000Z"
        },
        {
          "slug": "barts-health-nhs-trust-hit-by-clop-ransomware-via-oracle-zero-day",
          "headline": "Clop Ransomware Breaches Barts Health NHS Trust via Oracle Zero-Day",
          "summary": "The Clop ransomware gang has claimed responsibility for a significant data breach at Barts Health NHS Trust, one of England's largest healthcare providers. The attack, which occurred in August 2025, leveraged a zero-day vulnerability in Oracle E-Business Suite. The threat actors exfiltrated files from an invoice database containing the names and addresses of patients and former staff. This data was later published on Clop's dark web leak site. While core clinical systems were reportedly unaffected, the compromised information poses a serious risk for follow-on social engineering and fraud attacks. The incident is part of a wider campaign by Clop targeting the now-patched Oracle vulnerability.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Vulnerability"
          ],
          "tags": [
            "Dark Web",
            "Data Leak",
            "Double Extortion",
            "NHS",
            "Oracle",
            "Zero-Day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-07T15:00:00.000Z"
        },
        {
          "slug": "malicious-go-packages-impersonate-google-uuid-library-in-supply-chain-attack",
          "headline": "Malicious Go Packages Impersonating Google UUID Library Steal Data",
          "summary": "A sophisticated and long-running supply chain attack targeting Go developers has been discovered, active since at least May 2021. The attack involves two malicious packages, `github.com/bpoorman/uuid` and `github.com/bpoorman/uid`, which impersonate a popular Google UUID library using a typosquatting technique. The counterfeit packages are fully functional to avoid suspicion but contain a hidden backdoor. A specific function, `Valid`, is weaponized to secretly encrypt and exfiltrate any data passed to it, such as user IDs or session tokens, to an external paste site. This stealthy method allows the attacker, 'bpoorman', to siphon sensitive information from compromised applications.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "Data Exfiltration",
            "Dependency Confusion",
            "Go",
            "Software Supply Chain",
            "Typosquatting"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-07T15:00:00.000Z"
        },
        {
          "slug": "malicious-rust-package-evm-units-targets-web3-developers",
          "headline": "Malicious Rust Package 'evm-units' Targets Web3 Developers",
          "summary": "A malicious software package named 'evm-units' has been discovered and removed from Rust's official crates.io registry. The package, downloaded over 7,200 times, targeted Web3 developers by impersonating a legitimate utility for the Ethereum Virtual Machine (EVM). While appearing functional, the crate contained a stealthy, multi-stage loader designed to download and execute operating system-specific malware. The malware included code to specifically evade 360 Total Security, a popular antivirus in China, suggesting the threat actor's focus was on stealing cryptocurrency from developers, likely in the Asian market. A second package, 'uniswap-utils', was also removed for depending on the malicious crate.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Intelligence"
          ],
          "tags": [
            "Cryptocurrency",
            "Malware",
            "Rust",
            "Supply Chain Attack",
            "Web3",
            "crates.io"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-07T15:00:00.000Z",
          "malware": [
            "evm-units",
            "uniswap-utils"
          ]
        },
        {
          "slug": "us-canada-warn-of-chinese-brickstorm-malware-targeting-vmware",
          "headline": "US & Canada Warn of Chinese 'Brickstorm' Malware Targeting Critical Infrastructure",
          "summary": "The United States and Canada have issued a joint cybersecurity advisory regarding 'Brickstorm,' a sophisticated malware backdoor attributed to state-sponsored hackers from the People's Republic of China (PRC). The malware specifically targets Broadcom's VMware vSphere, a ubiquitous virtualization platform. Brickstorm is designed to establish long-term, stealthy persistence within government and information technology networks. Its primary functions are to steal login credentials and other sensitive data, providing attackers with deep access that could be used for espionage or future disruptive and destructive attacks.",
          "categories": [
            "Threat Actor",
            "Malware",
            "Cyberattack"
          ],
          "tags": [
            "APT",
            "Backdoor",
            "CISA",
            "Espionage",
            "State-Sponsored",
            "VMware",
            "vSphere"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-07T15:00:00.000Z",
          "malware": [
            "Brickstorm"
          ]
        },
        {
          "slug": "whatsapp-flaw-sparks-surge-in-no-click-account-hijackings",
          "headline": "WhatsApp Flaw Leads to Surge in No-Click Account Hijackings",
          "summary": "A technical vulnerability in WhatsApp is being actively exploited to conduct 'no-click' account takeovers, according to warnings from Kuwait's National Cyber Security Center and security experts. Unlike typical phishing attacks, this method allows threat actors to hijack a user's account without any interaction from the victim, such as clicking a link. The attacks have led to a sharp increase in compromised social media accounts in Kuwait and are believed to be occurring globally. While technical details of the flaw are sparse, officials and experts are urgently advising all WhatsApp users to enable two-factor authentication (2FA) as the most effective defense against this specific attack vector.",
          "categories": [
            "Mobile Security",
            "Vulnerability",
            "Cyberattack"
          ],
          "tags": [
            "2FA",
            "Account Takeover",
            "Mobile Security",
            "WhatsApp",
            "Zero-Click"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-12-07T15:00:00.000Z"
        },
        {
          "slug": "cisa-adds-react2shell-to-kev-catalog-amidst-active-exploitation-surge",
          "headline": "React2Shell Added to CISA's KEV Catalog After Widespread Exploitation",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the critical React2Shell vulnerability, CVE-2025-55182, to its Known Exploited Vulnerabilities (KEV) catalog following a surge in active and widespread attacks. The flaw, a CVSS 10.0 remote code execution (RCE) vulnerability in Meta's React Server Components, is being exploited by Chinese state-sponsored groups like Earth Lamia and UNC5174, as well as botnets such as Mirai and RondoDox. Attackers are deploying a range of payloads including the SNOWLIGHT and VShell backdoors, cryptocurrency miners, and Cobalt Strike beacons. The vulnerability's ease of exploitation via a single HTTP request puts millions of services using frameworks like Next.js at risk, prompting CISA to set a December 26, 2025, patching deadline for federal agencies.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Threat Actor"
          ],
          "tags": [
            "APT",
            "Botnet",
            "CISA",
            "Insecure Deserialization",
            "KEV",
            "Next.js",
            "RCE",
            "React"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-12-07T15:00:00.000Z",
          "cves": [
            "CVE-2025-55182"
          ],
          "malware": [
            "Cobalt Strike",
            "Mirai",
            "RondoDox botnet",
            "SNOWLIGHT",
            "VShell"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "marquis-software-supply-chain-breach-hits-dozens-of-us-banks",
        "originalHeadline": "Supply Chain Breach at Vendor Marquis Exposes Data From Dozens of US Banks",
        "updateTitle": "Update: Supply Chain Breach at Vendor Marquis Exposes Data From Dozens of US Banks",
        "updateSummary": "Akira ransomware gang suspected in Marquis Software breach, impacting over 400,000 customers across 74 banks via SonicWall vulnerabilities.",
        "categories": [
          "Supply Chain Attack",
          "Data Breach",
          "Ransomware"
        ],
        "tags": [
          "Data Breach",
          "Financial Services",
          "Marquis Software",
          "PII",
          "Ransomware",
          "SSN",
          "Supply Chain Attack"
        ],
        "severity": "high",
        "publishedAt": "2025-11-27T15:00:00.000Z",
        "updatedAt": "2025-12-08T12:00:00.000Z"
      },
      {
        "slug": "washington-post-confirms-breach-in-massive-oracle-software-attack",
        "originalHeadline": "Washington Post Breached by Clop Ransomware via Oracle Flaws",
        "updateTitle": "Update: Washington Post Breached by Clop Ransomware via Oracle Flaws",
        "updateSummary": "Clop ransomware campaign adds Barts Health NHS Trust as victim, exploiting a now-patched Oracle E-Business Suite zero-day, leading to patient data leak.",
        "categories": [
          "Ransomware",
          "Data Breach",
          "Cyberattack"
        ],
        "tags": [
          "Clop",
          "Data Breach",
          "E-Business Suite",
          "Extortion",
          "Oracle",
          "Ransomware",
          "TA505"
        ],
        "severity": "high",
        "publishedAt": "2025-11-09T15:00:00.000Z",
        "updatedAt": "2025-12-07T12:00:00.000Z"
      },
      {
        "slug": "cisa-warns-commercial-spyware-targets-signal-whatsapp-users",
        "originalHeadline": "CISA: Commercial Spyware Hijacking Signal & WhatsApp via Zero-Clicks",
        "updateTitle": "Update: CISA: Commercial Spyware Hijacking Signal & WhatsApp via Zero-Clicks",
        "updateSummary": "WhatsApp zero-click attacks surge globally, 2FA critical defense against widespread exploitation.",
        "categories": [
          "Malware",
          "Mobile Security",
          "Threat Intelligence"
        ],
        "tags": [
          "CISA",
          "Signal",
          "WhatsApp",
          "mobile security",
          "phishing",
          "social engineering",
          "spyware",
          "zero-click"
        ],
        "severity": "high",
        "publishedAt": "2025-11-25T15:00:00.000Z",
        "updatedAt": "2025-12-07T10:00:00.000Z"
      },
      {
        "slug": "global-agencies-launch-effort-against-bulletproof-hosting-providers",
        "originalHeadline": "Global Coalition Targets 'Bulletproof' Hosting Services Fueling Cybercrime",
        "updateTitle": "Update: Global Coalition Targets 'Bulletproof' Hosting Services Fueling Cybercrime",
        "updateSummary": "Discovery of Indonesian gambling network abused as resilient C2 infrastructure for malware operators.",
        "categories": [
          "Policy and Compliance",
          "Threat Intelligence",
          "Regulatory"
        ],
        "tags": [
          "BPH",
          "Bulletproof Hosting",
          "CISA",
          "Cybercrime Infrastructure",
          "FBI",
          "NSA",
          "Threat Intelligence"
        ],
        "severity": "informational",
        "publishedAt": "2025-11-21T15:00:00.000Z",
        "updatedAt": "2025-12-07T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}