{
  "lastUpdated": "2025-10-31T17:43:48.608Z",
  "runDate": "2025-10-31",
  "publications": [
    {
      "slug": "daily-threat-publications-2025-10-31",
      "type": "publication-daily",
      "headline": "PhantomRaven Supply Chain Attack Hits npm; Conduent Breach Exposes 10.5M; CISA Flags Actively Exploited Flaws",
      "articleCount": 10,
      "articles": [
        {
          "slug": "linkedin-phishing-campaign-targets-finance-execs-with-fake-board-invites",
          "headline": "Finance Execs Targeted in Sophisticated LinkedIn Phishing Scheme with Fake Board Invites",
          "summary": "A sophisticated phishing campaign is targeting finance executives through LinkedIn direct messages, using fake invitations to an executive board as a lure. The multi-stage attack, detailed by Push Security, aims to harvest Microsoft credentials and session cookies to bypass MFA. The attack chain leverages trusted services to appear legitimate, starting with a Google open redirect, leading to a fraudulent portal hosted on Google Firebase, and using a Cloudflare CAPTCHA to evade security bots. This non-email-based phishing vector is reportedly becoming significantly more common, accounting for over a third of recent attempts tracked by researchers.",
          "categories": [
            "Phishing",
            "Threat Actor",
            "Cloud Security"
          ],
          "tags": [
            "LinkedIn",
            "MFA bypass",
            "credential theft",
            "finance",
            "phishing",
            "social engineering"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2025-10-31T15:00:00.000Z"
        },
        {
          "slug": "canada-issues-national-alert-as-hacktivists-target-critical-infrastructure",
          "headline": "Canada Issues National Alert as Hacktivists Target Critical Infrastructure",
          "summary": "The Canadian Centre for Cyber Security, along with the RCMP, has issued a national alert warning of increasing cyberattacks by hacktivists against the nation's critical infrastructure. The advisory follows multiple successful breaches of internet-accessible Industrial Control Systems (ICS) in sectors like water treatment, food, and manufacturing. The alert notes a tactical shift by hacktivists from simple DDoS attacks to more disruptive intrusions into Operational Technology (OT). Authorities are urging organizations, especially in under-regulated sectors, to immediately inventory and secure exposed ICS/OT devices, recommending VPNs with 2FA and enhanced monitoring to mitigate the risk to public safety.",
          "categories": [
            "Industrial Control Systems",
            "Policy and Compliance",
            "Cyberattack"
          ],
          "tags": [
            "Canada",
            "ICS",
            "OT Security",
            "SCADA",
            "critical infrastructure",
            "cyber alert",
            "hacktivism"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-31T15:00:00.000Z"
        },
        {
          "slug": "ey-exposes-4tb-database-backup-on-public-azure-server",
          "headline": "EY Exposes 4TB Database Backup on Public Azure Server",
          "summary": "Global accounting firm Ernst & Young (EY) inadvertently exposed a massive 4-terabyte SQL Server backup file on a public Microsoft Azure server. The unprotected `.BAK` file was discovered by a security researcher from Neo Security and was not password-protected, leaving it accessible to anyone on the internet. Such a file could contain extremely sensitive corporate and client data, including database schemas, user information, API keys, and passwords. EY was notified through its CSIRT and promptly secured the file, stating that no client data was affected. The incident highlights the significant risks of cloud misconfigurations.",
          "categories": [
            "Data Breach",
            "Cloud Security",
            "Security Operations"
          ],
          "tags": [
            "Azure",
            "Ernst & Young",
            "cloud security",
            "data leak",
            "database backup",
            "misconfiguration"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-31T15:00:00.000Z"
        },
        {
          "slug": "microsoft-azure-global-outage-caused-by-faulty-front-door-configuration-change",
          "headline": "Global Azure Outage Blamed on Faulty 'Front Door' Configuration Change",
          "summary": "A major global outage struck Microsoft Azure for approximately 8.5 hours on October 29-30, 2025, affecting a vast range of services including Microsoft 365, Xbox Live, and customer applications like those of Alaska Airlines. Microsoft attributed the root cause to a faulty tenant configuration change within its Azure Front Door (AFD) service. A defect in the deployment system's validation logic allowed the erroneous configuration to be pushed live, causing AFD nodes to fail and leading to a cascading DNS failure. Microsoft engineers resolved the issue by rolling back the change and rerouting traffic.",
          "categories": [
            "Cloud Security",
            "Security Operations",
            "Incident Response"
          ],
          "tags": [
            "Azure Front Door",
            "Microsoft",
            "Microsoft Azure",
            "cloud security",
            "incident response",
            "outage"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-31T15:00:00.000Z"
        },
        {
          "slug": "phantomraven-supply-chain-attack-hits-npm-with-novel-stealth-technique",
          "headline": "PhantomRaven Hits npm: Stealthy Attack Steals Dev Credentials & CI/CD Secrets",
          "summary": "A highly evasive software supply chain attack dubbed 'PhantomRaven' has compromised at least 126 npm packages, resulting in over 86,000 downloads. The campaign, discovered by Koi Security, utilizes a novel technique called 'Remote Dynamic Dependencies' (RDD) to bypass security scanners. The malicious packages appear benign with no dependencies but fetch a malicious payload from an external server during installation. This payload then steals developer credentials, including `.gitconfig` and `.npmrc` files, and CI/CD secrets for platforms like GitHub Actions, GitLab, and Jenkins. The attackers also employ 'slopsquatting,' creating plausible but non-existent package names that AI coding assistants might mistakenly suggest, tricking developers into installation.",
          "categories": [
            "Supply Chain Attack",
            "Malware",
            "Threat Actor"
          ],
          "tags": [
            "CI/CD",
            "PhantomRaven",
            "credential theft",
            "developer security",
            "malware",
            "npm",
            "supply chain attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-31T15:00:00.000Z",
          "malware": [
            "PhantomRaven"
          ]
        },
        {
          "slug": "qilin-ransomware-surges-in-2025-with-manufacturing-sector-hit-hardest",
          "headline": "Qilin Ransomware Rampage: Manufacturing Sector Bears the Brunt of 2025 Attacks",
          "summary": "The Qilin ransomware group (also known as Agenda) has become one of the most prolific ransomware operations in 2025, according to a new report from Cisco Talos. The group is publishing data from over 40 victims per month on its leak site. The manufacturing sector is the most heavily targeted industry, accounting for 23% of all incidents, followed by professional services and wholesale trade. Talos researchers observed Qilin operators using the legitimate tool Cyberduck for data exfiltration and PsExec for lateral movement. The group also used standard Windows tools like notepad.exe to view sensitive data on compromised systems, likely as an evasion tactic.",
          "categories": [
            "Ransomware",
            "Threat Actor",
            "Cyberattack"
          ],
          "tags": [
            "Agenda",
            "Cisco Talos",
            "Qilin",
            "double extortion",
            "manufacturing",
            "ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-31T15:00:00.000Z"
        },
        {
          "slug": "telecom-provider-ribbon-communications-discloses-year-long-nation-state-breach",
          "headline": "Telecom Giant Ribbon Communications Breached by Nation-State Actor for 10 Months",
          "summary": "Telecommunications provider Ribbon Communications has disclosed a significant security breach by a suspected nation-state actor. According to an SEC filing, the attackers first gained access in December 2024 and remained undetected for nearly a year until September 2025. The company, which serves critical clients including the U.S. Department of Defense and major carriers like Verizon, stated the actor accessed several customer files stored on two laptops outside the main network. The long dwell time and the nature of the target suggest a sophisticated espionage campaign, raising serious concerns about supply chain security in the telecommunications sector.",
          "categories": [
            "Cyberattack",
            "Threat Actor",
            "Supply Chain Attack"
          ],
          "tags": [
            "APT",
            "Ribbon Communications",
            "data breach",
            "nation-state",
            "supply chain attack",
            "telecom"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-31T15:00:00.000Z"
        },
        {
          "slug": "vmware-privilege-escalation-zero-day-cve-2025-41244-added-to-cisa-kev-catalog",
          "headline": "VMware Zero-Day LPE Flaw Exploited by China-Linked Actor Added to CISA KEV",
          "summary": "CISA has added CVE-2025-41244, a high-severity local privilege escalation (LPE) vulnerability in VMware products, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw affects VMware Aria Operations and VMware Tools and allows a non-administrative user on a virtual machine to gain root privileges. The vulnerability has been exploited as a zero-day since mid-October 2024, with attribution pointing to UNC5174, a suspected China-linked threat actor. The flaw is an untrusted search path vulnerability, and a public proof-of-concept is available, increasing the risk to unpatched systems.",
          "categories": [
            "Vulnerability",
            "Threat Actor",
            "Patch Management"
          ],
          "tags": [
            "CISA",
            "CVE-2025-41244",
            "KEV",
            "UNC5174",
            "VMware",
            "privilege escalation",
            "zero-day"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-31T15:00:00.000Z",
          "cves": [
            "CVE-2025-41244"
          ]
        },
        {
          "slug": "xwiki-rce-flaw-cve-2025-24893-added-to-cisa-kev-catalog-amid-active-exploitation",
          "headline": "CISA KEV Alert: XWiki RCE Flaw Actively Exploited for Cryptomining",
          "summary": "The US Cybersecurity and Infrastructure Security Agency (CISA) has added a critical remote code execution (RCE) vulnerability in the XWiki enterprise wiki platform, CVE-2025-24893, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, rated 9.8 on the CVSS scale, allows an unauthenticated attacker to execute arbitrary code by injecting malicious Groovy expressions into a search query. Security researchers at VulnCheck have confirmed active exploitation in the wild, with attackers using the vulnerability to deploy cryptocurrency mining malware. CISA has mandated that federal agencies patch the flaw promptly due to the immediate risk.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CISA",
            "CVE-2025-24893",
            "KEV",
            "RCE",
            "XWiki",
            "cryptomining",
            "vulnerability"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-31T15:00:00.000Z",
          "cves": [
            "CVE-2025-24893"
          ]
        },
        {
          "slug": "conduent-data-breach-exposes-10-million-individuals-data-from-safepay-ransomware-attack",
          "headline": "Conduent Breach Exposes 10.5M; SafePay Ransomware Claims 8.5TB Data Theft",
          "summary": "Business services giant Conduent has begun notifying over 10.5 million people that their sensitive data was stolen in a major cyberattack attributed to the SafePay ransomware group. The breach, which ranks as one of the largest healthcare data breaches ever, occurred between October 21, 2024, and January 13, 2025. The attackers had a dwell time of nearly three months, allowing them to exfiltrate an estimated 8.5 terabytes of data. The compromised information includes names, Social Security numbers, health insurance details, and medical records. Numerous government and corporate clients were affected, including various Blue Cross Blue Shield entities and state human services departments. The significant delay in notifying victims, a year after the intrusion began, has led to legal investigations.",
          "categories": [
            "Data Breach",
            "Ransomware",
            "Threat Actor"
          ],
          "tags": [
            "Conduent",
            "PHI",
            "PII",
            "SafePay",
            "data breach",
            "healthcare",
            "ransomware"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-31T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2025-10-30",
      "type": "publication-daily",
      "headline": "Microsoft Azure Outage Causes Global Chaos; CISA Warns of Actively Exploited WSUS Flaw",
      "articleCount": 10,
      "articles": [
        {
          "slug": "uk-sees-alarming-rise-in-cyber-threats-proposes-ransomware-payment-ban",
          "headline": "UK Proposes Ransomware Payment Ban as 'Nationally Significant' Cyberattacks Double",
          "summary": "The UK is facing an 'alarming' increase in cyber threats, with a GCHQ report revealing that 'nationally significant' cyberattacks more than doubled to 204 in the past year, costing the economy billions. High-profile ransomware attacks on companies like Marks & Spencer and Jaguar Land Rover have inflicted massive financial damage. In response, the UK government is consulting on new legislation that includes a targeted ban on ransomware payments for public sector bodies and critical national infrastructure operators. The proposals aim to disrupt the ransomware business model and improve national threat intelligence through mandated incident reporting.",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Ransomware"
          ],
          "tags": [
            "Cybersecurity and Resilience Bill",
            "GCHQ",
            "Legislation",
            "NCSC",
            "Payment Ban",
            "Policy",
            "Ransomware",
            "UK Government"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2025-10-30T15:00:00.000Z"
        },
        {
          "slug": "dentsu-subsidiary-merkle-hit-by-cyberattack-exposing-data",
          "headline": "Ad Giant Dentsu's Subsidiary Merkle Hit by Cyberattack, Staff and Client Data Exposed",
          "summary": "Global advertising firm Dentsu has confirmed that its US-based customer experience management (CXM) subsidiary, Merkle, was the target of a cyberattack. The company detected 'abnormal activity' on Merkle's network and proactively shut down certain systems to contain the threat. An investigation has confirmed that the incident led to the exposure of both staff and sensitive client data. Merkle, a major player in the CXM industry, handles large volumes of customer data, making it a high-value target for threat actors. The full scope of the breach is still under investigation.",
          "categories": [
            "Cyberattack",
            "Data Breach",
            "Threat Intelligence"
          ],
          "tags": [
            "Advertising",
            "CXM",
            "Cyberattack",
            "Data Breach",
            "Dentsu",
            "Incident Response",
            "Merkle",
            "Supply Chain Attack"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-30T15:00:00.000Z"
        },
        {
          "slug": "microsoft-azure-outage-disrupts-global-services-after-configuration-error",
          "headline": "Azure Down: Misconfiguration Triggers Global Microsoft Service Outage",
          "summary": "A faulty configuration change in Microsoft's Azure Front Door (AFD) service on October 29-30, 2025, led to a multi-hour global outage. The incident caused widespread latency, timeouts, and connection failures for numerous Microsoft services, including Microsoft 365, Xbox Live, and Entra ID, as well as customer applications like Alaska Airlines' website. Microsoft engineers identified the inadvertent tenant configuration change as the root cause and initiated a rollback to restore services. The event highlights the systemic risk and fragility within globally interconnected cloud ecosystems, where a single non-malicious error can have a cascading, worldwide impact.",
          "categories": [
            "Cloud Security",
            "Cyberattack",
            "Incident Response"
          ],
          "tags": [
            "Azure Front Door",
            "Cloud Outage",
            "Cloud Security",
            "Configuration Error",
            "Incident Response",
            "Microsoft Azure",
            "Systemic Risk"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-30T15:00:00.000Z"
        },
        {
          "slug": "government-contractor-conduent-breach-exposes-data-of-10-million",
          "headline": "Conduent Data Breach: 10 Million+ Individuals' Personal & Medical Data Exposed",
          "summary": "Conduent Business Services, a major contractor for U.S. government agencies, has disclosed a massive data breach impacting over 10 million individuals. The incident, which occurred between October 2024 and January 2025, involved an unauthorized third party gaining access to Conduent's network and exfiltrating files. The compromised data is highly sensitive, including names, Social Security numbers, medical information, and health insurance details. The breach has affected residents across numerous states, including Texas, Washington, and California, and has triggered a legal investigation by the law firm Edelson Lechtzin LLP into the company's data privacy practices.",
          "categories": [
            "Data Breach",
            "Threat Intelligence",
            "Regulatory"
          ],
          "tags": [
            "Conduent",
            "Cybersecurity",
            "Data Breach",
            "Government Contractor",
            "Medical Data",
            "PHI",
            "PII",
            "Social Security Number"
          ],
          "severity": "high",
          "isUpdate": true,
          "publishedAt": "2025-10-30T15:00:00.000Z",
          "updatedAt": "2025-10-31T12:00:00.000Z"
        },
        {
          "slug": "incransom-gang-claims-20tb-data-theft-from-evolve-mortgage-services",
          "headline": "IncRansom Claims 20TB Data Heist from Evolve Mortgage Services",
          "summary": "The 'incransom' ransomware group has claimed responsibility for a significant data breach at Evolve Mortgage Services, listing the company on its dark web leak site on October 30, 2025. The attackers allege they have stolen over 20 terabytes of data, including 2 terabytes of databases containing sensitive PII such as Social Security numbers, client IDs, and full credit histories dating back to 2016. The group is using a pure data-theft extortion model, threatening to leak the data after claiming the company refused to negotiate. This incident highlights the ongoing threat of data extortion attacks against the U.S. financial services sector.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Dark Web",
            "Data Breach",
            "Data Extortion",
            "Evolve Mortgage Services",
            "Financial Services",
            "IncRansom",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-30T15:00:00.000Z",
          "malware": [
            "IncRansom"
          ]
        },
        {
          "slug": "herodotus-android-malware-mimics-human-typing-to-bypass-security",
          "headline": "New 'Herodotus' Android Trojan Mimics Human Typing to Defeat Biometric Security",
          "summary": "A new Android banking trojan, named 'Herodotus,' is being sold as a Malware-as-a-Service (MaaS) and is designed to evade modern behavioral biometric security. According to researchers at Threat Fabric, the malware gains full control of a device via Accessibility Service abuse. Its key innovation is the ability to 'humanize' fraudulent actions by simulating realistic typing, introducing random delays between keystrokes. This allows it to perform automated on-device fraud, such as transferring funds, while appearing as a legitimate user. The malware, spread via smishing, has been observed targeting banking users in Italy and Brazil.",
          "categories": [
            "Malware",
            "Mobile Security",
            "Threat Intelligence"
          ],
          "tags": [
            "Accessibility Service",
            "Android Malware",
            "Banking Trojan",
            "Behavioral Biometrics",
            "Herodotus",
            "MaaS",
            "Smishing",
            "Threat Fabric"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-30T15:00:00.000Z",
          "malware": [
            "Herodotus"
          ]
        },
        {
          "slug": "new-logins-zip-infostealer-service-uses-browser-exploits-for-rapid-theft",
          "headline": "New 'logins[.]zip' Infostealer Claims 99% Credential Theft in 12 Seconds Using Zero-Days",
          "summary": "A new Malware-as-a-Service (MaaS) infostealer named 'logins[.]zip' is being sold on the clear web, boasting incredible speed and efficiency. According to a report from Hudson Rock, its authors claim it can exfiltrate 99% of passwords and cookies from a victim's machine in under 12 seconds. The stealer's key selling point is its alleged use of two Chromium zero-day exploits, which allow it to steal credentials without needing admin rights. The service, sold for $150/month, provides a browser-based builder for creating polymorphic stubs and targets logins, cookies, payment cards, and crypto wallets.",
          "categories": [
            "Malware",
            "Threat Intelligence",
            "Vulnerability"
          ],
          "tags": [
            "Chromium",
            "Credential Theft",
            "Hudson Rock",
            "Infostealer",
            "MaaS",
            "Malware",
            "Zero-Day",
            "logins.zip"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-30T15:00:00.000Z",
          "malware": [
            "Lumma",
            "RedLine",
            "logins[.]zip"
          ]
        },
        {
          "slug": "scattered-spider-linked-to-major-uk-retail-breaches-in-phishing-report",
          "headline": "Scattered Spider's Phishing Blitz Caused Millions in Damages to UK Retailers",
          "summary": "A new phishing report from KnowBe4 has attributed hundreds of millions in damages at major UK retailers like M&S, Co-Op, and Harrods to the cybercrime group 'Scattered Spider'. The group utilizes a potent mix of social engineering, vishing (voice phishing), and MFA bombing to circumvent security controls. After breaching the companies, Scattered Spider launched secondary phishing campaigns impersonating the brands to steal customer credentials. The report also highlights a massive 449% increase in vishing attacks in 2025 and the growing use of AI-generated voices in callback scams, signaling a shift towards human-layer attacks.",
          "categories": [
            "Threat Actor",
            "Phishing",
            "Cyberattack"
          ],
          "tags": [
            "KnowBe4",
            "MFA Bombing",
            "Phishing",
            "Retail",
            "Scattered Spider",
            "Social Engineering",
            "Threat Actor",
            "Vishing"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2025-10-30T15:00:00.000Z"
        },
        {
          "slug": "cisa-warns-of-active-exploitation-of-critical-wsus-vulnerability-cve-2025-59287",
          "headline": "CISA: Patch Now! Critical, Actively Exploited RCE Flaw in Windows Server (WSUS)",
          "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued an urgent alert for a critical remote code execution (RCE) vulnerability, CVE-2025-59287, in Microsoft's Windows Server Update Services (WSUS). The flaw is being actively exploited in the wild, allowing unauthenticated attackers to gain system-level privileges on vulnerable servers. A previous patch was incomplete, necessitating an out-of-band security update from Microsoft. CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog and is instructing organizations to apply the new patch immediately or take mitigation steps.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Threat Intelligence"
          ],
          "tags": [
            "CISA",
            "CVE-2025-59287",
            "KEV",
            "Patch Management",
            "RCE",
            "Vulnerability",
            "WSUS",
            "Windows Server"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-30T15:00:00.000Z",
          "cves": [
            "CVE-2025-59287"
          ]
        },
        {
          "slug": "consulting-giant-ey-exposes-4tb-sql-database-to-internet",
          "headline": "EY Leaks 4TB+ SQL Database Packed with Corporate Secrets via Cloud Misconfiguration",
          "summary": "Consulting giant EY (Ernst & Young) inadvertently exposed a massive, 4TB+ SQL Server backup file to the public internet due to a cloud storage misconfiguration. The unencrypted `.BAK` file, discovered by researchers at Neo Security, contained a treasure trove of highly sensitive internal data, including API keys, service account passwords, session tokens, and user credentials. The incident highlights the severe risks associated with cloud service misconfigurations, where tools designed for convenience can lead to catastrophic data exposure if not secured properly. Neo Security described the leak as equivalent to finding the 'master blueprint and physical keys to a vault.'",
          "categories": [
            "Data Breach",
            "Cloud Security",
            "Vulnerability"
          ],
          "tags": [
            "Cloud Security",
            "Data Breach",
            "Data Exposure",
            "Data Leak",
            "EY",
            "Ernst & Young",
            "Misconfiguration",
            "SQL Server"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2025-10-30T15:00:00.000Z"
        }
      ]
    }
  ],
  "articles": {
    "updated": [
      {
        "slug": "government-contractor-conduent-breach-exposes-data-of-10-million",
        "originalHeadline": "Conduent Data Breach: 10 Million+ Individuals' Personal & Medical Data Exposed",
        "updateTitle": "Update: Conduent Data Breach: 10 Million+ Individuals' Personal & Medical Data Exposed",
        "updateSummary": "Conduent breach attributed to SafePay ransomware, impacting 10.5M individuals with 8.5TB data exfiltrated, incurring $25M in costs.",
        "categories": [
          "Data Breach",
          "Threat Intelligence",
          "Regulatory"
        ],
        "tags": [
          "Conduent",
          "Cybersecurity",
          "Data Breach",
          "Government Contractor",
          "Medical Data",
          "PHI",
          "PII",
          "Social Security Number"
        ],
        "severity": "high",
        "publishedAt": "2025-10-30T15:00:00.000Z",
        "updatedAt": "2025-10-31T12:00:00.000Z"
      },
      {
        "slug": "qilin-ransomware-surges-to-become-most-prolific-threat-of-2025",
        "originalHeadline": "Qilin Ransomware Claims 700 Victims in 2025, Becoming Top Global Threat",
        "updateTitle": "Update: Qilin Ransomware Claims 700 Victims in 2025, Becoming Top Global Threat",
        "updateSummary": "New Cisco Talos report details Qilin's use of Cyberduck for exfil, PsExec for lateral movement, and notepad.exe for evasion, with manufacturing as top target.",
        "categories": [
          "Ransomware",
          "Threat Actor",
          "Cyberattack"
        ],
        "tags": [
          "Agenda",
          "AnyDesk",
          "Double Extortion",
          "Qilin",
          "RaaS",
          "Ransomware",
          "Threat Actor"
        ],
        "malware": [
          "RansomHub"
        ],
        "severity": "high",
        "publishedAt": "2025-10-28T15:00:00.000Z",
        "updatedAt": "2025-10-31T00:00:00.000Z"
      },
      {
        "slug": "uk-ncsc-reports-nationally-significant-cyber-attacks-doubled",
        "originalHeadline": "UK's NCSC Warns 'Nationally Significant' Cyber Attacks Have More Than Doubled",
        "updateTitle": "Update: UK's NCSC Warns 'Nationally Significant' Cyber Attacks Have More Than Doubled",
        "updateSummary": "UK government proposes ransomware payment ban for public sector/CNI and mandatory incident reporting following NCSC's report.",
        "categories": [
          "Regulatory",
          "Policy and Compliance",
          "Ransomware"
        ],
        "tags": [
          "CNI",
          "Cyberattack",
          "NCSC",
          "Policy and Compliance",
          "Ransomware",
          "Threat Intelligence",
          "UK"
        ],
        "severity": "informational",
        "publishedAt": "2025-10-15T15:00:00.000Z",
        "updatedAt": "2025-10-30T00:00:00.000Z"
      }
    ]
  },
  "pages": {
    "updated": []
  }
}