{
  "lastUpdated": "2026-01-17T16:51:47.704Z",
  "runDate": "2026-01-17",
  "publications": [
    {
      "slug": "daily-threat-publications-2026-01-17",
      "type": "publication-daily",
      "headline": "Palo Alto Networks Patches Critical Firewall Flaw; Microsoft Dismantles RedVDS Cybercrime Service",
      "articleCount": 12,
      "articles": [
        {
          "slug": "acronis-launches-s3-compatible-archival-storage-for-msps",
          "headline": "Acronis Debuts S3-Compatible Archival Storage for MSPs with Predictable Pricing",
          "summary": "Acronis has launched Acronis Archival Storage, a new long-term, S3-compatible cold storage solution aimed at Managed Service Providers (MSPs) and their SMB clients. Powered by Seagate's Lyve Cloud, the service is integrated into the Acronis Cyber Protect Cloud platform and features a predictable pricing model with no egress or API fees. This addresses a key need for compliant, cost-effective data retention for large volumes of infrequently accessed data, offering WORM immutability and high durability.",
          "categories": [
            "Cloud Security",
            "Policy and Compliance",
            "Other"
          ],
          "tags": [
            "Acronis",
            "Archive",
            "Backup",
            "Compliance",
            "MSP",
            "S3",
            "Seagate",
            "Storage"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z"
        },
        {
          "slug": "armis-launches-new-select-partner-program-with-flexible-tier-free-model",
          "headline": "Armis Revamps Channel Strategy with Flexible, Tier-Free 'Select Partner Program'",
          "summary": "Armis, a leader in cyber exposure management, has launched its new Armis Select Partner Program. The revamped global channel initiative moves away from traditional, rigid tiers in favor of a flexible, three-route model: selling, delivering services, and building solutions. This approach allows partners to engage with Armis in a way that best suits their business model, aiming to accelerate the adoption of the Armis Centrix platform and build a more collaborative partner ecosystem.",
          "categories": [
            "Other"
          ],
          "tags": [
            "Armis",
            "Channel Program",
            "Cybersecurity Industry",
            "MSSP",
            "Partnership"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z"
        },
        {
          "slug": "asimily-enhances-cyber-asset-management-with-microsegmentation-for-cisco-ise",
          "headline": "Asimily Boosts Cisco ISE Integration with Enhanced Microsegmentation for IoT/OT Devices",
          "summary": "Asimily, a provider of cyber asset and exposure management, has launched enhanced microsegmentation capabilities, including new support for Security Group Access Control Lists (SGACL) in Cisco Identity Services Engine (ISE). This integration allows organizations to translate rich device context—such as risk, behavior, and classification—from the Asimily platform into dynamically enforced security policies in Cisco ISE. The goal is to automate the containment of threats across complex IT, IoT, and OT environments.",
          "categories": [
            "IoT Security",
            "Security Operations",
            "Industrial Control Systems"
          ],
          "tags": [
            "Asimily",
            "Cisco ISE",
            "IoMT",
            "IoT Security",
            "Microsegmentation",
            "Network Access Control",
            "OT Security"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z"
        },
        {
          "slug": "colortokens-xshield-platform-achieves-fedramp-moderate-authorization",
          "headline": "ColorTokens Xshield Platform Gains FedRAMP Moderate Authorization, Boosting Federal Zero Trust Adoption",
          "summary": "ColorTokens has achieved FedRAMP Moderate Authorization for its Xshield microsegmentation platform, a significant milestone that makes the solution readily available to U.S. federal agencies via the FedRAMP Marketplace. This authorization validates Xshield's security posture and enables government bodies to adopt the platform to accelerate their Zero Trust initiatives, particularly in preventing the lateral movement of cyberattacks across complex on-premise, cloud, and OT environments.",
          "categories": [
            "Policy and Compliance",
            "Cloud Security",
            "Security Operations"
          ],
          "tags": [
            "Cloud Security",
            "ColorTokens",
            "FedRAMP",
            "Microsegmentation",
            "Policy and Compliance",
            "Xshield",
            "Zero Trust"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z"
        },
        {
          "slug": "darktrace-appoints-terry-doyle-as-first-chief-information-officer",
          "headline": "Darktrace Hires Terry Doyle as First Chief Information Officer to Scale Enterprise IT",
          "summary": "AI cybersecurity leader Darktrace has appointed Terry Doyle as its first-ever Chief Information Officer (CIO). Doyle, a veteran technology executive with nearly 30 years of experience, will join the executive committee and be responsible for consolidating the company's enterprise IT and data functions. This strategic hire aims to build enterprise-scale systems and processes to support Darktrace's rapid global growth and enhance its operational discipline.",
          "categories": [
            "Other"
          ],
          "tags": [
            "CIO",
            "Cybersecurity Industry",
            "Darktrace",
            "Executive Move",
            "Leadership"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z"
        },
        {
          "slug": "infoblox-to-acquire-axur-to-bolster-external-threat-takedown-capabilities",
          "headline": "Infoblox to Acquire Axur, Expanding into AI-Powered External Threat Disruption",
          "summary": "Infoblox, a leader in DNS security and network services, has announced a definitive agreement to acquire Axur, a company specializing in AI-driven external threat detection and takedown. The acquisition will extend Infoblox's preemptive security offerings, enabling customers to combat threats like phishing, brand abuse, and credential theft that originate outside the corporate network. By integrating Axur's rapid takedown capabilities with its own DNS-level controls, Infoblox aims to significantly reduce the uptime of active cyberattacks.",
          "categories": [
            "Threat Intelligence",
            "Phishing",
            "Other"
          ],
          "tags": [
            "AI",
            "Acquisition",
            "Axur",
            "Brand Protection",
            "Infoblox",
            "M&A",
            "Phishing",
            "Threat Intelligence"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z"
        },
        {
          "slug": "jumpcloud-launches-ai-tools-for-identity-management-and-shadow-ai-governance",
          "headline": "JumpCloud Unveils AI-Powered Tools to Govern Shadow AI and Manage Autonomous Agents",
          "summary": "JumpCloud has introduced a suite of AI-powered capabilities for its identity and access management (IAM) platform, designed to help organizations manage the security risks of modern AI adoption. The new features focus on discovering and governing 'shadow AI'—the unsanctioned use of AI tools by employees—and applying Zero Trust principles to manage access for non-human autonomous agents. The goal is to provide IT and security teams with the visibility and control needed to turn a potential liability into a secure source of productivity.",
          "categories": [
            "Policy and Compliance",
            "Cloud Security",
            "Security Operations"
          ],
          "tags": [
            "AI",
            "Artificial Intelligence",
            "IAM",
            "Identity and Access Management",
            "JumpCloud",
            "Shadow AI",
            "Zero Trust"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z"
        },
        {
          "slug": "nsa-releases-foundational-guidelines-for-zero-trust-implementation",
          "headline": "NSA Kickstarts Zero Trust Adoption with New Foundational Implementation Guides",
          "summary": "The U.S. National Security Agency (NSA) has released the first two documents in its new Zero Trust Implementation Guidelines (ZIGs) series. The 'Primer' and 'Discovery Phase' guides are designed to provide federal agencies and other organizations with a foundational roadmap for adopting a Zero Trust security architecture. This initiative aligns with the Department of War's mandate for agencies to achieve specific Zero Trust targets and emphasizes the critical first step of gaining comprehensive visibility across all data, applications, assets, and services (DAAS).",
          "categories": [
            "Policy and Compliance",
            "Regulatory",
            "Security Operations"
          ],
          "tags": [
            "Compliance",
            "Cybersecurity Framework",
            "Department of War",
            "NSA",
            "Policy",
            "Regulatory",
            "Zero Trust"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z"
        },
        {
          "slug": "noction-irp-v4-3-introduces-automated-ddos-detection-and-mitigation",
          "headline": "Noction IRP v4.3 Launches with Automated DDoS Detection and Routing-Native Mitigation",
          "summary": "Noction has released version 4.3 of its Intelligent Routing Platform (IRP), introducing a major new feature called Automatic Anomaly Detection (AAD). This capability uses behavior-based traffic analysis to rapidly identify DDoS attacks and other network anomalies. Once an attack is detected, the platform can automatically trigger mitigation actions using routing-native mechanisms like BGP FlowSpec or Remote Triggered Blackholing (RTBH), enabling network operators to respond to threats in seconds without relying on external systems.",
          "categories": [
            "Cyberattack",
            "Security Operations",
            "Patch Management"
          ],
          "tags": [
            "BGP",
            "BGP FlowSpec",
            "DDoS",
            "Intelligent Routing Platform",
            "Network Security",
            "Noction",
            "RTBH"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z",
          "malware": [
            "DDoS"
          ]
        },
        {
          "slug": "spycloud-launches-supply-chain-threat-protection-solution-for-vendor-risk",
          "headline": "SpyCloud Unveils Supply Chain Threat Protection to Combat Third-Party Identity Risks",
          "summary": "SpyCloud has launched its Supply Chain Threat Protection solution, a new platform designed to give organizations visibility into identity-related compromises within their vendor and supplier ecosystems. By leveraging a massive repository of recaptured data from breaches and malware infections, the solution provides actionable intelligence on compromised credentials and infected devices affecting third parties. This allows security teams to move beyond static questionnaires and proactively address active threats within their supply chain.",
          "categories": [
            "Supply Chain Attack",
            "Threat Intelligence",
            "Security Operations"
          ],
          "tags": [
            "Credential Stuffing",
            "Dark Web",
            "Identity Threat",
            "SpyCloud",
            "Supply Chain Security",
            "TPRM",
            "Third-Party Risk Management"
          ],
          "severity": "informational",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z"
        },
        {
          "slug": "palo-alto-networks-patches-high-severity-dos-firewall-vulnerability-cve-2026-0227",
          "headline": "Palo Alto Networks Firewalls at Risk: High-Severity DoS Flaw Allows Remote Shutdown",
          "summary": "Palo Alto Networks has issued patches for a high-severity denial-of-service (DoS) vulnerability, CVE-2026-0227, affecting its PAN-OS software. The flaw, with a CVSS score of 7.7, allows an unauthenticated, remote attacker to crash firewalls with an enabled GlobalProtect portal or gateway by sending crafted network packets. Repeated exploitation can force the device into maintenance mode, halting traffic and disabling security protections until an administrator intervenes. With nearly 6,000 potentially vulnerable firewalls exposed online, immediate patching is critical.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Cyberattack"
          ],
          "tags": [
            "CVE-2026-0227",
            "Denial of Service",
            "DoS",
            "Firewall",
            "GlobalProtect",
            "PAN-OS",
            "Palo Alto Networks",
            "Patch Management",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z",
          "cves": [
            "CVE-2026-0227"
          ]
        },
        {
          "slug": "microsoft-and-law-enforcement-dismantle-redvds-cybercrime-as-a-service-platform",
          "headline": "RedVDS Takedown: Microsoft and Law Enforcement Disrupt $40M Cybercrime-as-a-Service Operation",
          "summary": "In a major international operation, Microsoft's Digital Crimes Unit, alongside law enforcement from the U.S., U.K., and Germany, has disrupted the RedVDS cybercrime-as-a-service (CaaS) platform. The service, operated by a group tracked as Storm-2470, provided criminals with cheap, disposable RDP servers used to launch large-scale phishing, BEC, and fraud campaigns. The operation, which took down key domains like redvds[.]com, has been linked to over $40 million in fraud losses in the U.S. and impacted more than 191,000 organizations globally.",
          "categories": [
            "Cyberattack",
            "Threat Actor",
            "Phishing"
          ],
          "tags": [
            "BEC",
            "CaaS",
            "Cybercrime-as-a-Service",
            "Microsoft",
            "Phishing",
            "RedVDS",
            "Storm-2470",
            "Takedown"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-17T15:00:00.000Z"
        }
      ]
    },
    {
      "slug": "daily-threat-publications-2026-01-16",
      "type": "publication-daily",
      "headline": "AWS CodeBreach Exposes Massive Supply Chain Risk; Ransomware Attacks Hit Record Highs in 2025",
      "articleCount": 12,
      "articles": [
        {
          "slug": "reprompt-attack-method-steals-data-from-microsoft-copilot",
          "headline": "New 'Reprompt' Attack Steals Data from Microsoft Copilot with a Single Click",
          "summary": "Security researchers at Varonis have discovered a novel attack technique called 'Reprompt' that allows attackers to silently steal sensitive data from a user's Microsoft Copilot Personal session. The attack, which has since been patched by Microsoft, required only a single click on a malicious link. By chaining together several techniques, including prompt injection via a URL parameter and bypassing security filters with a 'double request' trick, an attacker could take control of the AI assistant's session. This allowed them to issue hidden commands to summarize and exfiltrate data, such as conversation history and personal files, without the user's knowledge. The vulnerability did not affect the enterprise version of Copilot.",
          "categories": [
            "Vulnerability",
            "Phishing",
            "Cloud Security"
          ],
          "tags": [
            "AI Security",
            "Data Exfiltration",
            "Microsoft Copilot",
            "Prompt Injection",
            "Reprompt",
            "Varonis",
            "Vulnerability"
          ],
          "severity": "medium",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z"
        },
        {
          "slug": "industrial-control-systems-face-escalating-cyber-threats",
          "headline": "Attacks on Industrial Environments Doubled in 2025, Report Warns",
          "summary": "A new report from cybersecurity firm Cyble reveals a dramatic escalation in threats targeting industrial environments. According to its Annual Threat Landscape Report 2025, exploits against industrial technology (IT) and operational technology (OT) systems almost doubled last year. The report, published on January 15, 2026, documented nearly 6,000 ransomware attacks and identified numerous vulnerabilities in internet-exposed assets across critical infrastructure. Cyble predicts that in 2026, attackers will increasingly target exposed Human-Machine Interfaces (HMIs) and SCADA systems. This trend poses a significant risk to major global events, such as the 2026 Winter Olympics, where interconnected vendor systems create a rich target environment for disruption and extortion.",
          "categories": [
            "Industrial Control Systems",
            "Cyberattack",
            "Threat Intelligence"
          ],
          "tags": [
            "Critical Infrastructure",
            "Cyble",
            "HMI",
            "ICS",
            "OT Security",
            "Ransomware",
            "SCADA"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z"
        },
        {
          "slug": "china-linked-apt-targets-north-american-critical-infrastructure",
          "headline": "China-Linked APT 'UAT-8837' Targets North American Critical Infrastructure",
          "summary": "A new report from Cisco Talos has identified a China-nexus Advanced Persistent Threat (APT) group, tracked as UAT-8837, actively targeting critical infrastructure organizations in North America since at least 2025. The group gains initial access by exploiting public-facing vulnerabilities, including a zero-day in SiteCore products (CVE-2025-53690), and using compromised credentials. Once inside, UAT-8837 employs a variety of open-source tools, such as the Earthworm utility for creating reverse tunnels, to conduct reconnaissance, exfiltrate data, and maintain persistence. Cisco Talos assesses with medium confidence that the group is linked to China, highlighting the ongoing threat of state-sponsored espionage against vital sectors.",
          "categories": [
            "Threat Actor",
            "Cyberattack",
            "Industrial Control Systems"
          ],
          "tags": [
            "APT",
            "CVE-2025-53690",
            "China",
            "Cisco Talos",
            "Critical Infrastructure",
            "Earthworm",
            "UAT-8837"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z",
          "cves": [
            "CVE-2025-53690"
          ],
          "malware": [
            "Earthworm"
          ]
        },
        {
          "slug": "everest-ransomware-claims-major-breach-at-nissan",
          "headline": "Everest Ransomware Claims 900GB Data Theft from Automaker Nissan",
          "summary": "The Russia-linked Everest ransomware group has claimed a significant data breach against Japanese automotive giant Nissan Motor Corporation. On January 10, 2026, the group added Nissan to its dark web leak site, asserting they had exfiltrated approximately 900 gigabytes of sensitive internal files. To back their claims, Everest published screenshots showing folder structures related to marketing, sales, manufacturing designs, and financial records, primarily concerning Nissan's North American operations. This incident represents a classic double-extortion attack, where the threat actors aim to pressure the victim into paying a ransom to prevent the public release of stolen data. Nissan has not yet confirmed the breach, which follows several other recent cyberattacks against the company.",
          "categories": [
            "Ransomware",
            "Data Breach",
            "Cyberattack"
          ],
          "tags": [
            "Automotive",
            "Data Breach",
            "Double Extortion",
            "Everest",
            "Nissan",
            "Ransomware"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z"
        },
        {
          "slug": "glassworm-malware-targets-macos-developers-via-vs-code-extensions",
          "headline": "GlassWorm Malware Pivots to Attack macOS Developers via Malicious VS Code Extensions",
          "summary": "The GlassWorm malware campaign has evolved, now specifically targeting macOS developers through malicious extensions for Visual Studio Code and OpenVSX. This new wave of attacks, detailed in a security digest from Acronis, uses a self-propagating worm to deliver its payload. The malware embeds an encrypted payload within JavaScript files, uses a 15-minute execution delay to evade sandboxes, and establishes persistence using LaunchAgents. The primary goal of GlassWorm is to steal a wide range of developer-centric data, including credentials for GitHub and npm, browser data, and information from over 50 different cryptocurrency wallets, highlighting a significant supply chain threat.",
          "categories": [
            "Malware",
            "Supply Chain Attack",
            "Mobile Security"
          ],
          "tags": [
            "Developer",
            "GlassWorm",
            "Malware",
            "Supply Chain Attack",
            "Visual Studio Code",
            "macOS"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z",
          "malware": [
            "GlassWorm"
          ]
        },
        {
          "slug": "hawksec-group-claims-massive-data-breach-at-totalenergies",
          "headline": "Hacker Group 'HawkSec' Claims Breach of 184 Million TotalEnergies Records",
          "summary": "A hacking group calling itself 'HawkSec' has claimed a massive data breach against the French energy supermajor, TotalEnergies. In a post on a data leak forum, the group alleged the theft of a database containing nearly 184 million records, including sensitive customer information such as names, email addresses, phone numbers, and bank account details for French customers. To substantiate their claims, HawkSec posted sample data on social media. However, the full extent and legitimacy of the breach remain unverified. TotalEnergies has not yet confirmed the incident. The group's erratic behavior on forums has led some researchers to question their experience, though the potential impact if the claims are true is significant.",
          "categories": [
            "Data Breach",
            "Threat Actor"
          ],
          "tags": [
            "Data Breach",
            "Energy Sector",
            "GDPR",
            "HawkSec",
            "PII",
            "TotalEnergies"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z"
        },
        {
          "slug": "the-industrialization-of-npm-supply-chain-attacks",
          "headline": "NPM Supply Chain Attacks Evolve from Typosquatting to Industrialized Takeovers",
          "summary": "An analysis from CSO Online highlights a major strategic shift in software supply chain attacks targeting the npm ecosystem. Threat actors have moved beyond simple typosquatting to industrialized campaigns focused on compromising the accounts of legitimate package maintainers. These new attacks use phishing to steal developer credentials or access tokens, which are then used to publish malicious updates to widely-used, trusted packages. This makes the attacks far stealthier and more impactful. Campaigns are also becoming 'CI-aware,' designed to activate only within automated build environments to steal production secrets, marking a significant escalation in the threat to modern development pipelines.",
          "categories": [
            "Supply Chain Attack",
            "Threat Intelligence",
            "Security Operations"
          ],
          "tags": [
            "Account Takeover",
            "CI/CD Security",
            "DevSecOps",
            "Phishing",
            "Supply Chain Attack",
            "npm"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z",
          "malware": [
            "Shai-Hulud"
          ]
        },
        {
          "slug": "palo-alto-networks-patches-critical-pan-os-denial-of-service-flaw",
          "headline": "Palo Alto Networks Patches High-Severity DoS Flaw in PAN-OS Firewalls",
          "summary": "Palo Alto Networks has issued security updates to address a high-severity denial-of-service (DoS) vulnerability, CVE-2026-0227, in its PAN-OS software. The flaw, which has a CVSS score of 7.7, allows an unauthenticated, remote attacker to crash firewalls that have a GlobalProtect gateway or portal enabled. A successful exploit forces the device into maintenance mode, disrupting all network traffic. While Palo Alto Networks is not aware of active exploitation, a proof-of-concept (PoC) exploit reportedly exists. The vulnerability affects multiple versions of PAN-OS, and customers are urged to apply the patches as soon as possible, as there are no workarounds.",
          "categories": [
            "Vulnerability",
            "Patch Management",
            "Security Operations"
          ],
          "tags": [
            "CVE-2026-0227",
            "DoS",
            "GlobalProtect",
            "PAN-OS",
            "Palo Alto Networks",
            "Patch Management",
            "Vulnerability"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z",
          "cves": [
            "CVE-2024-3393",
            "CVE-2026-0227"
          ]
        },
        {
          "slug": "threat-reports-detail-record-breaking-ransomware-activity-in-2025",
          "headline": "Ransomware Attacks Skyrocket 58% in 2025, Setting New Records",
          "summary": "Multiple cybersecurity reports released in January 2026 confirm that 2025 was the most active year for ransomware on record. A report from GuidePoint Security's GRIT team documented a staggering 58% year-over-year increase in publicly claimed ransomware victims. December 2025 alone saw 814 attacks, the highest monthly total ever recorded. Despite law enforcement takedowns of major players like LockBit, the ransomware ecosystem proved resilient. Affiliates quickly migrated to other operations, with the Qilin and Akira ransomware groups emerging as the dominant forces, collectively responsible for a significant portion of all attacks. The United States remained the primary target, and the manufacturing sector was the most heavily impacted industry.",
          "categories": [
            "Ransomware",
            "Threat Intelligence",
            "Threat Actor"
          ],
          "tags": [
            "Akira",
            "GuidePoint Security",
            "LockBit",
            "Qilin",
            "RaaS",
            "Ransomware",
            "Symantec",
            "Threat Intelligence"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z"
        },
        {
          "slug": "voidlink-sophisticated-linux-malware-framework-for-cloud",
          "headline": "Researchers Uncover 'VoidLink,' a Sophisticated Linux Malware Built for Cloud Espionage",
          "summary": "Check Point researchers have discovered 'VoidLink,' a highly advanced and previously unknown malware framework for Linux. Attributed to Chinese developers, VoidLink is specifically designed for stealthy, long-term espionage in modern cloud environments, including AWS, GCP, Azure, and Kubernetes. Written in the Zig programming language, the malware is 'cloud-native,' capable of detecting its environment and tailoring its behavior. Its modular architecture, inspired by Cobalt Strike, supports over 37 plugins for reconnaissance, credential theft, and lateral movement. While no active infections have been found, VoidLink's focus on harvesting source code credentials suggests it is a tool being prepared for future supply chain attacks.",
          "categories": [
            "Malware",
            "Cloud Security",
            "Threat Actor"
          ],
          "tags": [
            "Check Point",
            "Cloud Security",
            "Espionage",
            "Kubernetes",
            "Linux",
            "Malware",
            "Supply Chain Attack",
            "VoidLink"
          ],
          "severity": "high",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z",
          "malware": [
            "Cobalt Strike",
            "VoidLink"
          ]
        },
        {
          "slug": "aws-codebuild-codebreach-supply-chain-vulnerability",
          "headline": "AWS Patches 'CodeBreach' Flaw, Averting Massive GitHub Supply Chain Attack",
          "summary": "Amazon Web Services (AWS) has remediated a critical vulnerability in its AWS CodeBuild service, dubbed 'CodeBreach' by Wiz researchers. The flaw, which stemmed from a misconfigured webhook filter, could have allowed unauthenticated attackers to inject malicious code into the build processes of major open-source projects, including the AWS JavaScript SDK. An exploit could have granted attackers administrative control over key GitHub repositories, creating a catastrophic supply chain risk for the millions of applications and cloud environments that depend on these libraries. The vulnerability was discovered following a separate, failed attack attempt, highlighting the real-world threat. AWS has since patched the issue and implemented global hardening measures.",
          "categories": [
            "Supply Chain Attack",
            "Cloud Security",
            "Vulnerability"
          ],
          "tags": [
            "AWS",
            "CI/CD Security",
            "CodeBreach",
            "CodeBuild",
            "GitHub",
            "Supply Chain Attack",
            "Vulnerability",
            "Wiz"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z"
        },
        {
          "slug": "modular-ds-wordpress-plugin-flaw-under-active-exploitation",
          "headline": "Critical Flaw in WordPress Plugin 'Modular DS' Actively Exploited for Admin Takeover",
          "summary": "A critical, unauthenticated privilege escalation vulnerability in the 'Modular DS' WordPress plugin is being actively exploited in the wild. The flaw, tracked as CVE-2026-23550 with a CVSS score of 10.0, affects over 40,000 websites. It allows attackers to bypass authentication and gain full administrator privileges by sending a specially crafted HTTP request. Security firm Patchstack, which discovered the exploitation, observed attackers creating rogue admin accounts named 'PoC Admin'. The vulnerability lies in the plugin's custom routing and login logic, which can be tricked into logging an unauthenticated user into an existing administrator account. The vendor released a patch in version 2.5.2, and all users are urged to update immediately.",
          "categories": [
            "Vulnerability",
            "Cyberattack",
            "Patch Management"
          ],
          "tags": [
            "Active Exploitation",
            "Authentication Bypass",
            "CVE-2026-23550",
            "Modular DS",
            "Patchstack",
            "Vulnerability",
            "WordPress"
          ],
          "severity": "critical",
          "isUpdate": false,
          "publishedAt": "2026-01-16T15:00:00.000Z",
          "cves": [
            "CVE-2026-23550"
          ]
        }
      ]
    }
  ],
  "articles": {
    "updated": []
  },
  "pages": {
    "updated": []
  }
}