[{"data":1,"prerenderedAt":199},["ShallowReactive",2],{"publication-daily-threat-publications-2026-01-19":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2026-01-19","Google Gemini Flaw Exposes Calendar Data; Black Basta Ransomware Leader on EU's Most Wanted","This cybersecurity advisory for January 19, 2026, covers a significant increase in sophisticated attacks. Key developments include a novel prompt injection vulnerability in Google Gemini allowing calendar data theft, an international manhunt for the leader of the Black Basta ransomware group, and a surge in cloud and supply chain attacks. Other critical stories include the discovery of Evelyn Stealer malware targeting developers via VS Code extensions, critical vulnerabilities in TP-Link cameras and various business software with public exploits, and a doubling of data breaches in the healthcare sector.","2026-01-19",12,[10,31,54,72,85,100,114,131,144,160,172,186],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":24,"createdAt":25,"updatedAt":26,"readingTime":27,"isUpdate":28,"updateSummary":29,"updateContent":30},"c8e0237e-487e-4c27-bccd-e8cb5a8a7898","2025-data-breaches-driven-by-misconfigurations-and-supply-chain-attacks","2025 in Review: Simple Errors, Not 0-Days, Caused Biggest Breaches","Year in Review: Cloud Misconfigurations and Supply Chain Failures Drove 2025's Biggest Data Breaches","informational","A year-end analysis of 2025's major data breaches reveals a recurring theme: fundamental security failures, not sophisticated zero-day exploits, were the primary cause. The report, published on December 26, 2025, highlights cloud security misconfigurations and third-party supply chain attacks as the dominant root causes. High-profile incidents at McDonald's (default password '123456'), TalentHook (public Azure Blob storage), Harrods, and TransUnion (both breached via third-party vendors) serve as stark examples of how neglecting basic security hygiene leads to massive data exposure.",[18,19,20,21,22,23],"Data Breach","Cloud Security","Misconfiguration","Supply Chain Attack","Default Password","2025 Review",[18,21,19],"2025-12-26T15:00:00.000Z","2026-01-19T00:00:00.000Z",4,true,"Cloud breaches surged 21% in 2025, costing $5.1M per incident, driven by credential compromise, misconfigurations, and insecure APIs.","New reports for 2025-2026 show cloud attacks increased 21% year-over-year, with 81% of organizations experiencing an incident. The average cost of a cloud breach reached $5.1 million. Primary attack vectors include credential compromise (over 50%), cloud misconfigurations (38%), and insecure APIs (31%). This analysis provides MITRE ATT&CK mapping for initial access (T1078, T1190), discovery (T1580), and exfiltration (T1530), reinforcing that basic security hygiene failures, not zero-days, are the main cause of these escalating incidents.",{"id":32,"slug":33,"headline":34,"title":35,"severity":36,"excerpt":37,"tags":38,"categories":47,"createdAt":49,"updatedAt":50,"readingTime":51,"isUpdate":28,"updateSummary":52,"updateContent":53},"350c730f-31ef-4a2f-b350-30944afdc1f4","threat-reports-detail-record-breaking-ransomware-activity-in-2025","Ransomware Attacks Skyrocket 58% in 2025, Setting New Records","New Threat Reports from GuidePoint and Symantec Reveal Record-Breaking Ransomware Activity in 2025","high","Multiple cybersecurity reports released in January 2026 confirm that 2025 was the most active year for ransomware on record. A report from GuidePoint Security's GRIT team documented a staggering 58% year-over-year increase in publicly claimed ransomware victims. December 2025 alone saw 814 attacks, the highest monthly total ever recorded. Despite law enforcement takedowns of major players like LockBit, the ransomware ecosystem proved resilient. Affiliates quickly migrated to other operations, with the Qilin and Akira ransomware groups emerging as the dominant forces, collectively responsible for a significant portion of all attacks. The United States remained the primary target, and the manufacturing sector was the most heavily impacted industry.",[39,40,41,42,43,44,45,46],"Ransomware","Threat Intelligence","GuidePoint Security","Symantec","Qilin","Akira","LockBit","RaaS",[39,40,48],"Threat Actor","2026-01-16T15:00:00.000Z","2026-01-19T12:00:00.000Z",7,"New report highlights a 93% surge in supply chain attacks in 2025, with ransomware groups leveraging them for mass deployment, significantly increasing the overall threat landscape.","A new report from Cyble reveals a critical development in the 2025 threat landscape: a 93% increase in supply chain attacks, with ransomware groups now responsible for over half of these incidents. This convergence allows attackers to compromise a single vendor to deploy ransomware to an entire customer base, bypassing individual defenses. The Qilin group was most prolific, and LockBit saw a resurgence. New technical details include targeting supplier update mechanisms (T1195.002) and mass payload deployment (T1072), leading to cascading financial losses and widespread disruption. Mitigation now emphasizes rigorous third-party risk management and application control.",{"id":55,"slug":56,"headline":57,"title":58,"severity":36,"excerpt":59,"tags":60,"categories":67,"createdAt":69,"updatedAt":69,"readingTime":70,"isUpdate":71},"1ff94068-3937-4d06-906f-f580d14c9c92","google-gemini-prompt-injection-flaw-exposes-private-calendar-data","Weaponized Invites: Google Gemini Flaw Allows Calendar Data Theft via Prompt Injection","Google Gemini Vulnerability Enabled Private Calendar Data Exfiltration Through Malicious Invites","Security researchers from Miggo Security have uncovered a significant vulnerability in Google Gemini's integration with Google Calendar. The flaw allowed attackers to use an indirect prompt injection technique to exfiltrate summaries of private meetings. By sending a specially crafted calendar invitation containing a hidden malicious prompt, an attacker could trick the AI into executing unauthorized actions when the user made a legitimate query about their calendar. This attack bypassed Google's privacy controls without requiring the user to interact directly with the malicious payload, highlighting emerging security risks in applications integrated with large language models (LLMs).",[61,62,63,64,65,66],"Prompt Injection","LLM Security","AI Security","Google Gemini","Google Calendar","Data Exfiltration",[68,19,18],"Vulnerability","2026-01-19T15:00:00.000Z",5,false,{"id":73,"slug":74,"headline":75,"title":76,"severity":36,"excerpt":77,"tags":78,"categories":84,"createdAt":69,"updatedAt":69,"readingTime":70,"isUpdate":71},"435f4d16-d531-45a8-aaca-672f73ba4dc0","evelyn-stealer-malware-targets-developers-via-malicious-vs-code-extensions","Evelyn Stealer: New Malware Hits Developers Through Malicious VS Code Extensions","Evelyn Stealer Malware Abuses Visual Studio Code Extensions to Target Developers","A new information-stealing malware, named Evelyn Stealer, is being distributed through malicious extensions on the Microsoft Visual Studio Code (VS Code) Marketplace. Researchers at Trend Micro and Koi Security report the campaign specifically targets software developers to steal credentials, cryptocurrency wallet data, and other sensitive information. Three malicious extensions—`BigBlack.bitcoin-black`, `BigBlack.codo-ai`, and `BigBlack.mrbigblacktheme`—have been identified as the distribution vectors. This supply chain attack highlights the significant risk posed by unvetted third-party tools in development environments, as compromising a single developer can provide a gateway into an entire organization's critical infrastructure.",[79,80,81,82,21,83],"Evelyn Stealer","InfoStealer","Malware","Visual Studio Code","Developer Security",[81,21,48],{"id":86,"slug":87,"headline":88,"title":89,"severity":90,"excerpt":91,"tags":92,"categories":99,"createdAt":69,"updatedAt":69,"readingTime":70,"isUpdate":71},"f78f012c-8048-426e-ad00-3450f5bb3d79","critical-vulnerability-in-tp-link-vigi-cameras-allows-remote-hacking","Patch Now: Critical Flaw Exposes Thousands of TP-Link VIGI Cameras to Remote Hacking","TP-Link Patches Critical Vulnerability in VIGI Security Cameras Exposing Devices to Remote Takeover","critical","TP-Link has issued urgent firmware updates for a critical vulnerability in its VIGI line of security cameras. The flaw could allow an unauthenticated remote attacker to gain unauthorized access to the devices, potentially viewing, modifying, or deleting surveillance footage. At the time of disclosure, researchers discovered over 2,500 VIGI cameras were exposed to the public internet and vulnerable to this attack. Owners are strongly advised to update their camera firmware immediately and ensure their devices are not directly accessible from the internet to mitigate the significant risk of compromise.",[93,94,95,68,96,97,98],"TP-Link","VIGI","IoT Security","Remote Hacking","Firmware","Patch Management",[68,95,98],{"id":101,"slug":102,"headline":103,"title":104,"severity":36,"excerpt":105,"tags":106,"categories":113,"createdAt":69,"updatedAt":69,"readingTime":70,"isUpdate":71},"11f3e2aa-b71f-4f41-8656-b082cf1741e4","raaga-pass-sport-breaches-added-to-have-i-been-pwned-16m-records","16.6 Million Records Exposed: Raaga and Pass'Sport Breaches Added to Have I Been Pwned","Have I Been Pwned Adds 16.6 Million Records from Raaga and Pass'Sport Data Breaches","The Have I Been Pwned (HIBP) data breach notification service has been updated with over 16.6 million user records from two separate incidents. The first breach involves 10.2 million users of the Indian music streaming service Raaga, which occurred in December 2025 and exposed names, email addresses, and MD5-hashed passwords. The second breach affects 6.4 million users of the French government's Pass'Sport program, also from December 2025, exposing names, dates of birth, and email addresses. Users of these services are urged to check HIBP and change their passwords, especially for the Raaga breach, due to the high risk of credential stuffing attacks from the weakly hashed passwords.",[18,107,108,109,110,111,112],"Have I Been Pwned","HIBP","Raaga","Pass'Sport","Credential Stuffing","MD5",[18],{"id":115,"slug":116,"headline":117,"title":118,"severity":36,"excerpt":119,"tags":120,"categories":128,"createdAt":69,"updatedAt":69,"readingTime":130,"isUpdate":71},"a2bdaa46-68b4-4351-8fee-474fe01c27f3","north-korean-apt-scarcruft-evolves-tactics-in-artemis-campaign","ScarCruft APT: North Korean Hackers Evolve Tactics in 'Artemis' Campaign","North Korean APT ScarCruft (APT37) Deploys New 'Artemis' Campaign with Evolved TTPs","The North Korean advanced persistent threat (APT) group ScarCruft, also known as APT37 or Reaper, has launched a new campaign dubbed 'Artemis'. Active since late 2025, the campaign targets entities likely in South Korea using malicious Hanword Word Processor (HWP) documents. Researchers report that ScarCruft has evolved its tactics, now employing steganography to hide malicious code within image files and leveraging legitimate cloud services, specifically Yandex Cloud, for its command and control (C2) infrastructure. This shift makes the group's activities harder to detect, as their C2 traffic blends in with legitimate cloud service activity.",[121,122,123,124,125,48,126,127],"ScarCruft","APT37","Reaper","North Korea","APT","Steganography","Yandex Cloud",[48,129,40],"Cyberattack",6,{"id":132,"slug":133,"headline":134,"title":135,"severity":36,"excerpt":136,"tags":137,"categories":143,"createdAt":69,"updatedAt":69,"readingTime":130,"isUpdate":71},"d4636084-d987-4ce3-9c60-6ecd65c50cb9","leader-of-black-basta-ransomware-on-eu-most-wanted-list","Manhunt: Black Basta Ransomware Leader Added to EU's Most Wanted List After Raids","International Arrest Warrant Issued for Black Basta Ransomware Founder; Suspects Raided in Ukraine","An international law enforcement operation has targeted the prolific Black Basta ransomware group, which is linked to over 600 attacks and millions in ransom payments. Police in Ukraine conducted raids against two suspected members of the syndicate. Concurrently, an international arrest warrant and an INTERPOL Red Notice have been issued for a Russian national believed to be the group's founder and leader. The individual has been placed on the EU's Most Wanted list, signaling a high-priority, coordinated effort to dismantle one of the world's most active ransomware operations.",[138,39,139,140,141,142,48],"Black Basta","Cybercrime","Law Enforcement","INTERPOL","EU Most Wanted",[39,48,129],{"id":145,"slug":146,"headline":147,"title":148,"severity":90,"excerpt":149,"tags":150,"categories":158,"createdAt":69,"updatedAt":69,"readingTime":130,"cves":159,"isUpdate":71},"8d59f76b-7fda-4c2f-a69e-feddfe53d026","critical-sql-injection-and-authorization-flaws-disclosed-with-public-exploits","Public Exploits Released for Critical SQLi and RCE Flaws in Business Software","Critical SQL Injection and Command Injection Vulnerabilities with Public Exploits Disclosed for Yonyou, Tosei, and MineAdmin Software","Multiple critical and high-severity vulnerabilities have been disclosed in various business software products, with proof-of-concept (PoC) exploits made public, elevating the risk of immediate attack. A critical SQL injection flaw (CVE-2026-1179) affects Yonyou KSOA 9.0. A critical command injection vulnerability (CVE-2026-1192) was found in Tosei Online Store Management System 1.01. Additionally, a high-severity improper authorization bug (CVE-2026-1193) impacts MineAdmin. Since vendors reportedly did not respond before disclosure, users of these products are urged to apply immediate mitigations to prevent compromise.",[68,151,152,153,154,155,156,157],"SQL Injection","Command Injection","RCE","Public Exploit","CVE-2026-1179","CVE-2026-1192","CVE-2026-1193",[68,129],[155,156,157],{"id":161,"slug":162,"headline":163,"title":164,"severity":36,"excerpt":165,"tags":166,"categories":170,"createdAt":69,"updatedAt":69,"readingTime":130,"isUpdate":71},"8190fd94-c70d-4e69-a976-16768fc81715","jordanian-access-broker-pleads-guilty-to-selling-network-access","Access Broker Pleads Guilty After Selling Access to 50 Companies to Undercover FBI Agent","Jordanian National Pleads Guilty in US Court to Operating as Initial Access Broker","A Jordanian national has pleaded guilty in a U.S. court for his role as an Initial Access Broker (IAB) in the cybercrime ecosystem. The man admitted to compromising and selling unauthorized access to the corporate networks of approximately 50 different enterprise organizations. The operation was uncovered when he unknowingly sold this access to an undercover U.S. federal agent. The case highlights the critical role IABs play in the cybercrime supply chain, providing the initial foothold for major threat actors like ransomware groups, and demonstrates the effectiveness of law enforcement sting operations in disrupting these criminal enterprises.",[167,168,139,169,39,48],"Initial Access Broker","IAB","FBI",[48,129,171],"Policy and Compliance",{"id":173,"slug":174,"headline":175,"title":176,"severity":36,"excerpt":177,"tags":178,"categories":185,"createdAt":69,"updatedAt":69,"readingTime":130,"isUpdate":71},"dafa6852-5028-4096-ac37-854b632d98f7","malicious-chrome-extensions-caught-hijacking-enterprise-user-sessions","Warning: Malicious Chrome Extensions Hijack Workday, NetSuite Sessions to Bypass MFA","Malicious Chrome Extensions Discovered Hijacking Enterprise User Sessions for Workday and NetSuite","Security researchers have uncovered five malicious Google Chrome extensions that impersonate legitimate add-ons for popular enterprise SaaS applications like Workday and NetSuite. The extensions are designed to perform session hijacking by stealing active session cookies and tokens after a user logs in. This technique allows attackers to completely bypass security controls, including multi-factor authentication (MFA), and gain full, authenticated access to the user's account. The stolen sessions can be used to exfiltrate sensitive corporate data, such as financial records and employee PII, highlighting the significant threat posed by unvetted browser extensions in corporate environments.",[179,180,81,181,182,183,184],"Session Hijacking","Chrome Extension","Workday","NetSuite","MFA Bypass","SaaS Security",[81,18,19],{"id":187,"slug":188,"headline":189,"title":190,"severity":36,"excerpt":191,"tags":192,"categories":198,"createdAt":69,"updatedAt":69,"readingTime":51,"isUpdate":71},"4644c7dc-384e-4955-8c41-0cdd8d427fed","healthcare-breaches-double-amid-shadow-ai-and-vendor-risk","Healthcare Data Breaches Double, Fueled by 'Shadow AI' and Vendor Risk","Healthcare Sector Sees Data Breaches Double as 'Shadow AI' and Third-Party Vendor Risks Proliferate","The healthcare industry is facing a cybersecurity crisis, with a new report indicating that the number of data breaches doubled in the past year. The surge is being driven by two key factors: the unmanaged use of generative AI tools by staff, termed 'shadow AI,' and persistent, unmitigated risks from third-party vendors. This dangerous trend is exemplified by the McLaren data breach, where a ransomware attack compromised the sensitive health information of over 743,000 patients. The report highlights a lack of confidence within the sector to handle these evolving threats, urging organizations to gain visibility into AI usage and implement far more stringent vendor risk management programs.",[193,18,39,194,195,196,197],"Healthcare","Shadow AI","Vendor Risk","Third-Party Risk","HIPAA",[18,39,171],1769006409139]