[{"data":1,"prerenderedAt":136},["ShallowReactive",2],{"publication-daily-threat-publications-2025-11-09":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-11-09","Clop Ransomware Breaches Washington Post; Critical Flaws Found in Docker, QNAP, and AI Models","This cybersecurity brief for November 9, 2025, covers a series of high-impact events. The Clop ransomware group has been confirmed as the perpetrator behind a major breach at The Washington Post, exploiting Oracle E-Business Suite vulnerabilities in a campaign affecting over 100 organizations. Concurrently, Microsoft revealed a novel 'Whisper Leak' side-channel attack capable of inferring AI chat topics from encrypted traffic. Critical vulnerabilities have also emerged, with the GlassWorm malware resurfacing in the VSCode marketplace, QNAP patching seven zero-days from Pwn2Own, and newly disclosed flaws in the runC container runtime threatening Docker and Kubernetes environments. These incidents highlight escalating threats across enterprise software, AI platforms, and cloud infrastructure.","2025-11-09",7,[10,34,54,72,89,105,121],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":24,"createdAt":28,"updatedAt":29,"readingTime":30,"isUpdate":31,"updateSummary":32,"updateContent":33},"186bb317-8286-4b73-a83c-33bc5fd4e320","76-percent-of-orgs-cant-match-speed-of-ai-powered-attacks","Over 75% of Orgs Can't Keep Pace with AI-Powered Attacks, Survey Finds","CrowdStrike Survey: 76% of Organizations Lag Behind AI-Driven Cyberattacks, Revealing Critical 'Confidence Illusion'","informational","A new survey from CrowdStrike reveals a stark reality: 76% of global organizations admit they cannot match the speed and sophistication of AI-powered cyberattacks. The 2025 State of Ransomware Survey highlights a dangerous 'confidence illusion,' where leaders believe they are prepared, yet 78% of their organizations were attacked in the past year. With adversaries using AI to accelerate attacks, 89% of security leaders now agree that AI-powered protection is essential to close the widening security gap and defend against modern threats.",[18,19,20,21,22,23],"AI","artificial intelligence","CrowdStrike","ransomware","threat landscape","cybersecurity survey",[25,26,27],"Threat Intelligence","Ransomware","Policy and Compliance","2025-10-22T15:00:00.000Z","2025-11-09T00:00:00.000Z",5,true,"Accenture report confirms widespread unpreparedness for AI-powered cyberattacks, with 90% of firms unready and 77% lacking AI security practices.","A new Accenture report, 'State of Cybersecurity Resilience 2025,' reinforces findings that organizations are critically unprepared for AI-driven cyber threats. Surveying over 2,200 executives, it found 90% of firms are not equipped, with 63% in an 'Exposed Zone' of reactive defenses. The report highlights that 77% lack mature security practices for AI models and data pipelines, creating significant business risk and urging a shift to security by design and robust AI governance. This complements previous findings on the widening gap between AI-powered attacks and organizational defense capabilities.",{"id":35,"slug":36,"headline":37,"title":38,"severity":39,"excerpt":40,"tags":41,"categories":49,"createdAt":28,"updatedAt":29,"readingTime":30,"isUpdate":31,"updateSummary":52,"updateContent":53},"f1c82939-249a-460a-a0a3-ac64a1ff4eb3","pwn2own-ireland-day-1-hackers-earn-522k-for-34-zero-days","Pwn2Own Day 1: Hackers Net $522K for 34 Zero-Days in SOHO Devices","Pwn2Own Ireland 2025 Day 1 Sees Researchers Earn $522,500 for 34 Zero-Days Across Printers, NAS, and Routers","high","The first day of Trend Micro's Pwn2Own Ireland 2025 competition was a resounding success for security researchers, who earned a total of $522,500 for demonstrating 34 unique zero-day vulnerabilities. In a stunning display, every single one of the 17 scheduled attempts against popular SOHO devices—including printers, NAS devices, and smart home products from brands like QNAP, Synology, Canon, and HP—was successful. The highlight was a complex 'SOHO Smashup' that chained eight bugs to compromise a router and a NAS device.",[42,43,44,45,46,47,48],"Pwn2Own","zero-day","vulnerability","hacking","IoT","SOHO","ZDI",[50,51,25],"Vulnerability","IoT Security","QNAP has released urgent patches for 7 zero-day vulnerabilities exploited at Pwn2Own Ireland 2025, including RCE flaws, affecting QTS and QuTS hero.","QNAP has issued critical security updates addressing seven zero-day vulnerabilities, including CVEs like CVE-2025-62847, that were demonstrated at Pwn2Own Ireland 2025. These flaws, ranging from buffer overflows to path traversals, allow unauthenticated remote code execution and full system takeover on QTS, QuTS hero, and applications like HBS 3 Hybrid Backup Sync. Users are urged to apply patches immediately as public disclosure increases exploitation risk. This update provides specific CVEs and affected software versions, detailing the remediation for a subset of the 34 zero-days initially reported.",{"id":55,"slug":56,"headline":57,"title":58,"severity":39,"excerpt":59,"tags":60,"categories":67,"createdAt":69,"updatedAt":69,"readingTime":70,"isUpdate":71},"bff50863-f8f0-4b0b-a731-84f7fd3ab456","washington-post-confirms-breach-in-massive-oracle-software-attack","Washington Post Breached by Clop Ransomware via Oracle Flaws","Washington Post Confirms Breach in Widespread Clop Ransomware Campaign Targeting Oracle E-Business Suite","The Washington Post has officially confirmed it was a victim of a large-scale cyberattack orchestrated by the Clop ransomware group. The threat actors exploited vulnerabilities in Oracle's E-Business Suite, compromising over 100 organizations globally. The campaign involves data exfiltration followed by aggressive extortion tactics, with Clop publicly naming victims on its dark web leak site to pressure them into paying ransoms reportedly as high as $50 million. This incident underscores the significant risk posed by vulnerabilities in widely used enterprise software and the sophisticated, multi-faceted extortion methods employed by modern ransomware gangs.",[61,26,62,63,64,65,66],"Clop","Oracle","E-Business Suite","Data Breach","Extortion","TA505",[26,64,68],"Cyberattack","2025-11-09T15:00:00.000Z",6,false,{"id":73,"slug":74,"headline":75,"title":76,"severity":77,"excerpt":78,"tags":79,"categories":87,"createdAt":69,"updatedAt":69,"readingTime":30,"isUpdate":71},"9dff68da-1c23-4b49-a615-0a864ef40fd5","microsoft-reveals-whisper-leak-attack-infers-ai-chat-topics-from-encrypted-traffic","Microsoft 'Whisper Leak' Attack Can Spy on Encrypted AI Chats","Microsoft Unveils 'Whisper Leak' Side-Channel Attack Capable of Identifying AI Chat Topics in Encrypted Traffic","medium","Microsoft researchers have discovered a novel side-channel attack method named 'Whisper Leak' that undermines the privacy of encrypted AI chatbot conversations. By analyzing the size and timing of encrypted data packets from streaming Large Language Models (LLMs), a passive network observer can accurately infer the topic of a conversation. The proof-of-concept attack achieved over 98% accuracy against models from OpenAI, Mistral, xAI, and DeepSeek. While major AI providers have already implemented mitigations following a responsible disclosure, the finding exposes a fundamental privacy risk in the architecture of streaming LLMs, particularly for users in sensitive sectors like law and healthcare.",[80,81,82,83,84,85,86],"Side-Channel Attack","Whisper Leak","AI Security","LLM","Privacy","Encryption","Microsoft",[50,25,88],"Cloud Security",{"id":90,"slug":91,"headline":92,"title":93,"severity":39,"excerpt":94,"tags":95,"categories":102,"createdAt":69,"updatedAt":69,"readingTime":30,"isUpdate":71},"4b24da54-8f91-4786-b940-b6fa9a9a1274","security-risk-found-in-chinese-made-electric-buses-across-europe-australia","Chinese-Made Electric Buses in Europe & Australia Pose Remote Shutdown Risk","Cybersecurity Tests in Norway Reveal Chinese-Made Yutong Electric Buses Can Be Remotely Disabled","Cybersecurity tests conducted in Norway on November 7, 2025, have uncovered a significant security risk in Chinese-manufactured Yutong electric buses, which are widely used across Europe and Australia. The 'Lion Cage' experiment demonstrated that the buses' connected systems could theoretically be accessed and disabled remotely by the manufacturer. The findings have triggered urgent security reviews by public transit authorities in multiple countries, highlighting the growing national security concerns surrounding internet-connected critical infrastructure and potential vulnerabilities in international supply chains.",[96,97,98,99,100,101],"ICS","Critical Infrastructure","Transportation","Yutong","Supply Chain Security","National Security",[103,68,104],"Industrial Control Systems","Supply Chain Attack",{"id":106,"slug":107,"headline":108,"title":109,"severity":15,"excerpt":110,"tags":111,"categories":117,"createdAt":69,"updatedAt":69,"readingTime":120,"isUpdate":71},"456ea328-86fd-4b50-988e-dd6c1c1a8aa0","philippines-lawmakers-propose-dedicated-national-cybersecurity-fund","Philippines Lawmakers Push for National Cybersecurity Fund","Lawmakers in Philippines Propose Dedicated National Cybersecurity Risk Management and Mitigation Fund","In the Philippines, Representatives Migz and Luigi Villafuerte have introduced a proposal to create a 'Cybersecurity Risk Management and Mitigation Fund' (CRMMF). This dedicated national fund would provide the government with the necessary resources to prevent and respond to cyberattacks against both public and private sector entities. The proposal comes after recent DDoS attack attempts on local banks and designates 30% of the fund for rapid restoration of critical information infrastructure, signaling a strong political push to enhance the nation's cyber resilience.",[112,113,114,115,97,116],"Philippines","Policy","Government","Cybersecurity Fund","DDoS",[27,118,119],"Regulatory","Incident Response",4,{"id":122,"slug":123,"headline":124,"title":125,"severity":126,"excerpt":127,"tags":128,"categories":134,"createdAt":69,"updatedAt":69,"readingTime":30,"isUpdate":71},"51bf1ec2-fdc9-433e-a54d-f851da2310b6","critical-flaws-in-runc-container-runtime-threaten-docker-kubernetes","Critical Container Escape Flaws in runC Threaten Docker & Kubernetes","Critical Vulnerabilities Disclosed in runC Container Runtime, Posing Container Escape Risk to Docker and Kubernetes Environments","critical","A security alert issued on November 9, 2025, warns of three new critical vulnerabilities in runC, the low-level container runtime used by Docker, Kubernetes, and other major container platforms. The flaws could allow a malicious actor to execute a 'container escape,' breaking out of the isolated container environment to gain unauthorized access to the underlying host operating system. A successful container escape is a worst-case scenario in cloud-native security, as it would allow an attacker to compromise all other containers on the host. Administrators of all containerized environments are urged to monitor for and apply patches immediately.",[129,130,131,132,50,88,133],"runC","Docker","Kubernetes","Container Escape","Zero-Day",[50,88,135],"Patch Management",1766088085852]