{
  "pub_id": "pub-2025-12-29",
  "headline": "CISA Warns of Actively Exploited 'MongoBleed' Flaw; Supply Chain Attacks Double in 2025 Amid Holiday Ransomware Surge",
  "summary": "This cybersecurity brief for December 28-29, 2025, covers several critical developments. CISA has issued an urgent warning about the 'MongoBleed' (CVE-2025-14847) vulnerability in MongoDB, now under active exploitation. Supply chain attacks continue to escalate, with Korean Air suffering a breach via a subsidiary, attributed to the Clop ransomware group exploiting an Oracle zero-day. A year-end report confirms that software supply chain attacks more than doubled in 2025. Ransomware groups, including Qilin and Medusa, capitalized on the holiday period to launch a wave of attacks, while malicious Chrome extensions were found to have stolen AI chat data from nearly a million users. Finally, Microsoft and Adobe released their last patches of the year, fixing over 190 vulnerabilities, including an actively exploited Windows zero-day.",
  "pub_date": "2025-12-29",
  "total_articles": 7,
  "articles": [
    {
      "id": "9d2f19c4-5c5e-4e40-8d57-8d21214e532f",
      "slug": "qilin-ransomware-group-claims-b-dynamic-as-new-victim",
      "headline": "Qilin Ransomware Gang Adds Business Services Firm B Dynamic to Leak Site",
      "title": "Qilin Ransomware Group Claims B Dynamic as New Victim in Ongoing Double-Extortion Campaign",
      "severity": "high",
      "excerpt": "The Qilin ransomware group, a prominent ransomware-as-a-service (RaaS) operation, has listed business services company 'B Dynamic' as its latest victim on its dark web data leak site. The December 1, 2025, posting indicates that the company has suffered a network compromise and data exfiltration. By publicizing the breach, the Qilin group is employing its standard double-extortion tactic to pressure the victim into paying a ransom to prevent the public release of stolen data. This incident highlights the persistent threat from established ransomware gangs.",
      "tags": [
        "Ransomware",
        "Qilin",
        "RaaS",
        "Double Extortion",
        "Dark Web"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2025-12-01T15:00:00.000Z",
      "updatedAt": "2025-12-29T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "Qilin ransomware group launched a post-holiday barrage, claiming over 15 new victims, including critical infrastructure, contributing to a record-breaking year for ransomware.",
      "updateContent": "The Qilin ransomware group, previously noted for targeting B Dynamic, has significantly escalated its activity. A post-holiday surge between December 26-28, 2025, saw Qilin and other gangs claim over 15 new victims, including the Canadian software company Questica and the major Thai petroleum refiner Bangchak Corporation. This highlights cybercriminals exploiting reduced holiday staffing and the group's willingness to target critical infrastructure. The overall ransomware landscape for 2025 has seen nearly 8,000 victims, a 50% increase, with Qilin being a primary driver of this record-breaking year."
    },
    {
      "id": "23c1a23d-7e0e-4294-8b25-e93eefd65b50",
      "slug": "barts-health-nhs-trust-hit-by-clop-ransomware-via-oracle-zero-day",
      "headline": "Clop Ransomware Breaches Barts Health NHS Trust via Oracle Zero-Day",
      "title": "Clop Ransomware Exploits Oracle E-Business Suite Zero-Day to Steal Patient and Staff Data from Barts Health NHS Trust",
      "severity": "high",
      "excerpt": "The Clop ransomware gang has claimed responsibility for a significant data breach at Barts Health NHS Trust, one of England's largest healthcare providers. The attack, which occurred in August 2025, leveraged a zero-day vulnerability in Oracle E-Business Suite. The threat actors exfiltrated files from an invoice database containing the names and addresses of patients and former staff. This data was later published on Clop's dark web leak site. While core clinical systems were reportedly unaffected, the compromised information poses a serious risk for follow-on social engineering and fraud attacks. The incident is part of a wider campaign by Clop targeting the now-patched Oracle vulnerability.",
      "tags": [
        "Zero-Day",
        "Oracle",
        "NHS",
        "Dark Web",
        "Data Leak",
        "Double Extortion"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Vulnerability"
      ],
      "createdAt": "2025-12-07T15:00:00.000Z",
      "updatedAt": "2025-12-29T00:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "Clop ransomware campaign exploiting Oracle E-Business Suite zero-day (CVE-2025-61882) now impacts Korean Air, compromising 30,000 employee records.",
      "updateContent": "The ongoing Clop ransomware campaign, which exploits a critical zero-day vulnerability in Oracle E-Business Suite, has claimed another victim: Korean Air. The airline announced on December 29, 2025, that a supply chain attack targeting its former subsidiary, KC&D Service, led to the compromise of approximately 30,000 employee records, including names and bank account numbers. The vulnerability has been identified as CVE-2025-61882, an unauthenticated remote code execution flaw with a CVSS score of 9.8 in the BI Publisher Integration component. This incident confirms the widespread nature of Clop's campaign, which is specifically targeting the aviation industry's supply chain, as evidenced by a similar attack on Asiana Airlines."
    },
    {
      "id": "0b685792-9bfc-4799-8592-a376533175a5",
      "slug": "malicious-chrome-extensions-steal-ai-chat-data-from-900k-users",
      "headline": "900,000+ Users Compromised: Malicious Chrome Extensions Steal ChatGPT & DeepSeek Conversations",
      "title": "Malicious Chrome Extensions Impersonating AI Tools Steal AI Chat Histories and Browsing Data from Over 900,000 Users",
      "severity": "high",
      "excerpt": "A significant data theft campaign has been uncovered involving two malicious Google Chrome extensions that were installed by over 900,000 users. The extensions, which impersonated legitimate AI productivity tools, were designed to secretly capture and exfiltrate entire conversation histories from AI platforms like ChatGPT and DeepSeek. In addition to stealing potentially sensitive AI chat data, the malware also monitored all user browsing activity, sending the harvested information to an attacker-controlled command-and-control server at `deepaichats[.]com`. One of the extensions had even received a 'Featured' badge from Google, highlighting the challenge of policing browser extension marketplaces.",
      "tags": [
        "Chrome Extension",
        "Malware",
        "Data Theft",
        "ChatGPT",
        "DeepSeek",
        "AI",
        "Browser Hijacking"
      ],
      "categories": [
        "Malware",
        "Data Breach",
        "Phishing"
      ],
      "createdAt": "2025-12-29T15:00:00.000Z",
      "updatedAt": "2025-12-29T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "f8f06e5f-c3dc-4281-b716-f40d6b2f3a0c",
      "slug": "devman-ransomware-group-claims-attack-on-us-financial-firm-sharinc",
      "headline": "DevMan Ransomware Group Claims Attack on U.S. Financial Firm Sharinc Inc.",
      "title": "DevMan Ransomware Group Targets U.S. Financial Sector, Claims Attack on Sharinc Inc.",
      "severity": "high",
      "excerpt": "The DevMan ransomware group has claimed responsibility for a cyberattack against Sharinc Inc., a U.S.-based financial organization. The claim was made on December 28, 2025, on the group's data leak site. The attackers have threatened to publish sensitive financial and customer data if their extortion demands are not met. This incident underscores the persistent and targeted threat that ransomware gangs pose to the financial services industry, which remains a high-value target due to the sensitive nature of the data it handles.",
      "tags": [
        "DevMan",
        "Ransomware",
        "Financial Services",
        "Data Leak",
        "Cyber Extortion",
        "Double Extortion"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Threat Actor"
      ],
      "createdAt": "2025-12-29T15:00:00.000Z",
      "updatedAt": "2025-12-29T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "63a298f2-f644-4417-a724-b50284579b65",
      "slug": "software-supply-chain-attacks-doubled-in-2025-losses-hit-60-billion",
      "headline": "Software Supply Chain Attacks Doubled in 2025, Report Finds",
      "title": "Software Supply Chain Attacks Hit Record Levels in 2025, Exposing Gaps in Enterprise Readiness",
      "severity": "medium",
      "excerpt": "A year-end security analysis published on December 29, 2025, reveals that software supply chain attacks more than doubled globally in 2025, with associated losses projected to reach $60 billion. The report, from CleanStart, indicates that this has become a systemic risk, with over 70% of organizations experiencing a related security incident. Despite the surge, the report finds that enterprise readiness to combat these threats remains critically low, with most organizations unable to quickly identify compromised components within their software.",
      "tags": [
        "Supply Chain",
        "DevSecOps",
        "SBOM",
        "CI/CD",
        "Open Source Security",
        "Systemic Risk"
      ],
      "categories": [
        "Supply Chain Attack",
        "Policy and Compliance",
        "Threat Intelligence"
      ],
      "createdAt": "2025-12-29T15:00:00.000Z",
      "updatedAt": "2025-12-29T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "8148a2c0-0f4a-4d58-abce-d726e9a05637",
      "slug": "microsoft-adobe-december-2025-patches-fix-190-vulnerabilities-zero-day",
      "headline": "Microsoft and Adobe Release December Patches for Over 190 Vulnerabilities",
      "title": "Microsoft and Adobe Patch Over 190 CVEs in Final 2025 Update, Including Actively Exploited Windows Zero-Day",
      "severity": "critical",
      "excerpt": "In their final security updates for 2025, Microsoft and Adobe addressed a combined total of over 190 vulnerabilities on December 28. Microsoft's Patch Tuesday release fixed 56 flaws, including a critical zero-day privilege escalation vulnerability (CVE-2025-62221) in the Windows Cloud Files Mini Filter Driver that is being actively exploited. Adobe's release was even more extensive, remediating 139 CVEs across a range of products, including Adobe Reader and Experience Manager. Administrators are urged to apply these critical updates promptly to mitigate risks.",
      "tags": [
        "Patch Tuesday",
        "Zero-Day",
        "Microsoft",
        "Adobe",
        "Vulnerability",
        "Privilege Escalation"
      ],
      "categories": [
        "Patch Management",
        "Vulnerability"
      ],
      "createdAt": "2025-12-29T15:00:00.000Z",
      "updatedAt": "2025-12-29T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-62221",
        "CVE-2025-62554",
        "CVE-2025-62562",
        "CVE-2025-64671"
      ],
      "isUpdate": false
    },
    {
      "id": "715fd720-1cdd-4f37-aadf-eb98f87de81a",
      "slug": "critical-xss-flaw-cve-2025-68876-in-wordpress-plugin-invelity-sps-connect",
      "headline": "Critical XSS Flaw in WordPress Plugin 'Invelity SPS connect' Disclosed",
      "title": "Unpatched Reflected XSS Vulnerability (CVE-2025-68876) Disclosed in 'Invelity SPS connect' WordPress Plugin",
      "severity": "medium",
      "excerpt": "A reflected cross-site scripting (XSS) vulnerability, tracked as CVE-2025-68876, was disclosed on December 28, 2025, affecting the 'Invelity SPS connect' WordPress plugin. The flaw, which has a CVSS score of 7.1, can be exploited by unauthenticated attackers and impacts all versions up to and including 1.0.8. At the time of disclosure, no patch was available. An attacker could trick a user into clicking a malicious link to execute arbitrary JavaScript in their browser, potentially leading to session hijacking. Administrators are advised to disable the plugin immediately.",
      "tags": [
        "WordPress",
        "XSS",
        "Vulnerability",
        "Plugin",
        "Unpatched",
        "Web Security"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2025-12-29T15:00:00.000Z",
      "updatedAt": "2025-12-29T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-68876"
      ],
      "cvssScore": 7.1,
      "isUpdate": false
    }
  ]
}