{
  "pub_id": "pub-2025-11-19",
  "headline": "Google Patches Actively Exploited Chrome Zero-Day as Ransomware Cripples PA Attorney General's Office",
  "summary": "This cybersecurity brief for November 19, 2025, covers a critical period marked by urgent zero-day patching and high-stakes ransomware attacks. Google rushed to fix the seventh actively exploited Chrome zero-day of the year (CVE-2025-13223), a type confusion bug in the V8 engine. Concurrently, the Pennsylvania Attorney General's office confirmed a major data breach by the Inc Ransom group, who exploited a Citrix vulnerability to exfiltrate 5.7 TB of sensitive data. Other significant events include CISA adding a Fortinet FortiWeb flaw to its KEV catalog, international sanctions against a Russian bulletproof hosting network, and multiple data breaches affecting DoorDash and healthcare providers due to phishing and supply chain weaknesses.",
  "pub_date": "2025-11-19",
  "total_articles": 8,
  "articles": [
    {
      "id": "ae3095a7-234a-43d1-9a93-4a8a375dc1d0",
      "slug": "pennsylvania-attorney-general-confirms-major-data-breach-by-inc-ransomware",
      "headline": "Inc Ransom Cripples PA Attorney General's Office, Exfiltrates 5.7 TB of Data",
      "title": "Pennsylvania Attorney General Confirms Massive Data Breach Following Inc Ransomware Attack",
      "severity": "high",
      "excerpt": "The Pennsylvania Office of the Attorney General (OAG) has confirmed it suffered a severe data breach orchestrated by the Inc Ransom ransomware group. The attackers exploited the 'CitrixBleed2' vulnerability (CVE-2025-5777) to gain initial access and subsequently exfiltrated 5.7 terabytes of highly sensitive data. The stolen information includes Social Security numbers, medical details, and confidential investigative files. The attack, which occurred in August 2025, caused a three-week operational disruption for the agency's 1,200 staff members. The OAG has refused to pay the ransom and is working with the FBI on the investigation.",
      "tags": [
        "Inc Ransom",
        "Ransomware",
        "Data Breach",
        "CVE-2025-5777",
        "CitrixBleed2",
        "Government",
        "Pennsylvania"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Vulnerability"
      ],
      "createdAt": "2025-11-19T15:00:00.000Z",
      "updatedAt": "2025-11-19T15:00:00.000Z",
      "readingTime": 7,
      "cves": [
        "CVE-2025-5777"
      ],
      "isUpdate": false
    },
    {
      "id": "57d60dd0-0ada-4bc1-95e5-c1bb5b8467fc",
      "slug": "us-uk-australia-sanction-russian-bulletproof-hosting-network-media-land",
      "headline": "US, UK, and Australia Sanction Russian Bulletproof Hosting Network Aiding Ransomware",
      "title": "US, UK, and Australia Impose Joint Sanctions on Russian Bulletproof Hosting Provider Media Land, LLC",
      "severity": "medium",
      "excerpt": "In a coordinated action, the United States, United Kingdom, and Australia have sanctioned Media Land, LLC, a Russian bulletproof hosting provider, along with its network of related entities and key individuals. This infrastructure is accused of providing essential services to a wide range of global cybercriminals, including malware distributors, phishing operators, and ransomware groups like the notorious LockBit gang. The sanctions aim to disrupt the foundational services that enable cybercrime by targeting the providers who knowingly support malicious operations. The action highlights a strategic international effort to dismantle the cybercrime economy.",
      "tags": [
        "Sanctions",
        "OFAC",
        "Bulletproof Hosting",
        "Cybercrime",
        "Russia",
        "LockBit",
        "Threat Actor"
      ],
      "categories": [
        "Policy and Compliance",
        "Threat Actor",
        "Regulatory"
      ],
      "createdAt": "2025-11-19T15:00:00.000Z",
      "updatedAt": "2025-11-19T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "7e3de89c-1db7-4f0a-b7b7-c54855fe1f6a",
      "slug": "cisa-adds-exploited-fortinet-fortiweb-flaw-cve-2025-58034-to-kev-catalog",
      "headline": "CISA Adds Actively Exploited Fortinet FortiWeb Flaw to KEV Catalog",
      "title": "CISA Adds Fortinet FortiWeb Command Injection Vulnerability (CVE-2025-58034) to KEV Catalog",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical OS command injection vulnerability in Fortinet's FortiWeb products, CVE-2025-58034, to its Known Exploited Vulnerabilities (KEV) catalog. Citing evidence of active exploitation, CISA has mandated a one-week remediation deadline for Federal Civilian Executive Branch (FCEB) agencies under Binding Operational Directive (BOD) 22-01. The vulnerability allows attackers to execute arbitrary commands on affected devices. CISA strongly urges all organizations using FortiWeb to prioritize patching this flaw to mitigate the threat.",
      "tags": [
        "CISA",
        "KEV",
        "Fortinet",
        "FortiWeb",
        "CVE-2025-58034",
        "Command Injection",
        "Vulnerability"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2025-11-19T15:00:00.000Z",
      "updatedAt": "2025-11-19T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-58034"
      ],
      "isUpdate": false
    },
    {
      "id": "391ee612-4796-4770-bd9f-7769b8554934",
      "slug": "st-anthony-hospital-discloses-data-breach-affecting-6600-individuals",
      "headline": "Chicago's St. Anthony Hospital Discloses Data Breach Affecting Over 6,600",
      "title": "St. Anthony Hospital Announces Data Breach Exposing PII and PHI of Over 6,600 Individuals",
      "severity": "medium",
      "excerpt": "St. Anthony Hospital in Chicago has reported a data breach that may have exposed the personal and medical information of more than 6,600 patients and staff members. The incident, which was discovered in February 2025, occurred when an unauthorized party gained access to several employee email accounts. An investigation revealed that the compromised accounts contained sensitive data, including names, Social Security numbers, medical record numbers, and medical histories. The hospital states there is no evidence the data has been misused but is in the process of notifying all affected individuals.",
      "tags": [
        "Data Breach",
        "Healthcare",
        "St. Anthony Hospital",
        "Phishing",
        "PII",
        "PHI",
        "HIPAA"
      ],
      "categories": [
        "Data Breach",
        "Phishing",
        "Industrial Control Systems"
      ],
      "createdAt": "2025-11-19T15:00:00.000Z",
      "updatedAt": "2025-11-19T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "d13011e3-d543-4b01-bbd2-5d5c9535699a",
      "slug": "darktrace-report-supply-chain-attacks-and-ai-phishing-escalate-in-apj",
      "headline": "Supply Chain Attacks & AI-Powered Phishing Surge Across Asia-Pacific, Darktrace Warns",
      "title": "Darktrace Report Reveals Escalation of Supply Chain Attacks, Cloud Intrusions, and AI-Enhanced Phishing in APJ Region",
      "severity": "informational",
      "excerpt": "A new threat report from cybersecurity firm Darktrace highlights a dramatic increase in sophisticated cyber threats across the Asia-Pacific and Japan (APJ) region. The report, covering the 12 months to July 2025, details a surge in supply chain attacks, business email compromise, and cloud intrusions. State-sponsored groups from China (APT40, APT41) and North Korea (Lazarus/Bluenoroff) are reportedly leveraging generative AI to create more convincing phishing emails, particularly in non-English languages like Japanese. The report also notes the high cost of supply chain breaches and the use of advanced voice-phishing by groups like Scattered Spider.",
      "tags": [
        "Threat Intelligence",
        "Darktrace",
        "APT",
        "Supply Chain Attack",
        "Phishing",
        "Generative AI",
        "APJ"
      ],
      "categories": [
        "Threat Intelligence",
        "Supply Chain Attack",
        "Phishing"
      ],
      "createdAt": "2025-11-19T15:00:00.000Z",
      "updatedAt": "2025-11-19T15:00:00.000Z",
      "readingTime": 7,
      "isUpdate": false
    },
    {
      "id": "c24557cc-3449-4683-9cd6-8a7d18c9eb7d",
      "slug": "china-aligned-apt-plushdaemon-deploys-edgestepper-network-implant",
      "headline": "China-Aligned APT 'PlushDaemon' Wields 'EdgeStepper' Implant for Network Hijacking",
      "title": "PlushDaemon: China-Aligned APT Deploys 'EdgeStepper' Network Implant for Adversary-in-the-Middle Attacks",
      "severity": "high",
      "excerpt": "Security researchers have uncovered a new, sophisticated network implant named 'EdgeStepper' used by the China-aligned APT group PlushDaemon. The implant provides the attackers with adversary-in-the-middle (AitM) capabilities, allowing them to intercept and hijack legitimate software updates within a compromised network. EdgeStepper is deployed as part of a larger toolset that includes 'LittleDaemon' and 'DaemonicLogistics' to deliver a Windows implant called 'SlowStepper'. This framework enables the APT group to conduct espionage and deploy additional malware by masquerading as legitimate update traffic.",
      "tags": [
        "PlushDaemon",
        "EdgeStepper",
        "APT",
        "China",
        "Malware",
        "Adversary-in-the-Middle",
        "AitM"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Supply Chain Attack"
      ],
      "createdAt": "2025-11-19T15:00:00.000Z",
      "updatedAt": "2025-11-19T15:00:00.000Z",
      "readingTime": 7,
      "isUpdate": false
    },
    {
      "id": "ce2695ba-a22b-41a9-aba9-51908326f90c",
      "slug": "togo-and-mozambique-sign-cybersecurity-pact-to-bolster-african-digital-defense",
      "headline": "Togo and Mozambique Forge Cybersecurity Pact to Strengthen African Defenses",
      "title": "Togo and Mozambique Sign MoU to Enhance Cybersecurity Cooperation and Threat Intelligence Sharing",
      "severity": "informational",
      "excerpt": "The nations of Togo and Mozambique have signed a Memorandum of Understanding (MoU) to formalize their cooperation on cybersecurity. The agreement, signed during the inaugural International Cybersecurity Week in Mozambique, establishes a framework for their national Computer Security Incident Response Teams (CSIRTs) to collaborate. The partnership will focus on sharing real-time threat intelligence, conducting joint capacity-building exercises, and coordinating operational responses to cyber incidents, aiming to bolster the digital resilience of both nations and the wider African continent.",
      "tags": [
        "Policy",
        "Cybersecurity Cooperation",
        "Africa",
        "Togo",
        "Mozambique",
        "CSIRT"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Threat Intelligence"
      ],
      "createdAt": "2025-11-19T15:00:00.000Z",
      "updatedAt": "2025-11-19T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "7c1f463c-8990-46a1-9912-c9b252c5b24f",
      "slug": "phishing-breach-at-vendor-exposes-innovative-physical-therapy-patient-data",
      "headline": "Vendor Breach Exposes Patient Data at Innovative Physical Therapy",
      "title": "Innovative Physical Therapy Discloses Patient Data Breach Due to Phishing Attack on Third-Party Vendor",
      "severity": "medium",
      "excerpt": "Innovative Physical Therapy has notified patients of a data breach that originated from a third-party vendor responsible for practice management. The breach occurred when two vendor employees fell victim to phishing emails, leading to the compromise of their email accounts. Between June 25 and June 26, 2025, an unauthorized party accessed these accounts, which contained the protected health information (PHI) and personally identifiable information (PII) of at least 2,023 patients. The exposed data includes names, Social Security numbers, medical information, and health insurance details.",
      "tags": [
        "Data Breach",
        "Healthcare",
        "Supply Chain Attack",
        "Phishing",
        "Vendor Breach",
        "PHI"
      ],
      "categories": [
        "Data Breach",
        "Supply Chain Attack",
        "Phishing"
      ],
      "createdAt": "2025-11-19T15:00:00.000Z",
      "updatedAt": "2025-11-19T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    }
  ]
}