{
  "pub_id": "pub-2025-10-18",
  "headline": "Nation-State Actors Breach F5 Networks Stealing BIG-IP Source Code; AI Phishing Effectiveness Skyrockets",
  "summary": "This cybersecurity brief for October 18, 2025, covers a critical supply chain attack against F5 Networks by a nation-state actor, resulting in the theft of BIG-IP source code and unpatched vulnerability data. Other major developments include a Microsoft report revealing AI-powered phishing is 4.5 times more effective, active exploitation of a Cisco zero-day to deploy rootkits, and the Clop ransomware group breaching an American Airlines subsidiary via Oracle EBS flaws. The period also saw rising ransomware attacks targeting healthcare and increased warnings about supply chain security from the UK's NCSC.",
  "pub_date": "2025-10-18",
  "total_articles": 6,
  "articles": [
    {
      "id": "02a78710-0d01-46eb-a99b-9aed6ffd560e",
      "slug": "ai-powered-phishing-emails-prove-4-5-times-more-effective-microsoft-report-finds",
      "headline": "Microsoft Report: AI-Generated Phishing Now 4.5x More Effective, Bypassing Traditional Defenses",
      "title": "AI-Powered Phishing Emails Achieve 54% Click-Through Rate, Microsoft's 2025 Digital Defense Report Reveals",
      "severity": "high",
      "excerpt": "According to the Microsoft 2025 Digital Defense Report, the effectiveness of phishing attacks has surged with the adoption of artificial intelligence. AI-generated emails now achieve a 54% click-through rate, 4.5 times higher than traditional methods. The report, covering July 2024 to June 2025, also highlights a 32% increase in identity-based attacks and the growing use of AI by nation-state actors for disinformation. Microsoft stresses that phishing-resistant MFA remains the most effective defense, blocking over 99% of identity attacks.",
      "tags": [
        "AI",
        "Phishing",
        "Microsoft",
        "Threat Intelligence",
        "MFA",
        "Identity Attack",
        "Infostealer",
        "ClickFix"
      ],
      "categories": [
        "Phishing",
        "Threat Intelligence",
        "Malware"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "4b0d5163-fb73-4372-9e0c-c5fd4952cdb9",
      "slug": "cisco-zero-day-cve-2025-20352-exploited-to-deploy-linux-rootkits-on-switches",
      "headline": "Cisco Zero-Day Flaw Actively Exploited to Implant Linux Rootkits on Network Switches",
      "title": "Cisco Zero-Day (CVE-2025-20352) Exploited in 'ZeroDisco' Operation to Deploy Linux Rootkits on Network Switches",
      "severity": "critical",
      "excerpt": "A critical zero-day vulnerability in Cisco IOS and IOS XE software, tracked as CVE-2025-20352, has been actively exploited in the wild to install Linux rootkits on network devices. The campaign, dubbed 'ZeroDisco' by Trend Micro, targeted Cisco 9400, 9300, and 3750G series switches. The attackers leveraged the SNMP stack overflow flaw for remote code execution after obtaining high-privilege credentials, implanting a fileless rootkit that could evade detection by disappearing after a reboot. Cisco has released patches and urges customers to update affected devices immediately.",
      "tags": [
        "Cisco",
        "Zero-Day",
        "CVE-2025-20352",
        "Rootkit",
        "Linux",
        "SNMP",
        "Vulnerability",
        "ZeroDisco",
        "IOS",
        "IOS XE"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Malware"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-20352",
        "CVE-2017-3881"
      ],
      "isUpdate": false
    },
    {
      "id": "ead32ea2-3e1d-4365-a1fb-5d0fe95236dc",
      "slug": "deloitte-agrees-to-6-3-million-settlement-for-rhode-island-data-breach",
      "headline": "Deloitte to Pay $6.3M in Settlement for Rhode Island Data Breach Affecting 640,000",
      "title": "Deloitte Reaches $6.3 Million Proposed Settlement in Class-Action Lawsuit Over Rhode Island Data Breach",
      "severity": "high",
      "excerpt": "Deloitte has agreed to a proposed $6.3 million class-action settlement related to a 2024 cyberattack that compromised the personal data of 640,000 Rhode Island residents—nearly half the state's population. The breach affected the state's 'RIBridges' social services system, which was managed by Deloitte. The incident resulted in significant disruption to state government services and the eventual leak of some compromised data on the dark web. This settlement is in addition to a previous $5 million payment Deloitte made to the state to cover breach-related expenses.",
      "tags": [
        "Data Breach",
        "Deloitte",
        "Rhode Island",
        "Settlement",
        "Class Action",
        "Government",
        "PII",
        "Dark Web"
      ],
      "categories": [
        "Data Breach",
        "Regulatory",
        "Policy and Compliance"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "b3592b17-d8af-4f58-8b45-3c01c8c441e9",
      "slug": "new-capi-backdoor-malware-targets-russian-auto-and-e-commerce-sectors",
      "headline": "New 'CAPI Backdoor' Malware Targets Russian Auto and E-Commerce Firms",
      "title": "New CAPI Backdoor Phishing Campaign Targets Russian Automobile and E-Commerce Industries",
      "severity": "medium",
      "excerpt": "A new cyberespionage campaign is targeting the Russian automobile and e-commerce sectors using a previously undocumented .NET malware known as 'CAPI Backdoor'. According to researchers at Seqrite Labs, the attack is initiated through phishing emails containing a ZIP archive with a malicious LNK file. The malware uses a living-off-the-land technique, executing via 'rundll32.exe', and establishes persistence through scheduled tasks and startup folder entries. CAPI Backdoor is designed to gather system information, check for antivirus products, and exfiltrate data to a C2 server.",
      "tags": [
        "CAPI Backdoor",
        "Malware",
        ".NET",
        "Phishing",
        "Cyber Espionage",
        "Russia",
        "LotL",
        "rundll32"
      ],
      "categories": [
        "Malware",
        "Phishing",
        "Threat Actor"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "afa8a3d8-4a04-4c2b-9648-74743c13bb28",
      "slug": "everest-ransomware-claims-collins-aerospace-breach-then-site-goes-offline",
      "headline": "Everest Ransomware Claims Collins Aerospace Hack; Leak Site Mysteriously Goes Offline",
      "title": "Everest Ransomware Group Takes Credit for Collins Aerospace Breach, Then Its Data Leak Site Goes Offline",
      "severity": "high",
      "excerpt": "The Everest ransomware group has claimed responsibility for the September 2025 cyberattack on Collins Aerospace, a major aviation and defense contractor. The attack caused widespread disruption, affecting check-in and boarding systems at major European airports like Heathrow and Brussels. Shortly after posting the claim on its dark web data leak site, the site became inaccessible, displaying a \"Fatal error\" message. This has fueled speculation about a potential law enforcement takedown or internal disruption within the ransomware group.",
      "tags": [
        "Everest",
        "Ransomware",
        "Collins Aerospace",
        "Aviation",
        "Supply Chain Attack",
        "Heathrow",
        "Cyberattack"
      ],
      "categories": [
        "Ransomware",
        "Cyberattack",
        "Supply Chain Attack"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "5f0b563c-bc1f-42b7-abaf-cd1098d10d5e",
      "slug": "critical-supply-chain-risk-uncovered-in-vscode-extension-marketplaces",
      "headline": "Massive Supply Chain Risk Found in VSCode Marketplace; 100+ Extensions Leaked Access Tokens",
      "title": "Critical Supply Chain Risk Uncovered in VSCode Extension Marketplaces, Potentially Affecting 150,000 Users",
      "severity": "critical",
      "excerpt": "Researchers at Wiz have discovered a significant supply chain risk in the popular VSCode and OpenVSX extension marketplaces. They found that publishers of over 100 extensions had inadvertently leaked their access tokens, which could have allowed attackers to hijack the extensions and distribute malware to more than 150,000 users. The research also uncovered over 550 exposed secrets within 500+ extensions, providing access to developer accounts on services like AWS, GitHub, and OpenAI, further highlighting the pervasive security risks in the software development ecosystem.",
      "tags": [
        "VSCode",
        "Supply Chain Attack",
        "Wiz",
        "Secrets Management",
        "DevSecOps",
        "GitHub",
        "Vulnerability"
      ],
      "categories": [
        "Supply Chain Attack",
        "Vulnerability",
        "Cloud Security"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}