{
  "pub_id": "pub-2025-11-29",
  "headline": "Qilin Ransomware Strikes Globally: Asahi and South Korean Financial Sector Hit in Major Campaigns",
  "summary": "This cybersecurity brief for November 29, 2025, covers a series of high-impact attacks led by the Qilin ransomware group, including a massive data breach at Japanese beverage giant Asahi affecting nearly 2 million individuals and a sophisticated supply-chain attack that compromised 28 South Korean financial firms. Additional major events include espionage campaigns by APT groups Bloody Wolf and APT36, data breaches at Under Armour and DoorDash, and a cloud misconfiguration incident at Oracle. The period was marked by significant ransomware activity, nation-state espionage, and supply chain vulnerabilities.",
  "pub_date": "2025-11-29",
  "total_articles": 9,
  "articles": [
    {
      "id": "e6e0b719-7d1e-4f69-9a41-d6f5932904ae",
      "slug": "asahi-confirms-massive-data-breach-from-qilin-ransomware-attack",
      "headline": "Asahi Confirms Qilin Ransomware Breach Exposed Data of Nearly 2 Million",
      "title": "Japanese Beverage Giant Asahi Confirms Qilin Ransomware Attack Exposed Data of 1.9 Million Individuals",
      "severity": "high",
      "excerpt": "Japanese beverage giant Asahi Group Holdings has confirmed a September 2025 ransomware attack by the Qilin group resulted in a massive data breach affecting 1.914 million individuals. The breach exposed the personal information of customers, employees, and business contacts, leading to significant operational disruptions, including production halts and product shortages. The attackers gained initial access through compromised network equipment and moved laterally to deploy ransomware across Asahi's domestic data centers. While no financial data was stolen, the exposed PII includes names, addresses, phone numbers, and dates of birth.",
      "tags": [
        "ransomware",
        "qilin",
        "data breach",
        "japan",
        "manufacturing",
        "pii"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Cyberattack"
      ],
      "createdAt": "2025-11-29T15:00:00.000Z",
      "updatedAt": "2025-11-29T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "d6a5dfe1-4b97-4c9e-907b-09ff17eed112",
      "slug": "qilin-ransomware-korean-leaks-supply-chain-attack-hits-financial-firms",
      "headline": "Qilin's \"Korean Leaks\" Hits 28 Financial Firms via MSP Supply Chain Attack",
      "title": "Qilin Ransomware's \"Korean Leaks\" Campaign Compromises 28 South Korean Financial Firms via MSP Breach",
      "severity": "critical",
      "excerpt": "The Qilin ransomware group has executed a devastating supply-chain attack, dubbed \"Korean Leaks,\" by breaching GJTec, a South Korean managed service provider (MSP). This single point of failure allowed the attackers to compromise at least 28 of the MSP's downstream financial services clients. The campaign, which ran in waves from September to October 2025, resulted in the exfiltration of over 2TB of data. Researchers from Bitdefender have noted potential links to the North Korean state-affiliated group Moonstone Sleet, suggesting a hybrid operation blending financial extortion with geopolitical motives.",
      "tags": [
        "supply chain attack",
        "qilin",
        "ransomware",
        "south korea",
        "msp",
        "financial services",
        "moonstone sleet"
      ],
      "categories": [
        "Supply Chain Attack",
        "Ransomware",
        "Threat Actor"
      ],
      "createdAt": "2025-11-29T15:00:00.000Z",
      "updatedAt": "2025-11-29T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "d6a9924c-3c50-4fa0-8535-007a80cac472",
      "slug": "tryhackme-apologizes-for-all-male-expert-list-in-advent-of-cyber-event",
      "headline": "TryHackMe Apologizes for All-Male Panel After Community Backlash",
      "title": "TryHackMe Faces Backlash and Apologizes for Lack of Female Representation in \"Advent of Cyber\" Event",
      "severity": "informational",
      "excerpt": "Cybersecurity training platform TryHackMe issued a public apology on November 28, 2025, after announcing an all-male list of 18 industry helpers for its popular \"Advent of Cyber\" event. The omission sparked significant backlash from the cybersecurity community regarding the lack of gender diversity and representation. The company acknowledged the mistake was unintentional, stating several female creators had been invited but were unavailable. TryHackMe is now actively working with community members to recruit and onboard women to the panel before the event's launch.",
      "tags": [
        "diversity",
        "inclusion",
        "cybersecurity community",
        "tryhackme",
        "training"
      ],
      "categories": [
        "Other"
      ],
      "createdAt": "2025-11-29T15:00:00.000Z",
      "updatedAt": "2025-11-29T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    },
    {
      "id": "5ba02873-db08-4d1e-8859-bbae97634af1",
      "slug": "apt36-targets-indian-government-with-new-python-elf-malware",
      "headline": "Pakistan-linked APT36 Targets Indian Government with New Linux Malware",
      "title": "APT36 (Transparent Tribe) Deploys New Python-Based ELF Malware in Espionage Campaign Against Indian Government",
      "severity": "high",
      "excerpt": "The Pakistan-based threat group APT36, also known as Transparent Tribe, is conducting an active cyber-espionage campaign against Indian government entities. A CYFIRMA report published on November 29, 2025, details the group's use of a new Python-based malware compiled for Linux systems (ELF format). This development signifies an expansion of APT36's toolkit to target non-Windows environments within sensitive Indian government and strategic sector networks, continuing the group's long-standing focus on intelligence gathering against India.",
      "tags": [
        "apt36",
        "transparent tribe",
        "cyberespionage",
        "india",
        "pakistan",
        "linux",
        "malware"
      ],
      "categories": [
        "Threat Actor",
        "Cyberattack",
        "Malware"
      ],
      "createdAt": "2025-11-29T15:00:00.000Z",
      "updatedAt": "2025-11-29T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "fb23ddc5-6c2f-4de7-a2ca-965a8691c885",
      "slug": "report-details-north-koreas-use-of-cybercrime-as-statecraft",
      "headline": "North Korea's Cybercrime is Statecraft, Report Warns",
      "title": "New Report Analyzes North Korea's Use of Cybercrime as a Tool of Statecraft Following UN Panel Dissolution",
      "severity": "informational",
      "excerpt": "A strategic intelligence report published by CYFIRMA on November 28, 2025, analyzes North Korea's increasing reliance on cybercrime as a core instrument of its statecraft. The report's release is timely, following Russia's 2024 veto that disbanded the UN Panel of Experts responsible for monitoring North Korean sanctions evasion. The analysis details how state-sponsored groups like the Lazarus Group conduct large-scale cyber operations, including cryptocurrency heists and ransomware attacks, to generate revenue that directly funds the nation's weapons programs and sustains the regime.",
      "tags": [
        "north korea",
        "dprk",
        "lazarus group",
        "cybercrime",
        "state-sponsored",
        "threat intelligence",
        "sanctions"
      ],
      "categories": [
        "Threat Intelligence",
        "Threat Actor",
        "Policy and Compliance"
      ],
      "createdAt": "2025-11-29T15:00:00.000Z",
      "updatedAt": "2025-11-29T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "def7ae18-98ee-4db3-b8f1-4507207b37cd",
      "slug": "under-armour-investigates-ransomware-attack-and-data-theft-claims",
      "headline": "Under Armour Investigates Ransomware Attack, Data Theft Claims",
      "title": "Under Armour Investigating Ransomware Attack After Threat Actors Claim Theft of Data on \"Millions\"",
      "severity": "high",
      "excerpt": "Athletic apparel giant Under Armour is investigating a ransomware attack that has impacted its internal corporate systems. According to a report from November 28, 2025, an unidentified ransomware group has claimed responsibility and alleges it has exfiltrated a large volume of data, including personal records for \"millions of individuals.\" Under Armour has acknowledged the unauthorized access and launched a forensic investigation to determine the scope of the breach and verify the attackers' claims. The incident has caused internal disruptions and poses a significant data privacy risk.",
      "tags": [
        "ransomware",
        "data breach",
        "under armour",
        "retail",
        "double extortion"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Cyberattack"
      ],
      "createdAt": "2025-11-29T15:00:00.000Z",
      "updatedAt": "2025-11-29T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "51c7cc7a-22e3-4df3-b770-0b07d3d36d4e",
      "slug": "doordash-discloses-new-breach-via-third-party-vendor",
      "headline": "DoorDash Discloses Another Breach via Third-Party Vendor",
      "title": "DoorDash Confirms Data Breach Stemming from Compromised Third-Party Service Provider",
      "severity": "medium",
      "excerpt": "Food delivery service DoorDash disclosed another data breach on November 27, 2025, resulting from a compromise at an unnamed third-party service provider. The incident, reported on November 28, exposed information belonging to both customers and delivery drivers. This breach marks the latest in a series of security incidents for DoorDash involving its supply chain, highlighting persistent vulnerabilities in its network of external vendors and raising concerns about the security of its platform.",
      "tags": [
        "data breach",
        "supply chain attack",
        "doordash",
        "third party risk",
        "api security"
      ],
      "categories": [
        "Data Breach",
        "Supply Chain Attack",
        "Cloud Security"
      ],
      "createdAt": "2025-11-29T15:00:00.000Z",
      "updatedAt": "2025-11-29T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "d9d2cc10-99f0-4bd6-bc70-77d751a76e4a",
      "slug": "oracle-cloud-infrastructure-misconfiguration-leads-to-data-breach",
      "headline": "Oracle Cloud Misconfiguration Exposes Customer Data",
      "title": "Oracle Reports Data Breach Caused by Misconfigured Cloud Resources",
      "severity": "medium",
      "excerpt": "Oracle has reported a data breach stemming from misconfigured resources within its own Oracle Cloud Infrastructure (OCI). The incident, first noted on November 13 and analyzed in a report on November 28, 2025, allowed external, unauthorized access to a portion of its cloud environment where customer data was stored. While the full scope and specific customers affected have not been detailed, the breach highlights the significant security challenges of managing large-scale cloud environments, demonstrating that even major cloud providers are susceptible to internal configuration errors.",
      "tags": [
        "cloud security",
        "data breach",
        "oracle",
        "oci",
        "misconfiguration",
        "cspm"
      ],
      "categories": [
        "Cloud Security",
        "Data Breach",
        "Vulnerability"
      ],
      "createdAt": "2025-11-29T15:00:00.000Z",
      "updatedAt": "2025-11-29T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "380b285b-463e-4980-ad3b-39c4cd261367",
      "slug": "tag-150-maas-group-operates-modular-loader-rat-campaign",
      "headline": "MaaS Provider TAG-150 Distributes Modular Loader and RAT",
      "title": "Malware-as-a-Service Group TAG-150 Identified Operating Modular Loader and RAT Campaign",
      "severity": "medium",
      "excerpt": "A Malware-as-a-Service (MaaS) provider, tracked as TAG-150, has been identified operating a campaign active since at least March 2025. According to a threat intelligence report from November 29, 2025, the group is distributing a modular loader that delivers a Remote Access Trojan (RAT). The operation is focused on information theft and leverages user interaction and living-off-the-land techniques to compromise systems. The campaign highlights the ongoing threat from the MaaS ecosystem, which provides cybercriminals with ready-made tools to conduct attacks.",
      "tags": [
        "maas",
        "malware-as-a-service",
        "rat",
        "loader",
        "tag-150",
        "cybercrime"
      ],
      "categories": [
        "Malware",
        "Threat Actor"
      ],
      "createdAt": "2025-11-29T15:00:00.000Z",
      "updatedAt": "2025-11-29T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}