{
  "pub_id": "pub-2025-12-17",
  "headline": "Critical React2Shell Flaw Under Widespread Attack, CISA Warns of Fortinet Exploit, and AI Fuels Cloud Risk",
  "summary": "This cybersecurity brief for December 17, 2025, covers a surge in critical vulnerability exploitation. A CVSS 10.0 flaw in React, dubbed 'React2Shell,' is being widely abused by both state actors and cybercriminals to deploy backdoors and miners. CISA has added a critical, actively exploited Fortinet SSO vulnerability to its KEV catalog. Meanwhile, a new Palo Alto Networks report reveals that rapid AI adoption is massively expanding the cloud attack surface, with 99% of organizations reporting attacks on their AI systems. Other major events include a cyberattack on the French Interior Ministry, a novel 'ConsentFix' phishing technique bypassing MFA to hijack Microsoft accounts, and a large-scale malware alert in New Zealand for Lumma Stealer infections.",
  "pub_date": "2025-12-17",
  "total_articles": 7,
  "articles": [
    {
      "id": "17a99b54-ec4d-498e-a197-324c5960e2fa",
      "slug": "access-broker-storm-0249-shifts-to-advanced-ransomware-delivery",
      "headline": "Storm-0249 Evolves: Access Broker Now Deploys Ransomware with Advanced Stealth Tactics",
      "title": "Threat Actor Storm-0249 Shifts from Access Broker to Hands-On Ransomware Enabler",
      "severity": "medium",
      "excerpt": "The initial access broker (IAB) known as Storm-0249 is evolving its tactics, moving beyond simply selling network access to actively participating in malware deployment. According to ReliaQuest, the group now uses more sophisticated techniques, including DLL side-loading and fileless PowerShell execution, to facilitate ransomware attacks directly. Their methods involve social engineering victims into running malicious commands (`ClickFix`), which fetch and execute PowerShell scripts from spoofed domains. A key technique is dropping a trojanized version of a SentinelOne security agent DLL to run malware under the guise of a trusted process. This evolution signifies a dangerous trend where IABs are becoming more integrated into the ransomware deployment process, increasing their threat level.",
      "tags": [
        "Storm-0249",
        "IAB",
        "Ransomware",
        "DLL Side-loading",
        "ClickFix",
        "PowerShell"
      ],
      "categories": [
        "Threat Actor",
        "Ransomware",
        "Malware"
      ],
      "createdAt": "2025-12-10T15:00:00.000Z",
      "updatedAt": "2025-12-17T00:00:00.000Z",
      "readingTime": 6,
      "isUpdate": true,
      "updateSummary": "Push Security launches browser tool to block 'ClickFix' copy-paste attacks, directly mitigating a key social engineering tactic.",
      "updateContent": "Push Security has released a new browser-based 'malicious copy-and-paste detection' feature designed to combat 'ClickFix' social engineering attacks. This tool directly addresses the technique where users are tricked into copying malicious code from websites and pasting it into terminals, a method identified as crucial for initial access by groups like Storm-0249. The feature works by analyzing copy events in the browser, blocking malicious scripts from reaching the clipboard, and effectively disarming the attack before execution. This provides a critical new layer of defense against a rapidly growing threat vector, enhancing mitigation efforts against sophisticated IAB tactics."
    },
    {
      "id": "4ddc798f-d783-441c-8a03-f67208717968",
      "slug": "palo-alto-networks-report-ai-driving-massive-expansion-of-cloud-attack-surface",
      "headline": "AI Adoption Fuels 'Massive' Cloud Attack Surface Expansion, Palo Alto Networks Report Warns",
      "title": "Palo Alto Networks Report: 99% of Organizations See Attacks on AI Systems Amid Surge in Cloud Risk",
      "severity": "informational",
      "excerpt": "Palo Alto Networks' 2025 'State of Cloud Security Report' reveals that the rapid adoption of AI is creating an unprecedented expansion of the cloud attack surface. The study, surveying 2,800 security leaders, found that 99% of organizations have had their AI systems attacked in the last year. The use of generative AI in coding is producing insecure code faster than security teams can remediate it, creating a significant risk gap. API attacks have surged by 41% year-over-year, and lenient identity and access management (IAM) remains a top vulnerability. The report calls for a unified, platform-based approach to cloud security to counter AI-weaponized threats.",
      "tags": [
        "Cloud Security",
        "AI Security",
        "Palo Alto Networks",
        "API Security",
        "IAM",
        "DevSecOps",
        "CNAPP",
        "Threat Intelligence"
      ],
      "categories": [
        "Cloud Security",
        "Threat Intelligence",
        "Policy and Compliance"
      ],
      "createdAt": "2025-12-17T15:00:00.000Z",
      "updatedAt": "2025-12-17T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "7fecc4aa-4b87-4bee-bd5f-eea9c54446d8",
      "slug": "french-interior-ministry-confirms-cyberattack-on-email-servers",
      "headline": "French Interior Ministry Confirms Cyberattack Compromised Email Servers",
      "title": "Hackers Breach French Interior Ministry Email Servers; Attacker Claims Access to 16.4 Million Citizen Files",
      "severity": "high",
      "excerpt": "The French Ministry of the Interior has confirmed its email servers were compromised in a cyberattack detected between December 11 and 12, 2025. Interior Minister Laurent Nuñez stated that attackers stole staff email passwords, allowing them to access an unknown number of document files. While the government is still assessing the scale, a hacker group named 'Indra' has claimed, without evidence, to have exfiltrated police files on 16.4 million citizens. In response, the ministry is rolling out two-factor authentication and resetting passwords. The attack on the high-value government target, which oversees national police and security, has raised speculation of nation-state involvement, with groups like APT28 being considered.",
      "tags": [
        "Data Breach",
        "Government",
        "France",
        "APT28",
        "Credential Compromise",
        "MFA",
        "Email Security",
        "Nation-State"
      ],
      "categories": [
        "Data Breach",
        "Cyberattack",
        "Threat Actor"
      ],
      "createdAt": "2025-12-17T15:00:00.000Z",
      "updatedAt": "2025-12-17T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "6405e8b7-bc8f-4075-a4d2-e2b8653ab17b",
      "slug": "new-consentfix-phishing-attack-bypasses-mfa-to-hijack-microsoft-accounts",
      "headline": "New 'ConsentFix' Phishing Attack Hijacks Microsoft Accounts, Bypassing MFA via Azure CLI Abuse",
      "title": "Researchers Uncover 'ConsentFix' Phishing Technique that Abuses Trusted Azure CLI for MFA-Bypassing Account Takeover",
      "severity": "high",
      "excerpt": "A novel and sophisticated phishing attack dubbed 'ConsentFix' allows attackers to hijack Microsoft accounts without stealing passwords or bypassing multi-factor authentication (MFA). Discovered by Push Security, the browser-native attack tricks users into completing a fake verification process that involves copying a URL containing a sensitive OAuth authorization code from their browser's address bar and pasting it into the attacker's phishing page. The attacker then uses this code to authenticate as the user via the legitimate and trusted Microsoft Azure Command-Line Interface (CLI). Because the Azure CLI is a first-party app, it bypasses many consent restrictions, granting the attacker full account access. The technique is active and circumvents even phishing-resistant authentication like passkeys.",
      "tags": [
        "ConsentFix",
        "Phishing",
        "OAuth",
        "MFA Bypass",
        "Account Takeover",
        "Azure CLI",
        "Microsoft Entra ID",
        "Push Security",
        "Social Engineering"
      ],
      "categories": [
        "Phishing",
        "Cloud Security",
        "Threat Actor"
      ],
      "createdAt": "2025-12-17T15:00:00.000Z",
      "updatedAt": "2025-12-17T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "804ea137-d101-497d-bf6f-2c82611dbfb7",
      "slug": "new-zealand-warns-26000-citizens-of-lumma-stealer-malware-infections",
      "headline": "New Zealand Launches Massive Public Alert, Warning 26,000 Citizens of Lumma Stealer Malware Infections",
      "title": "New Zealand's NCSC Emails 26,000 Individuals in Unprecedented Warning About Lumma Stealer Malware",
      "severity": "high",
      "excerpt": "In a first-of-its-kind campaign, New Zealand's National Cyber Security Centre (NCSC) is emailing approximately 26,000 people to warn them of potential infection by the Lumma Stealer malware. The potent information-stealing software targets Windows devices to covertly harvest sensitive data, including passwords, browser credentials, banking details, and cryptocurrency wallets. Officials have confirmed that some of the stolen credentials were linked to government and banking systems, heightening the risk of fraud. The NCSC's mass notification directs affected individuals to a government website with instructions for malware removal and improving account security.",
      "tags": [
        "Lumma Stealer",
        "Malware",
        "InfoStealer",
        "New Zealand",
        "NCSC",
        "Data Theft",
        "Credential Theft",
        "Phishing"
      ],
      "categories": [
        "Malware",
        "Phishing",
        "Data Breach"
      ],
      "createdAt": "2025-12-17T15:00:00.000Z",
      "updatedAt": "2025-12-17T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "796edd91-2fbf-4e30-a437-2436d5b24792",
      "slug": "mitre-extends-d3fend-cybersecurity-framework-to-operational-technology-ot",
      "headline": "MITRE Extends D3FEND Cybersecurity Framework to Operational Technology (OT)",
      "title": "MITRE Launches D3FEND for OT to Standardize Defense of Cyber-Physical Systems",
      "severity": "informational",
      "excerpt": "MITRE has officially extended its D3FEND cybersecurity framework to include Operational Technology (OT), providing a standardized knowledge base of defensive techniques for cyber-physical systems. Announced on December 16, 2025, the NSA-funded initiative aims to create a common language for securing critical infrastructure in sectors like energy, manufacturing, and defense. As OT systems become increasingly connected to IT networks, D3FEND for OT provides a structured ontology of countermeasures tailored to the unique components and risks of industrial environments, mapping defensive techniques to threats against controllers, sensors, and actuators.",
      "tags": [
        "MITRE",
        "D3FEND",
        "OT Security",
        "ICS Security",
        "Cyber-Physical Systems",
        "Critical Infrastructure",
        "NSA",
        "Cybersecurity Framework"
      ],
      "categories": [
        "Industrial Control Systems",
        "Policy and Compliance",
        "Security Operations"
      ],
      "createdAt": "2025-12-17T15:00:00.000Z",
      "updatedAt": "2025-12-17T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "196041a0-b4b8-47ab-a4e6-c1446a1b7538",
      "slug": "operation-moneymount-iso-phishing-campaign-deploys-phantom-stealer",
      "headline": "'Operation MoneyMount-ISO' Phishing Campaign Deploys Phantom Stealer via Malicious ISOs",
      "title": "Russian-Language Phishing Campaign 'Operation MoneyMount-ISO' Targets Finance Departments with Phantom Stealer Malware",
      "severity": "high",
      "excerpt": "A financially motivated, Russian-language phishing campaign dubbed 'Operation MoneyMount-ISO' is actively targeting finance and accounting departments to deploy the Phantom information-stealing malware. According to researchers at Seqrite Labs, the attack uses emails with fake payment confirmations that contain a malicious ISO disk image file. This technique is designed to bypass email security controls. When the user opens the ISO, it mounts a virtual drive with a disguised executable. Running this file triggers a memory-resident infection chain that deploys Phantom Stealer, which then harvests browser credentials, crypto wallets, and other sensitive data for exfiltration.",
      "tags": [
        "Phantom Stealer",
        "InfoStealer",
        "Phishing",
        "ISO file",
        "Malware",
        "Finance",
        "Credential Theft",
        "Russian"
      ],
      "categories": [
        "Phishing",
        "Malware",
        "Threat Actor"
      ],
      "createdAt": "2025-12-17T15:00:00.000Z",
      "updatedAt": "2025-12-17T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}