{
  "pub_id": "pub-2026-01-27",
  "headline": "Microsoft Patches Actively Exploited Office Zero-Day as Ransomware Groups Target Major Supply Chains",
  "summary": "This cybersecurity brief for January 27, 2026, covers multiple critical incidents, led by an emergency out-of-band patch from Microsoft for an actively exploited zero-day (CVE-2026-21509) in Office, prompting a CISA directive. Concurrently, the RansomHub group has claimed a major attack on Apple supplier Luxshare, and the fallout from a previous breach at Under Armour sees 72 million customer records leaked. Other significant events include a critical RCE flaw patched in Zoom, active exploitation of a Fortinet SSO bypass, and the EU's proposal for a revised Cybersecurity Act to counter supply chain threats.",
  "pub_date": "2026-01-27",
  "total_articles": 8,
  "articles": [
    {
      "id": "db7fae1a-2c3c-46da-bb12-d64462409279",
      "slug": "everest-ransomware-claims-under-armour-breach-leaks-data-of-72m-customers",
      "headline": "Everest Ransomware Leaks Data of 72 Million Under Armour Customers After Failed Talks",
      "title": "Everest Ransomware Group Claims Under Armour Breach, Publishes Data of 72 Million Customers on Dark Web",
      "severity": "high",
      "excerpt": "The Everest ransomware group has claimed a massive data breach against athletic apparel giant Under Armour. After negotiations allegedly failed, the group announced on its dark web leak site that it has published the full dataset, which it claims contains 191 million records, including 72.7 million unique email addresses. The compromised data reportedly includes sensitive customer information such as full names, phone numbers, physical locations, and purchase histories. This breach places a huge number of individuals at significant risk for targeted phishing campaigns, identity theft, and other fraudulent activities.",
      "tags": [
        "Everest",
        "Ransomware",
        "Data Breach",
        "Under Armour",
        "Dark Web",
        "PII"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Threat Actor"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-27T00:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "A class-action lawsuit has been filed against Under Armour following the Everest ransomware data breach, with additional PII types like gender and date of birth confirmed as exposed.",
      "updateContent": "New developments in the Under Armour data breach, attributed to the Everest ransomware group, include the filing of a class-action lawsuit against the company in the U.S. This legal action highlights the escalating consequences for Under Armour following the exposure of 72 million customer records. Furthermore, the leaked dataset has been confirmed to include additional Personally Identifiable Information (PII) such as customer genders and dates of birth, alongside previously reported names, emails, phone numbers, locations, and purchase histories. The initial ransomware attack occurred in November 2025, leading to the data leak in January 2026 after failed ransom negotiations. The lawsuit underscores the increased legal and financial repercussions for the company and heightened risks for affected individuals."
    },
    {
      "id": "1c59ff75-eb97-4aca-ba06-a3c1e36ed0a5",
      "slug": "zoom-and-gitlab-patch-critical-flaws-including-9-9-cvss-vulnerability",
      "headline": "Zoom & GitLab Race to Patch Critical Flaws, Including a 9.9 CVSS RCE Bug",
      "title": "Zoom and GitLab Release Patches for Critical Vulnerabilities, Including Near-Perfect 9.9 CVSS RCE Flaw in Zoom Node",
      "severity": "critical",
      "excerpt": "Both Zoom and GitLab have released critical security updates to address several high-severity vulnerabilities. The most severe flaw, CVE-2026-22844, is a remote code execution vulnerability in Zoom Node Multimedia Routers (MMRs) with a near-perfect CVSS score of 9.9. This flaw could allow an unauthenticated attacker with network access to compromise the devices. GitLab's updates address multiple vulnerabilities, including two high-severity flaws (CVE-2025-13927 and CVE-2025-13928) that could allow an unauthenticated user to cause denial-of-service conditions. Users of all affected products are urged to apply the patches immediately.",
      "tags": [
        "Zoom",
        "GitLab",
        "RCE",
        "DoS",
        "Vulnerability",
        "Patching",
        "Critical"
      ],
      "categories": [
        "Patch Management",
        "Vulnerability"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-27T00:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2026-22844",
        "CVE-2025-13927",
        "CVE-2025-13928"
      ],
      "cvssScore": 9.9,
      "isUpdate": true,
      "updateSummary": "Zoom RCE (CVE-2026-22844) details: command injection, exploitable by authenticated meeting participant. Affected versions (prior to 5.2.1716.0) and detection methods released.",
      "updateContent": "The new article provides crucial specifics for CVE-2026-22844, clarifying the vulnerability as a command injection exploitable by an authenticated participant within a meeting, a more precise attack vector than previously stated. Affected versions are identified as prior to 5.2.1716.0. The update also includes detailed cyber observables and detection methods, such as monitoring for unusual child processes and outbound network connections from Zoom Node routers. Zoom reports no active exploitation in the wild. This new information significantly enhances understanding of the threat and mitigation strategies."
    },
    {
      "id": "ed661c53-307b-42a5-a2cb-4e2bdba489c1",
      "slug": "new-osiris-ransomware-linked-to-medusa-and-inc-gang-ttps",
      "headline": "New 'Osiris' Ransomware Borrows TTPs from Medusa and Inc Gangs, Uses Signed Driver to Kill AV",
      "title": "Osiris Ransomware Emerges with Advanced TTPs, Including Custom-Signed Driver for Defense Evasion",
      "severity": "high",
      "excerpt": "A new ransomware strain named Osiris is demonstrating a high level of sophistication by combining tactics from established ransomware groups like Medusa and Inc. The attackers use Rclone for data exfiltration to Wasabi cloud storage and deploy a version of Mimikatz named `kaz.exe`, both TTPs linked to the Inc group. More significantly, Osiris uses a custom-developed and signed malicious driver, 'Abyssworker' (aka Poortry), in a Bring-Your-Own-Vulnerable-Driver (BYOVD) attack to terminate security software. This driver and its loader, 'Stonestop,' have been previously associated with the Medusa ransomware gang. The use of these advanced, borrowed TTPs suggests Osiris is operated by experienced actors, possibly former affiliates of other groups.",
      "tags": [
        "Ransomware",
        "BYOVD",
        "Kernel Driver",
        "Defense Evasion",
        "Double Extortion",
        "Medusa",
        "Inc"
      ],
      "categories": [
        "Ransomware",
        "Malware",
        "Threat Actor"
      ],
      "createdAt": "2026-01-23T15:00:00.000Z",
      "updatedAt": "2026-01-27T00:00:00.000Z",
      "readingTime": 6,
      "isUpdate": true,
      "updateSummary": "New details emerge on Osiris ransomware's 'Poortry' driver, which masquerades as a Malwarebytes component to disable security software.",
      "updateContent": "Further analysis of the Osiris ransomware confirms its continued use of the 'Poortry' malicious kernel driver for defense evasion. New information indicates this driver is deceptively signed and designed to masquerade as a legitimate Malwarebytes component, allowing it to terminate security software processes more effectively. This specific deceptive tactic aims to bypass detection and complicate forensic analysis, reinforcing the ransomware's sophisticated evasion capabilities. The use of Rclone for data exfiltration to Wasabi cloud storage remains a core tactic."
    },
    {
      "id": "dc73e147-d212-4cdc-836a-3ba68852c653",
      "slug": "fully-patched-fortigate-firewalls-compromised-via-sso-bypass",
      "headline": "Warning: Fully Patched FortiGate Firewalls Are Being Compromised via New SSO Bypass",
      "title": "New Attack Path Allows Compromise of Fully Patched FortiGate Firewalls with SAML SSO Enabled",
      "severity": "critical",
      "excerpt": "Security analysts are warning of a new wave of attacks compromising even fully patched Fortinet FortiGate firewalls. The activity, observed since January 15, 2026, allows attackers to bypass SAML-based single sign-on (SSO) authentication to gain administrative access. The attacks result in unauthorized configuration changes, creation of persistent user accounts, and exfiltration of device configurations. Fortinet has reportedly identified a new, distinct attack path related to previously disclosed vulnerabilities (CVE-2025-59718, CVE-2025-59719), suggesting existing patches may not be fully effective.",
      "tags": [
        "FortiGate",
        "Fortinet",
        "SSO",
        "SAML",
        "authentication bypass",
        "firewall",
        "zero-day"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Patch Management"
      ],
      "createdAt": "2026-01-25T15:00:00.000Z",
      "updatedAt": "2026-01-27T00:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-59718",
        "CVE-2025-59719"
      ],
      "isUpdate": true,
      "updateSummary": "Fortinet confirmed active exploitation of FortiCloud SSO bypass on fully patched FortiGate firewalls. Attackers gain admin access and exfiltrate configurations.",
      "updateContent": "Fortinet has officially confirmed active exploitation of a critical authentication bypass vulnerability affecting its FortiCloud Single Sign-On (SSO) feature on FortiGate firewalls. This vulnerability, explicitly linked to CVE-2025-59718 and CVE-2025-59719, is being successfully exploited even on fully patched devices. Attackers are leveraging specially crafted SAML messages to gain unauthorized administrative access. Post-exploitation activities include creating persistent administrative accounts, enabling remote access VPNs, and exfiltrating sensitive device configurations, posing a severe risk of long-term network compromise."
    },
    {
      "id": "ee1f9825-cc3e-4421-bb11-d44e2835492a",
      "slug": "microsoft-patches-actively-exploited-office-zero-day-cve-2026-21509",
      "headline": "Microsoft Scrambles to Patch Actively Exploited Office Zero-Day, CISA Issues Urgent Directive",
      "title": "Microsoft Releases Emergency Patch for Actively Exploited Office Zero-Day (CVE-2026-21509)",
      "severity": "critical",
      "excerpt": "Microsoft has issued an emergency out-of-band security update for a high-severity zero-day vulnerability in Microsoft Office, tracked as CVE-2026-21509. The flaw, a security feature bypass with a CVSS score of 7.8, is being actively exploited in targeted attacks, allowing threat actors to bypass OLE mitigations via specially crafted Office files. In response, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating that federal agencies apply the patch by February 16, 2026. The vulnerability affects multiple versions of Office, including Office 2016, 2019, LTSC 2021, and Microsoft 365 Apps for Enterprise.",
      "tags": [
        "Zero-Day",
        "Microsoft Office",
        "CISA KEV",
        "Security Feature Bypass",
        "OLE"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2026-01-27T15:00:00.000Z",
      "updatedAt": "2026-01-27T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-21509"
      ],
      "cvssScore": 7.8,
      "isUpdate": false
    },
    {
      "id": "4cce506b-af96-40ba-94e3-5993da07b190",
      "slug": "cyberattack-disrupts-operations-at-dresden-state-art-collections",
      "headline": "Cyberattack Cripples Digital Services at Germany's Dresden State Art Collections",
      "title": "Dresden State Art Collections' Digital Infrastructure Disabled by Cyberattack",
      "severity": "medium",
      "excerpt": "Germany's Dresden State Art Collections (SKD), one of Europe's most significant museum networks, has been hit by a cyberattack that caused widespread disruption to its digital infrastructure. The attack knocked out the SKD's online ticketing system, visitor services, museum shop website, and internal communications. On-site services were severely impacted, with ticket sales reverting to cash-only. While the operational disruption is significant, the SKD has stated that there is currently no evidence that any data, including sensitive collection or visitor data, was stolen during the incident. The attack highlights the increasing vulnerability of cultural institutions to cyber threats.",
      "tags": [
        "Cyberattack",
        "Museum",
        "Disruption",
        "Germany",
        "Cultural Heritage"
      ],
      "categories": [
        "Cyberattack",
        "Other"
      ],
      "createdAt": "2026-01-27T15:00:00.000Z",
      "updatedAt": "2026-01-27T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "d99b8f81-1a47-4935-93b7-40b5a7c19bef",
      "slug": "microsoft-teams-phishing-campaign-abuses-guest-invitations",
      "headline": "Widespread Phishing Campaign Abuses Microsoft Teams Guest Invites to Target 6,000+ Users",
      "title": "Phishing Campaign Leverages Microsoft Teams Guest Invitations to Distribute Malicious Billing Notices",
      "severity": "medium",
      "excerpt": "A large-scale phishing campaign is abusing Microsoft Teams' guest invitation feature to target thousands of users with fake billing notices. Researchers at Check Point have observed over 12,000 phishing emails sent to more than 6,100 users, primarily in the manufacturing, technology, and education sectors in the United States. Attackers create Teams groups with finance-related names and send guest invitations to targets. The invitation email, which comes from a legitimate Microsoft address, contains obfuscated text that appears to be a billing notification, lending it an air of authenticity and increasing the likelihood that a user will click the malicious link.",
      "tags": [
        "Phishing",
        "Microsoft Teams",
        "Social Engineering",
        "Cloud Security",
        "Credential Harvesting"
      ],
      "categories": [
        "Phishing",
        "Cloud Security"
      ],
      "createdAt": "2026-01-27T15:00:00.000Z",
      "updatedAt": "2026-01-27T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "81c121c0-e598-47d6-b7ae-3ee60b22eb7a",
      "slug": "health-isac-report-highlights-ai-driven-attacks-as-top-concern-for-2026",
      "headline": "Health-ISAC Report: AI-Enabled Attacks Named Top Threat to Healthcare Sector in 2026",
      "title": "AI-Driven Attacks, Supply Chain Risks Top Concerns in Health-ISAC's 2026 Threat Report",
      "severity": "informational",
      "excerpt": "The Health Information Sharing and Analysis Center (Health-ISAC) has released its 2026 Global Health Sector Threat Landscape report, identifying AI-enabled attacks as the number one projected concern for the year. Based on surveys of healthcare executives and security professionals, the report highlights a shift in focus towards emerging, sophisticated threats. Alongside AI, the report emphasizes the persistent dangers of major supply chain vulnerabilities and the continued high impact of ransomware. The findings, drawn from extensive data including over 1,200 targeted alerts in 2025, urge healthcare organizations to move towards a more proactive and resilient security posture.",
      "tags": [
        "Threat Intelligence",
        "Healthcare",
        "AI",
        "Ransomware",
        "Supply Chain Attack",
        "Health-ISAC"
      ],
      "categories": [
        "Threat Intelligence",
        "Policy and Compliance",
        "Ransomware"
      ],
      "createdAt": "2026-01-27T15:00:00.000Z",
      "updatedAt": "2026-01-27T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}