{
  "pub_id": "pub-2025-10-18",
  "headline": "Nation-State Actors Breach F5 Networks Stealing BIG-IP Source Code; AI Phishing Effectiveness Skyrockets",
  "summary": "This cybersecurity brief for October 18, 2025, covers a critical supply chain attack against F5 Networks by a nation-state actor, resulting in the theft of BIG-IP source code and unpatched vulnerability data. Other major developments include a Microsoft report revealing AI-powered phishing is 4.5 times more effective, active exploitation of a Cisco zero-day to deploy rootkits, and the Clop ransomware group breaching an American Airlines subsidiary via Oracle EBS flaws. The period also saw rising ransomware attacks targeting healthcare and increased warnings about supply chain security from the UK's NCSC.",
  "pub_date": "2025-10-18",
  "total_articles": 9,
  "articles": [
    {
      "id": "8a4fabd5-07e0-44e4-bc44-b2ff1c88d744",
      "slug": "uk-ncsc-reports-nationally-significant-cyberattacks-more-than-doubled",
      "headline": "UK's NCSC Warns of 'Alarming' Rise in Cyberattacks, Doubling in Past Year",
      "title": "UK's National Cyber Security Centre Reports \"Nationally Significant\" Cyberattacks More Than Doubled",
      "severity": "informational",
      "excerpt": "The UK's National Cyber Security Centre (NCSC) revealed in its 2025 annual review that it managed 204 \"nationally significant\" cyberattacks over the past year, more than double the 89 incidents from the previous year. The agency attributed the alarming surge to increasing threats from state-sponsored actors, particularly Russia and China, as well as the proliferation of sophisticated ransomware gangs. The NCSC has urged UK businesses to treat cybersecurity as a matter of survival and to elevate cyber resilience to a board-level responsibility to combat the growing threat.",
      "tags": [
        "NCSC",
        "UK",
        "Threat Report",
        "State-Sponsored Hacking",
        "Ransomware",
        "Policy"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Threat Intelligence"
      ],
      "createdAt": "2025-10-06T15:00:00.000Z",
      "updatedAt": "2025-10-18T12:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "New analysis highlights supply chain vulnerabilities as a primary driver for the surge in cyberattacks, with third-party providers as key entry points.",
      "updateContent": "Further analysis of the NCSC's report emphasizes that supply chain vulnerabilities are a critical factor behind the doubling of nationally significant cyberattacks. Experts, including Simon Colvin of Pinsent Masons, point to third-party service providers like IT helpdesks and MSPs as common gateways for attackers to breach core business systems. A September 2025 survey by Cips supports this, revealing that 29% of procurement managers reported a supply chain partner had been attacked recently. This highlights a systemic risk, expanding the attack surface and necessitating enhanced vendor risk management, principle of least privilege, and network segmentation for mitigation."
    },
    {
      "id": "f7f77e15-89ba-4343-ae20-710a353bb65e",
      "slug": "clop-ransomware-gang-claims-breach-of-harvard-university",
      "headline": "Clop Ransomware Claims Harvard University Breach, Threatens Data Leak",
      "title": "Notorious Ransomware Group Clop Adds Harvard University to its Dark Web Leak Site",
      "severity": "high",
      "excerpt": "The prolific Russian-speaking ransomware group Clop has claimed responsibility for a cyberattack against Harvard University, adding the prestigious institution to its data leak site on October 12, 2025. The group, known for its 'big-game hunting' and exploitation of zero-day vulnerabilities, threatened to publish stolen data, stating that a torrent link would be available soon. The claim has not yet been confirmed by Harvard. Clop, also known as TA505, has a history of high-profile attacks using double-extortion tactics, including the mass exploitation of flaws in MOVEit Transfer and GoAnywhere MFT, which affected hundreds of organizations worldwide.",
      "tags": [
        "Ransomware",
        "Clop",
        "TA505",
        "Harvard University",
        "Data Leak",
        "Big Game Hunting",
        "Zero-Day"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Data Breach"
      ],
      "createdAt": "2025-10-12T15:00:00.000Z",
      "updatedAt": "2025-10-18T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "Clop ransomware adds Envoy Air as a new victim in its ongoing Oracle EBS campaign, confirming wider impact and specific vulnerabilities.",
      "updateContent": "Clop ransomware has claimed Envoy Air, an American Airlines subsidiary, as a new victim in its ongoing campaign targeting Oracle E-Business Suite (EBS) vulnerabilities. The attack, likely exploiting flaws like CVE-2023-21931, resulted in the exfiltration of business information and commercial contacts. Envoy Air confirmed no sensitive customer or personal data was compromised. This incident confirms the broader impact of Clop's Oracle EBS campaign, which was previously mentioned, and highlights the group's continued focus on exploiting enterprise software."
    },
    {
      "id": "2fb9c34f-89ef-4d9f-a17f-952f8c7a5912",
      "slug": "ransomware-attacks-surged-36-percent-in-q3-2025",
      "headline": "Ransomware Attacks Surge 36% in Q3 2025, Data Stolen in 96% of Cases",
      "title": "BlackFog Report: Ransomware Attacks Rose 36% in Q3 2025, Qilin Most Active Group",
      "severity": "high",
      "excerpt": "A new report from cybersecurity firm BlackFog reveals that publicly disclosed ransomware attacks surged by 36% year-over-year in the third quarter of 2025, setting a new record. The analysis highlights the near-universal adoption of double-extortion tactics, with data exfiltration occurring in 96% of all incidents. The Qilin ransomware group was identified as the most active publicly attributed gang. Healthcare remained the most targeted public sector, while manufacturing was the hardest-hit sector in non-disclosed attacks, underscoring the pervasive and growing threat of ransomware across all industries.",
      "tags": [
        "Ransomware",
        "Threat Intelligence",
        "Q3 2025",
        "BlackFog",
        "Qilin",
        "Data Exfiltration",
        "Healthcare"
      ],
      "categories": [
        "Ransomware",
        "Threat Intelligence",
        "Threat Actor"
      ],
      "createdAt": "2025-10-17T15:00:00.000Z",
      "updatedAt": "2025-10-18T12:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "New details on Q3 2025 ransomware surge: 1,510 unreported attacks, 527GB data stolen per victim, and 71% of disclosures lack root cause.",
      "updateContent": "The Black Fog Q3 2025 report update reveals an estimated 1,510 unreported ransomware attacks, significantly expanding the known scope of the threat. It highlights that manufacturing and services are the most impacted overall when considering these non-disclosed incidents. Additionally, the report details that ransomware gangs stole an average of 527.65 GB of data per victim and listed 449 victims on data leak sites. A concerning lack of transparency is noted, with 71% of victim notifications failing to specify the incident's root cause, complicating threat intelligence efforts. The update also provides specific D3FEND mappings for detection and mitigation strategies."
    },
    {
      "id": "02a78710-0d01-46eb-a99b-9aed6ffd560e",
      "slug": "ai-powered-phishing-emails-prove-4-5-times-more-effective-microsoft-report-finds",
      "headline": "Microsoft Report: AI-Generated Phishing Now 4.5x More Effective, Bypassing Traditional Defenses",
      "title": "AI-Powered Phishing Emails Achieve 54% Click-Through Rate, Microsoft's 2025 Digital Defense Report Reveals",
      "severity": "high",
      "excerpt": "According to the Microsoft 2025 Digital Defense Report, the effectiveness of phishing attacks has surged with the adoption of artificial intelligence. AI-generated emails now achieve a 54% click-through rate, 4.5 times higher than traditional methods. The report, covering July 2024 to June 2025, also highlights a 32% increase in identity-based attacks and the growing use of AI by nation-state actors for disinformation. Microsoft stresses that phishing-resistant MFA remains the most effective defense, blocking over 99% of identity attacks.",
      "tags": [
        "AI",
        "Phishing",
        "Microsoft",
        "Threat Intelligence",
        "MFA",
        "Identity Attack",
        "Infostealer",
        "ClickFix"
      ],
      "categories": [
        "Phishing",
        "Threat Intelligence",
        "Malware"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "updatedAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "4b0d5163-fb73-4372-9e0c-c5fd4952cdb9",
      "slug": "cisco-zero-day-cve-2025-20352-exploited-to-deploy-linux-rootkits-on-switches",
      "headline": "Cisco Zero-Day Flaw Actively Exploited to Implant Linux Rootkits on Network Switches",
      "title": "Cisco Zero-Day (CVE-2025-20352) Exploited in 'ZeroDisco' Operation to Deploy Linux Rootkits on Network Switches",
      "severity": "critical",
      "excerpt": "A critical zero-day vulnerability in Cisco IOS and IOS XE software, tracked as CVE-2025-20352, has been actively exploited in the wild to install Linux rootkits on network devices. The campaign, dubbed 'ZeroDisco' by Trend Micro, targeted Cisco 9400, 9300, and 3750G series switches. The attackers leveraged the SNMP stack overflow flaw for remote code execution after obtaining high-privilege credentials, implanting a fileless rootkit that could evade detection by disappearing after a reboot. Cisco has released patches and urges customers to update affected devices immediately.",
      "tags": [
        "Cisco",
        "Zero-Day",
        "CVE-2025-20352",
        "Rootkit",
        "Linux",
        "SNMP",
        "Vulnerability",
        "ZeroDisco",
        "IOS",
        "IOS XE"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Malware"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "updatedAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-20352",
        "CVE-2017-3881"
      ],
      "isUpdate": false
    },
    {
      "id": "ead32ea2-3e1d-4365-a1fb-5d0fe95236dc",
      "slug": "deloitte-agrees-to-6-3-million-settlement-for-rhode-island-data-breach",
      "headline": "Deloitte to Pay $6.3M in Settlement for Rhode Island Data Breach Affecting 640,000",
      "title": "Deloitte Reaches $6.3 Million Proposed Settlement in Class-Action Lawsuit Over Rhode Island Data Breach",
      "severity": "high",
      "excerpt": "Deloitte has agreed to a proposed $6.3 million class-action settlement related to a 2024 cyberattack that compromised the personal data of 640,000 Rhode Island residents—nearly half the state's population. The breach affected the state's 'RIBridges' social services system, which was managed by Deloitte. The incident resulted in significant disruption to state government services and the eventual leak of some compromised data on the dark web. This settlement is in addition to a previous $5 million payment Deloitte made to the state to cover breach-related expenses.",
      "tags": [
        "Data Breach",
        "Deloitte",
        "Rhode Island",
        "Settlement",
        "Class Action",
        "Government",
        "PII",
        "Dark Web"
      ],
      "categories": [
        "Data Breach",
        "Regulatory",
        "Policy and Compliance"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "updatedAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "b3592b17-d8af-4f58-8b45-3c01c8c441e9",
      "slug": "new-capi-backdoor-malware-targets-russian-auto-and-e-commerce-sectors",
      "headline": "New 'CAPI Backdoor' Malware Targets Russian Auto and E-Commerce Firms",
      "title": "New CAPI Backdoor Phishing Campaign Targets Russian Automobile and E-Commerce Industries",
      "severity": "medium",
      "excerpt": "A new cyberespionage campaign is targeting the Russian automobile and e-commerce sectors using a previously undocumented .NET malware known as 'CAPI Backdoor'. According to researchers at Seqrite Labs, the attack is initiated through phishing emails containing a ZIP archive with a malicious LNK file. The malware uses a living-off-the-land technique, executing via 'rundll32.exe', and establishes persistence through scheduled tasks and startup folder entries. CAPI Backdoor is designed to gather system information, check for antivirus products, and exfiltrate data to a C2 server.",
      "tags": [
        "CAPI Backdoor",
        "Malware",
        ".NET",
        "Phishing",
        "Cyber Espionage",
        "Russia",
        "LotL",
        "rundll32"
      ],
      "categories": [
        "Malware",
        "Phishing",
        "Threat Actor"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "updatedAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "afa8a3d8-4a04-4c2b-9648-74743c13bb28",
      "slug": "everest-ransomware-claims-collins-aerospace-breach-then-site-goes-offline",
      "headline": "Everest Ransomware Claims Collins Aerospace Hack; Leak Site Mysteriously Goes Offline",
      "title": "Everest Ransomware Group Takes Credit for Collins Aerospace Breach, Then Its Data Leak Site Goes Offline",
      "severity": "high",
      "excerpt": "The Everest ransomware group has claimed responsibility for the September 2025 cyberattack on Collins Aerospace, a major aviation and defense contractor. The attack caused widespread disruption, affecting check-in and boarding systems at major European airports like Heathrow and Brussels. Shortly after posting the claim on its dark web data leak site, the site became inaccessible, displaying a \"Fatal error\" message. This has fueled speculation about a potential law enforcement takedown or internal disruption within the ransomware group.",
      "tags": [
        "Everest",
        "Ransomware",
        "Collins Aerospace",
        "Aviation",
        "Supply Chain Attack",
        "Heathrow",
        "Cyberattack"
      ],
      "categories": [
        "Ransomware",
        "Cyberattack",
        "Supply Chain Attack"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "updatedAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "5f0b563c-bc1f-42b7-abaf-cd1098d10d5e",
      "slug": "critical-supply-chain-risk-uncovered-in-vscode-extension-marketplaces",
      "headline": "Massive Supply Chain Risk Found in VSCode Marketplace; 100+ Extensions Leaked Access Tokens",
      "title": "Critical Supply Chain Risk Uncovered in VSCode Extension Marketplaces, Potentially Affecting 150,000 Users",
      "severity": "critical",
      "excerpt": "Researchers at Wiz have discovered a significant supply chain risk in the popular VSCode and OpenVSX extension marketplaces. They found that publishers of over 100 extensions had inadvertently leaked their access tokens, which could have allowed attackers to hijack the extensions and distribute malware to more than 150,000 users. The research also uncovered over 550 exposed secrets within 500+ extensions, providing access to developer accounts on services like AWS, GitHub, and OpenAI, further highlighting the pervasive security risks in the software development ecosystem.",
      "tags": [
        "VSCode",
        "Supply Chain Attack",
        "Wiz",
        "Secrets Management",
        "DevSecOps",
        "GitHub",
        "Vulnerability"
      ],
      "categories": [
        "Supply Chain Attack",
        "Vulnerability",
        "Cloud Security"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "updatedAt": "2025-10-18T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}