{
  "pub_id": "pub-2025-10-30",
  "headline": "Microsoft Azure Outage Causes Global Chaos; CISA Warns of Actively Exploited WSUS Flaw",
  "summary": "This cybersecurity brief for October 30, 2025, covers a widespread Microsoft Azure outage triggered by a configuration error, a critical CISA alert for an actively exploited Windows Server vulnerability (CVE-2025-59287), and massive data breaches at government contractor Conduent and consulting giant EY. New threats include the 'Herodotus' Android malware and the 'logins[.]zip' infostealer, while the UK government considers a ransomware payment ban in response to escalating attacks.",
  "pub_date": "2025-10-30",
  "total_articles": 6,
  "articles": [
    {
      "id": "23575c55-2552-4311-8d24-ac6fdb3c3183",
      "slug": "uk-ncsc-reports-nationally-significant-cyber-attacks-doubled",
      "headline": "UK's NCSC Warns 'Nationally Significant' Cyber Attacks Have More Than Doubled",
      "title": "UK's NCSC Annual Review Shows Nationally Significant Cyber Incidents More Than Doubled to 204",
      "severity": "informational",
      "excerpt": "The UK's National Cyber Security Centre (NCSC) has released its 2025 Annual Review, revealing a stark increase in major cyber threats. The agency handled 204 'nationally significant' incidents in the past year, more than double the 89 from the previous year. Ransomware remains the most acute threat, particularly to the UK's Critical National Infrastructure (CNI). The report highlights a growing gap between the escalating threats from APTs and cybercriminals and the nation's collective defenses, prompting the NCSC to urge all UK businesses to make cyber resilience a board-level priority and adopt foundational security controls.",
      "tags": [
        "NCSC",
        "UK",
        "Cyberattack",
        "Ransomware",
        "Threat Intelligence",
        "Policy and Compliance",
        "CNI"
      ],
      "categories": [
        "Regulatory",
        "Policy and Compliance",
        "Ransomware"
      ],
      "createdAt": "2025-10-15T15:00:00.000Z",
      "updatedAt": "2025-10-30T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "UK government proposes ransomware payment ban for public sector/CNI and mandatory incident reporting following NCSC's report.",
      "updateContent": "Following the NCSC's 2025 Annual Review, which highlighted a doubling of 'nationally significant' cyberattacks, the UK government is consulting on new legislation. Key proposals include a targeted ban on ransomware payments for public sector bodies and Critical National Infrastructure operators, aiming to disrupt criminal business models. Additionally, mandatory incident reporting requirements are being considered to enhance national threat intelligence. This policy shift signifies a more aggressive stance against cyber threats, forcing affected organizations to bolster their preventative and recovery capabilities without relying on ransom payments, thereby increasing potential impact if unprepared."
    },
    {
      "id": "99e7814d-b9d2-4dc1-9144-80d1ad5e451e",
      "slug": "government-contractor-conduent-breach-exposes-data-of-10-million",
      "headline": "Conduent Data Breach: 10 Million+ Individuals' Personal & Medical Data Exposed",
      "title": "Government Services Contractor Conduent Confirms Data Breach Affecting Over 10 Million People",
      "severity": "high",
      "excerpt": "Conduent Business Services, a major contractor for U.S. government agencies, has disclosed a massive data breach impacting over 10 million individuals. The incident, which occurred between October 2024 and January 2025, involved an unauthorized third party gaining access to Conduent's network and exfiltrating files. The compromised data is highly sensitive, including names, Social Security numbers, medical information, and health insurance details. The breach has affected residents across numerous states, including Texas, Washington, and California, and has triggered a legal investigation by the law firm Edelson Lechtzin LLP into the company's data privacy practices.",
      "tags": [
        "Data Breach",
        "Conduent",
        "PII",
        "PHI",
        "Government Contractor",
        "Social Security Number",
        "Medical Data",
        "Cybersecurity"
      ],
      "categories": [
        "Data Breach",
        "Threat Intelligence",
        "Regulatory"
      ],
      "createdAt": "2025-10-30T15:00:00.000Z",
      "updatedAt": "2025-10-30T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "29c3083a-d410-4794-b8a1-d6721fc5d086",
      "slug": "dentsu-subsidiary-merkle-hit-by-cyberattack-exposing-data",
      "headline": "Ad Giant Dentsu's Subsidiary Merkle Hit by Cyberattack, Staff and Client Data Exposed",
      "title": "Dentsu Confirms Cyberattack on US Subsidiary Merkle Resulted in Data Exposure",
      "severity": "high",
      "excerpt": "Global advertising firm Dentsu has confirmed that its US-based customer experience management (CXM) subsidiary, Merkle, was the target of a cyberattack. The company detected 'abnormal activity' on Merkle's network and proactively shut down certain systems to contain the threat. An investigation has confirmed that the incident led to the exposure of both staff and sensitive client data. Merkle, a major player in the CXM industry, handles large volumes of customer data, making it a high-value target for threat actors. The full scope of the breach is still under investigation.",
      "tags": [
        "Dentsu",
        "Merkle",
        "Cyberattack",
        "Data Breach",
        "CXM",
        "Advertising",
        "Supply Chain Attack",
        "Incident Response"
      ],
      "categories": [
        "Cyberattack",
        "Data Breach",
        "Threat Intelligence"
      ],
      "createdAt": "2025-10-30T15:00:00.000Z",
      "updatedAt": "2025-10-30T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "9328e6c7-2d77-4d06-990b-91d72ef3bf32",
      "slug": "consulting-giant-ey-exposes-4tb-sql-database-to-internet",
      "headline": "EY Leaks 4TB+ SQL Database Packed with Corporate Secrets via Cloud Misconfiguration",
      "title": "EY Exposed 4TB+ Unencrypted SQL Database Backup to Public Internet",
      "severity": "critical",
      "excerpt": "Consulting giant EY (Ernst & Young) inadvertently exposed a massive, 4TB+ SQL Server backup file to the public internet due to a cloud storage misconfiguration. The unencrypted `.BAK` file, discovered by researchers at Neo Security, contained a treasure trove of highly sensitive internal data, including API keys, service account passwords, session tokens, and user credentials. The incident highlights the severe risks associated with cloud service misconfigurations, where tools designed for convenience can lead to catastrophic data exposure if not secured properly. Neo Security described the leak as equivalent to finding the 'master blueprint and physical keys to a vault.'",
      "tags": [
        "EY",
        "Ernst & Young",
        "Data Leak",
        "Data Breach",
        "Cloud Security",
        "Misconfiguration",
        "SQL Server",
        "Data Exposure"
      ],
      "categories": [
        "Data Breach",
        "Cloud Security",
        "Vulnerability"
      ],
      "createdAt": "2025-10-30T15:00:00.000Z",
      "updatedAt": "2025-10-30T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "165714b0-a561-464c-be3f-68ae74d06364",
      "slug": "incransom-gang-claims-20tb-data-theft-from-evolve-mortgage-services",
      "headline": "IncRansom Claims 20TB Data Heist from Evolve Mortgage Services",
      "title": "IncRansom Ransomware Group Targets Evolve Mortgage Services, Alleges 20TB Data Exfiltration",
      "severity": "high",
      "excerpt": "The 'incransom' ransomware group has claimed responsibility for a significant data breach at Evolve Mortgage Services, listing the company on its dark web leak site on October 30, 2025. The attackers allege they have stolen over 20 terabytes of data, including 2 terabytes of databases containing sensitive PII such as Social Security numbers, client IDs, and full credit histories dating back to 2016. The group is using a pure data-theft extortion model, threatening to leak the data after claiming the company refused to negotiate. This incident highlights the ongoing threat of data extortion attacks against the U.S. financial services sector.",
      "tags": [
        "IncRansom",
        "Ransomware",
        "Data Breach",
        "Evolve Mortgage Services",
        "Data Extortion",
        "Financial Services",
        "Dark Web"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Threat Actor"
      ],
      "createdAt": "2025-10-30T15:00:00.000Z",
      "updatedAt": "2025-10-30T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "99d6941b-eebe-4a9b-bd92-88d286917704",
      "slug": "new-logins-zip-infostealer-service-uses-browser-exploits-for-rapid-theft",
      "headline": "New 'logins[.]zip' Infostealer Claims 99% Credential Theft in 12 Seconds Using Zero-Days",
      "title": "'logins[.]zip' MaaS Infostealer Advertised with Chromium Zero-Day Exploits for Ultra-Fast Theft",
      "severity": "high",
      "excerpt": "A new Malware-as-a-Service (MaaS) infostealer named 'logins[.]zip' is being sold on the clear web, boasting incredible speed and efficiency. According to a report from Hudson Rock, its authors claim it can exfiltrate 99% of passwords and cookies from a victim's machine in under 12 seconds. The stealer's key selling point is its alleged use of two Chromium zero-day exploits, which allow it to steal credentials without needing admin rights. The service, sold for $150/month, provides a browser-based builder for creating polymorphic stubs and targets logins, cookies, payment cards, and crypto wallets.",
      "tags": [
        "logins.zip",
        "Infostealer",
        "MaaS",
        "Chromium",
        "Zero-Day",
        "Credential Theft",
        "Hudson Rock",
        "Malware"
      ],
      "categories": [
        "Malware",
        "Threat Intelligence",
        "Vulnerability"
      ],
      "createdAt": "2025-10-30T15:00:00.000Z",
      "updatedAt": "2025-10-30T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}