{
  "pub_id": "pub-2026-01-28",
  "headline": "Microsoft and Fortinet Race to Patch Actively Exploited Zero-Days as ShinyHunters Claims Massive Match Group Breach",
  "summary": "This 24-hour period saw urgent, out-of-band patches from major vendors to combat actively exploited zero-day vulnerabilities. Microsoft issued an emergency fix for a critical Office security bypass (CVE-2026-21509), while Fortinet scrambled to address a critical SSO authentication bypass (CVE-2026-24858), both of which were added to CISA's KEV catalog. In the data breach landscape, the ShinyHunters group claimed a massive breach of Match Group, allegedly compromising 10 million user records from Hinge and OkCupid. Additionally, SolarWinds disclosed five critical RCE and auth bypass flaws in its Web Help Desk, and the Illinois Department of Human Services confirmed a breach affecting 700,000 individuals.",
  "pub_date": "2026-01-28",
  "total_articles": 10,
  "articles": [
    {
      "id": "1b88d0ab-ac47-4148-a4b2-03fdd0cfd7d0",
      "slug": "mustang-panda-apt-enhances-stealth-with-signed-kernel-mode-rootkit",
      "headline": "Mustang Panda APT Deploys Signed Kernel-Mode Rootkit to Hide Backdoor",
      "title": "Chinese-Linked APT Mustang Panda Uses Signed Kernel-Mode Rootkit to Stealthily Deploy TONESHELL Backdoor",
      "severity": "high",
      "excerpt": "The Chinese-linked cyber-espionage group Mustang Panda has significantly upgraded its stealth capabilities by using a signed kernel-mode rootkit to deploy its TONESHELL backdoor. Observed by Kaspersky, the rootkit, named 'ProjectConfiguration.sys', is signed with a leaked digital certificate from a Chinese tech company. By operating at the kernel level as a minifilter driver, the rootkit can effectively hide its malicious processes, files, and registry keys from security software. This new technique allows the group to inject its TONESHELL backdoor directly into the memory of legitimate processes like 'svchost.exe', enhancing its persistence and evasion in attacks targeting government organizations in Southeast Asia.",
      "tags": [
        "Mustang Panda",
        "APT",
        "Rootkit",
        "Kernel-mode",
        "TONESHELL",
        "China",
        "Espionage",
        "Kaspersky"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Cyberattack"
      ],
      "createdAt": "2026-01-01T15:00:00.000Z",
      "updatedAt": "2026-01-28T10:00:00.000Z",
      "readingTime": 6,
      "isUpdate": true,
      "updateSummary": "Mustang Panda (HoneyMyte) expands campaign with updated CoolClient backdoor, new browser data stealers, and continued use of kernel-mode rootkits targeting Asian governments.",
      "updateContent": "The China-aligned Mustang Panda (HoneyMyte) APT group has expanded its cyber-espionage campaign targeting government, military, and NGOs in Southeast and East Asia. The group is now deploying an updated version of its 'CoolClient' backdoor and multiple new browser data stealers to harvest credentials and sensitive information. While continuing to leverage kernel-mode rootkits for stealth and persistence, the campaign also utilizes spear-phishing and infected USB drives for initial access, followed by DLL side-loading for execution. This indicates an evolution in the group's toolset and TTPs for long-term intelligence gathering."
    },
    {
      "id": "ae7a040c-29a0-43dc-9236-6f4438c1abc9",
      "slug": "illinois-dhs-data-breach-exposes-700000-residents",
      "headline": "Illinois DHS Exposes Data of 700,000 Residents in Massive Misconfiguration Breach",
      "title": "Illinois Department of Human Services Exposes Personal and Health Information of 705,000 Residents via Public Website",
      "severity": "high",
      "excerpt": "The Illinois Department of Human Services (IDHS) has disclosed a major data breach affecting approximately 705,000 state residents. The breach was caused by incorrect privacy settings on internal planning maps that were inadvertently made public on a mapping website for up to four years. The exposed data includes addresses, case numbers, and medical plan information for Medicaid recipients, and names, addresses, and case details for customers of the Division of Rehabilitation Services. The exposure, which constitutes a HIPAA violation, was discovered in September 2025 but only announced in January 2026. IDHS has since secured the data and implemented new policies to prevent a recurrence.",
      "tags": [
        "Data Breach",
        "Illinois",
        "IDHS",
        "Misconfiguration",
        "HIPAA",
        "PII",
        "PHI",
        "Government"
      ],
      "categories": [
        "Data Breach",
        "Regulatory",
        "Policy and Compliance"
      ],
      "createdAt": "2026-01-10T15:00:00.000Z",
      "updatedAt": "2026-01-28T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "New details reveal full names were exposed for Medicaid recipients, contradicting initial reports. The cause is now unclear, implying potential malicious activity, increasing severity.",
      "updateContent": "The Illinois Department of Human Services (IDHS) data breach, previously attributed to a server misconfiguration, now has an undisclosed cause, with the new report implying potential malicious activity by cybercriminals. Crucially, the updated information states that full names were exposed for over 672,000 Medicaid recipients, directly contradicting earlier reports that individual names were not included for this group. This significantly increases the risk of identity theft and fraud for affected individuals. The total number of affected residents remains around 700,000. The incident highlights the vulnerability of social service agencies to sophisticated threats."
    },
    {
      "id": "f3a8efd0-748b-4b5f-9728-012f47a59413",
      "slug": "fortinet-confirms-active-exploitation-of-forticloud-sso-bypass",
      "headline": "Fortinet Confirms Active Exploitation of FortiCloud SSO Bypass on Fully Patched FortiGate Firewalls",
      "title": "Fortinet Warns of Active Exploitation of FortiCloud SSO Bypass (CVE-2025-59718, CVE-2025-59719)",
      "severity": "critical",
      "excerpt": "Fortinet has confirmed that a critical Single Sign-On (SSO) authentication bypass vulnerability affecting FortiCloud is being actively exploited in the wild. The attacks, linked to CVE-2025-59718 and CVE-2025-59719, are reportedly successful even against fully patched FortiGate firewalls. Attackers are exploiting the flaw by sending specially crafted SAML messages to bypass authentication. Once inside, they are creating persistent administrative accounts, enabling VPN access, and exfiltrating firewall configurations. This allows for long-term persistence and deep network compromise. Customers are urged to review Fortinet's advisories and take immediate mitigation steps.",
      "tags": [
        "Fortinet",
        "FortiGate",
        "Vulnerability",
        "Authentication Bypass",
        "SSO",
        "SAML",
        "Zero-Day"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Patch Management"
      ],
      "createdAt": "2026-01-27T15:00:00.000Z",
      "updatedAt": "2026-01-28T00:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-59718",
        "CVE-2025-59719"
      ],
      "isUpdate": true,
      "updateSummary": "Fortinet disclosed and patched CVE-2026-24858, a critical FortiCloud SSO bypass actively exploited to hijack devices, bypassing previous patches. CISA added it to KEV.",
      "updateContent": "A new critical authentication bypass, CVE-2026-24858, has been disclosed in FortiCloud SSO. This vulnerability allows attackers with any FortiCloud account to gain unauthorized access to other customers' devices, and crucially, it bypasses patches for the previously reported CVE-2025-59718 and CVE-2025-59719. The flaw affects a broader range of products including FortiOS, FortiManager, FortiAnalyzer, FortiWeb, and FortiProxy. CISA has added CVE-2026-24858 to its Known Exploited Vulnerabilities (KEV) catalog, highlighting its active exploitation and severe risk. Fortinet temporarily disabled the SSO service for remediation and urges immediate patching and thorough investigation for compromise."
    },
    {
      "id": "74b1f102-f96f-41b3-8034-5c99209cecf4",
      "slug": "solarwinds-discloses-five-critical-flaws-in-web-help-desk-platform",
      "headline": "SolarWinds Discloses Five Critical RCE & Auth Bypass Flaws in Web Help Desk",
      "title": "SolarWinds Reveals Multiple Critical Vulnerabilities in Web Help Desk Platform, Including RCE and Auth Bypass",
      "severity": "critical",
      "excerpt": "SolarWinds has disclosed a set of five critical vulnerabilities in its Web Help Desk (WHD) platform, a tool used by over 300,000 organizations. The flaws include two unauthenticated remote code execution (RCE) vulnerabilities and two authentication bypasses, each with a CVSS score of 9.8. This incident highlights a troubling pattern of recurring patch failures, as one of the new flaws, CVE-2025-40553, is the second bypass of an original deserialization vulnerability (CVE-2024-28986) first patched in 2024. Given the critical nature of the flaws, organizations with internet-facing WHD instances are at extreme risk and must patch immediately.",
      "tags": [
        "SolarWinds",
        "Web Help Desk",
        "RCE",
        "authentication bypass",
        "CVE-2025-40553",
        "deserialization",
        "patch bypass"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2026-01-28T15:00:00.000Z",
      "updatedAt": "2026-01-28T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-40553",
        "CVE-2024-28986",
        "CVE-2025-26399"
      ],
      "cvssScore": 9.8,
      "isUpdate": false
    },
    {
      "id": "2be2a8a7-6a28-4345-8023-cc8a935720b6",
      "slug": "shinyhunters-claims-massive-data-breach-of-match-group-dating-apps",
      "headline": "ShinyHunters Claims Breach of 10M Match Group Users from Hinge & OkCupid",
      "title": "ShinyHunters Threat Group Claims Major Data Breach of Match Group, Affecting 10 Million Dating App Users",
      "severity": "high",
      "excerpt": "The notorious cybercrime group ShinyHunters has claimed responsibility for a major data breach impacting Match Group, the parent company of popular dating apps like Hinge, OkCupid, and Match.com. The group posted on a dark web forum that it has stolen over 10 million user records, and released a 1.7GB sample as proof. The data allegedly includes sensitive user information such as names, phone numbers, IP addresses, and match logs, as well as internal corporate documents. ShinyHunters asserts the data was exfiltrated from a third-party analytics provider, AppsFlyer, highlighting a potential supply chain attack vector.",
      "tags": [
        "ShinyHunters",
        "Match Group",
        "data breach",
        "Hinge",
        "OkCupid",
        "supply chain attack",
        "AppsFlyer"
      ],
      "categories": [
        "Data Breach",
        "Threat Actor",
        "Supply Chain Attack"
      ],
      "createdAt": "2026-01-28T15:00:00.000Z",
      "updatedAt": "2026-01-28T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "a1485461-2dd1-432a-8546-2ac16aa26552",
      "slug": "high-severity-flaws-in-n8n-workflow-platform-allow-rce",
      "headline": "Critical RCE Flaws in n8n Workflow Platform Put Thousands of Instances at Risk",
      "title": "High-Severity Vulnerabilities (CVE-2026-1470, CVE-2026-0863) in n8n Platform Allow Remote Code Execution",
      "severity": "critical",
      "excerpt": "Two new high-severity vulnerabilities have been discovered in the n8n workflow automation platform, a tool that often holds credentials to critical corporate systems. The most severe flaw, CVE-2026-1470, is a critical eval injection vulnerability (CVSS 9.9) that allows an authenticated attacker to bypass the expression sandbox and achieve full remote code execution. A second flaw, CVE-2026-0863 (CVSS 8.5), allows for a similar sandbox escape in the Python execution environment. A compromise could provide an attacker with a 'skeleton key' to an organization's infrastructure. This news is compounded by data showing over 39,000 n8n instances remain unpatched for a previous critical flaw.",
      "tags": [
        "n8n",
        "RCE",
        "sandbox escape",
        "CVE-2026-1470",
        "CVE-2026-0863",
        "workflow automation",
        "vulnerability"
      ],
      "categories": [
        "Vulnerability",
        "Cloud Security",
        "Patch Management"
      ],
      "createdAt": "2026-01-28T15:00:00.000Z",
      "updatedAt": "2026-01-28T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2026-1470",
        "CVE-2026-0863",
        "CVE-2026-21858"
      ],
      "cvssScore": 9.9,
      "isUpdate": false
    },
    {
      "id": "7d58a690-c5cc-4c2b-8b4e-45e32ca91e87",
      "slug": "malicious-python-packages-on-pypi-deliver-rat",
      "headline": "Malicious PyPI Packages `spellcheckerpy` & `spellcheckpy` Deliver RAT via Hidden Payload",
      "title": "Malicious Python Packages on PyPI Deliver Remote Access Trojan via Hidden Payload",
      "severity": "high",
      "excerpt": "A software supply chain attack has been uncovered on the Python Package Index (PyPI), involving two malicious packages named `spellcheckerpy` and `spellcheckpy`. Downloaded over 1,000 times, the packages contained a hidden, dormant payload. A later version update activated the malware, which was designed to fingerprint the compromised developer's system and deploy a Remote Access Trojan (RAT). The attack was cleverly concealed, with the malicious code base64-encoded and hidden inside a Basque language dictionary file. The C2 domain used has been linked to a hosting provider known to service nation-state actors, suggesting a potentially sophisticated adversary.",
      "tags": [
        "PyPI",
        "Python",
        "supply chain attack",
        "malware",
        "RAT",
        "typosquatting"
      ],
      "categories": [
        "Supply Chain Attack",
        "Malware",
        "Threat Intelligence"
      ],
      "createdAt": "2026-01-28T15:00:00.000Z",
      "updatedAt": "2026-01-28T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "2b2b6402-24d6-48e1-bbc7-aff154a7d8d2",
      "slug": "us-indicts-31-more-in-international-atm-jackpotting-scheme",
      "headline": "US Indicts 31 More in ATM Jackpotting Ring Linked to Tren de Aragua Gang",
      "title": "U.S. Indicts 31 Additional Individuals in International 'ATM Jackpotting' Conspiracy",
      "severity": "medium",
      "excerpt": "A U.S. federal grand jury has indicted an additional 31 individuals for their participation in a widespread 'ATM jackpotting' conspiracy, bringing the total number of defendants to 87. The sophisticated scheme involved using malware to force ATMs to dispense large sums of cash. Many of the newly charged individuals are Venezuelan and Colombian nationals, including several identified members of the transnational criminal gang Tren de Aragua (TdA) who are in the U.S. illegally. The case highlights the growing convergence of organized crime and specialized cybercrime tactics.",
      "tags": [
        "ATM jackpotting",
        "Tren de Aragua",
        "bank fraud",
        "cybercrime",
        "indictment",
        "malware"
      ],
      "categories": [
        "Threat Actor",
        "Cyberattack",
        "Malware"
      ],
      "createdAt": "2026-01-28T15:00:00.000Z",
      "updatedAt": "2026-01-28T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "63da0e0d-10f4-4fc3-98a7-3a7077b85bf0",
      "slug": "nova-ransomware-group-claims-attack-on-kpmg-netherlands",
      "headline": "Nova Ransomware Group Claims Cyberattack on KPMG Netherlands, Sets 10-Day Deadline",
      "title": "Nova Ransomware Group Claims Attack on KPMG Netherlands, Threatens Data Leak",
      "severity": "high",
      "excerpt": "The Nova ransomware group has claimed responsibility for a cyberattack against the Netherlands division of global professional services firm KPMG. The claim, which appeared on ransomware monitoring services on January 23, 2026, alleges that the group successfully breached KPMG's systems and exfiltrated sensitive data. In a classic double-extortion tactic, the Nova group has reportedly set a ten-day deadline for KPMG Netherlands to enter into ransom negotiations before they potentially leak the stolen data. KPMG has not yet publicly confirmed the attack.",
      "tags": [
        "ransomware",
        "Nova ransomware",
        "KPMG",
        "data breach",
        "double extortion"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Data Breach"
      ],
      "createdAt": "2026-01-28T15:00:00.000Z",
      "updatedAt": "2026-01-28T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "4432e63a-7cc4-4f2f-95ef-74b4f4cc736c",
      "slug": "stanley-malware-as-a-service-for-malicious-chrome-extensions-emerges",
      "headline": "'Stanley' MaaS Sells Malicious Chrome Extensions Guaranteed for Web Store Publication",
      "title": "'Stanley' Malware-as-a-Service for Malicious Chrome Extensions Emerges on Cybercrime Forums",
      "severity": "medium",
      "excerpt": "A new Malware-as-a-Service (MaaS) platform named 'Stanley' has appeared on Russian-language cybercrime forums, specializing in the sale of malicious Google Chrome extensions. A key feature of the service is a guarantee that the malicious extensions will be successfully published to the official Chrome Web Store, lending them an air of legitimacy. The primary purpose of these extensions is to facilitate phishing and credential theft by spoofing legitimate websites. The emergence of 'as-a-service' models like Stanley significantly lowers the barrier to entry for less sophisticated cybercriminals to launch effective attacks.",
      "tags": [
        "Malware-as-a-Service",
        "MaaS",
        "Stanley",
        "Chrome extension",
        "phishing",
        "cybercrime"
      ],
      "categories": [
        "Malware",
        "Phishing",
        "Threat Intelligence"
      ],
      "createdAt": "2026-01-28T15:00:00.000Z",
      "updatedAt": "2026-01-28T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}