{
  "pub_id": "pub-2026-01-08",
  "headline": "Critical RCE Flaws in n8n and D-Link Routers Under Active Exploitation; CISA Issues Urgent Warnings",
  "summary": "This cybersecurity brief for January 8, 2026, covers a series of critical vulnerabilities and active threats. Headlining the news are two maximum-severity (CVSS 10.0) remote code execution flaws in the n8n workflow automation platform, one unauthenticated and one authenticated, prompting urgent patching. Concurrently, a zero-day RCE is being actively exploited in end-of-life D-Link routers, with no patch forthcoming. CISA has added exploited flaws in HPE OneView and legacy PowerPoint to its KEV catalog. Major incidents include a data breach claim against broadband provider Brightspeed by the Crimson Collective, a ransomware attack on claims giant Sedgwick by TridentLocker, and a large-scale SEO poisoning campaign by the Black Cat group. Additionally, reports highlight novel phishing tactics abusing Microsoft 365 and Google Cloud services, and malicious Chrome extensions stealing AI chat data from nearly a million users.",
  "pub_date": "2026-01-08",
  "total_articles": 5,
  "articles": [
    {
      "id": "7d8593e3-fc10-4ab6-814f-b92655985fa5",
      "slug": "claims-giant-sedgwick-hit-by-tridentlocker-ransomware-group",
      "headline": "TridentLocker Ransomware Strikes Claims Giant Sedgwick in Breach-then-Encrypt Attack",
      "title": "Sedgwick Becomes Latest Victim of TridentLocker Ransomware, Highlighting Modern Data Exfiltration and Extortion Tactics",
      "severity": "high",
      "excerpt": "Global claims management leader Sedgwick has reportedly been targeted by the TridentLocker ransomware group. The attack follows the increasingly common 'breach-then-encrypt' model, where threat actors first exfiltrate sensitive data before deploying ransomware to encrypt systems. TridentLocker claims to have stolen data from systems supporting Sedgwick's government services operations, a move designed to maximize pressure for a ransom payment. This incident underscores the evolution of ransomware from a simple availability attack to a complex data breach and extortion scheme. For service providers like Sedgwick, which manage vast amounts of third-party regulated data, such an attack poses significant operational, financial, and reputational risks.",
      "tags": [
        "Ransomware",
        "TridentLocker",
        "Sedgwick",
        "Data Breach",
        "Double Extortion",
        "Data Exfiltration",
        "Cyberattack"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Cyberattack"
      ],
      "createdAt": "2026-01-07T15:00:00.000Z",
      "updatedAt": "2026-01-08T12:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "Sedgwick confirms TridentLocker ransomware attack on its Government Solutions subsidiary, affecting an isolated file transfer system.",
      "updateContent": "Sedgwick has officially confirmed the cybersecurity incident, stating that the TridentLocker ransomware attack specifically targeted its Sedgwick Government Solutions subsidiary. The breach was reportedly contained to an isolated file transfer system used for government client services. This confirmation solidifies earlier reports of data exfiltration from systems supporting government operations, emphasizing the risk to sensitive public sector data handled by third-party contractors. Sedgwick is investigating the scope and has notified law enforcement."
    },
    {
      "id": "22dec23c-7f08-412c-bfe5-1a63782f1d8e",
      "slug": "active-exploitation-of-zero-day-flaw-in-end-of-life-d-link-routers",
      "headline": "Zero-Day in End-of-Life D-Link Routers Actively Exploited; No Patch Will Be Released",
      "title": "Unpatched Zero-Day Vulnerability (CVE-2026-0625) in Discontinued D-Link Routers Under Active Attack",
      "severity": "critical",
      "excerpt": "A critical zero-day command injection vulnerability, CVE-2026-0625, is being actively exploited in the wild, affecting multiple end-of-life (EOL) D-Link DSL router models. The flaw, rated 9.3 on the CVSS scale, allows unauthenticated remote attackers to execute arbitrary code by sending a malicious request to the 'dnscfg.cgi' endpoint. Exploitation has been observed since at least November 2025, with attackers using it for 'DNSChanger' style attacks. D-Link has confirmed the vulnerability but stated that since the affected products are discontinued, no security patches will be issued. Owners are strongly advised to immediately retire and replace the vulnerable devices to prevent compromise.",
      "tags": [
        "Zero-Day",
        "RCE",
        "D-Link",
        "CVE-2026-0625",
        "EOL",
        "Unpatched",
        "DNSChanger",
        "IoT"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "IoT Security"
      ],
      "createdAt": "2026-01-08T15:00:00.000Z",
      "updatedAt": "2026-01-08T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2026-0625"
      ],
      "cvssScore": 9.3,
      "isUpdate": false
    },
    {
      "id": "8f06bd5e-9d1d-48fa-9f4f-8093b00fc94d",
      "slug": "black-cat-group-uses-seo-poisoning-and-fake-notepad-sites-in-major-campaign",
      "headline": "Black Cat Group Targets Notepad++ Users in Massive SEO Poisoning Campaign",
      "title": "Black Cat Cybercrime Group Linked to SEO Poisoning Campaign Distributing Malware via Fake Notepad++ Sites",
      "severity": "high",
      "excerpt": "The notorious Black Cat (ALPHV) cybercrime group is behind a large-scale SEO poisoning campaign that uses malicious advertisements and manipulated search results to distribute an information-stealing backdoor. The campaign targets users searching for popular software like Notepad++. Victims are lured to convincing fake download sites, which redirect them to a GitHub clone to download a trojanized installer. The malware uses DLL side-loading to execute its payload, which is capable of stealing browser credentials, cookies, and keystrokes. A report from CNCERT/CC and ThreatBook revealed the campaign was highly effective, compromising nearly 278,000 hosts in China in just two weeks.",
      "tags": [
        "Black Cat",
        "ALPHV",
        "SEO Poisoning",
        "Malware",
        "Notepad++",
        "DLL Side-Loading",
        "InfoStealer"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Phishing"
      ],
      "createdAt": "2026-01-08T15:00:00.000Z",
      "updatedAt": "2026-01-08T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "df83a10b-267a-4cd3-8ac6-c8bbb4f76255",
      "slug": "broadband-provider-brightspeed-investigates-breach-claim-by-crimson-collective",
      "headline": "Brightspeed Investigates Breach Claim by Crimson Collective Affecting 1M+ Customers",
      "title": "US Broadband Provider Brightspeed Investigating Data Breach Allegations from 'Crimson Collective' Extortion Group",
      "severity": "high",
      "excerpt": "US fiber broadband provider Brightspeed is actively investigating a data breach claim made by the 'Crimson Collective' extortion group. The threat actors allege they have stolen a massive dataset containing the personally identifiable information (PII) of over one million customers, including names, addresses, phone numbers, and some payment data. The group, known for targeting AWS cloud environments, has threatened to leak the data if their demands are not met and has reportedly offered the dataset for sale. Brightspeed serves 20 states and has acknowledged the claim, stating it is working to determine its validity. The incident follows a pattern for Crimson Collective, which previously breached Red Hat.",
      "tags": [
        "Data Breach",
        "Extortion",
        "Crimson Collective",
        "Brightspeed",
        "Cloud Security",
        "AWS"
      ],
      "categories": [
        "Data Breach",
        "Threat Actor",
        "Cloud Security"
      ],
      "createdAt": "2026-01-08T15:00:00.000Z",
      "updatedAt": "2026-01-08T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "972af317-29e4-45ca-9c42-146c90ae35d7",
      "slug": "cisa-issues-advisory-for-rce-flaw-in-hitachi-energy-asset-suite",
      "headline": "CISA Warns of RCE Flaw in Hitachi Energy ICS Product",
      "title": "CISA Publishes Advisory for Remote Code Execution Vulnerability in Hitachi Energy Asset Suite",
      "severity": "medium",
      "excerpt": "The US Cybersecurity and Infrastructure Security Agency (CISA) has issued an Industrial Control Systems (ICS) advisory, ICSA-26-008-01, for a vulnerability in Hitachi Energy's Asset Suite. The flaw, CVE-2025-10492, could allow a remote attacker to achieve remote code execution (RCE). The vulnerability stems from an insecure third-party component, Jasper Report, used within the Asset Suite product, which is deployed in the energy sector. While there are no reports of active exploitation, CISA and Hitachi Energy are urging customers to apply mitigations and follow security best practices, such as ensuring control systems are not exposed to the internet.",
      "tags": [
        "CISA",
        "ICS",
        "OT",
        "Vulnerability",
        "RCE",
        "Hitachi Energy",
        "CVE-2025-10492",
        "Energy Sector"
      ],
      "categories": [
        "Industrial Control Systems",
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2026-01-08T15:00:00.000Z",
      "updatedAt": "2026-01-08T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-10492"
      ],
      "isUpdate": false
    }
  ]
}