{
  "pub_id": "pub-2025-11-06",
  "headline": "AI-Powered Malware Emerges as Critical Zero-Click Flaw Hits Billions of Android Devices",
  "summary": "This cybersecurity brief for November 6, 2025, covers a landmark shift in the threat landscape with Google's discovery of AI-powered malware like PROMPTFLUX, which uses LLMs to mutate its own code. Concurrently, a critical zero-click RCE vulnerability (CVE-2025-48593) was disclosed for Android versions 13-16, posing a severe risk to billions of users. Other major incidents include the Qilin ransomware gang's claimed breach of Habib Bank AG Zurich, a cyberattack on the U.S. Congressional Budget Office, and a supply chain attack by Cl0p impacting The Washington Post via an Oracle zero-day.",
  "pub_date": "2025-11-06",
  "total_articles": 7,
  "articles": [
    {
      "id": "0bac5277-e306-42d3-af32-68644f35a00a",
      "slug": "cisa-adds-actively-exploited-gladinet-cwp-flaws-to-kev-catalog",
      "headline": "CISA Adds Actively Exploited Gladinet and CWP Flaws to KEV Catalog",
      "title": "CISA Adds Two Actively Exploited Vulnerabilities in Gladinet and Control Web Panel to KEV Catalog",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added two new vulnerabilities to its Known Exploited Vulnerabilities (KEV) catalog, confirming they are under active attack. The flaws include an information disclosure bug in Gladinet CentreStack/Triofox (CVE-2025-11371) and an OS command injection vulnerability in CWP Control Web Panel (CVE-2025-48703). Under Binding Operational Directive (BOD) 22-01, federal agencies are mandated to patch these vulnerabilities by a specified deadline, and CISA strongly urges all organizations to prioritize remediation to defend against these active threats.",
      "tags": [
        "CISA",
        "KEV",
        "BOD 22-01",
        "Command Injection",
        "Information Disclosure",
        "Gladinet",
        "CWP"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Threat Intelligence"
      ],
      "createdAt": "2025-11-05T15:00:00.000Z",
      "updatedAt": "2025-11-06T00:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-11371",
        "CVE-2025-48703"
      ],
      "isUpdate": true,
      "updateSummary": "New technical details for CWP (CVE-2025-48703) RCE vulnerability, including specific endpoint, parameter, and authentication bypass method, with federal patch deadline set for Nov 25.",
      "updateContent": "Further analysis of CVE-2025-48703 in Control Web Panel reveals specific exploitation details. The OS command injection occurs in the file manager's `changePerm` endpoint via the `t_total` parameter. An authentication bypass is possible by knowing a valid non-root username. This allows remote code execution (RCE) on vulnerable servers. CISA has set a firm deadline of November 25, 2025, for federal agencies to patch CWP versions prior to `0.9.8.1205`."
    },
    {
      "id": "3dc5c02d-19a6-49a1-a637-8c6e4ff6aae3",
      "slug": "us-congressional-budget-office-confirms-cybersecurity-breach",
      "headline": "U.S. Congressional Budget Office Breached by Suspected Foreign Actor",
      "title": "U.S. Congressional Budget Office Confirms Cyberattack; Sensitive Legislative and Economic Data Potentially Exposed",
      "severity": "high",
      "excerpt": "The U.S. Congressional Budget Office (CBO), the nonpartisan agency that provides economic analysis to Congress, confirmed on November 6, 2025, that it suffered a significant cybersecurity breach. The attack is suspected to be the work of a foreign government, raising concerns about espionage and the potential exposure of sensitive, pre-decisional information. Data at risk includes confidential communications between lawmakers and CBO analysts, as well as early drafts of legislative cost analyses. The CBO has taken steps to contain the incident and is investigating the full scope of the compromise.",
      "tags": [
        "Government",
        "Data Breach",
        "Cyberattack",
        "Espionage",
        "Nation-State",
        "CBO"
      ],
      "categories": [
        "Data Breach",
        "Cyberattack",
        "Regulatory"
      ],
      "createdAt": "2025-11-06T15:00:00.000Z",
      "updatedAt": "2025-11-06T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "d6d2d5b5-6c5c-4b7e-aae3-ee5fe779b55d",
      "slug": "cisco-warns-of-new-dos-attacks-targeting-secure-firewalls",
      "headline": "Cisco Warns of New DoS Attacks Actively Exploiting Firewall Flaws",
      "title": "Cisco Issues Warning on New Attack Variant Targeting Secure Firewall ASA and FTD Devices via CVE-2025-20333 and CVE-2025-20362",
      "severity": "critical",
      "excerpt": "Cisco has issued an urgent warning about a new attack variant actively targeting its Secure Firewall products. Threat actors are chaining two previously disclosed vulnerabilities, CVE-2025-20333 and CVE-2025-20362, to cause a denial-of-service (DoS) condition on unpatched Adaptive Security Appliance (ASA) and Firewall Threat Defense (FTD) devices. These same flaws were exploited as zero-days in September 2025 and are listed in CISA's KEV catalog. Cisco strongly recommends that all customers immediately upgrade to patched software versions to prevent network outages and potential device compromise.",
      "tags": [
        "Cisco",
        "Firewall",
        "DoS",
        "Vulnerability",
        "CVE-2025-20333",
        "CVE-2025-20362",
        "KEV",
        "Zero-Day"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Patch Management"
      ],
      "createdAt": "2025-11-06T15:00:00.000Z",
      "updatedAt": "2025-11-06T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-20333",
        "CVE-2025-20362"
      ],
      "isUpdate": false
    },
    {
      "id": "801119cd-6ff1-4a42-9161-4a1cef7a7f0f",
      "slug": "critical-sql-injection-vulnerability-cve-2025-64459-in-django",
      "headline": "Critical SQL Injection Flaw in Django Framework Puts Web Apps at Risk",
      "title": "Django Patches Critical SQL Injection Vulnerability (CVE-2025-64459) with 9.1 CVSS Score",
      "severity": "critical",
      "excerpt": "The Django project has released urgent security updates to patch a critical SQL injection vulnerability, CVE-2025-64459, rated 9.1 on the CVSS scale. The flaw affects Django versions 4.2, 5.1, 5.2, and the 6.0 beta. It allows an attacker to manipulate database queries by passing a specially crafted dictionary to certain ORM methods, potentially leading to unauthorized data access, modification, or authentication bypass. Due to the widespread use of Django and the low complexity of the attack, developers are strongly urged to upgrade to the patched versions (4.2.26, 5.1.14, 5.2.8) immediately.",
      "tags": [
        "Django",
        "SQL Injection",
        "Vulnerability",
        "CVE-2025-64459",
        "Python",
        "Web Security",
        "Patch Management"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Threat Intelligence"
      ],
      "createdAt": "2025-11-06T15:00:00.000Z",
      "updatedAt": "2025-11-06T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-64459",
        "CVE-2025-64458"
      ],
      "cvssScore": 9.1,
      "isUpdate": false
    },
    {
      "id": "2c64cfe8-b71f-4633-a01a-86dcd142ab8c",
      "slug": "washington-post-confirms-victim-of-clop-oracle-supply-chain-attack",
      "headline": "Washington Post Confirms Breach in Cl0p's Oracle Supply Chain Attack",
      "title": "The Washington Post Acknowledges Impact from Cl0p Ransomware Campaign Exploiting Oracle E-Business Suite Zero-Day",
      "severity": "high",
      "excerpt": "The Washington Post confirmed on November 6, 2025, that it was a victim of the widespread supply chain attack orchestrated by the Cl0p ransomware gang. The attack exploited a zero-day vulnerability in Oracle's E-Business Suite (EBS), a widely used enterprise software platform. This confirmation came after Cl0p added the newspaper to its dark web leak site, a classic extortion tactic. The incident highlights the significant risk of supply chain attacks, where a single vulnerability in a trusted third-party vendor's software can lead to the compromise of hundreds of high-profile organizations.",
      "tags": [
        "Cl0p",
        "Ransomware",
        "Supply Chain Attack",
        "Oracle",
        "Zero-Day",
        "Data Breach",
        "The Washington Post"
      ],
      "categories": [
        "Supply Chain Attack",
        "Ransomware",
        "Data Breach"
      ],
      "createdAt": "2025-11-06T15:00:00.000Z",
      "updatedAt": "2025-11-06T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "eb960242-3ca7-4f9f-b1c5-a168a99e2b7d",
      "slug": "zscaler-report-239-malicious-android-apps-on-google-play-downloaded-42-million-times",
      "headline": "Zscaler: 239 Malicious Apps on Google Play Downloaded 42 Million Times",
      "title": "Zscaler ThreatLabz 2025 Report Reveals 67% Surge in Android Malware and Rise in OT Attacks",
      "severity": "medium",
      "excerpt": "A new report from Zscaler's ThreatLabz, published November 5, 2025, reveals a dramatic 67% year-over-year increase in Android malware. Researchers identified 239 malicious applications that successfully bypassed Google Play Store security, amassing a collective 42 million downloads before being removed. These apps often masqueraded as legitimate productivity 'Tools' to trick users. The report also highlights a dangerous trend in attacks against critical infrastructure, with the energy sector seeing a 387% surge in IoT/OT attacks, and significant increases in transportation and healthcare as well.",
      "tags": [
        "Android",
        "Malware",
        "Google Play",
        "Threat Intelligence",
        "Zscaler",
        "OT Security",
        "ICS"
      ],
      "categories": [
        "Threat Intelligence",
        "Malware",
        "Mobile Security"
      ],
      "createdAt": "2025-11-06T15:00:00.000Z",
      "updatedAt": "2025-11-06T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "9f3033b9-2e9b-449a-bf79-01abaa87f9e2",
      "slug": "cybercriminals-hijack-digital-logistics-for-physical-cargo-theft",
      "headline": "Hackers Hijack Logistics Systems to Orchestrate Physical Cargo Heists",
      "title": "Reports Detail Rise in Cyber-Enabled Cargo Theft via Compromise of Freight and Logistics Companies",
      "severity": "high",
      "excerpt": "A new and growing form of hybrid crime is targeting the supply chain, where cybercriminals infiltrate freight and logistics companies to facilitate physical cargo theft. According to recent reports, threat actors compromise carrier systems, often using legitimate Remote Monitoring and Management (RMM) tools like ScreenConnect. Once inside, they manipulate digital 'load boards' to bid on and win real shipments. They then reroute the cargo to a location controlled by organized crime partners, leading to the theft of entire truckloads of goods. This trend highlights a critical vulnerability where the digital transformation of the logistics industry is being exploited to cause billions in real-world losses.",
      "tags": [
        "Cargo Theft",
        "Logistics",
        "Supply Chain",
        "Cyberattack",
        "RMM",
        "Social Engineering"
      ],
      "categories": [
        "Cyberattack",
        "Supply Chain Attack",
        "Threat Intelligence"
      ],
      "createdAt": "2025-11-06T15:00:00.000Z",
      "updatedAt": "2025-11-06T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    }
  ]
}