{
  "pub_id": "pub-2025-11-27",
  "headline": "Ransomware Cripples US Emergency Alerts and London Councils; Critical Flaws in Azure and Oracle Under Active Attack",
  "summary": "This cybersecurity brief for November 26-27, 2025, covers a series of high-impact ransomware attacks and critical vulnerability disclosures. The Inc Ransom group disrupted the CodeRED emergency alert system across the U.S., while a separate attack crippled services for three London councils. The Akira ransomware gang claimed attacks on five North American firms. Concurrently, CISA issued warnings for actively exploited vulnerabilities in Oracle Identity Manager (CVE-2025-61757) and spyware targeting messaging apps. A critical CVSS 10.0 authentication bypass flaw (CVE-2025-49752) was also discovered in Microsoft's Azure Bastion service, highlighting significant risks in both public infrastructure and cloud environments.",
  "pub_date": "2025-11-27",
  "total_articles": 6,
  "articles": [
    {
      "id": "16b24639-1d98-4c4d-96b3-e6059bfa309c",
      "slug": "ransomware-attack-cripples-asahi-breweries-operations-ahead-of-peak-season",
      "headline": "Asahi Breweries Crippled by Ransomware Attack, Shipments Plummet to 10% Ahead of Peak Holiday Season",
      "title": "Ransomware Attack on Asahi Breweries Disrupts Supply Chain, Forcing Manual Operations and Delaying Earnings Report",
      "severity": "high",
      "excerpt": "Japan's largest brewer, Asahi Group Holdings Ltd., is facing severe operational paralysis more than a month after a devastating ransomware attack. The attack disabled the company's core order and shipment management system, forcing a regression to manual processes like phone calls and faxes. As a result, shipments are at only 10% of normal levels, a critical blow as the company enters its busiest sales month. The incident, which has also forced Asahi to postpone its Q3 earnings report, highlights the extreme vulnerability of complex supply chains and legacy IT systems to modern cyber threats.",
      "tags": [
        "Ransomware",
        "Asahi",
        "Japan",
        "Supply Chain",
        "Manufacturing",
        "Cyberattack"
      ],
      "categories": [
        "Ransomware",
        "Cyberattack",
        "Supply Chain Attack"
      ],
      "createdAt": "2025-11-12T15:00:00.000Z",
      "updatedAt": "2025-11-27T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "Asahi Group's September 2025 ransomware attack attributed to Qilin group. Ongoing production cuts, product shortages, and market share loss persist.",
      "updateContent": "The ransomware attack on Asahi Group Holdings, now attributed to the Qilin group, occurred in September 2025. Reports from November 27, 2025, confirm the company is still experiencing severe operational and financial consequences. The incident has forced ongoing production cuts, leading to product shortages and a significant loss of market share to competitors. The attack crippled manufacturing, supply chain, and communication systems, necessitating a temporary return to manual processes like fax machines, highlighting the deep impact on both IT and OT environments."
    },
    {
      "id": "e77b6746-4909-40b0-b35f-52701b3a164d",
      "slug": "critical-azure-bastion-flaw-cve-2025-49752-allows-complete-cloud-takeover",
      "headline": "Critical 10.0 CVSS Flaw in Azure Bastion Allows Full Cloud Takeover",
      "title": "Microsoft Patches Critical Authentication Bypass Vulnerability (CVE-2025-49752) in Azure Bastion",
      "severity": "critical",
      "excerpt": "Microsoft has patched a critical authentication bypass vulnerability, CVE-2025-49752, in its Azure Bastion service. The flaw, which scores a perfect 10.0 on the CVSS scale, could allow a remote, unauthenticated attacker to gain administrative control over all virtual machines connected via a vulnerable Bastion host. The vulnerability is a capture-replay flaw, where an attacker can intercept and reuse authentication tokens. All Azure Bastion deployments created before the patch on November 20, 2025, are considered vulnerable, and customers are urged to ensure their instances are updated.",
      "tags": [
        "CVE-2025-49752",
        "Azure",
        "Microsoft",
        "Azure Bastion",
        "Vulnerability",
        "Authentication Bypass",
        "CVSS 10",
        "Cloud Security"
      ],
      "categories": [
        "Vulnerability",
        "Cloud Security",
        "Patch Management"
      ],
      "createdAt": "2025-11-22T15:00:00.000Z",
      "updatedAt": "2025-11-27T12:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-49752"
      ],
      "cvssScore": 10,
      "isUpdate": true,
      "updateSummary": "Additional detection methods and remediation steps for CVE-2025-49752, including NSG flow logs and zero-trust principles.",
      "updateContent": "New details for CVE-2025-49752 include monitoring Azure Network Security Group (NSG) Flow Logs and VM login events (Windows Event ID 4624/Linux auth.log) for suspicious activity. Remediation advice now emphasizes restricting access with NSGs and implementing zero-trust principles, alongside verifying patch status and auditing. The vulnerability was formally disclosed on November 27, 2025, confirming the timeline of the critical flaw."
    },
    {
      "id": "c98f92b7-ff83-4d80-85e1-6fee65a86ced",
      "slug": "coordinated-cyberattack-disrupts-services-for-three-london-councils",
      "headline": "Major Cyberattack Hits Three London Councils, Crippling Public Services",
      "title": "Shared IT Systems for Three London Boroughs Taken Offline by Coordinated Cyberattack, Affecting Over 500,000 Residents",
      "severity": "high",
      "excerpt": "A major cyber incident was declared on November 26, 2025, after a coordinated attack struck the shared IT infrastructure of three London councils: the Royal Borough of Kensington and Chelsea (RBKC), Westminster City Council (WCC), and the London Borough of Hammersmith and Fulham (LBHF). The attack disrupted essential services, including phone lines, for over half a million residents. The councils, which operate under a joint IT arrangement, were forced to activate emergency protocols to maintain critical functions. The UK's National Cyber Security Centre (NCSC) is assisting with the investigation. While the nature of the attack is unconfirmed, experts suspect it is a ransomware incident, potentially targeting a shared managed service provider (MSP), raising fears of a significant data breach involving sensitive citizen information.",
      "tags": [
        "London",
        "Council",
        "Government",
        "Ransomware",
        "MSP",
        "Supply Chain Attack",
        "NCSC"
      ],
      "categories": [
        "Cyberattack",
        "Ransomware",
        "Supply Chain Attack"
      ],
      "createdAt": "2025-11-27T15:00:00.000Z",
      "updatedAt": "2025-11-27T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "3bd3d619-d10f-4f4a-98b2-989045d5b364",
      "slug": "marquis-software-supply-chain-breach-hits-dozens-of-us-banks",
      "headline": "Supply Chain Breach at Vendor Marquis Exposes Data From Dozens of US Banks",
      "title": "Ransomware Attack on Marketing Vendor Marquis Software Solutions Leads to Major Data Breach for U.S. Banks and Credit Unions",
      "severity": "high",
      "excerpt": "A ransomware attack on Marquis Software Solutions, a marketing and data analytics vendor for the financial industry, has resulted in a significant supply chain data breach affecting dozens of U.S. banks and credit unions. Marquis began notifying its clients on November 26, 2025, about the incident, which was first detected in August. The breach exposed highly sensitive customer information, including names, Social Security numbers, taxpayer IDs, and financial account details, that the financial institutions had entrusted to the vendor. While the banks' internal systems were not compromised, the incident highlights the profound risks associated with third-party vendors. At least 42,000 individuals in Maine alone have been affected, and Marquis is offering credit monitoring services to impacted customers.",
      "tags": [
        "Marquis Software",
        "Supply Chain Attack",
        "Data Breach",
        "Ransomware",
        "Financial Services",
        "PII",
        "SSN"
      ],
      "categories": [
        "Supply Chain Attack",
        "Data Breach",
        "Ransomware"
      ],
      "createdAt": "2025-11-27T15:00:00.000Z",
      "updatedAt": "2025-11-27T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "dd1a02b7-a4c9-4a79-b022-25149af4a29d",
      "slug": "new-hashjack-attack-bypasses-security-in-ai-enabled-browsers",
      "headline": "New 'HashJack' Attack Injects Malicious Prompts into AI Browsers",
      "title": "'HashJack' Prompt Injection Technique Bypasses Network Security by Hiding Commands in URL Fragments",
      "severity": "medium",
      "excerpt": "On November 26, 2025, researchers disclosed a novel indirect prompt injection attack called 'HashJack' that targets AI-enabled web browsers. The technique works by embedding malicious instructions in the fragment portion of a URL (the text following a '#' symbol). Because URL fragments are processed client-side and are not sent to the server, they are invisible to most network security tools like firewalls and web gateways. However, AI assistants integrated into browsers often parse the full URL, including the fragment, to gain context. This allows an attacker to craft a seemingly benign link that, when visited, secretly instructs the user's AI assistant to perform malicious actions, creating a significant new attack surface.",
      "tags": [
        "HashJack",
        "Prompt Injection",
        "AI Security",
        "Browser Security",
        "URL Fragment",
        "Cato CTRL"
      ],
      "categories": [
        "Vulnerability",
        "Malware",
        "Phishing"
      ],
      "createdAt": "2025-11-27T15:00:00.000Z",
      "updatedAt": "2025-11-27T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "a0cfcce2-f1c0-4682-bd8a-a30aabfdf133",
      "slug": "mitsubishi-electric-discloses-ics-software-credential-flaw",
      "headline": "Mitsubishi ICS Software Flaw Exposes Credentials in Plaintext",
      "title": "Mitsubishi Electric Discloses Cleartext Credential Storage Vulnerability (CVE-2025-3784) in GX Works2 ICS Software",
      "severity": "medium",
      "excerpt": "On November 27, 2025, Mitsubishi Electric issued a security advisory for CVE-2025-3784, an information disclosure vulnerability in its GX Works2 industrial control system (ICS) software. The flaw, which affects all versions of the software, involves the storage of credential information in plaintext within project files. An attacker with local access to a computer running the software could extract these credentials and use them to bypass authentication on project files, allowing them to view or modify critical industrial process information. The vulnerability has a CVSS score of 5.5. Mitsubishi is developing a patch and has provided interim mitigation guidance.",
      "tags": [
        "CVE-2025-3784",
        "Mitsubishi Electric",
        "GX Works2",
        "ICS",
        "OT Security",
        "Vulnerability",
        "Credential Storage"
      ],
      "categories": [
        "Vulnerability",
        "Industrial Control Systems",
        "Patch Management"
      ],
      "createdAt": "2025-11-27T15:00:00.000Z",
      "updatedAt": "2025-11-27T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-3784"
      ],
      "cvssScore": 5.5,
      "isUpdate": false
    }
  ]
}