{
  "pub_id": "pub-2026-02-09",
  "headline": "CISA Mandates Edge Device Purge Amid Wave of Zero-Day Exploits and Sophisticated Supply Chain Attacks",
  "summary": "This cybersecurity brief for February 9, 2026, covers a critical period marked by aggressive state-sponsored attacks and widespread vulnerabilities. Key developments include a CISA directive forcing federal agencies to remove unsupported edge devices, the rapid exploitation of a Microsoft Office zero-day by Russia's APT28, and a sophisticated supply chain attack on Notepad++ attributed to a Chinese APT. Further incidents include a crippling ransomware attack on the BridgePay payment gateway and the discovery of critical zero-days in Ivanti and BeyondTrust products, highlighting urgent risks across government, finance, and technology sectors.",
  "pub_date": "2026-02-09",
  "total_articles": 8,
  "articles": [
    {
      "id": "f22483cb-e089-4a4c-91dc-f6c487aaeb11",
      "slug": "ivanti-patches-two-critical-actively-exploited-rce-flaws-in-epmm",
      "headline": "CRITICAL: Ivanti Patches Two Actively Exploited RCE Zero-Days in EPMM",
      "title": "Ivanti Issues Emergency Patches for Two Critical, Actively Exploited RCE Vulnerabilities in Endpoint Manager Mobile (EPMM)",
      "severity": "critical",
      "excerpt": "Ivanti has released urgent security patches for two critical remote code execution (RCE) vulnerabilities, CVE-2026-1281 and CVE-2026-1340, affecting its Endpoint Manager Mobile (EPMM) solution, formerly MobileIron Core. Both flaws are rated 9.8 out of 10 on the CVSS scale and are confirmed to be actively exploited in the wild as zero-days. An unauthenticated attacker can exploit these vulnerabilities to execute arbitrary code on an affected appliance, granting them access to sensitive mobile device management data. Given the active exploitation, administrators are urged to apply the temporary RPM script patches immediately while awaiting a permanent fix in the upcoming version 12.8.0.0.",
      "tags": [
        "Zero-Day",
        "RCE",
        "Remote Code Execution",
        "MobileIron",
        "MDM",
        "Active Exploit",
        "KEV"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2026-01-30T15:00:00.000Z",
      "updatedAt": "2026-02-09T12:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-1281",
        "CVE-2026-1340"
      ],
      "cvssScore": 9.8,
      "isUpdate": true,
      "updateSummary": "European Commission, Dutch, and Finnish government agencies confirm breaches linked to Ivanti EPMM zero-days; over 50 servers compromised globally.",
      "updateContent": "The European Commission is investigating a cyberattack on its MDM system, suspected to be linked to the Ivanti EPMM zero-days (CVE-2026-1281, CVE-2026-1340). The Dutch Authority for the Protection of Personal Data and a Finnish government agency (Valtori) have confirmed breaches affecting employee data and up to 50,000 users, respectively, due to these vulnerabilities. Security watchdog Shadowserver has identified over 50 compromised Ivanti EPMM servers worldwide, indicating widespread active exploitation. Ivanti has also released an integrity checker tool and IOCs to aid detection."
    },
    {
      "id": "813494bc-f2bb-499b-9b25-f474d3c00027",
      "slug": "fake-ransomware-group-0apt-bluffs-australian-hospital-in-extortion-attempt",
      "headline": "New '0APT' Extortion Group Fakes Data Breach in Bluff Attack on Australian Hospital",
      "title": "Fake Ransomware Group '0APT' Targets Epworth HealthCare with Extortion Bluff",
      "severity": "medium",
      "excerpt": "A new extortion group calling itself '0APT' has targeted Australia's Epworth HealthCare, claiming to have stolen 920GB of sensitive patient and financial data. The group listed the hospital on its darknet leak site on February 4, 2026, threatening to publish the data if a ransom was not paid. However, Epworth HealthCare conducted a thorough investigation with external cybersecurity experts and found \"no verified evidence of any impact to our systems or data.\" Cybersecurity researchers have corroborated this, assessing that 0APT is likely a \"fake\" ransomware operation. The group's modus operandi involves posting a high volume of victims without providing credible proof of a breach, instead using empty files or random data streams. This tactic relies on psychological pressure and the threat of reputational damage to extort payment, representing a shift from technical intrusion to pure intimidation.",
      "tags": [
        "0APT",
        "Ransomware",
        "Extortion",
        "Bluff Attack",
        "Healthcare",
        "Australia",
        "Cybercrime"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Data Breach"
      ],
      "createdAt": "2026-02-09T15:00:00.000Z",
      "updatedAt": "2026-02-09T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "12ce5275-6395-4207-8b42-625544f7549f",
      "slug": "killsec-ransomware-gang-targets-nigerian-startup-getly",
      "headline": "KillSec Ransomware Group Claims Attack on Nigerian Tech Startup Getly",
      "title": "Nigerian Startup Getly Targeted by KillSec Ransomware Group",
      "severity": "medium",
      "excerpt": "The ransomware group known as KillSec has claimed responsibility for a cyberattack on Getly, a Nigerian technology startup. On February 9, 2026, the group posted the claim on its platform, stating it had breached the company and exfiltrated sensitive data. KillSec has threatened to leak the stolen information if its unspecified ransom demands are not met. Getly, which operates the `getly.app` domain, has not yet publicly commented on the alleged breach, and the claims have not been independently verified. The incident highlights the global reach of ransomware gangs and the increasing risk they pose to startups and small businesses in emerging markets, not just large enterprises.",
      "tags": [
        "KillSec",
        "Ransomware",
        "Nigeria",
        "Startup",
        "Cybercrime"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2026-02-09T15:00:00.000Z",
      "updatedAt": "2026-02-09T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "029cba85-17aa-42cc-8231-06e10fe2de3f",
      "slug": "widespread-phishing-campaign-impersonates-australia-post",
      "headline": "Australia Post Phishing Scam Harvests Credit Card and OTP Data",
      "title": "Phishing Campaign Impersonating Australia Post Aims to Steal Payment Data and One-Time Passcodes",
      "severity": "medium",
      "excerpt": "A widespread phishing campaign is actively targeting Australians by impersonating Australia Post. Cybersecurity firm MailGuard intercepted the scam on February 9, 2026, which uses emails with the subject line \"Parcel Awaiting Instructions.\" The emails claim a delivery has failed due to an incomplete address and trick recipients into clicking a link to pay a small, fraudulent shipping fee of 1.99 AUD. The link leads to a sophisticated, multi-stage credential harvesting site designed to look like an official Australia Post portal. The site first captures the victim's full credit card details and phone number, and then, in a final crucial step, prompts for the one-time passcode (OTP) sent to their mobile. This allows the attackers to authorize fraudulent transactions immediately. The sender's email address is a clear giveaway, and users are advised to be vigilant.",
      "tags": [
        "Phishing",
        "Australia Post",
        "Scam",
        "Credential Harvesting",
        "OTP Theft",
        "Australia"
      ],
      "categories": [
        "Phishing",
        "Cyberattack"
      ],
      "createdAt": "2026-02-09T15:00:00.000Z",
      "updatedAt": "2026-02-09T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "18445d14-5815-4aaf-8b7c-346c54954c84",
      "slug": "malicious-ai-skills-proliferate-on-clawhub-marketplace",
      "headline": "AI Supply Chain Attack: Hundreds of Malicious 'Skills' on ClawHub Marketplace Steal Credentials",
      "title": "Supply Chain Attack Hits OpenClaw AI Ecosystem via Malicious 'Skills' on ClawHub",
      "severity": "high",
      "excerpt": "A significant software supply chain attack is targeting users of the OpenClaw AI assistant through its community marketplace, ClawHub. Security researchers have discovered hundreds of malicious 'skills'—add-ons that extend the AI's functionality—that have been published by threat actors. These skills masquerade as useful tools, such as wallet trackers or content summarizers, but their installation instructions trick users into downloading malware. The primary payloads include the Atomic Stealer infostealer for macOS and other backdoors and keyloggers for Windows. The attack leverages the trusted, open-source nature of the marketplace, which lacked a formal review process for submissions. In response to the discovery by KOI Security and SlowMist, the OpenClaw team has partnered with VirusTotal to automatically scan all skills uploaded to ClawHub to prevent further abuse.",
      "tags": [
        "Supply Chain Attack",
        "AI",
        "Artificial Intelligence",
        "OpenClaw",
        "ClawHub",
        "Atomic Stealer",
        "Malware"
      ],
      "categories": [
        "Supply Chain Attack",
        "Malware",
        "Cloud Security"
      ],
      "createdAt": "2026-02-09T15:00:00.000Z",
      "updatedAt": "2026-02-09T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "03e306c5-5b5c-4185-8b95-ad8fe979a97f",
      "slug": "bloody-wolf-apt-targets-russia-and-uzbekistan-with-netsupport-rat",
      "headline": "'Bloody Wolf' APT Deploys NetSupport RAT in Espionage Campaign",
      "title": "'Bloody Wolf' APT Targets Russia and Uzbekistan with NetSupport RAT in Financial and Espionage Attacks",
      "severity": "high",
      "excerpt": "Security researchers have uncovered an active spear-phishing campaign attributed to the threat actor 'Bloody Wolf' (also tracked as Stan Ghouls). The campaign targets organizations primarily in Uzbekistan and Russia, with a focus on manufacturing, finance, and IT sectors, though government and other entities have also been targeted. The attackers use phishing emails with password-protected ZIP archives containing a malicious LNK file. When executed, this file downloads and installs the legitimate remote administration tool, NetSupport RAT, which gives the attackers full control over the victim's system. The motives appear to be mixed, pointing towards both financially motivated cybercrime and state-aligned cyber espionage. This campaign marks a shift in tooling for the group, which previously used the STRRAT malware.",
      "tags": [
        "Bloody Wolf",
        "APT",
        "NetSupport RAT",
        "Spear-phishing",
        "Uzbekistan",
        "Russia",
        "LOLBAS"
      ],
      "categories": [
        "Threat Actor",
        "Cyberattack",
        "Malware"
      ],
      "createdAt": "2026-02-09T15:00:00.000Z",
      "updatedAt": "2026-02-09T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "9cbd9d54-f3f7-426b-aa68-8a9c4b700954",
      "slug": "singapore-telcos-hit-by-coordinated-unc3886-espionage-campaign",
      "headline": "China-Linked UNC3886 Hits All Major Singapore Telcos in Coordinated Zero-Day Attack",
      "title": "Coordinated Espionage Campaign by UNC3886 Targets All Major Singapore Telecommunication Providers",
      "severity": "critical",
      "excerpt": "Singaporean authorities have revealed that all four of the nation's major telecommunication providers were targeted in a sophisticated and coordinated cyber espionage campaign. The attack is attributed to UNC3886, a Chinese-linked advanced persistent threat (APT) group known for targeting critical infrastructure. The attackers exploited a zero-day vulnerability in the telcos' perimeter firewalls to gain initial access. Once inside, the group stole a limited amount of technical data and used advanced techniques to evade detection. While the attackers have not yet penetrated the core networks, officials noted their capability to deploy tools that could disrupt internet and telecommunications services. In response, Singapore has launched one of its largest-ever coordinated cyber defense operations, involving government agencies and the affected telcos working together to hunt for the intruders and harden national infrastructure.",
      "tags": [
        "UNC3886",
        "APT",
        "Zero-Day",
        "Singapore",
        "Telecommunications",
        "Cyber Espionage",
        "China"
      ],
      "categories": [
        "Threat Actor",
        "Cyberattack",
        "Vulnerability"
      ],
      "createdAt": "2026-02-09T15:00:00.000Z",
      "updatedAt": "2026-02-09T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "ba01459f-6579-42ac-acdd-c6434dfb202c",
      "slug": "critical-9-9-cvss-zero-day-vulnerability-disclosed-in-beyondtrust-products",
      "headline": "BeyondTrust Patches Critical 9.9 CVSS RCE Zero-Day in Remote Access Tools",
      "title": "BeyondTrust Patches Critical 9.9 CVSS Zero-Day (CVE-2026-1731) in Remote Support and Privileged Remote Access Products",
      "severity": "critical",
      "excerpt": "BeyondTrust has patched a critical zero-day vulnerability, CVE-2026-1731, affecting its self-hosted Remote Support (RS) and Privileged Remote Access (PRA) products. The flaw is a pre-authentication remote code execution (RCE) vulnerability with a CVSS score of 9.9, indicating extreme severity. It allows an unauthenticated attacker to execute arbitrary OS commands on a vulnerable appliance by sending a specially crafted network request, requiring no user interaction. This could lead to a full server compromise. The vulnerability affects RS versions 25.3.1 and earlier, and PRA versions 24.3.4 and earlier. BeyondTrust has already secured its cloud instances, but is urging all on-premise customers to upgrade to the patched versions immediately. The flaw was discovered and responsibly disclosed by a security researcher.",
      "tags": [
        "BeyondTrust",
        "CVE-2026-1731",
        "Zero-Day",
        "RCE",
        "Vulnerability",
        "Patch Management",
        "PAM"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2026-02-09T15:00:00.000Z",
      "updatedAt": "2026-02-09T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-1731"
      ],
      "cvssScore": 9.9,
      "isUpdate": false
    }
  ]
}