{
  "pub_id": "pub-2025-12-28",
  "headline": "Critical Flaws \"MongoBleed\" and \"React2Shell\" Actively Exploited, Major Data Breaches and Ransomware Attacks Continue Year-End Surge",
  "summary": "This cybersecurity advisory for December 28, 2025, covers a series of critical threats, including the active exploitation of the \"MongoBleed\" (CVE-2025-14847) memory leak in MongoDB and the \"React2Shell\" (CVE-2025-55182) RCE vulnerability in the React framework. The period also saw major data breach disclosures from 700Credit and Baker University, affecting millions. Ransomware activity remains high, with attacks on Romanian critical infrastructure by \"The Gentlemen\" and a claimed breach of Chrysler by the Everest group. State-sponsored activity also features prominently with updated advisories on the BRICKSTORM backdoor and the re-emergence of Iran's \"Prince of Persia\" APT.",
  "pub_date": "2025-12-28",
  "total_articles": 5,
  "articles": [
    {
      "id": "ee2b446b-850d-42e2-a050-66b0e8fcdaa3",
      "slug": "baker-university-discloses-2024-data-breach-affecting-53000-individuals",
      "headline": "Baker University Discloses Year-Old Breach Affecting Over 53,000 Individuals",
      "title": "Baker University Notifies 53,624 Individuals of 2024 Data Breach Exposing SSNs, Health, and Financial Data",
      "severity": "critical",
      "excerpt": "Baker University in Kansas has begun notifying 53,624 individuals about a severe data breach that occurred in December 2024. Attackers maintained access to the university's network for over two weeks, from December 2 to December 19, 2024. The compromised data is highly sensitive, including names, Social Security numbers, student IDs, financial account information, and private health data. The university detected the breach following a network outage but is only now, a full year later, informing the victims.",
      "tags": [
        "university breach",
        "identity theft",
        "social security number",
        "health data",
        "PII",
        "breach notification",
        "incident response"
      ],
      "categories": [
        "Data Breach",
        "Incident Response",
        "Other"
      ],
      "createdAt": "2025-12-23T15:00:00.000Z",
      "updatedAt": "2025-12-28T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "New technical analysis detailing different inferred TTPs (phishing, persistence, discovery, collection) and D3FEND recommendations for the Baker University breach. Additional sources included.",
      "updateContent": "The update provides a refined technical analysis of the Baker University breach, inferring different attacker TTPs including initial access via phishing (T1566.001), establishing persistence (T1136), network discovery (T1018), and data collection (T1074). It also introduces specific D3FEND techniques for detection, such as Process Analysis and Network Traffic Analysis, and MITRE mitigations like Network Segmentation (M1030) and Multi-factor Authentication (M1032). These details offer a fresh perspective on the attack chain and recommended defenses, complementing the existing report."
    },
    {
      "id": "44b61bf9-cbff-4854-9b09-04daddc0984d",
      "slug": "everest-ransomware-claims-theft-of-1tb-data-from-chrysler",
      "headline": "Everest Ransomware Claims Breach of Chrysler, Threatens to Leak Over 1TB of Data",
      "title": "Everest Ransomware Group Claims Major Data Theft from Automaker Chrysler, Including Salesforce Data",
      "severity": "high",
      "excerpt": "The Everest ransomware group has claimed responsibility for a significant data breach at the American automaker Chrysler. In a post on its dark web leak site on December 25, 2025, the group alleged it exfiltrated over 1 terabyte (TB) of data, including a \"full database\" of company operations and over 100 GB of Salesforce data covering 2021 to 2025. Chrysler has not yet confirmed the breach, but the claim represents a serious threat of data exposure for the major automotive manufacturer, following a common double-extortion tactic.",
      "tags": [
        "Everest",
        "Ransomware",
        "Chrysler",
        "Data Breach",
        "Automotive",
        "Salesforce",
        "Double Extortion"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Cyberattack"
      ],
      "createdAt": "2025-12-28T15:00:00.000Z",
      "updatedAt": "2025-12-28T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "c13e9bf3-550c-4c46-ac79-6b77844840c7",
      "slug": "phishing-campaign-abuses-google-cloud-email-service",
      "headline": "Living Off the Cloud: Phishing Campaign Abuses Google Cloud Service to Bypass Security Filters",
      "title": "Novel Phishing Campaign Leverages Google Cloud Application Integration to Send Malicious Emails from Legitimate Google Domain",
      "severity": "medium",
      "excerpt": "A widespread and sophisticated phishing campaign is abusing Google Cloud's own Application Integration service to send malicious emails that appear to come from a legitimate Google address (\"noreply-application-integration@google.com\"). This technique allows the emails to bypass standard security filters like SPF and DMARC. The campaign, which sent nearly 9,400 emails in two weeks, impersonates routine notifications to trick users into clicking links that lead to credential harvesting pages, demonstrating how attackers are increasingly weaponizing trusted cloud platforms.",
      "tags": [
        "Phishing",
        "Google Cloud",
        "Cloud Security",
        "Email Security",
        "DMARC",
        "SPF",
        "Living off the Land"
      ],
      "categories": [
        "Phishing",
        "Cloud Security",
        "Cyberattack"
      ],
      "createdAt": "2025-12-28T15:00:00.000Z",
      "updatedAt": "2025-12-28T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "673c34e9-3a99-476d-8e05-7254f315de9b",
      "slug": "iranian-apt-prince-of-persia-re-emerges-with-new-malware",
      "headline": "Iran's \"Prince of Persia\" APT Returns with Upgraded Malware, Uses Telegram for C2",
      "title": "Iranian APT \"Prince of Persia\" Re-emerges with New Variants of Tonnerre Backdoor Targeting Critical Infrastructure",
      "severity": "high",
      "excerpt": "The Iranian state-sponsored threat group \"Prince of Persia\" has resurfaced with multiple active malware campaigns, according to a new report from SafeBreach. The APT group is deploying new variants of its signature \"Tonnerre\" and \"Foudre\" backdoors. In a significant tactical evolution, one new variant, Tonnerre v50, now uses Telegram for command and control (C2) communications, replacing older protocols. The campaigns, which feature multiple Domain Generation Algorithms (DGAs), appear to be targeting critical infrastructure, indicating a patient and re-tooled adversary.",
      "tags": [
        "Prince of Persia",
        "APT",
        "Iran",
        "Threat Actor",
        "Malware",
        "Tonnerre",
        "Telegram",
        "DGA"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Industrial Control Systems"
      ],
      "createdAt": "2025-12-28T15:00:00.000Z",
      "updatedAt": "2025-12-28T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "14fc758b-1b20-4d62-aaab-17f82c324759",
      "slug": "aisuru-botnet-launches-record-breaking-29-7-tbps-ddos-attack",
      "headline": "\"Aisuru\" Botnet Shatters Records with 29.7 Tbps DDoS Attack",
      "title": "\"Aisuru\" Botnet-for-Hire Service Linked to Record-Breaking 29.7 Tbps DDoS Attack, Leveraging Millions of IoT Devices",
      "severity": "critical",
      "excerpt": "A powerful botnet-for-hire service named \"Aisuru\" has emerged as a major global threat, responsible for a new record-breaking Distributed Denial-of-Service (DDoS) attack peaking at 29.7 Terabits per second (Tbps). The botnet, which leverages millions of compromised Internet of Things (IoT) devices and routers, has been linked to over 1,300 attacks in just three months. The industrial scale of the Aisuru service poses a severe risk to internet stability, with attacks impacting the gaming, telecommunications, and financial services sectors.",
      "tags": [
        "DDoS",
        "Botnet",
        "Aisuru",
        "IoT Security",
        "Cyberattack",
        "Record Attack"
      ],
      "categories": [
        "Cyberattack",
        "Malware",
        "IoT Security"
      ],
      "createdAt": "2025-12-28T15:00:00.000Z",
      "updatedAt": "2025-12-28T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}