{
  "pub_id": "pub-2026-01-20",
  "headline": "Ingram Micro Breach Exposes 42k; UK Warns of Pro-Russia DDoS; New Ransomware Threats Emerge",
  "summary": "In the last 24 hours, the cybersecurity landscape has been dominated by major data breach disclosures, state-sponsored threat alerts, and the evolution of the ransomware ecosystem. IT distributor Ingram Micro confirmed a ransomware attack from mid-2025 impacted over 42,000 individuals, exposing sensitive PII. Simultaneously, the UK's NCSC issued a formal warning about persistent DDoS attacks from Russian-aligned hacktivists targeting critical infrastructure. New malware campaigns like 'PDFSIDER' and 'Evelyn Stealer' showcase increasingly sophisticated evasion techniques, while emerging threat groups like DragonForce signal a consolidation in the RaaS market.",
  "pub_date": "2026-01-20",
  "total_articles": 9,
  "articles": [
    {
      "id": "4c85e138-e951-4395-8ecb-e2ecfbbe97d0",
      "slug": "ingram-micro-discloses-ransomware-attack-impacting-42000-individuals",
      "headline": "Ingram Micro Breach Exposes Data of 42,000 After Safepay Ransomware Attack",
      "title": "Ingram Micro Confirms July 2025 Ransomware Attack Compromised Personal Data of 42,521 Individuals",
      "severity": "high",
      "excerpt": "Global IT distributor Ingram Micro has officially notified 42,521 individuals that their personal and sensitive information, including Social Security numbers, was stolen during a ransomware attack in July 2025. The incident, attributed to the Safepay ransomware group, compromised employment and job applicant records. After Ingram Micro reportedly refused to pay the ransom, the threat actors published the stolen 3.5 terabytes of data on their dark web leak site.",
      "tags": [
        "ransomware",
        "data breach",
        "PII",
        "Social Security Number",
        "supply chain",
        "Safepay"
      ],
      "categories": [
        "Data Breach",
        "Ransomware",
        "Supply Chain Attack"
      ],
      "createdAt": "2026-01-20T15:00:00.000Z",
      "updatedAt": "2026-01-20T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "b4f88070-d164-4c07-b747-1ed0c5e8a9b2",
      "slug": "ceos-cisos-split-on-ai-cybersecurity-risks-rewards-survey-finds",
      "headline": "CEOs Optimistic, CISOs Wary: Survey Reveals Deep Divide on AI's Cybersecurity Impact",
      "title": "AXIS Capital Survey Shows CEOs and CISOs Have Diverging Views on AI's Cybersecurity Risks and Benefits",
      "severity": "informational",
      "excerpt": "A new survey by specialty insurer AXIS Capital, released on January 20, 2026, reveals a significant perception gap between CEOs and CISOs regarding the role of artificial intelligence in cybersecurity. While CEOs are largely optimistic about AI's productivity and security benefits, CISOs are more acutely aware of the new risks it introduces, including data leakage, model manipulation, and sophisticated AI-driven attacks. This disconnect could lead to misaligned security strategies and underinvestment in critical risk areas.",
      "tags": [
        "AI",
        "Artificial Intelligence",
        "CISO",
        "CEO",
        "cybersecurity leadership",
        "risk management",
        "survey"
      ],
      "categories": [
        "Policy and Compliance",
        "Security Operations",
        "Other"
      ],
      "createdAt": "2026-01-20T15:00:00.000Z",
      "updatedAt": "2026-01-20T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "cbcd533b-ab72-45de-b4f8-4d6058e09a88",
      "slug": "north-korean-apt-konni-abuses-google-ads-in-operation-poseidon",
      "headline": "North Korean 'Konni' APT Weaponizes Google Ads to Deliver EndRAT Malware",
      "title": "Operation Poseidon: North Korean APT Konni Abuses Google Advertising URLs for Malware Delivery",
      "severity": "high",
      "excerpt": "The North Korean state-sponsored threat group Konni is conducting a sophisticated spear-phishing campaign dubbed \"Operation Poseidon.\" The advanced persistent threat (APT) actor is weaponizing Google advertising URLs to make malicious links appear legitimate, thereby bypassing security filters and tricking users. The campaign's ultimate goal is to deliver the 'EndRAT' malware, a remote access trojan, onto victim systems.",
      "tags": [
        "APT",
        "North Korea",
        "Konni",
        "EndRAT",
        "Google Ads",
        "spear-phishing",
        "malvertising"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Phishing"
      ],
      "createdAt": "2026-01-20T15:00:00.000Z",
      "updatedAt": "2026-01-20T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "12b0cef1-e3a6-4899-a45d-ae701550e5b2",
      "slug": "pdfsider-backdoor-uses-dll-side-loading-to-evade-defenses",
      "headline": "Stealthy 'PDFSIDER' Backdoor Uses DLL Side-Loading to Bypass EDR and AV",
      "title": "New 'PDFSIDER' Backdoor Leverages DLL Side-Loading with Legitimate PDF App to Achieve Stealth and Evade Detection",
      "severity": "high",
      "excerpt": "Security researchers at Resecurity have uncovered a new stealthy backdoor, dubbed 'PDFSIDER,' that uses a DLL side-loading technique to evade EDR and antivirus solutions. The malware masquerades as a legitimate PDF application to load a malicious DLL, establishing an encrypted command-and-control channel for long-term, covert access. The backdoor is already being actively used by ransomware groups, including the notorious Qilin gang, for payload delivery.",
      "tags": [
        "backdoor",
        "DLL side-loading",
        "EDR evasion",
        "Qilin",
        "PDFSIDER",
        "Resecurity"
      ],
      "categories": [
        "Malware",
        "Ransomware",
        "Threat Actor"
      ],
      "createdAt": "2026-01-20T15:00:00.000Z",
      "updatedAt": "2026-01-20T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "de70db21-853b-4318-b93d-d0fd34ab47d3",
      "slug": "south-korean-conglomerate-kyowon-hit-by-major-ransomware-attack",
      "headline": "South Korean Giant Kyowon Group Hit by Ransomware, 9.6 Million Accounts at Risk",
      "title": "South Korean Conglomerate Kyowon Group Confirms Major Ransomware Attack and Data Exfiltration",
      "severity": "critical",
      "excerpt": "The South Korean conglomerate Kyowon Group has confirmed it suffered a significant ransomware attack that disrupted operations and resulted in data exfiltration. The attack, detected on January 10, 2026, compromised approximately 600 of the company's 800 servers. South Korean authorities estimate that up to 9.6 million user accounts (representing 5.5 million unique individuals) may have been affected, as attackers reportedly exploited an open external port to gain initial access.",
      "tags": [
        "ransomware",
        "data breach",
        "South Korea",
        "Kyowon",
        "cyberattack"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Cyberattack"
      ],
      "createdAt": "2026-01-20T15:00:00.000Z",
      "updatedAt": "2026-01-20T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "938e1d88-7201-40bf-9a11-6ec4df261298",
      "slug": "crashfix-campaign-uses-fake-ad-blocker-to-crash-browsers-and-push-malware",
      "headline": "Fake Ad Blocker Crashes Chrome, Tricks Users into Installing 'ModeloRAT' Malware",
      "title": "'CrashFix' Campaign Uses Malicious Chrome Extension to Crash Browsers and Socially Engineer Malware Installation",
      "severity": "high",
      "excerpt": "A novel malware campaign dubbed \"CrashFix\" is using a malicious Google Chrome extension that impersonates the 'uBlock Origin Lite' ad blocker to intentionally crash victims' browsers. The attack, attributed to a group called 'KongTuke,' then uses social engineering, presenting a fake crash report that tricks users into running a PowerShell command to \"fix\" the issue. This command ultimately downloads and installs 'ModeloRAT,' a previously undocumented Python-based remote access trojan.",
      "tags": [
        "malware",
        "Chrome extension",
        "social engineering",
        "ModeloRAT",
        "KongTuke",
        "LOLBAS"
      ],
      "categories": [
        "Malware",
        "Phishing",
        "Threat Actor"
      ],
      "createdAt": "2026-01-20T15:00:00.000Z",
      "updatedAt": "2026-01-20T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "27929780-25bc-4aee-b862-a67c6215cec1",
      "slug": "gtmaritime-launches-gt-identify-to-bolster-maritime-cybersecurity-compliance",
      "headline": "GTMaritime Launches 'GT Identify' to Tackle Maritime Cybersecurity and Compliance",
      "title": "GTMaritime Launches 'GT Identify' to Bolster Maritime Cybersecurity Compliance with IMO and IACS Regulations",
      "severity": "informational",
      "excerpt": "Maritime technology firm GTMaritime has launched GT Identify, a new cybersecurity system designed to help ship operators comply with increasingly stringent regulations. Announced on January 20, 2026, the system provides fleet-wide hardware and software asset inventory, vulnerability reporting, and aligns with the NIST Cybersecurity Framework. The launch addresses the growing need for robust cyber risk management to meet IMO and IACS E26/E27 requirements.",
      "tags": [
        "maritime",
        "shipping",
        "cybersecurity",
        "compliance",
        "IMO",
        "IACS",
        "NIST",
        "asset management"
      ],
      "categories": [
        "Policy and Compliance",
        "Industrial Control Systems",
        "Patch Management"
      ],
      "createdAt": "2026-01-20T15:00:00.000Z",
      "updatedAt": "2026-01-20T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    },
    {
      "id": "16ca5eaf-0aa7-404c-b5d4-548137ac0b01",
      "slug": "hacktivists-and-cybercriminals-expand-attacks-on-ics-and-ai-systems",
      "headline": "Threat Landscape Converges as Attackers Target ICS and AI Systems",
      "title": "Hacktivists and Cybercriminals Expand Attacks on ICS and AI Systems, Cyble Research Finds",
      "severity": "high",
      "excerpt": "New research from Cyble highlights a dangerous convergence of threats, as both hacktivists and financially motivated cybercriminals are increasingly targeting Industrial Control Systems (ICS), Operational Technology (OT), and enterprise AI systems. The report, published January 20, 2026, notes that attackers are exploiting exposed HMI and SCADA systems while also leveraging AI to create polymorphic malware and more effective social engineering lures.",
      "tags": [
        "threat intelligence",
        "ICS",
        "OT",
        "SCADA",
        "AI security",
        "hacktivism",
        "cybercrime"
      ],
      "categories": [
        "Threat Intelligence",
        "Industrial Control Systems",
        "Cyberattack"
      ],
      "createdAt": "2026-01-20T15:00:00.000Z",
      "updatedAt": "2026-01-20T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "5ffe8925-84c7-458c-83e2-4d8271bed82b",
      "slug": "dragonforce-emerges-as-new-ransomware-cartel-using-lockbit-and-conti-code",
      "headline": "'DragonForce' Emerges as New Ransomware Cartel Built on LockBit and Conti DNA",
      "title": "New Ransomware Cartel 'DragonForce' Emerges, Leveraging LockBit and Conti Code on 'Ransombay' RaaS Platform",
      "severity": "high",
      "excerpt": "A new Ransomware-as-a-Service (RaaS) operation named DragonForce has emerged, positioning itself as a \"ransomware cartel.\" The group is reportedly building its operations on the leaked source code of the notorious LockBit 3.0 and Conti ransomware variants. Operating a RaaS platform called 'Ransombay,' DragonForce's strategy includes absorbing smaller rival operations, signaling a trend towards consolidation in the cybercrime ecosystem.",
      "tags": [
        "ransomware",
        "RaaS",
        "DragonForce",
        "Ransombay",
        "LockBit",
        "Conti",
        "cybercrime"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Malware"
      ],
      "createdAt": "2026-01-20T15:00:00.000Z",
      "updatedAt": "2026-01-20T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}