{
  "pub_id": "pub-2025-10-28",
  "headline": "CISA Warns of Actively Exploited Zero-Days in Fortinet & Dassault Systems; Massive Infostealer Dump Exposes 183M Credentials",
  "summary": "This 24-hour period is marked by critical zero-day vulnerabilities and massive data exposure events. CISA has added actively exploited flaws in Fortinet's FortiWeb and Dassault Systèmes' DELMIA Apriso products to its KEV catalog, demanding urgent patching from federal agencies. Concurrently, a colossal dataset of 183 million credentials, harvested by infostealer malware like RedLine and Vidar, has been discovered, heightening the risk of widespread credential stuffing attacks. Other significant events include a supply chain breach at healthcare vendor Cerner, new ransomware attacks by Safepay and BlueNoroff, and disclosures of vulnerabilities in Apache Tomcat and OpenAI's new Atlas browser.",
  "pub_date": "2025-10-28",
  "total_articles": 13,
  "articles": [
    {
      "id": "02a78710-0d01-46eb-a99b-9aed6ffd560e",
      "slug": "ai-powered-phishing-emails-prove-4-5-times-more-effective-microsoft-report-finds",
      "headline": "Microsoft Report: AI-Generated Phishing Now 4.5x More Effective, Bypassing Traditional Defenses",
      "title": "AI-Powered Phishing Emails Achieve 54% Click-Through Rate, Microsoft's 2025 Digital Defense Report Reveals",
      "severity": "high",
      "excerpt": "According to the Microsoft 2025 Digital Defense Report, the effectiveness of phishing attacks has surged with the adoption of artificial intelligence. AI-generated emails now achieve a 54% click-through rate, 4.5 times higher than traditional methods. The report, covering July 2024 to June 2025, also highlights a 32% increase in identity-based attacks and the growing use of AI by nation-state actors for disinformation. Microsoft stresses that phishing-resistant MFA remains the most effective defense, blocking over 99% of identity attacks.",
      "tags": [
        "AI",
        "Phishing",
        "Microsoft",
        "Threat Intelligence",
        "MFA",
        "Identity Attack",
        "Infostealer",
        "ClickFix"
      ],
      "categories": [
        "Phishing",
        "Threat Intelligence",
        "Malware"
      ],
      "createdAt": "2025-10-18T15:00:00.000Z",
      "updatedAt": "2025-10-28T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "Massive leak of 183M email credentials from infostealer malware logs, now on HIBP, increasing credential stuffing risk.",
      "updateContent": "A colossal collection of 183 million unique email and plaintext password combinations, dubbed 'Synthient Stealer Log Threat Data,' has been discovered on underground forums and added to Have I Been Pwned. This data was aggregated from numerous infostealer malware infections over nearly a year, not from a direct breach of any email provider. This incident underscores the escalating threat from infostealer malware, as highlighted in the Microsoft report, and creates a massive pool of credentials for widespread credential stuffing attacks, significantly increasing the risk of account takeovers and identity theft. Users are urged to check HIBP, reset passwords, and enable MFA."
    },
    {
      "id": "e891d09c-251e-4489-9c26-a5a24434a34b",
      "slug": "ransomware-automation-cuts-attack-timelines-to-18-minutes",
      "headline": "18 Minutes to Mayhem: Ransomware Attacks Now Fully Automated, Slashing Defender Response Time",
      "title": "Ransomware Automation Reduces Attacker 'Breakout Time' to Just 18 Minutes, ReliaQuest Reports",
      "severity": "critical",
      "excerpt": "A new report from ReliaQuest reveals a dramatic acceleration in ransomware attacks, with the average time from initial access to lateral movement ('breakout time') plummeting to just 18 minutes. This is a significant decrease from 48 minutes in 2024, driven by the adoption of automation and AI by 80% of Ransomware-as-a-Service (RaaS) groups. The report highlights the Qilin ransomware gang as a prime example, whose platform automates key attack phases like discovery, backup deletion, and encryption. Other groups like LockBit are also integrating AI to enhance their operations, creating a hyper-competitive landscape where speed and automation are paramount. This shrinking response window poses a monumental challenge for security teams, demanding automated detection and response capabilities to counter the threat.",
      "tags": [
        "Ransomware",
        "Automation",
        "AI",
        "Qilin",
        "LockBit",
        "Breakout Time",
        "Incident Response",
        "SOAR"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Threat Intelligence"
      ],
      "createdAt": "2025-10-23T15:00:00.000Z",
      "updatedAt": "2025-10-28T00:00:00.000Z",
      "readingTime": 7,
      "isUpdate": true,
      "updateSummary": "Ransomware victim payments hit record low of 23% in Q3 2025, as major RaaS groups shift to high-volume attacks on mid-market firms.",
      "updateContent": "A new report from Coveware indicates a significant shift in the ransomware landscape. The percentage of victims paying ransoms dropped to a historic low of 23% in Q3 2025, with average payments plummeting by 66%. This decline is attributed to large enterprises refusing to pay and major RaaS groups, including Qilin, pivoting to a 'high-volume, low-demand' model targeting mid-market companies. Despite lower payments, the overall volume of ransomware incidents remains at an all-time high, increasing pressure on SMBs. This evolution demands continued focus on resilience and robust recovery strategies."
    },
    {
      "id": "3ce4bc15-1f72-4c84-9d41-44c648b88418",
      "slug": "cisa-adds-new-actively-exploited-vulnerability-to-kev-catalog",
      "headline": "CISA Orders Federal Agencies to Patch New Actively Exploited Vulnerability",
      "title": "CISA Adds New Vulnerability to Known Exploited Vulnerabilities (KEV) Catalog, Mandating Federal Patching",
      "severity": "high",
      "excerpt": "On October 22, 2025, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) added a new, unspecified vulnerability to its Known Exploited Vulnerabilities (KEV) catalog. This action confirms that the flaw is being actively exploited in the wild by malicious actors. Under Binding Operational Directive (BOD) 22-01, all Federal Civilian Executive Branch (FCEB) agencies are now required to remediate this vulnerability by a specific deadline to protect federal networks. While the CVE identifier was not immediately released, the alert serves as a critical warning to all organizations to prioritize its patching.",
      "tags": [
        "CISA",
        "KEV",
        "Vulnerability",
        "Patch Management",
        "BOD 22-01",
        "Zero-Day"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Regulatory"
      ],
      "createdAt": "2025-10-23T15:00:00.000Z",
      "updatedAt": "2025-10-28T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "CISA identifies two critical vulnerabilities (CVE-2025-6204, CVE-2025-6205) in Dassault DELMIA Apriso manufacturing software, actively exploited and added to KEV catalog.",
      "updateContent": "CISA has now identified the previously unspecified actively exploited vulnerability as two critical flaws (CVE-2025-6204, code injection; CVE-2025-6205, missing authorization) affecting Dassault Systèmes' DELMIA Apriso manufacturing software. These vulnerabilities, added to the KEV catalog on October 28, 2025, are confirmed to be under active exploitation, posing a severe risk to global manufacturing operations. Successful exploitation could lead to operational shutdowns, intellectual property theft, and potential pivot to OT networks. Organizations using DELMIA Apriso are urged to apply patches immediately as mandated for federal agencies."
    },
    {
      "id": "53a1b24b-1f7e-493e-aaf9-181eecbc35dc",
      "slug": "massive-infostealer-campaign-exposes-183-million-credentials",
      "headline": "Infostealer Malware Campaign Dumps 183 Million Credentials Online",
      "title": "Massive \"Synthient\" Data Dump from RedLine and Vidar Infostealers Exposes 183 Million Credentials",
      "severity": "high",
      "excerpt": "A colossal 3.5-terabyte dataset named \"Synthient,\" containing 183 million unique email and password combinations, has been indexed by Have I Been Pwned. The credentials were not stolen from a single service breach but were aggregated over time from devices infected with infostealer malware such as RedLine and Vidar. While Google confirmed its systems were not directly compromised, the leak poses a severe risk of credential stuffing attacks across countless online services. The data includes 16.4 million credentials never before seen in breach databases, highlighting the ongoing threat of malware-based data harvesting. Security experts urge immediate password updates and the adoption of multi-factor authentication (MFA).",
      "tags": [
        "credential stuffing",
        "infostealer",
        "password reuse",
        "data leak",
        "cybersecurity"
      ],
      "categories": [
        "Data Breach",
        "Malware",
        "Threat Intelligence"
      ],
      "createdAt": "2025-10-28T15:00:00.000Z",
      "updatedAt": "2025-10-28T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "4da2a55a-4edf-42ac-9810-1963a2b6bc9d",
      "slug": "cerner-discloses-patient-data-breach-to-alaskan-hospital",
      "headline": "Cerner Discloses Patient Data Breach at Alaskan Hospital Months After Initial Intrusion",
      "title": "Cerner Corporation Notifies Mat-Su Regional Medical Center of Patient Data Breach from Legacy System Compromise",
      "severity": "high",
      "excerpt": "Electronic health records (EHR) vendor Cerner Corporation has informed Mat-Su Regional Medical Center in Alaska of a data breach affecting patient information. The security incident, which involved unauthorized access to legacy Cerner systems, was first detected in February 2025 but originated as early as January. The compromised data could include patient names, Social Security numbers, medical records, diagnoses, and other sensitive health information. The breach did not affect the hospital's own systems, but highlights significant supply chain risks in the healthcare sector. Cerner is offering two years of identity protection services to affected patients.",
      "tags": [
        "healthcare breach",
        "supply chain attack",
        "patient data",
        "HIPAA",
        "EHR",
        "EMR"
      ],
      "categories": [
        "Data Breach",
        "Supply Chain Attack",
        "Regulatory"
      ],
      "createdAt": "2025-10-28T15:00:00.000Z",
      "updatedAt": "2025-10-28T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "7e144dbe-204c-41de-b2ad-790d3d31242a",
      "slug": "slow-email-breach-response-correlates-to-high-ransomware-risk",
      "headline": "Slow Email Breach Response Leads to 79% Higher Ransomware Risk, Report Finds",
      "title": "Barracuda Report: Delayed Email Breach Response Correlates to 79% Chance of Ransomware",
      "severity": "informational",
      "excerpt": "A new report from Barracuda Networks reveals a strong correlation between slow incident response times for email breaches and the likelihood of a subsequent ransomware attack. Organizations that take over nine hours to remediate an email compromise face a 79% higher chance of also being hit by ransomware. The study found that 78% of organizations experienced an email breach in the last year, with attackers often gaining access and deploying ransomware in under an hour. The high cost of recovery, especially for small businesses, underscores the critical need for automated detection and rapid response capabilities to contain initial email-based threats.",
      "tags": [
        "incident response",
        "email security",
        "phishing",
        "ransomware",
        "cybersecurity report"
      ],
      "categories": [
        "Threat Intelligence",
        "Security Operations",
        "Ransomware"
      ],
      "createdAt": "2025-10-28T15:00:00.000Z",
      "updatedAt": "2025-10-28T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "089691e8-5337-426d-ab4b-38f7d281e4ff",
      "slug": "cisa-warns-of-actively-exploited-flaws-in-dassault-systemes-manufacturing-software",
      "headline": "CISA Warns of Actively Exploited Flaws in Dassault Systèmes' Manufacturing Software",
      "title": "CISA Adds Actively Exploited Dassault Systèmes DELMIA Apriso Flaws to KEV Catalog",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added two vulnerabilities in Dassault Systèmes' DELMIA Apriso manufacturing software to its Known Exploited Vulnerabilities (KEV) catalog. The flaws, CVE-2025-6205 (CVSS 9.1) and CVE-2025-6204 (CVSS 8.0), are being actively exploited in the wild. Attackers can chain them to create a privileged user account and then achieve remote code execution, leading to a full system compromise. The software is widely used in critical manufacturing sectors like automotive and aerospace. Federal agencies have been given a three-week deadline to apply patches released in August 2025.",
      "tags": [
        "KEV",
        "zero-day",
        "CISA",
        "manufacturing",
        "ICS security",
        "OT security"
      ],
      "categories": [
        "Vulnerability",
        "Industrial Control Systems",
        "Patch Management"
      ],
      "createdAt": "2025-10-28T15:00:00.000Z",
      "updatedAt": "2025-10-28T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-6204",
        "CVE-2025-6205"
      ],
      "cvssScore": 9.1,
      "isUpdate": false
    },
    {
      "id": "1d813ff5-992e-4160-abea-e04466ef0535",
      "slug": "new-apache-tomcat-vulnerabilities-expose-servers-to-rce",
      "headline": "Apache Tomcat Flaws Expose Servers to Path Traversal and RCE Risk",
      "title": "New Apache Tomcat Vulnerabilities Impact Versions 9, 10, and 11, Posing RCE Risk",
      "severity": "high",
      "excerpt": "The Apache Software Foundation has disclosed two new vulnerabilities impacting Apache Tomcat versions 9, 10, and 11. The most severe flaw, CVE-2025-55752, is a directory traversal vulnerability rated 'Important' that could allow an attacker to bypass security constraints and access protected directories like /WEB-INF/. If HTTP PUT requests are enabled—a non-default setting—this flaw can be escalated to achieve remote code execution (RCE). A second, low-severity flaw, CVE-2025-55754, affects Windows systems and could lead to code execution via malicious console log entries. Users are urged to upgrade to the latest versions to mitigate these risks.",
      "tags": [
        "Apache Tomcat",
        "path traversal",
        "RCE",
        "vulnerability",
        "Java"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2025-10-28T15:00:00.000Z",
      "updatedAt": "2025-10-28T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-55752",
        "CVE-2025-55754",
        "CVE-2025-61795"
      ],
      "isUpdate": false
    },
    {
      "id": "d39d70f3-34c6-4c79-a62f-9a390e69decc",
      "slug": "north-korean-bluenoroff-apt-deploys-ai-driven-tools-in-new-campaigns",
      "headline": "North Korean APT BlueNoroff Uses AI-Driven Spyware in New 'GhostCall' and 'GhostHire' Campaigns",
      "title": "BlueNoroff APT Targets Web3 and Venture Capital with AI-Enhanced Spyware on Windows and macOS",
      "severity": "high",
      "excerpt": "The North Korean APT group BlueNoroff is conducting two new financially motivated campaigns, 'GhostCall' and 'GhostHire,' targeting the cryptocurrency and venture capital sectors. According to research from Kaspersky, the group is using sophisticated social engineering, enhanced by generative AI, to lure executives and developers on both Windows and macOS. The attacks involve fake meetings and job offers to trick victims into downloading malware capable of stealing cryptocurrency wallet data, macOS Keychain contents, and other sensitive information. The campaigns show BlueNoroff's increasing focus on macOS and its adoption of AI to accelerate malware development.",
      "tags": [
        "BlueNoroff",
        "APT",
        "North Korea",
        "cryptocurrency",
        "macOS",
        "spyware",
        "AI"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Phishing"
      ],
      "createdAt": "2025-10-28T15:00:00.000Z",
      "updatedAt": "2025-10-28T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "95d9d336-e500-463e-b9c5-a6be683696fd",
      "slug": "memento-labs-hacking-team-successor-linked-to-chrome-zero-day-and-dante-spyware",
      "headline": "Hacking Team Successor Memento Labs Linked to Chrome Zero-Day and 'Dante' Spyware",
      "title": "Kaspersky Links Memento Labs, Successor to Hacking Team, to 'Dante' Spyware and Chrome Zero-Day Campaign",
      "severity": "critical",
      "excerpt": "Kaspersky researchers have linked Memento Labs, the Italian company that succeeded the notorious surveillance vendor Hacking Team, to a cyber-espionage campaign that used a Google Chrome zero-day (CVE-2025-2783). The campaign, dubbed \"Operation ForumTroll,\" targeted entities in Russia and Belarus with phishing links that installed spyware called \"Dante.\" Analysis of Dante revealed code similarities to Hacking Team's old RCS spyware, confirming it as a commercial surveillance tool. The zero-day exploit allowed for infection simply by visiting a malicious website, highlighting the continued threat posed by commercial spyware vendors.",
      "tags": [
        "spyware",
        "zero-day",
        "Hacking Team",
        "Memento Labs",
        "Google Chrome",
        "espionage"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Vulnerability"
      ],
      "createdAt": "2025-10-28T15:00:00.000Z",
      "updatedAt": "2025-10-28T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-2783"
      ],
      "isUpdate": false
    },
    {
      "id": "359029ae-88bd-43a9-8aca-e2edc51d9f83",
      "slug": "at-bay-report-cites-vpns-and-email-as-primary-ransomware-vectors",
      "headline": "Cisco and Citrix VPNs Linked to 5-7x Higher Ransomware Risk, At-Bay Report Finds",
      "title": "At-Bay Report: VPNs and Email Remain Primary Ransomware Vectors, with Cisco and Citrix Posing Highest Risk",
      "severity": "informational",
      "excerpt": "A new report from cyber-insurance provider At-Bay identifies email and remote access as the entry points for 90% of cyber claims in 2024. The 2025 InsurSec Rankings Report found that organizations using on-premise VPNs from vendors like Cisco and Citrix were five to seven times more likely to suffer a ransomware attack compared to those using other remote access solutions. Email fraud, often powered by AI, also saw a 30% surge in claim frequency. The report highlights the effectiveness of Managed Detection and Response (MDR) services in mitigating ransomware and ranks Sophos as the top-performing email security solution.",
      "tags": [
        "VPN",
        "remote access",
        "ransomware",
        "cyber insurance",
        "MDR",
        "email security"
      ],
      "categories": [
        "Threat Intelligence",
        "Ransomware",
        "Vulnerability"
      ],
      "createdAt": "2025-10-28T15:00:00.000Z",
      "updatedAt": "2025-10-28T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "f0993278-7776-424e-bd47-f1b603de718c",
      "slug": "fortinet-silently-patches-actively-exploited-fortiweb-zero-day",
      "headline": "Fortinet Silently Patches Critical, Actively Exploited FortiWeb Zero-Day",
      "title": "Fortinet Deploys Silent Patch for Critical FortiWeb Path Traversal Flaw (CVE-2025-64446) Under Active Exploitation",
      "severity": "critical",
      "excerpt": "Fortinet has quietly released a patch for a critical, actively exploited zero-day vulnerability in its FortiWeb Web Application Firewall (WAF). The flaw, tracked as CVE-2025-64446 (CVSS 9.8), is a path traversal vulnerability that allows an unauthenticated remote attacker to create an administrator account and gain full control of the device. Attacks have been observed since at least early October 2025. Fortinet released the fix in version 8.0.2 on October 28 but did not immediately issue a public advisory, delaying awareness. The vulnerability was later added to CISA's KEV catalog, confirming its threat and mandating urgent patching.",
      "tags": [
        "zero-day",
        "Fortinet",
        "FortiWeb",
        "KEV",
        "CISA",
        "path traversal",
        "WAF"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2025-10-28T15:00:00.000Z",
      "updatedAt": "2025-10-28T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-64446"
      ],
      "cvssScore": 9.8,
      "isUpdate": false
    },
    {
      "id": "0336421c-be20-4fea-ab1d-4f17a05c49f3",
      "slug": "city-of-gloversville-new-york-hit-by-ransomware-attack",
      "headline": "City of Gloversville, NY, Pays Partial Ransom After Attack Compromises Employee Data",
      "title": "New York's City of Gloversville Hit by Ransomware, Pays $150,000 After Employee Payroll Data Stolen",
      "severity": "high",
      "excerpt": "The City of Gloversville, New York, has suffered a ransomware attack that was discovered on October 27, 2025. The attack disrupted city computer systems and compromised the personal and payroll information of current and former employees, including bank account numbers. After initially demanding $300,000, the city council approved a partial ransom payment of $150,000 to the unnamed threat actors in exchange for the return of the stolen data. The incident highlights the ongoing vulnerability of municipalities to ransomware attacks.",
      "tags": [
        "ransomware",
        "municipal government",
        "data breach",
        "public sector",
        "ransom payment"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Regulatory"
      ],
      "createdAt": "2025-10-28T15:00:00.000Z",
      "updatedAt": "2025-10-28T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}