{
  "pub_id": "pub-2025-10-10",
  "headline": "Cl0p Exploits Oracle Zero-Day in Massive Extortion Spree; SonicWall Breach Hits All Cloud Backup Users",
  "summary": "This cybersecurity brief for October 10, 2025, covers a critical period marked by high-impact zero-day exploitation and significant data breaches. A Cl0p-affiliated group has been exploiting an Oracle E-Business Suite zero-day (CVE-2025-61882) for months, leading to an FBI warning. Concurrently, SonicWall admitted a breach impacted all cloud backup customers, exposing firewall configurations. Other major incidents include the 'CamoLeak' flaw in GitHub Copilot allowing code exfiltration, a supply chain breach at crypto platform Shuffle.com, and the emergence of new ransomware and APT groups.",
  "pub_date": "2025-10-10",
  "total_articles": 8,
  "articles": [
    {
      "id": "716fe449-ba81-4707-a952-64cd853f90a3",
      "slug": "camoleak-flaw-in-github-copilot-allowed-silent-code-exfiltration",
      "headline": "GitHub Patches 'CamoLeak' Flaw in Copilot That Allowed Silent Code and Secret Exfiltration",
      "title": "'CamoLeak' Vulnerability in GitHub Copilot Chat Enabled Covert Data Theft via Prompt Injection",
      "severity": "high",
      "excerpt": "A critical vulnerability, dubbed 'CamoLeak,' has been discovered and patched in **[GitHub Copilot Chat](https://github.com/features/copilot)**. The flaw, rated 9.6 CVSS by researcher Omer Mayraz of Legit Security, allowed attackers to silently steal private source code, API keys, and other secrets from developers' repositories. The attack involved a novel prompt injection technique where malicious instructions were hidden in a pull request's markdown. When a developer used Copilot to review the PR, the AI would execute the hidden commands. The stolen data was then exfiltrated character-by-character using a clever trick involving **[GitHub](https://github.com/)**'s own image proxy service, Camo, bypassing standard security controls. GitHub has mitigated the flaw by disabling image rendering in Copilot Chat.",
      "tags": [
        "prompt injection",
        "AI security",
        "GitHub Copilot",
        "data exfiltration",
        "source code leak",
        "DevSecOps"
      ],
      "categories": [
        "Vulnerability",
        "Cloud Security",
        "Supply Chain Attack"
      ],
      "createdAt": "2025-10-10T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "d9777cbe-406c-425f-a8fa-723cde2ddb3d",
      "slug": "crypto-platform-shuffle-hit-by-third-party-data-breach",
      "headline": "Crypto Platform Shuffle.com Discloses Major Data Breach via Third-Party CRM Provider",
      "title": "Shuffle.com User Data, Including KYC Documents, Exposed in Breach at CRM Partner Fast Track",
      "severity": "high",
      "excerpt": "Crypto betting platform **[Shuffle.com](https://shuffle.com/)** has confirmed a significant data breach affecting a majority of its users. The incident occurred not on Shuffle's own systems, but at its third-party CRM provider, **Fast Track**. On October 10, Shuffle announced that attackers compromised Fast Track and gained access to a trove of sensitive user data. The exposed information includes full names, emails, phone numbers, home addresses, transaction histories, and, most critically, Know Your Customer (KYC) identity documents like passports and driver's licenses. While user funds and passwords are safe, the breach creates a severe risk of identity theft and targeted phishing for affected customers. Shuffle has revoked the provider's access and is urging users to enable 2FA.",
      "tags": [
        "supply chain attack",
        "data breach",
        "crypto",
        "KYC",
        "PII",
        "third-party risk"
      ],
      "categories": [
        "Data Breach",
        "Supply Chain Attack",
        "Phishing"
      ],
      "createdAt": "2025-10-10T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "79e8c1fc-43cf-4b60-9f30-8d0de78e9890",
      "slug": "new-white-lock-ransomware-demands-4-bitcoin-ransom",
      "headline": "New 'White Lock' Ransomware Emerges, Demanding 4 Bitcoin and Threatening Data Leaks",
      "title": "'White Lock' Ransomware Surfaces with Double Extortion Tactics, Appends '.fbin' Extension to Files",
      "severity": "high",
      "excerpt": "A new ransomware strain named **White Lock** has been identified by cybersecurity researchers. Operating as a double-extortion threat, the malware first exfiltrates sensitive data before encrypting files on the victim's Windows system, appending the `.fbin` extension. A ransom note, `c0ntact.txt`, is dropped in each affected folder, demanding a payment of 4 Bitcoin within a stringent four-day deadline. The operators threaten to notify the victim's customers, sell the stolen data to competitors, and ultimately leak it publicly if the ransom is not paid. Victims are instructed to use the **[Tor](https://www.torproject.org/)** browser to communicate with the attackers, suggesting a focus on high-value enterprise targets.",
      "tags": [
        "ransomware",
        "double extortion",
        "data exfiltration",
        "Windows malware",
        "Tor"
      ],
      "categories": [
        "Ransomware",
        "Malware",
        "Threat Actor"
      ],
      "createdAt": "2025-10-10T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "7974936d-4304-48e1-a3b1-35668cb90161",
      "slug": "pro-russian-hackers-tricked-into-attacking-decoy-water-utility",
      "headline": "Humiliation for Pro-Russian Hackers 'TwoNet' After Attacking Decoy Water Utility Honeypot",
      "title": "Hacktivist Group TwoNet Publicly Brags About Hacking Dutch Water Utility, Only to Find It Was a Forescout Honeypot",
      "severity": "informational",
      "excerpt": "The pro-Russian hacktivist group **TwoNet** has been publicly embarrassed after cybersecurity firm **[Forescout](https://www.forescout.com/)** revealed the group was duped into attacking a sophisticated decoy system. In September, TwoNet boasted on Telegram about disrupting a Dutch water utility's control systems. However, Forescout's research, published on October 10, confirmed the 'attack' was against one of their industrial control system (ICS) honeypots. The attacker, 'Barlati,' gained access using default credentials (`admin`/`admin`), defaced the HMI, and changed settings, believing it was a real facility. The incident highlights the naivety of some hacktivist groups and provides valuable intelligence on their TTPs against critical infrastructure.",
      "tags": [
        "hacktivism",
        "honeypot",
        "ICS",
        "OT security",
        "critical infrastructure",
        "threat intelligence",
        "Russia"
      ],
      "categories": [
        "Threat Actor",
        "Industrial Control Systems",
        "Threat Intelligence"
      ],
      "createdAt": "2025-10-10T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "b0cf7e2d-bfe0-4b3f-b7d9-0e260ded9a7f",
      "slug": "key-us-cyber-information-sharing-law-expires-sparking-concerns",
      "headline": "US Cyber Threat Sharing Law 'CISA 2015' Expires, Creating Potential Intelligence Gap",
      "title": "Cybersecurity Information Sharing Act of 2015 Sunsets, Sparking Industry Fears of Reduced Public-Private Collaboration",
      "severity": "medium",
      "excerpt": "The Cybersecurity Information Sharing Act of 2015 (CISA 2015), a foundational U.S. law that provided liability protections to encourage private companies to share cyber threat data with the government, expired on October 1, 2025. Amidst a government shutdown and a block by Senator Rand Paul, lawmakers failed to reauthorize the act. Security and legal experts warn this could have a chilling effect on threat intelligence sharing, with one law firm predicting a potential 80% drop. The lapse creates uncertainty and could hinder national cybersecurity efforts. In response, new legislation, the PACT Act, has been introduced to retroactively restore and extend the protections, but its future is uncertain.",
      "tags": [
        "cybersecurity law",
        "information sharing",
        "threat intelligence",
        "US government",
        "policy",
        "CISA"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Threat Intelligence"
      ],
      "createdAt": "2025-10-10T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "dd6612c6-3d49-43ef-8aa9-38dc2dd6ee02",
      "slug": "phantom-taurus-chinese-apt-targets-global-geopolitical-intel",
      "headline": "New Chinese APT 'Phantom Taurus' Targets Global Geopolitical Intel with 'NET-STAR' Malware",
      "title": "China-Aligned 'Phantom Taurus' APT Group Linked to Long-Term Espionage Campaigns Against Government and Telecom Sectors",
      "severity": "high",
      "excerpt": "A newly designated, sophisticated threat group aligned with China, named **Phantom Taurus**, has been identified conducting long-term cyber-espionage campaigns. Active for over two years, the group targets government, military, and telecommunications organizations across Africa, the Middle East, and Asia. Its operations focus on strategic intelligence gathering that aligns with China's geopolitical interests. **Phantom Taurus** is distinguished by its stealth and use of a custom malware suite called **NET-STAR**, which targets **[Microsoft Internet Information Services (IIS)](https://www.iis.net/)** servers. While showing some infrastructure overlap with known APTs like **[APT27](https://attack.mitre.org/groups/G0045/)** and **[Mustang Panda](https://attack.mitre.org/groups/G0129/)**, its unique tools and TTPs mark it as a distinct and advanced threat.",
      "tags": [
        "APT",
        "cyber-espionage",
        "China",
        "IIS",
        "malware",
        "threat actor"
      ],
      "categories": [
        "Threat Actor",
        "Cyberattack",
        "Threat Intelligence"
      ],
      "createdAt": "2025-10-10T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "0da08529-653f-4e54-9dad-aa9a3ea279e8",
      "slug": "killsec-ransomware-strikes-indonesian-fintech-firm-walletku",
      "headline": "Killsec Ransomware Claims Attack on Indonesian FinTech WalletKu, Threatens to Leak KYC Data",
      "title": "Killsec Ransomware Group Adds Indonesian Digital Payment App WalletKu to Victim List, Exposing Customer KYC Data",
      "severity": "high",
      "excerpt": "The **Killsec** ransomware group has claimed responsibility for an attack on **WalletKu Indompet Indonesia**, a financial technology firm based in Jakarta. WalletKu provides a digital payment application primarily for micro, small, and medium enterprises. According to a post on an underground forum, Killsec has compromised the company and is threatening to release a significant amount of sensitive customer data. The exposed data reportedly includes Know Your Customer (KYC) information, such as full names, photos, government-issued IDs, and addresses. The attack highlights the growing trend of ransomware groups targeting FinTech companies, where the theft of KYC data poses a severe risk of identity theft and fraud for customers.",
      "tags": [
        "ransomware",
        "FinTech",
        "KYC",
        "data breach",
        "Indonesia",
        "Killsec"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Threat Actor"
      ],
      "createdAt": "2025-10-10T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "4f1173b6-5d9a-472a-961c-cea9fe37088c",
      "slug": "datzbro-trojan-targets-seniors-via-ai-powered-facebook-scams",
      "headline": "'Datzbro' Android Trojan Targets Seniors in Global AI-Powered Facebook Scam",
      "title": "Cybercriminals Use AI-Generated Content in Fake Facebook Groups to Lure Seniors into Installing 'Datzbro' Banking Trojan",
      "severity": "high",
      "excerpt": "A global malicious campaign is using AI-generated content to create fake **[Facebook](https://www.facebook.com/)** groups that target seniors. The campaign, detailed in a CYFIRMA report, sets up convincing-looking communities for social events to lure victims into downloading a malicious Android application. This app is a potent banking trojan and spyware known as **Datzbro**. The malware can grant attackers full remote control of the device, enabling them to record audio and video, steal files, and use phishing overlays to capture banking credentials. The campaign has been observed targeting users in Australia, Canada, the UK, and Southeast Asia. The threat is amplified by the fact that the builder for the Datzbro trojan was previously leaked online, allowing any criminal to use it.",
      "tags": [
        "Android malware",
        "banking trojan",
        "social engineering",
        "AI",
        "Facebook",
        "phishing",
        "seniors"
      ],
      "categories": [
        "Malware",
        "Phishing",
        "Mobile Security"
      ],
      "createdAt": "2025-10-10T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}