{
  "pub_id": "pub-2025-11-08",
  "headline": "Samsung Zero-Day Exploited by LANDFALL Spyware; Sandworm Escalates Destructive Attacks on Ukraine",
  "summary": "This cybersecurity publication for November 8, 2025, covers a critical period marked by sophisticated mobile espionage, escalating nation-state attacks, and a record surge in supply chain compromises. Key stories include the discovery of the LANDFALL spyware using a Samsung zero-day for zero-click attacks in the Middle East, a new report detailing Russia's Sandworm group intensifying destructive wiper attacks against Ukraine's critical infrastructure, and data showing software supply chain attacks hit an all-time high in October, driven by ransomware gangs like Qilin.",
  "pub_date": "2025-11-08",
  "total_articles": 7,
  "articles": [
    {
      "id": "dcf8686b-2588-4cd6-b5f1-69a55ee6db88",
      "slug": "clop-ransomware-exploits-oracle-e-business-suite-zero-day-cve-2025-61882",
      "headline": "Cl0p Gang Exploits Oracle EBS Zero-Day in Massive Data Theft Spree",
      "title": "Cl0p Ransomware Linked to Widespread Data Theft via Critical Oracle E-Business Suite Zero-Day (CVE-2025-61882)",
      "severity": "critical",
      "excerpt": "The Cl0p ransomware syndicate, also known as Graceful Spider, is actively exploiting a critical zero-day vulnerability, CVE-2025-61882, in Oracle's E-Business Suite (EBS). The flaw, which has a CVSS score of 9.8, allows for unauthenticated remote code execution and has been used to steal data from numerous organizations since at least August 2025. The attackers exfiltrated data for weeks before sending extortion demands in late September. In response, Oracle released an emergency patch on October 4, 2025, and CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating a patch deadline for federal agencies.",
      "tags": [
        "Zero-Day",
        "RCE",
        "Data Theft",
        "Extortion",
        "Oracle",
        "Cl0p",
        "KEV"
      ],
      "categories": [
        "Vulnerability",
        "Ransomware",
        "Data Breach"
      ],
      "createdAt": "2025-10-09T15:00:00.000Z",
      "updatedAt": "2025-11-08T00:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-61882"
      ],
      "cvssScore": 9.8,
      "isUpdate": true,
      "updateSummary": "CL0P names Washington Post among 100+ victims of Oracle EBS zero-day, demanding up to $50M in ransoms and publicly shaming non-payers.",
      "updateContent": "The CL0P ransomware group has significantly escalated its Oracle EBS zero-day campaign, now claiming over 100 organizations compromised, including high-profile victim The Washington Post. The group is demanding ransoms reaching up to $50 million and has adopted a public shaming tactic, listing non-compliant victims on its dark web leak site to pressure payments. This development underscores the widespread impact and severe financial implications of the ongoing exploitation of the Oracle E-Business Suite vulnerability, highlighting critical supply chain risks from widely used enterprise software."
    },
    {
      "id": "e61a5d0c-da69-467d-b499-4e2e8888ff90",
      "slug": "sonicwall-breach-expands-compromising-all-cloud-backup-users",
      "headline": "SonicWall Breach Far Worse Than Feared: All Cloud Backup Users' Firewall Configs Stolen",
      "title": "SonicWall Confirms Data Breach Compromised Firewall Configuration Backups for All MySonicWall Cloud Backup Customers",
      "severity": "high",
      "excerpt": "**[SonicWall](https://www.sonicwall.com)** has issued a major update on a September data breach, revealing its impact is far more severe than initially disclosed. The company confirmed that an unauthorized party accessed and exfiltrated firewall configuration backups for **all** customers of its MySonicWall cloud backup service, a stark revision from the initial estimate of less than 5%. The stolen `.EXP` files contain complete firewall configurations, including security rules and encrypted credentials. While the credentials remain encrypted, security experts warn that possession of these files significantly lowers the bar for future targeted attacks. SonicWall, assisted by **[Mandiant](https://www.mandiant.com/)**, is urging all affected customers to reset passwords and follow detailed mitigation guidance.",
      "tags": [
        "data breach",
        "SonicWall",
        "firewall",
        "cloud security",
        "API security",
        "configuration management"
      ],
      "categories": [
        "Data Breach",
        "Supply Chain Attack",
        "Cloud Security"
      ],
      "createdAt": "2025-10-10T15:00:00.000Z",
      "updatedAt": "2025-11-08T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "SonicWall confirms state-sponsored actor behind September cloud backup breach, exploiting a compromised API call to steal customer firewall configurations.",
      "updateContent": "SonicWall has concluded its investigation into the September 2025 cloud backup breach, attributing the attack to a sophisticated state-sponsored threat actor. The attackers exploited a compromised API call within the MySonicWall cloud backup service to exfiltrate customer firewall configuration files. The company emphasizes the breach was isolated to this specific cloud environment and did not affect core products or internal networks. Remedial actions and tools have been released to assist customers in securing their services and resetting credentials, highlighting the advanced nature of the adversary and the targeted supply chain attack."
    },
    {
      "id": "83ecb472-0cbe-42bc-9eb1-ece10b910ffb",
      "slug": "qilin-ransomware-gang-claims-new-attacks-across-us-france-africa",
      "headline": "Qilin Ransomware Strikes Again, Claiming Victims Across US, France, and Africa",
      "title": "Qilin Ransomware-as-a-Service Operation Claims Flurry of New Attacks on Leak Site, Targeting Diverse Sectors",
      "severity": "high",
      "excerpt": "The Qilin ransomware-as-a-service (RaaS) group has had a highly active month, listing numerous new victims on its data leak site. The group has claimed responsibility for attacks against a wide range of organizations in the U.S., France, and Africa. Victims include insurance providers, healthcare authorities, real estate firms, and French municipalities. This follows recent high-profile claims against two Texas electric cooperatives and Volkswagen Group Finance, demonstrating the group's broad targeting and operational capability, supported by resilient bulletproof hosting infrastructure.",
      "tags": [
        "Qilin",
        "Ransomware",
        "RaaS",
        "Data Leak",
        "Cyberattack",
        "Double Extortion"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor"
      ],
      "createdAt": "2025-10-16T15:00:00.000Z",
      "updatedAt": "2025-11-08T12:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "Qilin claims 7 new victims in 24 hours, showing continued high activity and targeting professional services and manufacturing.",
      "updateContent": "Qilin ransomware continues its high operational tempo, claiming 7 new victims on November 8, 2025, primarily in the professional services and manufacturing sectors across the US, Canada, and UK. This surge highlights Qilin's ongoing dominance in the RaaS landscape. New technical details include specific MITRE ATT&CK techniques like spearphishing (T1566.001) and exfiltration to cloud storage (T1567.002), alongside D3FEND techniques for detection and mitigation. The group maintains its double-extortion strategy, reinforcing the persistent threat."
    },
    {
      "id": "f8ff6fcb-29ff-47b6-98f5-ce00baa5ff19",
      "slug": "ai-driven-social-engineering-top-cyber-threat-for-2026",
      "headline": "AI-Powered Social Engineering to Become Top Cyber Threat, ISACA Warns",
      "title": "ISACA Report: IT Professionals Rank AI-Driven Social Engineering as #1 Future Threat",
      "severity": "informational",
      "excerpt": "A new report from the global IT association ISACA reveals a major shift in the threat landscape, with IT professionals now believing AI-driven social engineering will be the most significant cyber threat by 2026. The survey of 3,000 professionals found that 63% ranked this emerging threat highest, surpassing ransomware. Critically, the report also highlights a widespread lack of preparedness, with only 13% of organizations feeling 'very prepared' to manage the risks of generative AI, signaling an urgent need for new defense strategies and training.",
      "tags": [
        "Artificial Intelligence",
        "Generative AI",
        "Social Engineering",
        "Phishing",
        "Deepfake",
        "ISACA",
        "Cyber Threat"
      ],
      "categories": [
        "Threat Intelligence",
        "Phishing",
        "Policy and Compliance"
      ],
      "createdAt": "2025-10-20T15:00:00.000Z",
      "updatedAt": "2025-11-08T00:00:00.000Z",
      "readingTime": 6,
      "isUpdate": true,
      "updateSummary": "UAE issues public warning on AI deepfakes, highlighting legal risks and public awareness.",
      "updateContent": "The UAE Cybersecurity Council has issued a formal public warning regarding the escalating threat of AI-generated deepfake content. This advisory emphasizes the potential for deepfakes to spread misinformation, facilitate fraud, and damage reputations. It highlights public awareness as a primary defense and references Federal Decree-Law No. (34) of 2021, which criminalizes the creation and distribution of such content. This development underscores the growing real-world impact and governmental response to the AI-powered social engineering threats previously identified."
    },
    {
      "id": "77e1d23a-8166-42bf-9907-3791a5e2cffd",
      "slug": "malicious-vs-code-extension-with-ransomware-found-on-marketplace",
      "headline": "Malicious VS Code Extension with Ransomware Capabilities Discovered on Official Marketplace",
      "title": "AI-Generated Malicious VS Code Extension 'susvsex' Found to Contain Ransomware Functionality",
      "severity": "medium",
      "excerpt": "A malicious Visual Studio (VS) Code extension named \"susvsex\" was discovered on the official VS Code Extension Marketplace. The extension, which appears to have been created with AI assistance, contained overt ransomware capabilities. Upon activation, it was designed to archive a target directory, exfiltrate the ZIP file to a remote server, and then encrypt the original files. The extension also used a private GitHub repository as a command-and-control channel. Although its default target was a test folder, it could easily be modified to target sensitive user data. Microsoft has since removed the extension, which was published on November 5, 2025.",
      "tags": [
        "VS Code",
        "Ransomware",
        "Malicious Extension",
        "Supply Chain Attack",
        "Developer Security",
        "Microsoft"
      ],
      "categories": [
        "Malware",
        "Supply Chain Attack",
        "Ransomware"
      ],
      "createdAt": "2025-11-08T15:00:00.000Z",
      "updatedAt": "2025-11-08T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "c748444b-2a9e-44a7-9be6-5e06cd82ba95",
      "slug": "hungarian-political-party-tisza-suffers-major-data-breach",
      "headline": "Data of Nearly 200,000 Supporters of Hungarian Party TISZA Leaked Online",
      "title": "Major Data Breach at Hungarian Political Party TISZA Exposes PII of 198,500 Supporters",
      "severity": "high",
      "excerpt": "The personal data of nearly 200,000 supporters of the Hungarian political party TISZA has been leaked and is being widely distributed online. The breach, which occurred in October 2025, originated from the party's \"TISZA Világ\" service. The compromised dataset, containing 198,500 records, has been added to the Have I Been Pwned service. Exposed information includes supporters' full names, email addresses, phone numbers, physical addresses, and usernames. This incident places affected individuals at significant risk of phishing, fraud, and other malicious targeting.",
      "tags": [
        "Data Breach",
        "PII",
        "Hungary",
        "Politics",
        "GDPR",
        "Have I Been Pwned"
      ],
      "categories": [
        "Data Breach"
      ],
      "createdAt": "2025-11-08T15:00:00.000Z",
      "updatedAt": "2025-11-08T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "515d1d28-a81a-4ed1-b977-659a00e1e40b",
      "slug": "bahrain-polytechnic-and-beyon-cyber-partner-on-ai-and-cybersecurity",
      "headline": "Bahrain Fosters Digital Talent with AI and Cybersecurity Partnership",
      "title": "Bahrain Polytechnic and Beyon Cyber Sign MoU to Advance AI and Cybersecurity Innovation",
      "severity": "informational",
      "excerpt": "Bahrain is strengthening its national digital capabilities through a new partnership between Beyon Cyber, a cybersecurity firm, and Bahrain Polytechnic. The two organizations signed a Memorandum of Understanding (MoU) to foster innovation in Artificial Intelligence and cybersecurity. The collaboration aims to develop advanced, AI-driven security solutions and cultivate a skilled local workforce. This strategic initiative is aligned with Bahrain's goal of becoming a regional leader in technology and equipping its next generation of professionals with the skills to tackle modern cybersecurity challenges.",
      "tags": [
        "Bahrain",
        "AI",
        "Cybersecurity",
        "Partnership",
        "Talent Development",
        "Education"
      ],
      "categories": [
        "Security Operations",
        "Other"
      ],
      "createdAt": "2025-11-08T15:00:00.000Z",
      "updatedAt": "2025-11-08T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    }
  ]
}