{
  "pub_id": "pub-2025-12-03",
  "headline": "Android Zero-Days & Critical React RCE Exploited in Wild; Coupang Breach Hits 34M",
  "summary": "This cybersecurity brief for December 3, 2025, covers a series of critical incidents, including the active exploitation of two Android zero-day vulnerabilities and a perfect 10.0 CVSS score RCE flaw in React and Next.js. A massive data breach at South Korean e-commerce giant Coupang exposed the data of nearly 34 million customers due to a compromised employee key. Other major developments include a supply-chain attack on the SmartTube app, new stealthy tactics from Iranian APT MuddyWater, a shift to data extortion by ransomware groups targeting manufacturing, and significant policy updates from the G7 and EU.",
  "pub_date": "2025-12-03",
  "total_articles": 5,
  "articles": [
    {
      "id": "98cfb456-3e1c-458d-9292-1f2dcdbbf084",
      "slug": "daily-ransomware-report-qilin-gang-dominates-november-8-2025",
      "headline": "Qilin Ransomware Gang Claims 7 of 11 New Victims in 24 Hours",
      "title": "Daily Ransomware Report: Qilin Group Leads Surge in Attacks, Targeting Professional Services and Manufacturing",
      "severity": "high",
      "excerpt": "The daily ransomware report for November 8, 2025, highlights a significant burst of activity from the Qilin ransomware group, which claimed responsibility for 7 of the 11 new victims announced in the past 24 hours. The DragonForce group was the second most active with three victims. The attacks primarily targeted the professional services and manufacturing sectors, with victims located in the United States, Canada, and the United Kingdom. This latest surge brings the total number of publicly claimed ransomware victims in 2025 to 6,364, underscoring the relentless and persistent threat that ransomware-as-a-service (RaaS) operations pose to organizations globally.",
      "tags": [
        "Ransomware",
        "Qilin",
        "DragonForce",
        "Data Breach",
        "Cybercrime",
        "RaaS"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor"
      ],
      "createdAt": "2025-11-08T15:00:00.000Z",
      "updatedAt": "2025-12-03T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "Ransomware tactics shift with increased data extortion and decreased encryption rates, impacting manufacturing sector.",
      "updateContent": "A new Sophos report reveals a significant evolution in ransomware tactics, particularly in the manufacturing sector. While improved defenses have led to a five-year low in data encryption rates (40%), attackers, including groups like Qilin, are adapting by increasing extortion-only attacks from 3% to 10%. Exploited vulnerabilities remain the primary root cause. This shift emphasizes the need for enhanced focus on preventing data exfiltration and detecting initial access, as the overall threat remains potent despite changes in attack methodology."
    },
    {
      "id": "e285198c-e08f-412c-98fb-da69943f5949",
      "slug": "critical-react2shell-rce-flaw-disclosed-in-react-and-nextjs",
      "headline": "React2Shell: Critical 10.0 CVSS RCE Hits React & Next.js, Actively Exploited!",
      "title": "Critical 'React2Shell' RCE (CVE-2025-55182) in React Server Components Under Active Exploitation",
      "severity": "critical",
      "excerpt": "A critical unauthenticated remote code execution (RCE) vulnerability, dubbed 'React2Shell' and tracked as CVE-2025-55182, has been disclosed in React Server Components. With a maximum CVSS score of 10.0, the flaw affects popular frameworks like Next.js and allows attackers to take complete control of vulnerable servers. Security researchers have already observed active exploitation in the wild, with attackers attempting to harvest cloud credentials and deploy cryptocurrency miners. Major cloud providers have issued WAF rules as a temporary mitigation, but immediate patching is essential.",
      "tags": [
        "React",
        "Next.js",
        "RCE",
        "Vulnerability",
        "CVSS 10",
        "Zero-Day",
        "Deserialization",
        "WAF"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Cloud Security"
      ],
      "createdAt": "2025-12-03T15:00:00.000Z",
      "updatedAt": "2025-12-03T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-55182",
        "CVE-2025-66478"
      ],
      "cvssScore": 10,
      "isUpdate": false
    },
    {
      "id": "4eb87ec0-85ca-4608-8dd2-a29c3c07e7c1",
      "slug": "valleyrat-malware-campaign-targets-job-seekers-via-foxit-pdf-reader-lure",
      "headline": "ValleyRAT Malware Targets Job Seekers Using Foxit PDF Reader Disguise",
      "title": "ValleyRAT Campaign Abuses Foxit PDF Reader for DLL Side-Loading to Target Job Seekers",
      "severity": "medium",
      "excerpt": "A new malware campaign is distributing the ValleyRAT remote access trojan by preying on job seekers. Attackers send emails with weaponized executables disguised as HR documents, using the Foxit PDF Reader icon as a lure. The attack leverages a legitimate, renamed Foxit executable to perform a DLL side-loading attack, which silently loads the malware while displaying a decoy document to the victim. Once active, ValleyRAT provides attackers with full control over the compromised system, enabling data theft and surveillance.",
      "tags": [
        "ValleyRAT",
        "Malware",
        "Phishing",
        "DLL Side-loading",
        "Social Engineering",
        "Job Seekers",
        "Trend Micro"
      ],
      "categories": [
        "Malware",
        "Phishing",
        "Threat Actor"
      ],
      "createdAt": "2025-12-03T15:00:00.000Z",
      "updatedAt": "2025-12-03T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "b463b034-6e16-4943-96f8-e9e26e1ae4c7",
      "slug": "g7-publishes-framework-for-coordinated-cyber-response-in-financial-sector",
      "headline": "G7 Unveils New Framework for Coordinated Cyber Response in Financial Sector",
      "title": "G7 Publishes Non-Binding Framework for Collective Cyber Incident Response and Recovery (CCIRR) in Financial Sector",
      "severity": "informational",
      "excerpt": "The G7 Cyber Expert Group has published a new policy paper outlining non-binding principles for Collective Cyber Incident Response and Recovery (CCIRR) within the global financial sector. The framework, developed to foster greater cross-border cooperation, aims to improve information sharing, streamline crisis communication, and bolster the resilience of the international financial system against major cyber incidents. The principles are intended as a high-level guide rather than a set of regulatory requirements.",
      "tags": [
        "G7",
        "Financial Sector",
        "Incident Response",
        "Policy",
        "Cybersecurity Framework",
        "CCIRR",
        "Regulation"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Incident Response"
      ],
      "createdAt": "2025-12-03T15:00:00.000Z",
      "updatedAt": "2025-12-03T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "d06ea8d0-9f55-4f51-bb13-a5899504f6d8",
      "slug": "eu-moves-forward-with-cyber-resilience-act-cra-implementation",
      "headline": "EU Cyber Resilience Act Deadlines Loom: Vulnerability Reporting Starts 2026",
      "title": "EU Advances Cyber Resilience Act (CRA) Implementation, Sets Key Deadlines for Manufacturers",
      "severity": "informational",
      "excerpt": "The European Union is advancing the implementation of its landmark Cyber Resilience Act (CRA), which establishes mandatory cybersecurity requirements for all hardware and software products sold in the EU. With the regulation now in force, key deadlines are approaching. Manufacturers must prepare for a critical milestone in September 2026, when obligations to report actively exploited vulnerabilities to authorities within 24 hours will begin. The act aims to enforce security-by-design and ensure products remain secure throughout their lifecycle.",
      "tags": [
        "CRA",
        "EU",
        "Regulation",
        "Compliance",
        "Cybersecurity Act",
        "ENISA",
        "Vulnerability Management"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Vulnerability"
      ],
      "createdAt": "2025-12-03T15:00:00.000Z",
      "updatedAt": "2025-12-03T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}