{
  "pub_id": "pub-2025-12-19",
  "headline": "Critical Zero-Days in Cisco, Chrome, and WatchGuard Actively Exploited; React2Shell Weaponized for Ransomware",
  "summary": "This cybersecurity brief for December 19, 2025, covers a surge in critical vulnerability exploitation. Multiple threat actors are leveraging the React2Shell flaw (CVE-2025-55182) to deploy ransomware. Concurrently, a China-linked APT is exploiting a zero-day in Cisco email gateways (CVE-2025-20393), and actively exploited flaws in WatchGuard firewalls and Google Chrome are putting networks and users at severe risk. Other major incidents include critical patches for HPE OneView, significant data breaches at SoundCloud and 700Credit, and new regulatory updates from the UK.",
  "pub_date": "2025-12-19",
  "total_articles": 4,
  "articles": [
    {
      "id": "a5bdcac9-eafd-46c7-919d-4551f2afcc11",
      "slug": "china-linked-apt-exploits-cisco-email-gateway-zero-day",
      "headline": "China-Linked Hackers Exploit Critical Cisco Email Gateway Zero-Day",
      "title": "Cisco Discloses Actively Exploited Zero-Day (CVE-2025-20393) in Email Security Appliances Linked to Chinese APT",
      "severity": "critical",
      "excerpt": "Cisco has revealed that a China-affiliated advanced persistent threat (APT) group, tracked as UAT-9686, is actively exploiting a critical zero-day vulnerability in its email security products. The flaw, CVE-2025-20393, is a remote code execution vulnerability with a maximum CVSS score of 10.0, affecting Cisco Secure Email Gateway and Secure Email and Web Manager appliances. The attackers have been exploiting the flaw since late November 2025 to gain root-level access and have deployed persistence mechanisms on compromised devices. Due to active exploitation by a nation-state actor, CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating immediate patching for federal agencies.",
      "tags": [
        "Zero-Day",
        "Cisco",
        "APT",
        "UAT-9686",
        "China",
        "RCE",
        "KEV",
        "CISA"
      ],
      "categories": [
        "Vulnerability",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2025-12-19T15:00:00.000Z",
      "updatedAt": "2025-12-19T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-20393"
      ],
      "cvssScore": 10,
      "isUpdate": false
    },
    {
      "id": "fbe1b521-9942-4ded-a820-dce376ae6fca",
      "slug": "hpe-patches-critical-10-0-cvss-flaw-in-oneview-management-tool",
      "headline": "HPE Issues Urgent Patch for 10.0 CVSS RCE Flaw in OneView",
      "title": "HPE Patches Critical Unauthenticated RCE Vulnerability (CVE-2025-37164) in OneView Infrastructure Management Software",
      "severity": "critical",
      "excerpt": "Hewlett Packard Enterprise (HPE) has released an urgent security advisory for CVE-2025-37164, a critical vulnerability in its OneView infrastructure management software with a maximum CVSS score of 10.0. The flaw allows a remote, unauthenticated attacker to achieve complete remote code execution on affected systems. HPE OneView versions 5.20 through 10.20 are impacted. Given that OneView serves as a central control plane for enterprise server, storage, and firmware management, a compromise could give an attacker control over vast segments of IT infrastructure. HPE is urging customers to upgrade to the patched version 11.0 or apply an emergency hotfix immediately.",
      "tags": [
        "HPE",
        "OneView",
        "RCE",
        "Vulnerability",
        "CVSS 10",
        "Patch Management",
        "Infrastructure"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Industrial Control Systems"
      ],
      "createdAt": "2025-12-19T15:00:00.000Z",
      "updatedAt": "2025-12-19T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-37164"
      ],
      "cvssScore": 10,
      "isUpdate": false
    },
    {
      "id": "cbd4fcb2-2fb0-48e6-bf55-7bf891df567e",
      "slug": "watchguard-warns-of-actively-exploited-critical-firewall-rce-flaw",
      "headline": "Actively Exploited RCE Flaw in WatchGuard Firewalls Puts Networks at Risk",
      "title": "WatchGuard Urges Immediate Patching for Actively Exploited Critical RCE Vulnerability (CVE-2025-14733) in Fireware OS",
      "severity": "critical",
      "excerpt": "WatchGuard has issued an urgent advisory for customers to patch CVE-2025-14733, a critical remote code execution vulnerability in its Fireware OS that is confirmed to be under active exploitation. The flaw, an out-of-bounds write issue in the IKEv2 process, has a CVSS score of 9.3 and can be exploited by an unauthenticated remote attacker. The vulnerability affects Firebox firewalls with specific IKEv2 VPN configurations enabled. Given that firewalls are prime targets for initial access, immediate application of the provided security updates is crucial to protect network perimeters from compromise.",
      "tags": [
        "WatchGuard",
        "Firewall",
        "RCE",
        "VPN",
        "IKEv2",
        "Active Exploitation",
        "KEV"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Patch Management"
      ],
      "createdAt": "2025-12-19T15:00:00.000Z",
      "updatedAt": "2025-12-19T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-14733"
      ],
      "cvssScore": 9.3,
      "isUpdate": false
    },
    {
      "id": "320713ec-e8a5-466b-9e2f-e4560969738d",
      "slug": "manufacturers-targeted-in-supply-chain-attacks-via-web-portals",
      "headline": "Manufacturing Web Portals Are a Weak Link in Supply Chain Attacks",
      "title": "Attackers Target Manufacturers' Web Portals with Bots and SQL Injection to Launch Supply Chain Attacks",
      "severity": "high",
      "excerpt": "A new report reveals that cybercriminals are increasingly targeting manufacturers through their public-facing web portals, such as supplier and customer forms, to execute supply chain attacks. Attackers are using bots and SQL injection to compromise these forms, which often run on legacy systems with weak security. The goal is to steal sensitive data, including credentials and intellectual property, or to gain a foothold to attack more heavily regulated downstream customers in defense, healthcare, and finance. A survey found that 85% of manufacturing firms experienced a security incident related to web forms, and 42% confirmed a resulting data breach.",
      "tags": [
        "Supply Chain",
        "Manufacturing",
        "SQL Injection",
        "Bots",
        "Web Security",
        "Data Breach"
      ],
      "categories": [
        "Supply Chain Attack",
        "Cyberattack",
        "Data Breach"
      ],
      "createdAt": "2025-12-19T15:00:00.000Z",
      "updatedAt": "2025-12-19T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}