{
  "pub_id": "pub-2026-01-10",
  "headline": "Chinese Hackers Caught Exploiting VMware Zero-Days for Over a Year; FBI Warns of North Korean 'Quishing' Attacks",
  "summary": "This cybersecurity brief for January 10, 2026, covers several critical developments. A sophisticated Chinese-linked threat actor was discovered exploiting a trio of VMware ESXi zero-days for more than a year before they were patched, enabling full VM escapes. The FBI has issued a warning about the North Korean Kimsuky APT using QR code phishing ('quishing') to bypass email security and steal credentials. Additionally, major data breaches have been disclosed by the Illinois Department of Human Services, affecting 700,000 residents, and online gambling firm BetVictor. CISA has also added a critical, actively exploited HPE OneView vulnerability to its KEV catalog, mandating urgent patching.",
  "pub_date": "2026-01-10",
  "total_articles": 8,
  "articles": [
    {
      "id": "0536d836-a9ed-47ef-ba6f-a22fb9c7cd7c",
      "slug": "hpe-oneview-critical-rce-vulnerability-cve-2025-37164",
      "headline": "HPE OneView Flaw Scores Perfect 10.0, Grants Attackers 'Keys to the Kingdom'",
      "title": "HPE OneView Hit with Maximum-Severity RCE Vulnerability (CVE-2025-37164)",
      "severity": "critical",
      "excerpt": "Hewlett Packard Enterprise (HPE) has disclosed CVE-2025-37164, a critical unauthenticated remote code execution vulnerability in its OneView infrastructure management software. The flaw, rated with a maximum CVSS score of 10.0, allows a remote attacker to gain complete control of the centralized management appliance without any credentials. Given OneView's extensive privileges over servers, storage, and firmware, a successful exploit could lead to a catastrophic compromise of an organization's entire infrastructure. CISA has added the vulnerability to its KEV catalog, mandating immediate patching for federal agencies.",
      "tags": [
        "RCE",
        "Unauthenticated",
        "CVSS 10.0",
        "KEV",
        "Infrastructure Management",
        "Data Center Security"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Threat Intelligence"
      ],
      "createdAt": "2025-12-20T15:00:00.000Z",
      "updatedAt": "2026-01-10T00:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-37164"
      ],
      "cvssScore": 10,
      "isUpdate": true,
      "updateSummary": "CISA confirms active exploitation of critical HPE OneView RCE (CVE-2025-37164), mandating immediate patching for federal agencies by Jan 28, 2026.",
      "updateContent": "CISA has officially confirmed that the critical HPE OneView RCE vulnerability, CVE-2025-37164, is now being actively exploited in the wild. This update follows the initial disclosure and CISA's previous KEV listing, which indicated high risk. The confirmation of active exploitation, likely spurred by a public Proof-of-Concept released in late December 2025, elevates the threat level significantly. CISA has reiterated its mandate for federal agencies to patch by January 28, 2026, urging all organizations to prioritize remediation immediately due to the severe risk of infrastructure compromise."
    },
    {
      "id": "ae7a040c-29a0-43dc-9236-6f4438c1abc9",
      "slug": "illinois-dhs-data-breach-exposes-700000-residents",
      "headline": "Illinois DHS Exposes Data of 700,000 Residents in Massive Misconfiguration Breach",
      "title": "Illinois Department of Human Services Exposes Personal and Health Information of 705,000 Residents via Public Website",
      "severity": "high",
      "excerpt": "The Illinois Department of Human Services (IDHS) has disclosed a major data breach affecting approximately 705,000 state residents. The breach was caused by incorrect privacy settings on internal planning maps that were inadvertently made public on a mapping website for up to four years. The exposed data includes addresses, case numbers, and medical plan information for Medicaid recipients, and names, addresses, and case details for customers of the Division of Rehabilitation Services. The exposure, which constitutes a HIPAA violation, was discovered in September 2025 but only announced in January 2026. IDHS has since secured the data and implemented new policies to prevent a recurrence.",
      "tags": [
        "Data Breach",
        "Illinois",
        "IDHS",
        "Misconfiguration",
        "HIPAA",
        "PII",
        "PHI",
        "Government"
      ],
      "categories": [
        "Data Breach",
        "Regulatory",
        "Policy and Compliance"
      ],
      "createdAt": "2026-01-10T15:00:00.000Z",
      "updatedAt": "2026-01-10T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "e1349c05-1059-4887-b527-0f2c16e47790",
      "slug": "chinese-apt-salt-typhoon-breaches-us-congressional-staff-emails",
      "headline": "Chinese State Hackers 'Salt Typhoon' Breach U.S. Congressional Committee Emails",
      "title": "Chinese APT Salt Typhoon Infiltrates Email Systems of U.S. House Committee Staff",
      "severity": "high",
      "excerpt": "The Chinese state-sponsored hacking group known as Salt Typhoon has reportedly compromised the email systems of staff members for several key U.S. House of Representatives committees. The cyberespionage campaign, detected in December 2025, targeted aides on influential panels including those overseeing China, foreign affairs, intelligence, and armed services. While lawmakers' personal accounts are not believed to have been accessed, the infiltration of staff networks raises significant national security concerns about the potential for long-term intelligence gathering from sensitive, unclassified communications. Salt Typhoon is a known actor with a history of targeting U.S. critical infrastructure.",
      "tags": [
        "Salt Typhoon",
        "China",
        "APT",
        "Cyberespionage",
        "US Government",
        "Congress",
        "Email Breach"
      ],
      "categories": [
        "Threat Actor",
        "Cyberattack",
        "Policy and Compliance"
      ],
      "createdAt": "2026-01-10T15:00:00.000Z",
      "updatedAt": "2026-01-10T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "f2e038f6-300c-4bb0-a865-0b7615e2ee13",
      "slug": "cisco-patches-snort-3-flaws-allowing-dos-and-data-leaks",
      "headline": "Cisco Patches Medium-Severity Flaws in Snort 3 Engine That Could Lead to DoS and Data Leaks",
      "title": "Cisco Snort 3 Vulnerabilities in DCE/RPC Processing Allow for Denial of Service and Information Disclosure",
      "severity": "medium",
      "excerpt": "Cisco has disclosed two medium-severity vulnerabilities, CVE-2026-20026 and CVE-2026-20027, in its widely used Snort 3 detection engine. The flaws exist in the processing of DCE/RPC traffic and can be triggered by a remote, unauthenticated attacker. CVE-2026-20026 (CVSS 5.8) is a use-after-free issue that could cause the engine to crash, leading to a denial-of-service. CVE-2026-20027 (CVSS 5.3) is an out-of-bounds read that could leak sensitive memory data. The vulnerabilities affect numerous Cisco products, including Secure Firewall, IOS XE with UTD, and Meraki MX appliances. Patches are available for some products, but others are pending.",
      "tags": [
        "Cisco",
        "Snort",
        "Vulnerability",
        "Patch Management",
        "Denial of Service",
        "Information Disclosure",
        "DCE/RPC"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2026-01-10T15:00:00.000Z",
      "updatedAt": "2026-01-10T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-20026",
        "CVE-2026-20027"
      ],
      "cvssScore": 5.8,
      "isUpdate": false
    },
    {
      "id": "e832d94c-d13a-47ed-9763-fea5b53f94fd",
      "slug": "google-patches-high-risk-chrome-webview-security-bypass-flaw",
      "headline": "Google Patches High-Severity Chrome Flaw That Could Allow Attackers to Bypass Security Policies",
      "title": "Google Releases Urgent Patch for High-Risk Chrome WebView Vulnerability (CVE-2026-0628)",
      "severity": "high",
      "excerpt": "Google has issued a security update for its Chrome browser, patching a high-severity vulnerability tracked as CVE-2026-0628. The flaw, which affects Chrome on Windows, macOS, and Linux, is described as an \"insufficient policy enforcement\" issue within the WebView component. An attacker could exploit this by tricking a user into installing a malicious extension, which could then bypass security controls to execute unauthorized code on normally protected browser pages. This could lead to data theft or session hijacking. While there is no evidence of active exploitation, Google urges all users to update to the patched versions immediately.",
      "tags": [
        "Google Chrome",
        "Vulnerability",
        "Security Bypass",
        "WebView",
        "Patch Management",
        "CVE-2026-0628"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2026-01-10T15:00:00.000Z",
      "updatedAt": "2026-01-10T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-0628"
      ],
      "isUpdate": false
    },
    {
      "id": "6d220bbb-a5cf-43ac-a109-7880d1fcc8fb",
      "slug": "betvictor-online-gambling-site-reports-data-breach",
      "headline": "Online Betting Giant BetVictor Discloses Major Data Breach, Customer Data Compromised",
      "title": "BetVictor Confirms Significant Data Breach Impacting Customer Information and Operations",
      "severity": "high",
      "excerpt": "BetVictor, a major European online gambling company, has officially disclosed a significant data breach that compromised sensitive customer information. The security incident was first detected on January 8, 2026, during routine security audits and has caused unspecified operational disruptions. The company has not yet detailed the nature of the attack or the exact types of data accessed. An investigation is underway as BetVictor works to secure its systems and manage the fallout, which could include regulatory scrutiny and a loss of customer trust in the highly competitive online gaming market.",
      "tags": [
        "Data Breach",
        "BetVictor",
        "Gambling",
        "Gaming",
        "Customer Data"
      ],
      "categories": [
        "Data Breach",
        "Cyberattack"
      ],
      "createdAt": "2026-01-10T15:00:00.000Z",
      "updatedAt": "2026-01-10T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "1b6f26be-9961-4f8e-ae70-c579f7996ee2",
      "slug": "instagram-data-leak-exposes-17-5-million-users",
      "headline": "Data of 17.5 Million Instagram Users Leaked on Hacker Forum After Scraping Attack",
      "title": "Scraped Data of 17.5 Million Instagram Users, Including Emails and Phone Numbers, Leaked on BreachForums",
      "severity": "high",
      "excerpt": "The personal data of approximately 17.5 million Instagram users has been leaked on the BreachForums hacking forum. The data, posted by a user named 'Solonik,' was allegedly obtained via automated data scraping from public APIs. The leaked information includes full names, email addresses, phone numbers, and user IDs, exposing the affected individuals to a high risk of targeted phishing, identity theft, and SIM swapping attacks. Following the leak, users have reported a surge in fraudulent password reset attempts. As of January 10, 2026, Instagram's parent company, Meta, has not formally acknowledged the incident.",
      "tags": [
        "Data Leak",
        "Data Scraping",
        "Instagram",
        "Meta",
        "BreachForums",
        "PII",
        "Phishing",
        "SIM Swapping"
      ],
      "categories": [
        "Data Breach",
        "Phishing"
      ],
      "createdAt": "2026-01-10T15:00:00.000Z",
      "updatedAt": "2026-01-10T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "241294e3-363b-47d9-a7f3-f00b7c92a305",
      "slug": "critical-openssh-flaw-affects-moxa-industrial-switches",
      "headline": "Critical OpenSSH Flaw Exposes Moxa Industrial Switches to Remote Code Execution",
      "title": "Moxa Warns of Critical RCE Vulnerability (CVE-2023-38408) in Industrial Ethernet Switches",
      "severity": "critical",
      "excerpt": "Industrial networking vendor Moxa has issued a security advisory for a critical vulnerability, CVE-2023-38408, affecting its EDS-G4000 and RKS-G4000 series industrial Ethernet switches. The flaw resides in the OpenSSH service integrated into the device firmware and could allow a remote attacker to execute arbitrary code. These switches are commonly used in critical infrastructure and industrial control systems (ICS), making the vulnerability particularly high-risk. The Canadian Centre for Cyber Security has echoed the warning, and both organizations are urging administrators to apply the provided firmware updates immediately to mitigate the threat.",
      "tags": [
        "Moxa",
        "ICS",
        "OT Security",
        "Vulnerability",
        "Critical Infrastructure",
        "OpenSSH",
        "RCE",
        "CVE-2023-38408"
      ],
      "categories": [
        "Vulnerability",
        "Industrial Control Systems",
        "Patch Management"
      ],
      "createdAt": "2026-01-10T15:00:00.000Z",
      "updatedAt": "2026-01-10T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2023-38408"
      ],
      "isUpdate": false
    }
  ]
}