{
  "pub_id": "pub-2026-01-22",
  "headline": "Cisco Zero-Day Under Active Attack as Oracle Drops Massive 337-Flaw Patch Update and Everest Ransomware Hits Major Brands",
  "summary": "The cybersecurity landscape for January 22, 2026, is dominated by critical vulnerabilities and high-profile cyberattacks. Cisco is racing to patch an actively exploited zero-day RCE flaw (CVE-2026-20045) in its communications products, which CISA has added to its KEV catalog. Oracle released a massive January Critical Patch Update addressing 337 flaws, over 235 of which are remotely exploitable. Meanwhile, the Everest ransomware group has been highly active, claiming major data breaches at Under Armour and McDonald's India, threatening to leak data for millions of customers. Other significant events include critical patches from Zoom and GitLab, and reports highlighting the growing risks of supply chain attacks through both SaaS platforms and misconfigured security training applications.",
  "pub_date": "2026-01-22",
  "total_articles": 12,
  "articles": [
    {
      "id": "13ad4e28-db23-4995-842c-da2abf41b9cd",
      "slug": "oracle-january-2026-critical-patch-update-fixes-337-flaws-including-cvss-10-bug",
      "headline": "Oracle Issues Critical Patch for CVSS 10.0 Auth Bypass in WebLogic Server",
      "title": "Oracle's January 2026 Critical Patch Update Addresses 337 Vulnerabilities, Including a Perfect 10.0 Flaw",
      "severity": "critical",
      "excerpt": "Oracle has released its January 2026 Critical Patch Update (CPU), a massive security release containing 337 fixes for vulnerabilities across its product portfolio. The most severe flaw addressed is CVE-2026-21962, a critical authentication bypass vulnerability in the Oracle WebLogic Server Proxy Plug-in with a CVSS score of 10.0. This vulnerability can be exploited remotely by a low-privileged attacker without user interaction, potentially allowing complete takeover of the affected component. The flaw impacts WebLogic Server Proxy Plug-in versions 12.2.1.4.0, 14.1.1.0.0, and 14.1.2.0.0. Oracle strongly urges customers to apply these cumulative patches immediately, highlighting the continued risk of exploitation of previously patched vulnerabilities due to slow enterprise adoption rates.",
      "tags": [
        "Oracle",
        "Critical Patch Update",
        "CPU",
        "Vulnerability",
        "CVE-2026-21962",
        "WebLogic Server",
        "Patch Management",
        "Authentication Bypass"
      ],
      "categories": [
        "Patch Management",
        "Vulnerability"
      ],
      "createdAt": "2026-01-21T15:00:00.000Z",
      "updatedAt": "2026-01-22T00:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-21962"
      ],
      "cvssScore": 10,
      "isUpdate": true,
      "updateSummary": "Oracle's January 2026 CPU includes another CVSS 10.0 flaw (CVE-2025-66516 in Apache Tika) and addresses over 235 remotely exploitable vulnerabilities across 30+ product families.",
      "updateContent": "The January 2026 Critical Patch Update from Oracle is more extensive than initially detailed, addressing approximately 230 unique CVEs, with over 235 vulnerabilities remotely exploitable without authentication. Beyond the critical WebLogic flaw (CVE-2026-21962), another CVSS 10.0 vulnerability, CVE-2025-66516, has been identified in the Apache Tika library used by Oracle products. This broad update impacts over 30 product families, including JD Edwards, MySQL, E-Business Suite, and Fusion Middleware, underscoring the widespread risk and the urgent need for comprehensive patching across all affected Oracle environments."
    },
    {
      "id": "9bdd3986-1b78-48e2-99ea-87a3453f946d",
      "slug": "everest-ransomware-claims-major-data-breach-at-mcdonalds-india",
      "headline": "Everest Ransomware Claims 861GB Data Breach at McDonald's India",
      "title": "Everest Ransomware Group Alleges Major Breach of McDonald's India, Threatens to Leak Customer and Corporate Data",
      "severity": "high",
      "excerpt": "The Everest ransomware group has claimed a major cyberattack against McDonald's India, alleging the theft of 861 gigabytes of sensitive data. In a post on its dark web leak site on January 20, 2026, the group threatened to publicly release the information if a ransom is not paid. The compromised data reportedly includes a vast amount of personal information on customers and employees, as well as internal corporate documents. This incident, if confirmed, would be the latest in a series of data security issues for the fast-food giant's Indian operations, which suffered previous breaches. The Everest group, a Russian-speaking operation active since 2020, is known for its double-extortion tactics, and the potential leak of customer data poses a significant risk of identity theft and phishing campaigns.",
      "tags": [
        "Everest",
        "Ransomware",
        "Data Breach",
        "McDonald's",
        "India",
        "Dark Web",
        "PII"
      ],
      "categories": [
        "Ransomware",
        "Data Breach"
      ],
      "createdAt": "2026-01-21T15:00:00.000Z",
      "updatedAt": "2026-01-22T10:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "Everest ransomware group provided screenshots as proof of McDonald's India breach, showing financial reports, internal audits, and investor contact database, suggesting ERP system compromise.",
      "updateContent": "The Everest ransomware group has released screenshots as proof of their alleged data breach at McDonald's India. These images purportedly display internal financial reports, audit trails, and a 'Contact Database' containing investor and partner information from multiple regions including the US, UK, Singapore, and India. This new evidence strongly suggests a deeper compromise, potentially involving core accounting or Enterprise Resource Planning (ERP) systems, escalating the potential impact beyond initial reports of general sensitive data. The group also issued a two-day deadline for McDonald's India to respond to their ransom demands."
    },
    {
      "id": "850e803d-4c6d-4a09-b4fb-7fef094d8bf5",
      "slug": "cisco-warns-of-actively-exploited-zero-day-rce-flaw-cve-2026-20045",
      "headline": "Cisco Scrambles to Patch Actively Exploited RCE Zero-Day in Comms Products",
      "title": "Cisco Warns of Actively Exploited Zero-Day RCE Flaw (CVE-2026-20045) in Unified Communications and Webex Products",
      "severity": "critical",
      "excerpt": "Cisco has issued an urgent warning and emergency patches for a critical remote code execution (RCE) vulnerability, CVE-2026-20045, affecting a wide range of its Unified Communications and Webex Calling products. This zero-day flaw is being actively exploited in the wild, allowing unauthenticated attackers to send crafted HTTP requests to the web management interface and execute arbitrary code, potentially leading to full root access on the underlying server. In response to the active threat, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to patch by February 11, 2026. Cisco has confirmed there are no workarounds and is urging all customers to apply the updates immediately.",
      "tags": [
        "Zero-Day",
        "RCE",
        "Active Exploitation",
        "KEV",
        "Unified Communications",
        "Patching"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Threat Intelligence"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-22T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2026-20045"
      ],
      "cvssScore": 8.2,
      "isUpdate": false
    },
    {
      "id": "db7fae1a-2c3c-46da-bb12-d64462409279",
      "slug": "everest-ransomware-claims-under-armour-breach-leaks-data-of-72m-customers",
      "headline": "Everest Ransomware Leaks Data of 72 Million Under Armour Customers After Failed Talks",
      "title": "Everest Ransomware Group Claims Under Armour Breach, Publishes Data of 72 Million Customers on Dark Web",
      "severity": "high",
      "excerpt": "The Everest ransomware group has claimed a massive data breach against athletic apparel giant Under Armour. After negotiations allegedly failed, the group announced on its dark web leak site that it has published the full dataset, which it claims contains 191 million records, including 72.7 million unique email addresses. The compromised data reportedly includes sensitive customer information such as full names, phone numbers, physical locations, and purchase histories. This breach places a huge number of individuals at significant risk for targeted phishing campaigns, identity theft, and other fraudulent activities.",
      "tags": [
        "Everest",
        "Ransomware",
        "Data Breach",
        "Under Armour",
        "Dark Web",
        "PII"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Threat Actor"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-22T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "de6e531a-05d3-4e1c-8690-3bd041d3d395",
      "slug": "insecure-security-training-apps-expose-cloud-infrastructure-at-major-firms",
      "headline": "Exposed Security Training Apps Like OWASP Juice Shop Create Backdoors into Corporate Clouds",
      "title": "Threat Actors Exploit Publicly Exposed Security Training Apps to Breach Cloud Infrastructure of Major Firms",
      "severity": "high",
      "excerpt": "A new report reveals a dangerous trend where intentionally vulnerable security training applications, such as OWASP Juice Shop and DVWA, are being deployed on live, production cloud infrastructure and left exposed to the internet. Threat actors are actively scanning for and exploiting these misconfigured applications to compromise the cloud environments of numerous organizations, including Fortune 500 companies and security vendors. The exploits have been used to achieve remote code execution, deploy webshells, install cryptominers, and steal sensitive cloud credentials, turning these training tools into unmonitored backdoors.",
      "tags": [
        "Cloud Security",
        "Misconfiguration",
        "AWS",
        "Azure",
        "OWASP Juice Shop",
        "Supply Chain Attack",
        "Credential Theft"
      ],
      "categories": [
        "Cloud Security",
        "Cyberattack",
        "Vulnerability"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-22T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "90502df5-5957-4b6f-a4e1-a994b88ab4a5",
      "slug": "skeleton-key-campaign-bypasses-malware-defenses-by-abusing-rmm-tools",
      "headline": "'Skeleton Key' Attacks Bypass Defenses by Weaponizing Legitimate RMM Tools",
      "title": "New 'Skeleton Key' Campaign Abuses Legitimate RMM Software for Stealthy Backdoor Access",
      "severity": "high",
      "excerpt": "A sophisticated attack campaign dubbed \"Skeleton Key\" is bypassing traditional, malware-focused security defenses by weaponizing legitimate remote monitoring and management (RMM) software. A report from KnowBe4 Threat Labs details how attackers first compromise user credentials and then abuse trusted IT tools to create persistent, stealthy backdoors inside enterprise networks. This 'living-off-the-land' (LotL) technique allows attackers to blend in with normal administrative activity, making their presence extremely difficult to detect and highlighting the need for security teams to shift focus from signature-based detection to behavioral analysis and identity security.",
      "tags": [
        "Living off the Land",
        "LOTL",
        "RMM",
        "Threat Actor",
        "Defense Evasion",
        "Persistence"
      ],
      "categories": [
        "Threat Intelligence",
        "Security Operations",
        "Cyberattack"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-22T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "1c59ff75-eb97-4aca-ba06-a3c1e36ed0a5",
      "slug": "zoom-and-gitlab-patch-critical-flaws-including-9-9-cvss-vulnerability",
      "headline": "Zoom & GitLab Race to Patch Critical Flaws, Including a 9.9 CVSS RCE Bug",
      "title": "Zoom and GitLab Release Patches for Critical Vulnerabilities, Including Near-Perfect 9.9 CVSS RCE Flaw in Zoom Node",
      "severity": "critical",
      "excerpt": "Both Zoom and GitLab have released critical security updates to address several high-severity vulnerabilities. The most severe flaw, CVE-2026-22844, is a remote code execution vulnerability in Zoom Node Multimedia Routers (MMRs) with a near-perfect CVSS score of 9.9. This flaw could allow an unauthenticated attacker with network access to compromise the devices. GitLab's updates address multiple vulnerabilities, including two high-severity flaws (CVE-2025-13927 and CVE-2025-13928) that could allow an unauthenticated user to cause denial-of-service conditions. Users of all affected products are urged to apply the patches immediately.",
      "tags": [
        "Zoom",
        "GitLab",
        "RCE",
        "DoS",
        "Vulnerability",
        "Patching",
        "Critical"
      ],
      "categories": [
        "Patch Management",
        "Vulnerability"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-22T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2026-22844",
        "CVE-2025-13927",
        "CVE-2025-13928"
      ],
      "cvssScore": 9.9,
      "isUpdate": false
    },
    {
      "id": "e2c79874-933a-4e94-a8b0-fe37f3b21535",
      "slug": "reports-highlight-growing-threat-of-saas-and-digital-supply-chain-attacks",
      "headline": "Spotlight on Supply Chain Risk: Reports Warn of Escalating SaaS-to-SaaS Attacks",
      "title": "Growing Threat of SaaS and Digital Supply Chain Attacks Highlighted by New Reports and Security Solutions",
      "severity": "informational",
      "excerpt": "The digital supply chain has become a primary focus of cyber risk, as highlighted by multiple events on January 22, 2026. A new report from security firm Black Kite warns that the retail and wholesale sectors are highly exposed to attacks that exploit interconnected IT systems and shared vendors. Concurrently, SaaS security leader Obsidian Security launched the industry's first end-to-end SaaS supply chain security solution to combat the growing threat of SaaS-to-SaaS attacks, where a compromise in one application (like Salesloft) can cascade to affect hundreds of integrated partner applications (like Drift). These developments underscore the urgent need for organizations to gain visibility and control over their sprawling, interconnected digital ecosystems.",
      "tags": [
        "Supply Chain Attack",
        "SaaS",
        "Cloud Security",
        "Third-Party Risk",
        "API Security"
      ],
      "categories": [
        "Supply Chain Attack",
        "Cloud Security",
        "Threat Intelligence"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-22T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "2e05719e-17c9-4d88-b8d2-07685cedfb5e",
      "slug": "osticket-vulnerability-allows-arbitrary-file-reading-via-pdf-export-cve-2026-22200",
      "headline": "osTicket Flaw Lets Attackers Read Server Files via Malicious PDF Export",
      "title": "osTicket Vulnerability (CVE-2026-22200) Allows Arbitrary File Reading via PDF Export Feature",
      "severity": "high",
      "excerpt": "A high-severity vulnerability, CVE-2026-22200, has been disclosed in osTicket, a popular open-source helpdesk system. The flaw allows an unauthenticated, anonymous attacker to read arbitrary files from the server by injecting a malicious PHP filter chain into a support ticket. When a privileged user exports the ticket to PDF, the vulnerability is triggered, embedding the contents of sensitive server files (like configuration files) into the generated PDF as a bitmap image. Researchers warn this flaw can be chained with other vulnerabilities for full remote code execution (RCE). Patches are available in versions 1.18.3 and 1.17.4.",
      "tags": [
        "osTicket",
        "Vulnerability",
        "PHP",
        "Arbitrary File Read",
        "CVE-2026-22200"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-22T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2026-22200",
        "CVE-2024-2961"
      ],
      "isUpdate": false
    },
    {
      "id": "98613509-0cc3-4977-ac28-dd60ee0f2cad",
      "slug": "critical-nodejs-flaw-in-binary-parser-library-allows-code-execution-cve-2026-1245",
      "headline": "Critical Flaw in Popular Node.js Library 'binary-parser' Allows Code Execution",
      "title": "Node.js Supply Chain Risk: 'binary-parser' Library Vulnerable to RCE (CVE-2026-1245)",
      "severity": "high",
      "excerpt": "The CERT Coordination Center (CERT/CC) has issued a warning about a critical vulnerability, CVE-2026-1245, in the popular 'binary-parser' npm library for Node.js. The flaw, which has a CVSS score of 6.5, allows for arbitrary JavaScript execution. The vulnerability exists because the library dynamically generates parser code from user-supplied input without proper sanitization, creating a code injection sink. This poses a significant software supply chain risk, as any application using the library to parse untrusted data could be compromised. Developers are urged to update to the patched version 2.3.0 immediately.",
      "tags": [
        "Node.js",
        "npm",
        "Supply Chain Attack",
        "Vulnerability",
        "RCE",
        "CVE-2026-1245"
      ],
      "categories": [
        "Vulnerability",
        "Supply Chain Attack",
        "Patch Management"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-22T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2026-1245"
      ],
      "cvssScore": 6.5,
      "isUpdate": false
    },
    {
      "id": "5edb5a31-7dc1-4259-915b-cbab1c96711f",
      "slug": "new-ai-powered-android-malware-evades-detection-with-human-like-behavior",
      "headline": "New Android Malware Uses AI to Mimic Human Behavior and Evade Detection",
      "title": "AI-Powered Android Malware Leverages TensorFlow to Commit Sophisticated Ad Fraud",
      "severity": "medium",
      "excerpt": "A new and sophisticated family of Android malware is leveraging artificial intelligence to commit ad fraud while evading detection. The malware uses TensorFlow, Google's open-source machine learning framework, to mimic human-like behavior, such as realistic clicks and swipes on hidden advertisements. This advanced technique allows it to bypass traditional ad fraud detection systems that rely on identifying the predictable, scripted patterns of bots. The malware can also stream video of its operations back to attackers, likely for model refinement, representing a significant evolution in mobile threat capabilities.",
      "tags": [
        "Android",
        "Malware",
        "AI",
        "TensorFlow",
        "Ad Fraud",
        "Mobile Security"
      ],
      "categories": [
        "Malware",
        "Mobile Security"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-22T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "8bf7a16c-5c1c-4ff9-a0a5-8592ed1a3014",
      "slug": "gnu-inetutils-flaw-allows-remote-authentication-bypass-in-telnet-cve-2026-24061",
      "headline": "Critical GNU Inetutils Flaw Allows Root Access via Telnet Authentication Bypass",
      "title": "GNU Inetutils Telnet Daemon Vulnerable to Remote Authentication Bypass (CVE-2026-24061)",
      "severity": "critical",
      "excerpt": "A critical authentication bypass vulnerability, CVE-2026-24061, has been disclosed in the telnet daemon (telnetd) of GNU Inetutils, a common package of networking utilities for many Unix-like operating systems. The flaw allows a remote attacker to bypass authentication and gain root access to the system simply by providing a specially crafted username. Successful exploitation, achieved by passing '-f root' as the USER environment variable, leads to a complete compromise of the machine. All versions of GNU Inetutils up to and including 2.7 are affected. Administrators are urged to disable the telnetd service immediately.",
      "tags": [
        "GNU",
        "Telnet",
        "Vulnerability",
        "Authentication Bypass",
        "Root",
        "CVE-2026-24061"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-22T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2026-24061"
      ],
      "isUpdate": false
    }
  ]
}