{
  "pub_id": "pub-2026-02-02",
  "headline": "Russian Hackers Target Polish Grid, Multiple Supply Chain Attacks, and Two Critical Zero-Days Under Active Exploitation",
  "summary": "This edition covers a series of high-impact cybersecurity events for February 2nd, 2026. Key developments include a destructive but failed wiper attack on Poland's energy sector by the Russian-linked Sandworm group. The software supply chain remains a primary target, with attacks compromising both eScan antivirus update servers and the Open VSX marketplace. Concurrently, Microsoft and Fortinet are racing to patch critical, actively exploited zero-day vulnerabilities in Office and FortiGate firewalls, respectively. Other major stories include the rise of AI-assisted malware and phishing, a new stealthy RAT, and a significant data breach at an AI social network.",
  "pub_date": "2026-02-02",
  "total_articles": 9,
  "articles": [
    {
      "id": "c4e5d8c9-8779-4170-9445-596d19eb2474",
      "slug": "experian-forecasts-ai-agents-to-become-top-cause-of-data-breaches",
      "headline": "AI to Overtake Human Error as Top Cause of Breaches, Experian Predicts",
      "title": "Experian Forecasts AI-Driven Attacks and Synthetic Identities to Dominate 2026 Threat Landscape",
      "severity": "informational",
      "excerpt": "In its 13th Annual Data Breach Industry Forecast, Experian predicts a paradigm shift in cybersecurity for 2026, with autonomous AI agents potentially surpassing human error as the leading cause of data breaches. The report warns that threat actors are weaponizing AI to create sophisticated polymorphic malware, execute highly personalized attacks, and generate 'pristine synthetic identities' at scale from stolen data. This new wave of AI-driven threats, combined with the looming risk of quantum computing, is expected to fuel a massive spike in identity theft and fundamentally change the nature of cyberattacks.",
      "tags": [
        "Artificial Intelligence",
        "AI",
        "Threat Forecast",
        "Synthetic Identity",
        "Polymorphic Malware",
        "Quantum Computing"
      ],
      "categories": [
        "Threat Intelligence",
        "Policy and Compliance"
      ],
      "createdAt": "2026-01-13T15:00:00.000Z",
      "updatedAt": "2026-02-02T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "New report confirms over 80% of malicious emails now use generative AI, making phishing attacks 'almost perfect' and harder to detect.",
      "updateContent": "The Catalan Cybersecurity Agency's 'Cybersecurity Outlook Report for 2026' reveals 82.6% of malicious emails now leverage generative AI, validating earlier predictions about AI weaponization. This significantly increases the sophistication and success rate of phishing, making scams 'almost perfect' and harder for users to identify. The report emphasizes the need for AI-powered defenses, updated user training, MFA, and browser isolation to combat this widespread threat, which has lowered the barrier to entry for criminals and increased attack scale."
    },
    {
      "id": "93c0f006-83f1-44c7-b83e-cd48ea414751",
      "slug": "industrial-control-systems-face-escalating-cyber-threats",
      "headline": "Attacks on Industrial Environments Doubled in 2025, Report Warns",
      "title": "Industrial Control Systems Face Escalating Cyber Threats as Attacks on IT/OT Environments Nearly Doubled in 2025",
      "severity": "high",
      "excerpt": "A new report from cybersecurity firm Cyble reveals a dramatic escalation in threats targeting industrial environments. According to its Annual Threat Landscape Report 2025, exploits against industrial technology (IT) and operational technology (OT) systems almost doubled last year. The report, published on January 15, 2026, documented nearly 6,000 ransomware attacks and identified numerous vulnerabilities in internet-exposed assets across critical infrastructure. Cyble predicts that in 2026, attackers will increasingly target exposed Human-Machine Interfaces (HMIs) and SCADA systems. This trend poses a significant risk to major global events, such as the 2026 Winter Olympics, where interconnected vendor systems create a rich target environment for disruption and extortion.",
      "tags": [
        "ICS",
        "OT Security",
        "SCADA",
        "HMI",
        "Critical Infrastructure",
        "Ransomware",
        "Cyble"
      ],
      "categories": [
        "Industrial Control Systems",
        "Cyberattack",
        "Threat Intelligence"
      ],
      "createdAt": "2026-01-16T15:00:00.000Z",
      "updatedAt": "2026-02-02T00:00:00.000Z",
      "readingTime": 7,
      "isUpdate": true,
      "updateSummary": "Forescout report reveals 84% surge in OT protocol attacks, with 71% of exploited vulnerabilities not in CISA KEV catalog, complicating defense.",
      "updateContent": "A new Forescout Vedere Labs report, analyzing 900 million attacks in 2025, confirms a dramatic 84% increase in attacks leveraging OT-specific protocols like Modbus. Crucially, it highlights that 71% of exploited vulnerabilities are not listed in CISA's KEV catalog, challenging current prioritization strategies. This finding suggests a broader attack surface than previously understood, requiring organizations to adopt more comprehensive, risk-based vulnerability management beyond KEV lists. The report reinforces the escalating threat to industrial and IoT environments, emphasizing the need for enhanced network monitoring and device hardening."
    },
    {
      "id": "9654824c-cf06-4f58-a399-f87f37ab00d5",
      "slug": "fortinet-fixes-actively-exploited-sso-authentication-bypass-flaw",
      "headline": "Fortinet Scrambles to Fix Actively Exploited SSO Auth Bypass (CVE-2026-24858) Hijacking Devices",
      "title": "Fortinet Addresses Critical Authentication Bypass Vulnerability (CVE-2026-24858) in FortiCloud SSO",
      "severity": "critical",
      "excerpt": "Fortinet has disclosed and patched a critical authentication bypass vulnerability, CVE-2026-24858, in its FortiCloud Single Sign-On (SSO) feature. The flaw is being actively exploited, allowing attackers with a FortiCloud account to log into devices registered to other users, leading to unauthorized configuration changes and account creation. The vulnerability affects a wide range of products, including FortiOS, FortiManager, and FortiAnalyzer. Due to the active exploitation and severity, CISA has added CVE-2026-24858 to its Known Exploited Vulnerabilities (KEV) catalog, urging users to patch and hunt for signs of compromise immediately.",
      "tags": [
        "Fortinet",
        "CVE-2026-24858",
        "authentication bypass",
        "SSO",
        "CISA KEV",
        "zero-day",
        "FortiCloud"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Patch Management"
      ],
      "createdAt": "2026-01-28T15:00:00.000Z",
      "updatedAt": "2026-02-02T12:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-24858",
        "CVE-2025-59718",
        "CVE-2025-59719"
      ],
      "isUpdate": true,
      "updateSummary": "Fortinet confirms CVE-2026-24858 as a zero-day, with active exploitation observed since January 20, 2026, targeting FortiGate firewalls.",
      "updateContent": "Fortinet has confirmed that CVE-2026-24858 is a zero-day vulnerability, with active exploitation first observed on January 20, 2026. Attackers successfully compromised FortiGate firewalls, even those running the latest firmware at the time, by exploiting the FortiCloud SSO flaw to create new local administrator accounts. This provides attackers with persistent and privileged access, highlighting the critical need for immediate patching and thorough compromise hunting. The vulnerability's low attack complexity and lack of user interaction make it particularly dangerous."
    },
    {
      "id": "53fe71fb-9aad-4291-af70-c5e2fa887d3d",
      "slug": "microsoft-office-zero-day-cve-2026-21509-actively-exploited",
      "headline": "Microsoft Office Zero-Day Under Active Attack Bypasses Security Features",
      "title": "Microsoft Scrambles to Patch Actively Exploited Office Zero-Day (CVE-2026-21509)",
      "severity": "critical",
      "excerpt": "Microsoft has issued an emergency out-of-band patch for a high-severity zero-day vulnerability in Microsoft Office, CVE-2026-21509. The flaw, a security feature bypass with a CVSS score of 7.8, is being actively exploited in the wild through malicious documents. It allows attackers to circumvent Object Linking and Embedding (OLE) protections, leading to code execution if a user opens a specially crafted file. The vulnerability affects a wide range of Office products, including Office 2016 through LTSC 2024 and Microsoft 365 Apps. CISA has added the flaw to its Known Exploited Vulnerabilities (KEV) catalog, mandating urgent patching for federal agencies and signaling a significant risk to all organizations.",
      "tags": [
        "zero-day",
        "OLE",
        "security feature bypass",
        "out-of-band patch",
        "KEV"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2026-01-29T15:00:00.000Z",
      "updatedAt": "2026-02-02T10:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2026-21509"
      ],
      "cvssScore": 7.8,
      "isUpdate": true,
      "updateSummary": "Microsoft confirms its threat intelligence discovered the Office zero-day exploitation, providing more specific attack details and detection methods.",
      "updateContent": "Microsoft has confirmed that its internal threat intelligence teams were responsible for discovering the active exploitation of CVE-2026-21509, leading to the urgent out-of-band patch. Further details clarify the attack complexity as low with no privileges required, though user interaction is still necessary. New observables include monitoring for 'mshta.exe' spawned by Office applications. Detection methods are refined to include URL and File Analysis (D3-UA, D3-FA) for email gateways, and remediation guidance now specifies deployment via WSUS or Configuration Manager. No specific threat actor has been named."
    },
    {
      "id": "4d572bd2-5a87-4c25-b404-beae50db4738",
      "slug": "iran-linked-redkitten-campaign-targets-human-rights-ngos",
      "headline": "New Iran-Linked 'RedKitten' Group Targets Human Rights NGOs with AI-Suspected Malware",
      "title": "Farsi-Speaking Threat Actor 'RedKitten' Uses Sophisticated Malware in Espionage Campaign Against Human Rights Activists",
      "severity": "medium",
      "excerpt": "A new cyber-espionage campaign by a Farsi-speaking threat actor dubbed 'RedKitten' is targeting human rights NGOs and activists documenting abuses in Iran. The campaign, observed by HarfangLab in January 2026, uses phishing emails with macro-laced Excel files as an initial vector. The malware is notable for its modularity and its use of legitimate public services like GitHub, Google Drive, and Telegram for C2 and payload delivery, a technique to evade detection. Researchers suspect the attackers may have used Large Language Models (LLMs) to assist in the development of their sophisticated tooling, marking a potential new trend in malware creation.",
      "tags": [
        "RedKitten",
        "Iran",
        "Espionage",
        "Malware",
        "Phishing",
        "NGO",
        "Telegram",
        "AI"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Phishing"
      ],
      "createdAt": "2026-02-01T15:00:00.000Z",
      "updatedAt": "2026-02-02T12:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "New details on RedKitten campaign reveal C# implant 'SloppyMIO' using password-protected Excel, steganography, and AppDomain Manager injection for stealth.",
      "updateContent": "Further analysis of the RedKitten campaign identifies the C# implant as 'SloppyMIO'. Initial access is now confirmed via password-protected Excel spreadsheets, a technique used to bypass email gateway scanning. The malware employs advanced evasion tactics including steganography to hide its configuration and AppDomain Manager injection for stealthy execution. Persistence is achieved through scheduled tasks. These new technical details highlight increased sophistication and evasiveness, making detection and mitigation more challenging for targeted human rights NGOs and activists."
    },
    {
      "id": "54895fa8-bfd5-43b9-b235-5c41a49f17c9",
      "slug": "open-vsx-marketplace-compromised-to-spread-glassworm-malware",
      "headline": "Open VSX Marketplace Hit by Supply Chain Attack Spreading \"GlassWorm\" Malware",
      "title": "Compromised Developer Account Used to Inject GlassWorm Malware into Popular Open VSX Extensions",
      "severity": "high",
      "excerpt": "On January 30, 2026, the Open VSX Registry, a popular marketplace for Visual Studio Code extensions, fell victim to a supply chain attack. Threat actors compromised the account of a legitimate developer, 'oorzc', and published malicious updates to four of their popular extensions. These updates embedded the 'GlassWorm' malware loader. The compromised extensions had been downloaded over 22,000 times, exposing a large number of developers to the malware before the malicious versions were removed by the Open VSX security team.",
      "tags": [
        "supply chain",
        "VS Code",
        "developer tools",
        "malware loader",
        "Open VSX",
        "GlassWorm"
      ],
      "categories": [
        "Supply Chain Attack",
        "Malware",
        "Cloud Security"
      ],
      "createdAt": "2026-02-02T15:00:00.000Z",
      "updatedAt": "2026-02-02T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "e2f25e64-60d1-4986-bb36-e15d6ae96833",
      "slug": "new-pulsar-rat-windows-malware-uses-in-memory-execution",
      "headline": "New \"Pulsar RAT\" Evades Detection with In-Memory Execution and LoTL Techniques",
      "title": "Stealthy 'Pulsar RAT' Windows Malware Campaign Uses In-Memory Execution for Evasion",
      "severity": "medium",
      "excerpt": "Security researchers have uncovered a new, stealthy Remote Access Trojan (RAT) targeting Windows systems, named 'Pulsar RAT'. This modular, .NET-based malware utilizes a multi-stage infection chain that heavily relies on in-memory execution and living-off-the-land techniques to evade detection. It features advanced anti-analysis capabilities, including anti-VM and anti-debugging checks. Once active, Pulsar RAT provides operators with live, interactive control for credential harvesting and data exfiltration, using legitimate services like Discord and Telegram for command-and-control.",
      "tags": [
        "RAT",
        "malware",
        ".NET",
        "in-memory",
        "living-off-the-land",
        "Discord",
        "Telegram"
      ],
      "categories": [
        "Malware",
        "Threat Intelligence"
      ],
      "createdAt": "2026-02-02T15:00:00.000Z",
      "updatedAt": "2026-02-02T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "11ac94f9-36b5-4fcd-ac82-43ceba680002",
      "slug": "malicious-chatgpt-chrome-extensions-hijack-user-sessions",
      "headline": "Warning: Malicious ChatGPT Chrome Extensions Steal Session Tokens to Hijack Accounts",
      "title": "Malicious ChatGPT Chrome Extensions Discovered Stealing Session Tokens and User Data",
      "severity": "medium",
      "excerpt": "Researchers have identified 16 malicious Google Chrome extensions that masquerade as helpful tools for OpenAI's ChatGPT. Once installed, these extensions inject malicious scripts into the ChatGPT web application. The scripts are designed to monitor outbound requests, intercept sensitive data such as authorization details and session tokens, and exfiltrate them to an attacker-controlled server. This allows the attackers to hijack active user sessions, granting them full access to the victim's account and chat history.",
      "tags": [
        "browser extension",
        "session hijacking",
        "ChatGPT",
        "data theft",
        "Chrome",
        "malware"
      ],
      "categories": [
        "Malware",
        "Phishing",
        "Cloud Security"
      ],
      "createdAt": "2026-02-02T15:00:00.000Z",
      "updatedAt": "2026-02-02T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "bc464ecc-cc84-47ad-9ec0-0a9687b360b3",
      "slug": "moltbook-ai-social-network-breach-exposes-1-5-million-api-keys",
      "headline": "AI Social Network \"Moltbook\" Breach Exposes 1.5M API Keys and 29k User Emails",
      "title": "Moltbook AI Social Network Breach Exposes 1.5 Million API Keys and User Data",
      "severity": "high",
      "excerpt": "A significant data breach at the AI-focused social network 'Moltbook' has exposed 1.5 million API keys, 29,000 user emails, and other sensitive data tables. The investigation, conducted by security firm Wiz, not only uncovered the data exposure but also revealed systemic security flaws, such as a lack of rate-limiting on agent registration. The breach also provided a skewed insight into the platform's user base, showing that its 1.5 million 'agents' were owned by only 17,000 human users. Moltbook has since deployed fixes to secure the exposed data.",
      "tags": [
        "data breach",
        "API security",
        "rate limiting",
        "AI",
        "social media",
        "Wiz",
        "misconfiguration"
      ],
      "categories": [
        "Data Breach",
        "Cloud Security"
      ],
      "createdAt": "2026-02-02T15:00:00.000Z",
      "updatedAt": "2026-02-02T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}