{
  "pub_id": "pub-2025-10-13",
  "headline": "Critical Oracle Zero-Day Exploited by TA505 & Cl0p; Discord Vendor Breach Exposes 70,000 IDs",
  "summary": "This cybersecurity brief for October 13, 2025, covers a critical zero-day vulnerability (CVE-2025-61882) in Oracle E-Business Suite being actively exploited by major extortion groups, leading to widespread data theft. Other significant events include a major data breach at a Discord third-party vendor exposing 70,000 user IDs, a novel phishing campaign abusing NPM infrastructure, and a report showing a 30% surge in ransomware attacks against healthcare vendors.",
  "pub_date": "2025-10-13",
  "total_articles": 8,
  "articles": [
    {
      "id": "7a1299e2-8537-43ad-a952-d3e5a8ebbf72",
      "slug": "clop-exploits-oracle-ebs-zero-day-prompting-urgent-fbi-warning",
      "headline": "Cl0p Exploits Oracle EBS Zero-Day in Widespread Extortion Campaign, FBI Issues Emergency Warning",
      "title": "Cl0p-Affiliated Group Exploits Oracle E-Business Suite Zero-Day (CVE-2025-61882) for Months, Triggering FBI Alert",
      "severity": "critical",
      "excerpt": "A financially motivated threat group, claiming ties to the notorious **[Cl0p](https://attack.mitre.org/groups/G0114/)** ransomware gang, has been exploiting a critical zero-day vulnerability in **[Oracle E-Business Suite](https://www.oracle.com/applications/ebs/)** (EBS). The flaw, **CVE-2025-61882**, is an unauthenticated remote code execution vulnerability with a 9.8 CVSS score. Investigations by Google and Mandiant reveal the attackers exploited the flaw since at least August 2025, months before Oracle released a patch on October 4. The campaign involves exfiltrating large volumes of data and sending extortion emails to executives. The **[FBI](https://www.fbi.gov)** has issued an emergency directive urging immediate patching, highlighting the severe risk to sectors like healthcare and education, with Harvard University confirmed as one of the victims.",
      "tags": [
        "zero-day",
        "extortion",
        "RCE",
        "fileless malware",
        "data theft",
        "enterprise software"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Threat Actor"
      ],
      "createdAt": "2025-10-10T15:00:00.000Z",
      "updatedAt": "2025-10-13T12:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-61882",
        "CVE-2025-61884"
      ],
      "cvssScore": 9.8,
      "isUpdate": true,
      "updateSummary": "New details emerge on Oracle EBS zero-day (CVE-2025-61882) exploitation, with TA505 joining Cl0p. Detailed exploit chain and NCSC warning issued.",
      "updateContent": "Further analysis reveals the critical Oracle EBS zero-day (CVE-2025-61882) is also being exploited by the TA505 threat group, alongside Cl0p, with hundreds of thousands of attack attempts recorded. The NCSC has issued a warning. Technical details now include a multi-stage exploit chain involving SSRF, CRLF injection, and malicious XSL stylesheets executing Base64-encoded Java code for RCE. This broadens the threat landscape and provides more specific detection guidance."
    },
    {
      "id": "cc1f383d-f3ff-454f-a55a-27c6ade5abcc",
      "slug": "discord-vendor-breach-exposes-70000-users-government-ids",
      "headline": "Supply Chain Attack Hits Discord: Vendor Breach Exposes 70,000 User IDs",
      "title": "Third-Party Breach at Discord Vendor 5CA Exposes Government IDs and Personal Data of 70,000 Users",
      "severity": "high",
      "excerpt": "The communication platform Discord has disclosed a significant data breach originating from a third-party customer service vendor, 5CA. The incident, which occurred in early October 2025, resulted in unauthorized access to the sensitive data of approximately 70,000 users who had interacted with Discord's support teams. Exposed information includes photos of government-issued IDs, names, email addresses, IP addresses, and partial billing data. The breach highlights the persistent and growing risk of supply chain attacks, where attackers target less secure partners to access data from larger organizations.",
      "tags": [
        "Discord",
        "5CA",
        "Data Breach",
        "Supply Chain Attack",
        "PII",
        "Identity Theft",
        "Extortion"
      ],
      "categories": [
        "Data Breach",
        "Supply Chain Attack",
        "Phishing"
      ],
      "createdAt": "2025-10-13T15:00:00.000Z",
      "updatedAt": "2025-10-13T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "273f9834-6654-4cac-8cc7-80f0e08415bd",
      "slug": "healthcare-ransomware-attacks-shift-to-vendors-surging-30-percent",
      "headline": "Ransomware Groups Pivot to Healthcare Vendors, Attacks Surge 30%",
      "title": "Healthcare Ransomware Attacks Shift to Vendors, Surging 30% in 2025 as Criminals Target Supply Chain",
      "severity": "high",
      "excerpt": "A new report from Comparitech reveals a significant strategic shift in ransomware attacks targeting the healthcare sector. While attacks on direct care providers remained steady, incidents involving healthcare-affiliated businesses and vendors surged by 30% in the first nine months of 2025. Threat actors like Qilin and INC are increasingly targeting less-secure partners such as medical billing services and pharmaceutical manufacturers to disrupt the healthcare supply chain, leading to the breach of over 6 million records from confirmed attacks on these adjacent businesses alone.",
      "tags": [
        "Ransomware",
        "Healthcare",
        "Supply Chain Attack",
        "Qilin",
        "INC Ransomware",
        "Data Breach",
        "Comparitech"
      ],
      "categories": [
        "Ransomware",
        "Supply Chain Attack",
        "Threat Actor"
      ],
      "createdAt": "2025-10-13T15:00:00.000Z",
      "updatedAt": "2025-10-13T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "066f28b4-2434-4dab-9467-0e66882b42bb",
      "slug": "russian-apt-seashell-blizzard-targets-european-critical-infrastructure",
      "headline": "Russian APT Seashell Blizzard Targets European Critical Infrastructure",
      "title": "Sandworm Subgroup 'Seashell Blizzard' Targets European Critical Infrastructure with Custom Malware",
      "severity": "high",
      "excerpt": "A subgroup of the Russian state-sponsored threat actor Sandworm, tracked as Seashell Blizzard, is conducting a new campaign against critical infrastructure in Ukraine and Europe. The attacks leverage phishing emails with malicious XLL attachments to deliver a custom downloader, CheapShot, which in turn deploys a backdoor called ShroudDoor. The campaign targets organizations in the agricultural, defense, transportation, and manufacturing sectors, highlighting ongoing espionage and disruptive efforts by Russian APTs.",
      "tags": [
        "Seashell Blizzard",
        "Sandworm",
        "APT28",
        "Russia",
        "Critical Infrastructure",
        "Ukraine",
        "Phishing",
        "Malware",
        "ShroudDoor"
      ],
      "categories": [
        "Threat Actor",
        "Cyberattack",
        "Malware"
      ],
      "createdAt": "2025-10-13T15:00:00.000Z",
      "updatedAt": "2025-10-13T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "6594d259-da2c-4b48-89e8-b2707f940db6",
      "slug": "lastpass-warns-of-active-phishing-campaign-impersonating-brand",
      "headline": "LastPass Warns of Active Phishing Campaign Impersonating Brand",
      "title": "LastPass Issues Alert on Active Phishing Campaign Falsely Claiming a Hack",
      "severity": "medium",
      "excerpt": "Password manager LastPass issued an alert on October 13, 2025, about an active phishing campaign targeting its users. The attackers are sending emails from a fraudulent domain with subject lines like \"We Have Been Hacked,\" creating a false sense of urgency to trick users into clicking a malicious link. The link directs victims to a convincing phishing site designed to steal their master password. LastPass has confirmed it was not hacked and is working to take down the malicious infrastructure.",
      "tags": [
        "LastPass",
        "Phishing",
        "Credential Theft",
        "Social Engineering",
        "MFA"
      ],
      "categories": [
        "Phishing",
        "Security Operations"
      ],
      "createdAt": "2025-10-13T15:00:00.000Z",
      "updatedAt": "2025-10-13T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "c891107a-0dd3-45c8-ab8a-46afde590baa",
      "slug": "new-android-spyware-clayrat-spreads-via-telegram",
      "headline": "New Android Spyware \"ClayRat\" Spreads via Telegram, Hijacks SMS",
      "title": "Android Spyware \"ClayRat\" Targets Russian Users via Telegram, Stealing SMS and Spreading to Contacts",
      "severity": "high",
      "excerpt": "A new Android spyware named \"ClayRat\" is targeting Russian users through fake applications distributed on phishing sites and Telegram. The malware uses sophisticated techniques to bypass Android 13+ security restrictions, install itself as the default SMS handler to intercept 2FA codes, and exfiltrate a wide range of data including call logs and photos. A key feature of ClayRat is its self-propagation mechanism, where it automatically sends malicious links via SMS to all contacts on the victim's device, rapidly expanding the infection.",
      "tags": [
        "Android",
        "Spyware",
        "ClayRat",
        "Malware",
        "Telegram",
        "SMS",
        "2FA",
        "Mobile Security"
      ],
      "categories": [
        "Malware",
        "Mobile Security",
        "Phishing"
      ],
      "createdAt": "2025-10-13T15:00:00.000Z",
      "updatedAt": "2025-10-13T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "954d38b1-22d2-4e97-9fb5-349b7887b484",
      "slug": "ivanti-discloses-13-vulnerabilities-in-endpoint-manager",
      "headline": "Ivanti Discloses 13 Vulnerabilities in Endpoint Manager, Two High-Severity",
      "title": "Ivanti Publishes Advisory for 13 Vulnerabilities in Endpoint Manager (EPM), Including High-Severity RCE and Privilege Escalation Flaws",
      "severity": "high",
      "excerpt": "Ivanti has released a security advisory for its Endpoint Manager (EPM) software, detailing 13 new vulnerabilities. The batch includes two high-severity flaws—one allowing for local privilege escalation and another for remote code execution with user interaction—and eleven medium-severity bugs, many of which are SQL injection vulnerabilities. While none of the flaws are known to be actively exploited, Ivanti is urging customers to upgrade from the now end-of-life EPM 2022 to the more secure 2024 version and apply forthcoming patches.",
      "tags": [
        "Ivanti",
        "Vulnerability",
        "Patch Management",
        "EPM",
        "RCE",
        "SQL Injection",
        "Privilege Escalation"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2025-10-13T15:00:00.000Z",
      "updatedAt": "2025-10-13T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-62389",
        "CVE-2025-11622",
        "CVE-2025-9713"
      ],
      "isUpdate": false
    },
    {
      "id": "936f0675-8b79-492e-882d-dc508be36f28",
      "slug": "new-york-state-inflation-refund-program-exploited-in-phishing-scams",
      "headline": "New York Inflation Refund Program Exploited in Phishing Scams",
      "title": "Scammers Exploit New York State Inflation Refund Program with Phishing and Smishing Campaigns",
      "severity": "medium",
      "excerpt": "The New York State Department of Taxation and Finance is warning residents about phishing and smishing (SMS phishing) campaigns that are exploiting a legitimate state inflation relief program. Scammers are sending fraudulent messages claiming that recipients must submit personal and payment information via a malicious link to receive their refund. In reality, the legitimate program sends checks automatically to eligible taxpayers with no action required. The scams use social engineering to create urgency and trick victims into giving up sensitive data.",
      "tags": [
        "Phishing",
        "Smishing",
        "Scam",
        "New York",
        "Social Engineering",
        "Identity Theft"
      ],
      "categories": [
        "Phishing",
        "Policy and Compliance"
      ],
      "createdAt": "2025-10-13T15:00:00.000Z",
      "updatedAt": "2025-10-13T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    }
  ]
}