{
  "pub_id": "pub-2026-01-16",
  "headline": "AWS CodeBreach Exposes Massive Supply Chain Risk; Ransomware Attacks Hit Record Highs in 2025",
  "summary": "This cybersecurity publication for January 16, 2026, covers a series of critical developments, led by the disclosure of the 'CodeBreach' vulnerability in AWS CodeBuild, which posed a severe supply chain threat to countless applications. Concurrently, new reports confirm that 2025 was a record-breaking year for ransomware, with a 58% surge in attacks. Other major incidents include the Everest ransomware group's claimed breach of Nissan, active exploitation of a critical WordPress plugin flaw, and the discovery of sophisticated malware frameworks like VoidLink targeting cloud environments and GlassWorm targeting macOS developers.",
  "pub_date": "2026-01-16",
  "total_articles": 6,
  "articles": [
    {
      "id": "7e66af22-ead2-4097-867b-df7f322253ce",
      "slug": "aws-codebuild-codebreach-supply-chain-vulnerability",
      "headline": "AWS Patches 'CodeBreach' Flaw, Averting Massive GitHub Supply Chain Attack",
      "title": "AWS Fixes Critical \"CodeBreach\" Flaw in CodeBuild That Exposed GitHub Repositories to Widespread Supply Chain Attacks",
      "severity": "critical",
      "excerpt": "Amazon Web Services (AWS) has remediated a critical vulnerability in its AWS CodeBuild service, dubbed 'CodeBreach' by Wiz researchers. The flaw, which stemmed from a misconfigured webhook filter, could have allowed unauthenticated attackers to inject malicious code into the build processes of major open-source projects, including the AWS JavaScript SDK. An exploit could have granted attackers administrative control over key GitHub repositories, creating a catastrophic supply chain risk for the millions of applications and cloud environments that depend on these libraries. The vulnerability was discovered following a separate, failed attack attempt, highlighting the real-world threat. AWS has since patched the issue and implemented global hardening measures.",
      "tags": [
        "CodeBreach",
        "CI/CD Security",
        "Supply Chain Attack",
        "AWS",
        "CodeBuild",
        "GitHub",
        "Wiz",
        "Vulnerability"
      ],
      "categories": [
        "Supply Chain Attack",
        "Cloud Security",
        "Vulnerability"
      ],
      "createdAt": "2026-01-16T15:00:00.000Z",
      "updatedAt": "2026-01-16T15:00:00.000Z",
      "readingTime": 7,
      "isUpdate": false
    },
    {
      "id": "28d3e7c8-862a-4f48-a8f9-327ffdb275d6",
      "slug": "china-linked-apt-targets-north-american-critical-infrastructure",
      "headline": "China-Linked APT 'UAT-8837' Targets North American Critical Infrastructure",
      "title": "Cisco Talos Uncovers Chinese APT Group UAT-8837 Actively Targeting Critical Infrastructure in North America",
      "severity": "high",
      "excerpt": "A new report from Cisco Talos has identified a China-nexus Advanced Persistent Threat (APT) group, tracked as UAT-8837, actively targeting critical infrastructure organizations in North America since at least 2025. The group gains initial access by exploiting public-facing vulnerabilities, including a zero-day in SiteCore products (CVE-2025-53690), and using compromised credentials. Once inside, UAT-8837 employs a variety of open-source tools, such as the Earthworm utility for creating reverse tunnels, to conduct reconnaissance, exfiltrate data, and maintain persistence. Cisco Talos assesses with medium confidence that the group is linked to China, highlighting the ongoing threat of state-sponsored espionage against vital sectors.",
      "tags": [
        "APT",
        "UAT-8837",
        "China",
        "Cisco Talos",
        "Critical Infrastructure",
        "CVE-2025-53690",
        "Earthworm"
      ],
      "categories": [
        "Threat Actor",
        "Cyberattack",
        "Industrial Control Systems"
      ],
      "createdAt": "2026-01-16T15:00:00.000Z",
      "updatedAt": "2026-01-16T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-53690"
      ],
      "isUpdate": false
    },
    {
      "id": "bfdf38c2-3585-4668-ba34-201dfd092927",
      "slug": "hawksec-group-claims-massive-data-breach-at-totalenergies",
      "headline": "Hacker Group 'HawkSec' Claims Breach of 184 Million TotalEnergies Records",
      "title": "\"HawkSec\" Hacker Group Claims Massive Data Breach at French Energy Giant TotalEnergies, Allegedly Stealing 184 Million Customer Records",
      "severity": "high",
      "excerpt": "A hacking group calling itself 'HawkSec' has claimed a massive data breach against the French energy supermajor, TotalEnergies. In a post on a data leak forum, the group alleged the theft of a database containing nearly 184 million records, including sensitive customer information such as names, email addresses, phone numbers, and bank account details for French customers. To substantiate their claims, HawkSec posted sample data on social media. However, the full extent and legitimacy of the breach remain unverified. TotalEnergies has not yet confirmed the incident. The group's erratic behavior on forums has led some researchers to question their experience, though the potential impact if the claims are true is significant.",
      "tags": [
        "HawkSec",
        "Data Breach",
        "TotalEnergies",
        "Energy Sector",
        "GDPR",
        "PII"
      ],
      "categories": [
        "Data Breach",
        "Threat Actor"
      ],
      "createdAt": "2026-01-16T15:00:00.000Z",
      "updatedAt": "2026-01-16T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "422a1eac-d256-4d24-904c-1c7b6377b3c7",
      "slug": "modular-ds-wordpress-plugin-flaw-under-active-exploitation",
      "headline": "Critical Flaw in WordPress Plugin 'Modular DS' Actively Exploited for Admin Takeover",
      "title": "Actively Exploited Critical Vulnerability (CVE-2026-23550) in Modular DS WordPress Plugin Allows Unauthenticated Admin Takeover",
      "severity": "critical",
      "excerpt": "A critical, unauthenticated privilege escalation vulnerability in the 'Modular DS' WordPress plugin is being actively exploited in the wild. The flaw, tracked as CVE-2026-23550 with a CVSS score of 10.0, affects over 40,000 websites. It allows attackers to bypass authentication and gain full administrator privileges by sending a specially crafted HTTP request. Security firm Patchstack, which discovered the exploitation, observed attackers creating rogue admin accounts named 'PoC Admin'. The vulnerability lies in the plugin's custom routing and login logic, which can be tricked into logging an unauthenticated user into an existing administrator account. The vendor released a patch in version 2.5.2, and all users are urged to update immediately.",
      "tags": [
        "CVE-2026-23550",
        "WordPress",
        "Vulnerability",
        "Modular DS",
        "Patchstack",
        "Authentication Bypass",
        "Active Exploitation"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Patch Management"
      ],
      "createdAt": "2026-01-16T15:00:00.000Z",
      "updatedAt": "2026-01-16T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2026-23550"
      ],
      "cvssScore": 10,
      "isUpdate": false
    },
    {
      "id": "6a91449a-2ee7-48bf-91ea-c93374ce5b6b",
      "slug": "palo-alto-networks-patches-critical-pan-os-denial-of-service-flaw",
      "headline": "Palo Alto Networks Patches High-Severity DoS Flaw in PAN-OS Firewalls",
      "title": "Palo Alto Networks Releases Patches for High-Severity Denial-of-Service Vulnerability (CVE-2026-0227) in PAN-OS",
      "severity": "high",
      "excerpt": "Palo Alto Networks has issued security updates to address a high-severity denial-of-service (DoS) vulnerability, CVE-2026-0227, in its PAN-OS software. The flaw, which has a CVSS score of 7.7, allows an unauthenticated, remote attacker to crash firewalls that have a GlobalProtect gateway or portal enabled. A successful exploit forces the device into maintenance mode, disrupting all network traffic. While Palo Alto Networks is not aware of active exploitation, a proof-of-concept (PoC) exploit reportedly exists. The vulnerability affects multiple versions of PAN-OS, and customers are urged to apply the patches as soon as possible, as there are no workarounds.",
      "tags": [
        "CVE-2026-0227",
        "Palo Alto Networks",
        "PAN-OS",
        "GlobalProtect",
        "DoS",
        "Vulnerability",
        "Patch Management"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Security Operations"
      ],
      "createdAt": "2026-01-16T15:00:00.000Z",
      "updatedAt": "2026-01-16T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-0227",
        "CVE-2024-3393"
      ],
      "cvssScore": 7.7,
      "isUpdate": false
    },
    {
      "id": "f982f886-c49e-4e9b-9465-90d51ed232da",
      "slug": "glassworm-malware-targets-macos-developers-via-vs-code-extensions",
      "headline": "GlassWorm Malware Pivots to Attack macOS Developers via Malicious VS Code Extensions",
      "title": "GlassWorm Malware Campaign Targets macOS Developers with Malicious Visual Studio Code Extensions",
      "severity": "high",
      "excerpt": "The GlassWorm malware campaign has evolved, now specifically targeting macOS developers through malicious extensions for Visual Studio Code and OpenVSX. This new wave of attacks, detailed in a security digest from Acronis, uses a self-propagating worm to deliver its payload. The malware embeds an encrypted payload within JavaScript files, uses a 15-minute execution delay to evade sandboxes, and establishes persistence using LaunchAgents. The primary goal of GlassWorm is to steal a wide range of developer-centric data, including credentials for GitHub and npm, browser data, and information from over 50 different cryptocurrency wallets, highlighting a significant supply chain threat.",
      "tags": [
        "GlassWorm",
        "Malware",
        "macOS",
        "Visual Studio Code",
        "Supply Chain Attack",
        "Developer"
      ],
      "categories": [
        "Malware",
        "Supply Chain Attack",
        "Mobile Security"
      ],
      "createdAt": "2026-01-16T15:00:00.000Z",
      "updatedAt": "2026-01-16T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    }
  ]
}