{
  "pub_id": "pub-2026-02-06",
  "headline": "Global Espionage 'Shadow Campaign' Breaches 37 Nations; CISA Warns of Actively Exploited Flaws in SmarterMail and VMware",
  "summary": "This week in cybersecurity, a massive state-aligned espionage operation dubbed the 'Shadow Campaign' was uncovered, having compromised government and critical infrastructure entities in 37 countries. Meanwhile, CISA issued urgent warnings about actively exploited vulnerabilities in SmarterMail and VMware ESXi, both being used in ransomware attacks. Major data breaches also came to light, with an unsecured server exposing 8.7 billion records on Chinese citizens and social engineering attacks hitting investment platform Betterment and newsletter service Substack, affecting millions of users. In policy news, CISA mandated the removal of all unsupported edge devices from federal networks to combat nation-state threats.",
  "pub_date": "2026-02-06",
  "total_articles": 8,
  "articles": [
    {
      "id": "09839cb6-cf6c-46e2-9600-ef316190b755",
      "slug": "cisa-warns-of-actively-exploited-smartermail-rce-flaw-in-ransomware-attacks",
      "headline": "CISA: Critical SmarterMail RCE Flaw Actively Exploited in Ransomware Attacks",
      "title": "CISA Adds Critical SmarterMail RCE Vulnerability (CVE-2026-24423) to KEV Catalog Amid Ransomware Exploitation",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical remote code execution (RCE) vulnerability in SmarterTools' SmarterMail, CVE-2026-24423, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, which has a CVSS score of 9.3, allows an unauthenticated attacker to take full control of a mail server by abusing an API method with a missing authentication check. CISA confirms the vulnerability is being actively used in ransomware campaigns and has mandated that federal agencies patch by February 26, 2026. All organizations using the affected email server software are strongly urged to update to build 9511 or later immediately.",
      "tags": [
        "CVE-2026-24423",
        "RCE",
        "KEV",
        "SmarterMail",
        "Ransomware",
        "CISA"
      ],
      "categories": [
        "Vulnerability",
        "Ransomware",
        "Patch Management"
      ],
      "createdAt": "2026-02-06T15:00:00.000Z",
      "updatedAt": "2026-02-06T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-24423"
      ],
      "cvssScore": 9.3,
      "isUpdate": false
    },
    {
      "id": "88ac62bb-3ab6-4994-ae31-b9325522bb79",
      "slug": "cisa-orders-federal-agencies-to-remove-unsupported-edge-devices-from-networks",
      "headline": "CISA Issues Directive Forcing Removal of Unsupported Edge Devices from Federal Networks",
      "title": "CISA Mandates Removal of End-of-Life Edge Devices with Binding Operational Directive 26-02",
      "severity": "high",
      "excerpt": "In response to increasing exploitation by nation-state actors, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued Binding Operational Directive (BOD) 26-02. The directive mandates that all Federal Civilian Executive Branch (FCEB) agencies inventory and remove all unsupported network edge devices, such as firewalls and routers, within one year. Devices that are end-of-life (EOL) or end-of-support (EOS) no longer receive security updates and represent a significant risk. The order requires agencies to replace unsupported hardware and software, report their inventory to CISA, and establish a mature lifecycle management process to prevent future risks from technical debt.",
      "tags": [
        "CISA",
        "BOD 26-02",
        "federal government",
        "EOL",
        "EOS",
        "edge security",
        "technical debt"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Patch Management"
      ],
      "createdAt": "2026-02-06T15:00:00.000Z",
      "updatedAt": "2026-02-06T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "043f7d7e-db70-49ed-9a17-b207faa0eebc",
      "slug": "betterment-data-breach-exposes-1-4-million-customers-after-social-engineering-attack",
      "headline": "Betterment Data Breach Exposes 1.4M Customers After Social Engineering Attack",
      "title": "Investment Platform Betterment Discloses Breach of 1.4 Million Accounts Following Voice Phishing Attack",
      "severity": "high",
      "excerpt": "Automated investment platform Betterment has disclosed a data breach affecting 1.4 million customers, originating from a sophisticated social engineering attack. Threat actors, claiming to be the 'ShinyHunters' group, used voice phishing (vishing) to manipulate employees and steal Okta single sign-on codes, gaining access to third-party marketing and support systems. The compromised data includes names, email addresses, phone numbers, and physical addresses. While core financial accounts were not compromised, the attackers used the stolen contact information to launch a fraudulent cryptocurrency scam targeting Betterment's customers. The incident highlights the growing threat of social engineering targeting employees to bypass technical security controls.",
      "tags": [
        "Betterment",
        "ShinyHunters",
        "vishing",
        "social engineering",
        "Okta",
        "cryptocurrency scam"
      ],
      "categories": [
        "Data Breach",
        "Phishing",
        "Threat Actor"
      ],
      "createdAt": "2026-02-06T15:00:00.000Z",
      "updatedAt": "2026-02-06T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "722aa20c-eae5-4f68-b9c7-ac9d5bbfa94b",
      "slug": "financial-sector-cyberattacks-doubled-in-2025-fueled-by-hacktivism",
      "headline": "Financial Sector Cyberattacks Doubled in 2025, Fueled by Geopolitical Hacktivism",
      "title": "Report: Cyberattacks on Financial Sector Doubled in 2025, Driven by 105% Surge in DDoS Attacks",
      "severity": "high",
      "excerpt": "A new report from Check Point Software reveals a dramatic escalation in cyber threats targeting the global financial sector, with incidents more than doubling in 2025. The primary driver was a 105% increase in Distributed Denial-of-Service (DDoS) attacks, which were largely motivated by geopolitically-driven hacktivism rather than direct financial gain. Hacktivist campaigns aimed to disrupt banking portals and payment systems in countries involved in geopolitical conflicts, including Israel, the U.S., and Ukraine. The report also highlights a 73% jump in data breaches and the persistent threat of multi-extortion ransomware, indicating a complex and evolving threat landscape for financial institutions.",
      "tags": [
        "DDoS",
        "hacktivism",
        "financial services",
        "Check Point",
        "cyberattack trends",
        "geopolitics"
      ],
      "categories": [
        "Cyberattack",
        "Threat Intelligence",
        "Ransomware"
      ],
      "createdAt": "2026-02-06T15:00:00.000Z",
      "updatedAt": "2026-02-06T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "144b0199-19df-4d10-8a73-7ddb7198e55a",
      "slug": "critical-rce-vulnerability-in-n8n-automation-platform-allows-server-compromise",
      "headline": "Critical RCE Flaw in n8n Automation Platform Allows Full Server Takeover",
      "title": "Critical Sandbox Escape Vulnerability (CVE-2026-25049) in n8n Allows Remote Code Execution",
      "severity": "critical",
      "excerpt": "A critical sandbox escape vulnerability, CVE-2026-25049, has been discovered in the popular n8n workflow automation platform. The flaw, rated 9.4 on the CVSS scale, allows an authenticated user with permission to edit workflows to bypass security controls and execute arbitrary system commands on the host server. This could lead to a full server compromise, exposing sensitive credentials, API keys, and OAuth tokens stored in the environment. The vulnerability is a bypass for a previously patched RCE flaw, and administrators are urged to update to n8n versions 1.123.17 or 2.5.2 immediately to prevent potential hijacking of connected cloud services and AI pipelines.",
      "tags": [
        "CVE-2026-25049",
        "n8n",
        "RCE",
        "sandbox escape",
        "workflow automation",
        "supply chain"
      ],
      "categories": [
        "Vulnerability",
        "Supply Chain Attack",
        "Cloud Security"
      ],
      "createdAt": "2026-02-06T15:00:00.000Z",
      "updatedAt": "2026-02-06T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-25049",
        "CVE-2025-68613"
      ],
      "cvssScore": 9.4,
      "isUpdate": false
    },
    {
      "id": "30aa1fc2-e500-4712-b166-8a5b67536942",
      "slug": "new-milkyway-ransomware-strain-emerges-with-aggressive-extortion-tactics",
      "headline": "New 'Milkyway' Ransomware Strain Surfaces with Aggressive Extortion Tactics",
      "title": "Researchers Detail Emerging 'Milkyway' Ransomware Variant Threatening Data Leaks and Reporting Victims to Authorities",
      "severity": "medium",
      "excerpt": "A new Windows-based ransomware strain named 'Milkyway' has been identified by researchers at CYFIRMA. Currently in a developing state, the malware encrypts files and appends a '.milkyway' extension. It employs aggressive extortion tactics via a full-screen ransom note, threatening not only to leak or sell stolen data but also to report victims to tax authorities and law enforcement if the ransom is not paid. The operators also threaten to contact the victim's clients and partners. Experts warn that Milkyway could evolve into a more sophisticated threat, potentially adopting a Ransomware-as-a-Service (RaaS) model, which would significantly broaden its impact.",
      "tags": [
        "Milkyway",
        "Ransomware",
        "malware",
        "CYFIRMA",
        "RaaS",
        "extortion"
      ],
      "categories": [
        "Ransomware",
        "Malware",
        "Threat Intelligence"
      ],
      "createdAt": "2026-02-06T15:00:00.000Z",
      "updatedAt": "2026-02-06T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "36bd2c6e-da20-4595-b485-4fafdffd2dc4",
      "slug": "everest-ransomware-group-attacks-japanese-manufacturer-hosokawa-micron",
      "headline": "Everest Ransomware Group Claims Attack on Japanese Manufacturer Hosokawa Micron",
      "title": "Everest Ransomware Lists Japanese Tech Firm Hosokawa Micron as Victim, Threatens to Leak 30 GB of Data",
      "severity": "high",
      "excerpt": "The Everest ransomware group has claimed responsibility for a cyberattack against Hosokawa Micron Corporation, a leading Japanese manufacturer of industrial processing technology. The group announced the breach on an underground forum, threatening to publish approximately 30 GB of exfiltrated confidential company data if their ransom demands are not met. This incident aligns with Everest's typical double-extortion strategy. The group is known for targeting organizations in manufacturing, finance, and IT across the U.S., Europe, and Asia, and also acts as an initial access broker, selling network access to other threat actors.",
      "tags": [
        "Everest",
        "Ransomware",
        "double extortion",
        "manufacturing",
        "Hosokawa Micron"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2026-02-06T15:00:00.000Z",
      "updatedAt": "2026-02-06T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "2d267f6d-0964-481c-bab5-271e6fc6cdaa",
      "slug": "substack-discloses-data-breach-exposing-user-contact-information",
      "headline": "Substack Discloses Data Breach Exposing User Contact Information",
      "title": "Newsletter Platform Substack Confirms Data Breach Exposing User PII",
      "severity": "medium",
      "excerpt": "The newsletter platform Substack has announced it suffered a data breach after discovering on February 3, 2026, that an unauthorized party had gained access to a database containing user information. The exposed data includes names, email addresses, phone numbers, and Stripe IDs, though the company stated that financial data like credit card numbers and passwords were not compromised. The data exposure may date back to October 2025. With over 20 million active users, Substack is warning customers to be wary of suspicious emails and text messages, as a hacker has claimed to have stolen data from 700,000 users and posted it on the dark web.",
      "tags": [
        "Substack",
        "data breach",
        "PII",
        "phishing",
        "privacy"
      ],
      "categories": [
        "Data Breach",
        "Phishing",
        "Cloud Security"
      ],
      "createdAt": "2026-02-06T15:00:00.000Z",
      "updatedAt": "2026-02-06T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}