{
  "pub_id": "pub-2026-01-23",
  "headline": "CISA Warns of Actively Exploited Flaws; North Korean Hackers Target Developers; Ransomware Hits Apple Supplier",
  "summary": "This week in cybersecurity, CISA added four actively exploited vulnerabilities to its KEV catalog, demanding urgent patching from federal agencies. North Korean threat actors launched the 'Contagious Interview' campaign, using malicious VS Code projects to backdoor developers' systems. In the supply chain, a major Apple partner, Luxshare, was breached by the RansomHub group, leaking sensitive product designs. Meanwhile, new ransomware strains like Osiris and Anubis emerged with advanced TTPs, including data-wiping capabilities, and Oracle released a massive patch update fixing 337 vulnerabilities, one with a perfect 10.0 CVSS score.",
  "pub_date": "2026-01-23",
  "total_articles": 9,
  "articles": [
    {
      "id": "5912bd03-11ee-4070-b7aa-ae484e9933e8",
      "slug": "new-zealand-patient-portal-manage-my-health-hit-by-ransomware",
      "headline": "New Zealand's 'Manage My Health' Portal Breached; Data of 120,000 Patients Held for Ransom",
      "title": "Manage My Health Patient Portal in New Zealand Suffers Data Breach, Attacker Demands Ransom for 126,000 Users' Data",
      "severity": "high",
      "excerpt": "New Zealand's largest patient portal, Manage My Health, is responding to a significant data breach that occurred in late December 2025. An attacker using the alias 'Kazu' claims to have stolen over 400,000 files, including sensitive medical records like lab results and clinical notes, affecting up to 126,000 individuals. The attacker has demanded a $60,000 ransom. The breach originated from a vulnerability in the 'Health Documents' module of the application. Manage My Health has since closed the security gap and is working with New Zealand authorities, while the government has launched an urgent review of the incident.",
      "tags": [
        "Healthcare",
        "Patient Data",
        "PHI",
        "Ransomware",
        "New Zealand"
      ],
      "categories": [
        "Data Breach",
        "Ransomware",
        "Cyberattack"
      ],
      "createdAt": "2026-01-13T15:00:00.000Z",
      "updatedAt": "2026-01-23T12:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "Manage My Health warns customers of follow-on phishing and spam attacks exploiting data stolen in the late 2025 breach, increasing risk to affected individuals.",
      "updateContent": "Following the late 2025 data breach, Manage My Health is now alerting over 120,000 affected patients to active secondary attacks. Malicious actors are launching sophisticated phishing and spam campaigns, impersonating Manage My Health to exploit the previously stolen sensitive medical information. These highly convincing lures aim to trick victims into revealing further personal or financial details, or to deploy malware. This development significantly increases the immediate threat and potential harm to individuals whose data was compromised, moving beyond the initial data theft to active exploitation. New Zealand's Privacy Commissioner has launched an official inquiry into the incident."
    },
    {
      "id": "28d3e7c8-862a-4f48-a8f9-327ffdb275d6",
      "slug": "china-linked-apt-targets-north-american-critical-infrastructure",
      "headline": "China-Linked APT 'UAT-8837' Targets North American Critical Infrastructure",
      "title": "Cisco Talos Uncovers Chinese APT Group UAT-8837 Actively Targeting Critical Infrastructure in North America",
      "severity": "high",
      "excerpt": "A new report from Cisco Talos has identified a China-nexus Advanced Persistent Threat (APT) group, tracked as UAT-8837, actively targeting critical infrastructure organizations in North America since at least 2025. The group gains initial access by exploiting public-facing vulnerabilities, including a zero-day in SiteCore products (CVE-2025-53690), and using compromised credentials. Once inside, UAT-8837 employs a variety of open-source tools, such as the Earthworm utility for creating reverse tunnels, to conduct reconnaissance, exfiltrate data, and maintain persistence. Cisco Talos assesses with medium confidence that the group is linked to China, highlighting the ongoing threat of state-sponsored espionage against vital sectors.",
      "tags": [
        "APT",
        "UAT-8837",
        "China",
        "Cisco Talos",
        "Critical Infrastructure",
        "CVE-2025-53690",
        "Earthworm"
      ],
      "categories": [
        "Threat Actor",
        "Cyberattack",
        "Industrial Control Systems"
      ],
      "createdAt": "2026-01-16T15:00:00.000Z",
      "updatedAt": "2026-01-23T12:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-53690"
      ],
      "isUpdate": true,
      "updateSummary": "UAT-8837's Sitecore zero-day (CVE-2025-53690) is a CVSS 9.0 RCE flaw, now in CISA KEV. New tools: WeepSteel backdoor, Sharphound, Certipy. DLL exfiltration suggests supply chain attack.",
      "updateContent": "New analysis reveals CVE-2025-53690 is a critical ViewState deserialization vulnerability with a CVSS score of 9.0, allowing remote code execution, and has been added to CISA's KEV catalog. Beyond Earthworm, UAT-8837 now uses Sharphound for Active Directory reconnaissance, Certipy for certificate abuse, and deploys the WeepSteel backdoor. A significant development is the observation of attackers exfiltrating victims' proprietary DLLs, raising concerns about future supply chain attacks. Mitigation now explicitly includes rotating ASP.NET machine keys."
    },
    {
      "id": "f9b01bca-1575-4f92-bd2d-1fa170b4d29d",
      "slug": "oracle-january-2026-cpu-fixes-337-flaws-including-critical-remote-exploits",
      "headline": "Oracle's January 2026 Patch Update Fixes 337 Flaws, Including Critical Remote Exploits",
      "title": "Oracle Releases January 2026 Critical Patch Update, Addressing 337 Vulnerabilities Across Product Lines",
      "severity": "high",
      "excerpt": "Oracle has released its January 2026 Critical Patch Update (CPU), a massive security update containing 337 new patches for vulnerabilities across more than 30 product families. The update resolves approximately 230 unique CVEs, with the discrepancy due to shared components like third-party libraries affecting multiple products. Alarmingly, over 235 of the patched vulnerabilities can be exploited remotely without authentication, significantly increasing their risk. The update includes fixes for over two dozen critical-rated flaws, such as CVE-2025-66516, a 10.0 CVSS vulnerability in the Apache Tika library embedded in Oracle products. Oracle strongly urges customers to apply these patches without delay.",
      "tags": [
        "Oracle",
        "CPU",
        "Patch Tuesday",
        "Vulnerability",
        "RCE",
        "SSRF"
      ],
      "categories": [
        "Patch Management",
        "Vulnerability"
      ],
      "createdAt": "2026-01-22T15:00:00.000Z",
      "updatedAt": "2026-01-23T00:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-66516",
        "CVE-2026-21962",
        "CVE-2026-21945"
      ],
      "cvssScore": 10,
      "isUpdate": true,
      "updateSummary": "New details emerge on CVE-2026-21962, a 10.0 CVSS flaw affecting Oracle HTTP Server and WebLogic Proxy Plug-in, allowing remote takeover.",
      "updateContent": "Further analysis of Oracle's January 2026 CPU highlights CVE-2026-21962 as a critical 10.0 CVSS vulnerability. This flaw impacts Oracle HTTP Server and WebLogic Server Proxy Plug-in, allowing unauthenticated remote attackers to achieve complete system takeover and data access. The SANS Institute has identified this as a top-priority patch. Additionally, CVE-2026-21969, a high-severity vulnerability in Oracle's Agile Product Lifecycle Management, was also detailed, posing another risk for system compromise."
    },
    {
      "id": "f0fc24cb-491b-4a0f-ad22-5c6ce01ee0e6",
      "slug": "cisa-adds-four-actively-exploited-vulnerabilities-to-kev-catalog-january-2026",
      "headline": "CISA Mandates Patching for Four Actively Exploited Flaws in Zimbra, Vite, and More",
      "title": "CISA Adds Four Actively Exploited Vulnerabilities to KEV Catalog, Sets February Patch Deadline",
      "severity": "high",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added four vulnerabilities to its Known Exploited Vulnerabilities (KEV) catalog, confirming they are under active attack. The flaws affect a diverse range of products, including Synacor Zimbra Collaboration Suite (CVE-2025-68645), the Vite frontend framework (CVE-2025-31125), Versa Concerto SD-WAN (CVE-2025-34026), and the 'eslint-config-prettier' NPM package (CVE-2025-54313). Due to evidence of ongoing exploitation, Federal Civilian Executive Branch (FCEB) agencies are required to apply patches or mitigations by February 12, 2026. CISA strongly urges all organizations to prioritize remediation to defend against these immediate threats.",
      "tags": [
        "KEV",
        "BOD 22-01",
        "Federal Agencies",
        "LFI",
        "Authentication Bypass",
        "NPM",
        "SD-WAN"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Supply Chain Attack"
      ],
      "createdAt": "2026-01-23T15:00:00.000Z",
      "updatedAt": "2026-01-23T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-68645",
        "CVE-2025-31125",
        "CVE-2025-34026",
        "CVE-2025-54313"
      ],
      "isUpdate": false
    },
    {
      "id": "ce7d4822-b161-49c4-9cf7-99f555a387a3",
      "slug": "north-korean-contagious-interview-campaign-weaponizes-vs-code-projects",
      "headline": "North Korean Hackers Lure Developers with Fake Job Interviews, Backdoor macOS via VS Code",
      "title": "North Korea's 'Contagious Interview' Campaign Weaponizes Malicious VS Code Projects on GitHub",
      "severity": "high",
      "excerpt": "State-sponsored threat actors from North Korea, including the Lazarus Group, are targeting software developers in a sophisticated campaign dubbed 'Contagious Interview.' According to Jamf Threat Labs, the attackers use fake job offers to entice developers, particularly in the crypto and fintech sectors, into cloning malicious repositories from GitHub and GitLab. The attack abuses a feature in Microsoft's Visual Studio Code (VS Code), where trusting a repository can automatically execute a hidden `tasks.json` file. This triggers a backdoor on macOS systems, establishing persistence, collecting system data, and opening a C2 channel for remote code execution.",
      "tags": [
        "Social Engineering",
        "macOS",
        "VS Code",
        "Developer Targeting",
        "Cryptocurrency",
        "Fintech"
      ],
      "categories": [
        "Threat Actor",
        "Supply Chain Attack",
        "Phishing"
      ],
      "createdAt": "2026-01-23T15:00:00.000Z",
      "updatedAt": "2026-01-23T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "791377e4-0e79-4a94-9408-64654814db5d",
      "slug": "spanish-retailer-pccomponentes-denies-breach-cites-credential-stuffing-attack",
      "headline": "PcComponentes Denies Data Breach, Blames Credential Stuffing for Account Takeovers",
      "title": "Spanish Retailer PcComponentes Refutes Breach Claims, Confirms Large-Scale Credential Stuffing Attack",
      "severity": "medium",
      "excerpt": "Spanish electronics retailer PcComponentes has denied claims of a massive data breach affecting 16 million customers, stating its internal systems were not compromised. The announcement came after a threat actor, 'daghetiaw,' attempted to sell a large customer database on a hacking forum. The company's investigation concluded the incident was a large-scale credential stuffing attack, where attackers used credentials stolen from other breaches to access user accounts. While denying the breach, PcComponentes confirmed that customer data such as names, addresses, and phone numbers were exposed for accounts with reused passwords. In response, the company has mandated two-factor authentication (2FA) for all users and invalidated all active sessions.",
      "tags": [
        "Credential Stuffing",
        "Account Takeover",
        "2FA",
        "Password Reuse",
        "E-commerce"
      ],
      "categories": [
        "Data Breach",
        "Phishing",
        "Cyberattack"
      ],
      "createdAt": "2026-01-23T15:00:00.000Z",
      "updatedAt": "2026-01-23T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "ed661c53-307b-42a5-a2cb-4e2bdba489c1",
      "slug": "new-osiris-ransomware-linked-to-medusa-and-inc-gang-ttps",
      "headline": "New 'Osiris' Ransomware Borrows TTPs from Medusa and Inc Gangs, Uses Signed Driver to Kill AV",
      "title": "Osiris Ransomware Emerges with Advanced TTPs, Including Custom-Signed Driver for Defense Evasion",
      "severity": "high",
      "excerpt": "A new ransomware strain named Osiris is demonstrating a high level of sophistication by combining tactics from established ransomware groups like Medusa and Inc. The attackers use Rclone for data exfiltration to Wasabi cloud storage and deploy a version of Mimikatz named `kaz.exe`, both TTPs linked to the Inc group. More significantly, Osiris uses a custom-developed and signed malicious driver, 'Abyssworker' (aka Poortry), in a Bring-Your-Own-Vulnerable-Driver (BYOVD) attack to terminate security software. This driver and its loader, 'Stonestop,' have been previously associated with the Medusa ransomware gang. The use of these advanced, borrowed TTPs suggests Osiris is operated by experienced actors, possibly former affiliates of other groups.",
      "tags": [
        "Ransomware",
        "BYOVD",
        "Kernel Driver",
        "Defense Evasion",
        "Double Extortion",
        "Medusa",
        "Inc"
      ],
      "categories": [
        "Ransomware",
        "Malware",
        "Threat Actor"
      ],
      "createdAt": "2026-01-23T15:00:00.000Z",
      "updatedAt": "2026-01-23T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "cd9bbb12-b068-4e4c-b770-de65af3e4cfa",
      "slug": "inc-ransomware-opsec-fail-allows-data-recovery-for-12-us-firms",
      "headline": "INC Ransomware OPSEC Fail: Reused Infrastructure Leads to Data Recovery for 12 U.S. Victims",
      "title": "INC Ransomware's Poor Operational Security Allows Security Firm to Recover Data for 12 U.S. Companies",
      "severity": "medium",
      "excerpt": "A significant operational security (OPSEC) failure by the INC ransomware group has allowed cybersecurity firm Cyber Centaurs to recover stolen data for twelve U.S. organizations. The discovery was made after analyzing an attack involving the RainINC ransomware variant. Researchers found artifacts from the open-source backup tool, Restic, including hardcoded S3 access keys and passwords. By pivoting to this attacker-controlled infrastructure, Cyber Centaurs found that the gang had been reusing the same cloud storage repositories across multiple attacks, leaving the encrypted data of a dozen unrelated victims accessible. This rare win for defenders highlights how even sophisticated groups can make critical mistakes.",
      "tags": [
        "OPSEC",
        "Restic",
        "Data Recovery",
        "Incident Response",
        "Forensics",
        "S3"
      ],
      "categories": [
        "Ransomware",
        "Incident Response",
        "Threat Actor"
      ],
      "createdAt": "2026-01-23T15:00:00.000Z",
      "updatedAt": "2026-01-23T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "3b6ac02f-37de-4bc8-93c9-92ccbb743273",
      "slug": "anubis-raas-offers-destructive-wipe-mode-for-extortion",
      "headline": "Anubis RaaS Ups the Ante with Destructive 'Wipe Mode' to Maximize Extortion",
      "title": "New Anubis Ransomware-as-a-Service Includes Optional 'Wipe Mode' for Permanent Data Destruction",
      "severity": "high",
      "excerpt": "A new Ransomware-as-a-Service (RaaS) operation named Anubis is gaining attention for its destructive capabilities. Evolving from a prototype called 'Sphinx,' Anubis offers its affiliates a dual-execution model. In addition to standard encryption, the malware can be run with a `/WIPEMODE` parameter that irreversibly overwrites and destroys victim files, rendering them unrecoverable. This tactic fundamentally changes the extortion negotiation, as paying a ransom cannot restore the data. It indicates a strategy where attackers rely solely on the threat of leaking exfiltrated data for payment, using permanent data destruction as additional leverage. The group is targeting organizations opportunistically across the globe.",
      "tags": [
        "RaaS",
        "Wiper Malware",
        "Data Destruction",
        "Extortion",
        "Double Extortion"
      ],
      "categories": [
        "Ransomware",
        "Malware",
        "Threat Actor"
      ],
      "createdAt": "2026-01-23T15:00:00.000Z",
      "updatedAt": "2026-01-23T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    }
  ]
}