{
  "pub_id": "pub-2025-11-26",
  "headline": "CodeRED Emergency Alerts Downed by Ransomware; Major Banks Hit in Supply Chain Breach; Russia & North Korea APTs Collaborate",
  "summary": "This cybersecurity brief for November 26, 2025, covers several critical incidents. A ransomware attack by the 'Inc Ransom' group has crippled the OnSolve CodeRED emergency alert system across the U.S., disrupting a vital public safety tool. In a major supply chain breach, financial tech vendor SitusAMC exposed sensitive data from top banks like JPMorgan Chase and Citi. Security researchers uncovered an unprecedented collaboration between Russian (Gamaredon) and North Korean (Lazarus) state-sponsored hacking groups using shared infrastructure. Additionally, a new, more destructive version of the 'Shai-Hulud' npm worm is causing widespread compromise, and CISA has issued warnings about spyware targeting Signal/WhatsApp users and multiple vulnerabilities in industrial control systems.",
  "pub_date": "2025-11-26",
  "total_articles": 6,
  "articles": [
    {
      "id": "12bce11f-9b46-4203-b252-f20d7700d187",
      "slug": "us-homeland-security-warns-of-rising-cyber-threats-amid-shutdown",
      "headline": "Homeland Security Warns Gov't Shutdown and Lapsed Law Cripple U.S. Cyber Defenses",
      "title": "U.S. Homeland Security Committee Warns of Rising Cyber Threats Amidst Government Shutdown",
      "severity": "high",
      "excerpt": "The U.S. House Committee on Homeland Security has issued a stark warning in its latest 'Cyber Threat Snapshot,' stating that the nation's ability to defend against cyber threats is being severely hampered. The report cites a dual crisis: a federal government shutdown that furloughs key cybersecurity personnel, and the lapse of the Cybersecurity Information Sharing Act of 2015. This creates 'dangerous blind spots' at a time of heightened threat activity from nation-state actors like China and Iran, and a surge in attacks against U.S. critical infrastructure.",
      "tags": [
        "government shutdown",
        "policy",
        "information sharing",
        "CISA",
        "Homeland Security",
        "nation-state",
        "critical infrastructure"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Threat Intelligence"
      ],
      "createdAt": "2025-11-04T15:00:00.000Z",
      "updatedAt": "2025-11-26T00:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "CISA faces proposed 17% budget cut and staffing crisis, while CISA 2015 gets short extension, intensifying U.S. cyber defense concerns.",
      "updateContent": "A draft 2026 budget proposes a 17% cut ($495M) and over 1,000 job eliminations for CISA, exacerbating its 40% vacancy rate. This threatens support for state/local entities and programs like MS-ISAC. Meanwhile, the Cybersecurity Information Sharing Act of 2015 (CISA 2015), previously lapsed, has received a short-term extension until January 30, 2026. These developments further degrade the U.S. national cybersecurity posture, increasing vulnerability to sophisticated threats and ransomware."
    },
    {
      "id": "963a1f54-78eb-42c0-905e-29ac86efa63b",
      "slug": "us-emergency-alert-system-codered-crippled-by-inc-ransom-attack",
      "headline": "CodeRED Emergency Alert System Crippled by 'Inc Ransom' Attack, Disrupting US Public Safety",
      "title": "Inc Ransom Attack on OnSolve Disables CodeRED Emergency Alert System Across the United States",
      "severity": "high",
      "excerpt": "The OnSolve CodeRED emergency alert system, a critical communication tool for hundreds of U.S. municipalities, has been taken offline following a ransomware attack claimed by the 'Inc Ransom' group. The attack, which began on November 1, 2025, resulted in the encryption of systems and the exfiltration of user data, including names, addresses, and contact information. After failed ransom negotiations, the vendor was forced to decommission the legacy platform, causing significant service disruptions for local governments in numerous states and leaving them unable to issue vital public safety notifications.",
      "tags": [
        "Ransomware",
        "Inc Ransom",
        "CodeRED",
        "OnSolve",
        "Emergency Alert System",
        "Public Safety",
        "Data Breach",
        "Double Extortion"
      ],
      "categories": [
        "Ransomware",
        "Cyberattack",
        "Data Breach"
      ],
      "createdAt": "2025-11-26T15:00:00.000Z",
      "updatedAt": "2025-11-26T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "9ab5d287-f056-4fd4-86f2-fe3c171687db",
      "slug": "unprecedented-collaboration-found-between-russian-gamaredon-and-north-korean-lazarus-apts",
      "headline": "Geopolitical Shift: Russian and North Korean State Hackers Found Sharing Attack Infrastructure",
      "title": "Researchers Uncover Unprecedented Collaboration Between Russian Gamaredon and North Korean Lazarus APTs",
      "severity": "high",
      "excerpt": "In a rare and alarming discovery, security researchers have found evidence of operational collaboration between two of the world's most prolific state-sponsored hacking groups: Russia's Gamaredon (Pitty Tiger) and North Korea's Lazarus. The evidence centers on a shared command-and-control (C2) server IP address that was used by both groups within days of each other to deliver their respective malware payloads. This convergence of TTPs and infrastructure signals a potential new phase of cyber operations where geopolitical alliances between Moscow and Pyongyang are extending into direct, cooperative attacks, potentially amplifying the threat level for defenders globally.",
      "tags": [
        "Threat Actor",
        "APT",
        "Gamaredon",
        "Lazarus",
        "Russia",
        "North Korea",
        "Threat Intelligence",
        "C2"
      ],
      "categories": [
        "Threat Actor",
        "Threat Intelligence",
        "Cyberattack"
      ],
      "createdAt": "2025-11-26T15:00:00.000Z",
      "updatedAt": "2025-11-26T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "8412e817-3f3f-4409-bf6e-83b7056de636",
      "slug": "water-gamayun-apt-exploits-windows-msc-eviltwin-vulnerability",
      "headline": "Water Gamayun APT Exploits Novel 'MSC EvilTwin' Windows Flaw in Stealthy Attacks",
      "title": "Russia-Aligned Water Gamayun APT Exploits Windows MMC Vulnerability (CVE-2025-26633) in Sophisticated Campaign",
      "severity": "high",
      "excerpt": "The Russia-aligned APT group Water Gamayun is actively exploiting a novel vulnerability in the Windows Microsoft Management Console (MMC), tracked as CVE-2025-26633. The attack, analyzed by Zscaler and dubbed 'MSC EvilTwin,' uses a malicious .msc file to proxy code execution through the trusted mmc.exe binary, making it difficult to detect. The multi-stage campaign begins with a malicious download and uses embedded commands to execute hidden PowerShell payloads. This technique allows the attackers to install backdoors and information stealers while evading traditional security measures, showcasing the group's continued sophistication in developing stealthy intrusion methods.",
      "tags": [
        "Water Gamayun",
        "APT",
        "CVE-2025-26633",
        "MSC EvilTwin",
        "Microsoft Management Console",
        "PowerShell",
        "Defense Evasion",
        "Zscaler"
      ],
      "categories": [
        "Threat Actor",
        "Vulnerability",
        "Malware"
      ],
      "createdAt": "2025-11-26T15:00:00.000Z",
      "updatedAt": "2025-11-26T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-26633"
      ],
      "isUpdate": false
    },
    {
      "id": "5b155ce6-72ee-4ebb-be6a-7ef34051c5af",
      "slug": "cisa-issues-seven-advisories-for-critical-ics-vulnerabilities",
      "headline": "CISA Warns of Critical Flaws in Industrial Control Systems, Including CVSS 10.0 Bug",
      "title": "CISA Releases Seven Advisories for Vulnerabilities in Rockwell, Opto 22, and Zenitel Industrial Control Systems",
      "severity": "critical",
      "excerpt": "On November 25, 2025, CISA issued seven new advisories for vulnerabilities in Industrial Control Systems (ICS) from multiple vendors, including Rockwell Automation, Opto 22, and Zenitel. The flaws affect equipment used globally in critical manufacturing and communications sectors. The most severe vulnerability, CVE-2025-64130, is a critical OS command injection flaw in Zenitel communications equipment with a CVSS score of 10.0, which could allow for remote code execution. Other advisories cover flaws leading to denial-of-service and information exposure, prompting CISA to urge immediate review and mitigation by asset owners.",
      "tags": [
        "ICS",
        "OT",
        "CISA",
        "Vulnerability",
        "CVE-2025-64130",
        "Rockwell Automation",
        "Zenitel",
        "Critical Infrastructure"
      ],
      "categories": [
        "Industrial Control Systems",
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2025-11-26T15:00:00.000Z",
      "updatedAt": "2025-11-26T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-64130"
      ],
      "cvssScore": 10,
      "isUpdate": false
    },
    {
      "id": "bd47a1f9-f630-4a6c-a52f-e29600ee534d",
      "slug": "nvidia-and-wordpress-plugins-hit-with-ssrf-and-xss-vulnerabilities",
      "headline": "NVIDIA AI Toolkit and WordPress Plugins Hit with High-Severity Flaws",
      "title": "Vulnerabilities Disclosed in NVIDIA NeMo Agent and WordPress Plugins, Exposing Users to SSRF and XSS Attacks",
      "severity": "high",
      "excerpt": "On November 25, 2025, several new software vulnerabilities were disclosed, including a high-severity Server-Side Request Forgery (SSRF) flaw in NVIDIA's NeMo Agent Toolkit (CVE-2025-33203) used for AI development. This flaw could lead to information disclosure and denial of service. Concurrently, vulnerabilities were found in popular WordPress plugins. The 'Just Highlight' plugin is affected by a stored Cross-Site Scripting (XSS) bug (CVE-2025-13311), while the 'Locker Content' plugin has a sensitive information exposure flaw (CVE-2025-12525) that could allow unauthenticated attackers to bypass content restrictions.",
      "tags": [
        "Vulnerability",
        "NVIDIA",
        "WordPress",
        "SSRF",
        "XSS",
        "CVE-2025-33203",
        "CVE-2025-13311",
        "CVE-2025-12525"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cloud Security"
      ],
      "createdAt": "2025-11-26T15:00:00.000Z",
      "updatedAt": "2025-11-26T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-33203",
        "CVE-2025-13311",
        "CVE-2025-12525"
      ],
      "cvssScore": 7.6,
      "isUpdate": false
    }
  ]
}