{
  "pub_id": "pub-2025-11-23",
  "headline": "Zero-Day Exploits Rock Oracle and Chrome; APTs Uncovered in Multi-Year Espionage Campaigns",
  "summary": "This cybersecurity brief for November 23, 2025, covers a tumultuous period marked by the active exploitation of zero-day vulnerabilities in Oracle E-Business Suite by the Cl0p ransomware gang and in Google Chrome. Concurrently, researchers have exposed long-running cyberespionage campaigns by APT24 and APT31, which utilized sophisticated supply chain attacks and cloud-based C2 infrastructure. Other major incidents include a record-breaking 15.72 Tbps DDoS attack mitigated by Microsoft, a critical CVSS 10.0 vulnerability in Grafana Enterprise, and a series of data breaches impacting Harvard University, CrowdStrike, and Salesforce customers via a supply chain attack on Gainsight.",
  "pub_date": "2025-11-23",
  "total_articles": 3,
  "articles": [
    {
      "id": "af3d2680-756a-4006-906c-2beb4e01ab01",
      "slug": "logitech-confirms-data-breach-by-clop-ransomware-via-oracle-zero-day",
      "headline": "Logitech Confirms Breach: Clop Ransomware Exploits Oracle Zero-Day",
      "title": "Logitech Becomes Latest Victim of Clop Ransomware's Mass-Exploitation of Oracle E-Business Suite Zero-Day",
      "severity": "high",
      "excerpt": "Logitech has confirmed it suffered a data breach after the Clop ransomware gang exploited a zero-day vulnerability in Oracle's E-Business Suite (CVE-2025-61882). The consumer electronics giant stated that an unauthorized third party accessed and copied data related to employees, consumers, and suppliers. The incident is part of a wider campaign by Clop that has impacted numerous major organizations. Logitech asserts that sensitive personal data like credit card numbers was not exposed and business operations remain unaffected.",
      "tags": [
        "Clop",
        "Ransomware",
        "Data Breach",
        "Zero-Day",
        "Oracle",
        "CVE-2025-61882",
        "Logitech"
      ],
      "categories": [
        "Data Breach",
        "Ransomware",
        "Vulnerability"
      ],
      "createdAt": "2025-11-18T15:00:00.000Z",
      "updatedAt": "2025-11-23T12:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-61882",
        "CVE-2025-61884",
        "CVE-2025-618842"
      ],
      "isUpdate": true,
      "updateSummary": "Cox Enterprises confirmed as new victim of Clop's Oracle EBS zero-day campaign, impacting 9,500 individuals.",
      "updateContent": "Cox Enterprises has confirmed a data breach affecting nearly 9,500 individuals due to the Clop ransomware gang exploiting the same Oracle E-Business Suite zero-day vulnerability (CVE-2025-61882). The breach occurred in August 2025 but was detected in late September. This adds Cox Enterprises to the growing list of victims in Clop's large-scale campaign targeting this critical Oracle flaw, underscoring the widespread impact of the zero-day exploit. Cox is offering identity theft protection to affected individuals."
    },
    {
      "id": "815dbf5f-459d-4979-b189-ce8c9d974fb6",
      "slug": "cisa-mandates-7-day-patch-for-actively-exploited-fortinet-fortiweb-zero-day-cve-2025-58034",
      "headline": "URGENT: CISA Orders 7-Day Patch for Actively Exploited FortiWeb Zero-Day",
      "title": "Fortinet Discloses Critical FortiWeb Zero-Day (CVE-2025-58034) Under Active Attack; CISA Issues Emergency Directive",
      "severity": "critical",
      "excerpt": "Fortinet has disclosed a critical OS command injection zero-day vulnerability, CVE-2025-58034, in its FortiWeb Web Application Firewall (WAF) that is being actively exploited in the wild. The flaw allows an authenticated attacker to execute arbitrary commands on the underlying system. In response to observed attacks, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog and issued an emergency directive mandating federal agencies apply patches within an accelerated seven-day window, by November 25, 2025. Researchers have detected approximately 2,000 attacks leveraging the flaw and warn it could potentially be chained with a recently disclosed authentication bypass vulnerability (CVE-2025-64446) to achieve unauthenticated remote code execution.",
      "tags": [
        "Zero-Day",
        "WAF",
        "Command Injection",
        "CISA",
        "KEV",
        "Fortinet",
        "FortiWeb"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2025-11-20T15:00:00.000Z",
      "updatedAt": "2025-11-23T00:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-58034",
        "CVE-2025-64446"
      ],
      "isUpdate": true,
      "updateSummary": "Fortinet patches FortiWeb WAF CVE-2025-58034; Metasploit module released, increasing exploitation risk for 7.x/8.x versions.",
      "updateContent": "Fortinet has officially patched the actively exploited CVE-2025-58034 in FortiWeb WAF, affecting 7.x and 8.x versions. The vulnerability was initially 'stealth-patched' in routine updates before public disclosure. A critical development is the release of an exploit module for this flaw in the Metasploit framework. This significantly lowers the technical barrier for exploitation, making it accessible to a wider range of threat actors and dramatically increasing the likelihood of widespread attacks. Organizations are urged to apply patches immediately due to the heightened risk."
    },
    {
      "id": "be9adb28-3779-473f-8829-248ef18bf62b",
      "slug": "harvard-university-discloses-data-breach-from-phone-phishing-attack",
      "headline": "Harvard University Data Breach Exposes Donor Information After Phone Phishing Attack",
      "title": "Harvard University's Development Office Hit by Data Breach Following Sophisticated Vishing Campaign",
      "severity": "medium",
      "excerpt": "Harvard University has disclosed a data breach affecting its Alumni Affairs and Development Office, discovered on November 18, 2025. The incident originated from a phone-based phishing (vishing) attack that gave an unauthorized party access to systems containing personal information and donation records of university affiliates and donors. While highly sensitive data like Social Security numbers were reportedly not compromised, the breach exposed names, contact details, and donation histories. This attack follows a similar pattern seen in recent incidents at Princeton University and the University of Pennsylvania, indicating a targeted campaign against the development departments of major educational institutions.",
      "tags": [
        "vishing",
        "social engineering",
        "data breach",
        "education sector",
        "donor data",
        "PII"
      ],
      "categories": [
        "Data Breach",
        "Phishing",
        "Threat Intelligence"
      ],
      "createdAt": "2025-11-23T15:00:00.000Z",
      "updatedAt": "2025-11-23T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}