{
  "pub_id": "pub-2025-10-09",
  "headline": "Cl0p Exploits Oracle Zero-Day; Threat Actors Weaponize Legitimate Security Tools in Widespread Attacks",
  "summary": "This cybersecurity brief for October 9, 2025, covers a surge in critical threats, led by the Cl0p ransomware gang's exploitation of a zero-day vulnerability (CVE-2025-61882) in Oracle's E-Business Suite. A significant trend this period is the abuse of legitimate tools, with threat actors weaponizing the Velociraptor DFIR tool and exploiting a critical flaw (CVE-2025-10035) in Fortra's GoAnywhere MFT. Other major events include the Qilin ransomware attack on Japanese beverage giant Asahi, a sophisticated phishing campaign targeting marketing professionals, and new guidance from the G7 and UK's NCSC on managing AI risks and a sharp rise in national-level cyberattacks.",
  "pub_date": "2025-10-09",
  "total_articles": 8,
  "articles": [
    {
      "id": "8a4fabd5-07e0-44e4-bc44-b2ff1c88d744",
      "slug": "uk-ncsc-reports-nationally-significant-cyberattacks-more-than-doubled",
      "headline": "UK's NCSC Warns of 'Alarming' Rise in Cyberattacks, Doubling in Past Year",
      "title": "UK's National Cyber Security Centre Reports \"Nationally Significant\" Cyberattacks More Than Doubled",
      "severity": "informational",
      "excerpt": "The UK's National Cyber Security Centre (NCSC) revealed in its 2025 annual review that it managed 204 \"nationally significant\" cyberattacks over the past year, more than double the 89 incidents from the previous year. The agency attributed the alarming surge to increasing threats from state-sponsored actors, particularly Russia and China, as well as the proliferation of sophisticated ransomware gangs. The NCSC has urged UK businesses to treat cybersecurity as a matter of survival and to elevate cyber resilience to a board-level responsibility to combat the growing threat.",
      "tags": [
        "NCSC",
        "UK",
        "Threat Report",
        "State-Sponsored Hacking",
        "Ransomware",
        "Policy"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Threat Intelligence"
      ],
      "createdAt": "2025-10-06T15:00:00.000Z",
      "updatedAt": "2025-10-09T00:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "NCSC launches new 'Cyber Action Toolkit' for SMBs, reiterating 129% surge in nationally significant cyberattacks and emphasizing board-level responsibility.",
      "updateContent": "The NCSC's 2025 Annual Review, released on October 9, confirms a 129% surge in 'nationally significant' cyber incidents, rising to 204. In response to the escalating threat, the NCSC has launched a new 'Cyber Action Toolkit' specifically designed for small businesses and sole traders to bolster their defenses. NCSC Chief Executive Dr. Richard Horne emphasized that cybersecurity is now a fundamental component of business survival and national resilience. The report also details increased scrutiny, higher cyber insurance premiums, and heightened supply chain risk as key impacts for UK organizations."
    },
    {
      "id": "876cd663-5651-48fe-bbc5-f088d248a886",
      "slug": "clop-exploits-critical-oracle-e-business-suite-zero-day-cve-2025-61882",
      "headline": "Clop Exploits Critical Oracle Zero-Day; CISA Issues Emergency Patch Directive",
      "title": "Clop Ransomware Group Actively Exploiting Critical Oracle E-Business Suite Zero-Day (CVE-2025-61882)",
      "severity": "critical",
      "excerpt": "Multiple international cybersecurity agencies, including CISA, the UK's NCSC, and Singapore's CSA, have issued urgent warnings about a critical zero-day vulnerability, CVE-2025-61882, in Oracle E-Business Suite. The flaw, which has a CVSS score of 9.8, is being actively exploited by the Clop ransomware group in a campaign that began in August 2025. The attackers are leveraging the vulnerability to exfiltrate corporate data and are now sending extortion emails to executives of victim organizations. CISA has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, mandating federal agencies to patch by October 28, 2025, highlighting the extreme risk posed by this unauthenticated remote code execution flaw.",
      "tags": [
        "Zero-Day",
        "RCE",
        "Oracle",
        "Clop",
        "Ransomware",
        "KEV",
        "CISA"
      ],
      "categories": [
        "Vulnerability",
        "Threat Actor",
        "Ransomware"
      ],
      "createdAt": "2025-10-07T15:00:00.000Z",
      "updatedAt": "2025-10-09T00:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-61882"
      ],
      "cvssScore": 9.8,
      "isUpdate": true,
      "updateSummary": "New technical details emerge on Clop's Oracle EBS zero-day, including SSRF escalation, specific affected versions, and patch prerequisites.",
      "updateContent": "Further analysis of the CVE-2025-61882 Oracle EBS zero-day reveals it is reportedly an SSRF issue escalating to RCE, affecting versions 12.2.3 through 12.2.14. The Clop group is also combining this zero-day with other previously patched vulnerabilities to maximize access. Oracle released an emergency patch on October 4, 2025, with the October 2023 Critical Patch Update as a prerequisite. New MITRE ATT&CK techniques identified include T1595.002 (Vulnerability Scanning), T1212 (Exploitation for Credential Access), T1041 (Exfiltration Over C2 Channel), and T1486 (Data Encrypted for Impact). A new observable */xmlpserver/* has also been identified for the BI Publisher component."
    },
    {
      "id": "62443d6f-4cda-496d-92c0-61206be98447",
      "slug": "qilin-ransomware-claims-attack-on-asahi-breweries",
      "headline": "Qilin Ransomware Claims Disruptive Attack on Japanese Beverage Giant Asahi",
      "title": "Qilin Ransomware Gang Takes Responsibility for Cyberattack on Asahi Group, Claims Theft of 27GB of Data",
      "severity": "high",
      "excerpt": "The Russia-based Qilin ransomware group has claimed responsibility for a significant cyberattack against Asahi Group Holdings, one of Japan's largest beverage companies. The attack, first disclosed in late September 2025, caused major operational disruptions, forcing the suspension of order and shipment systems. On October 7, Qilin added Asahi to its data leak site, alleging the theft of 27 gigabytes of sensitive data, including contracts and employee information. Asahi is still working to restore its systems, highlighting the vulnerability of manufacturing and supply chain operations to ransomware.",
      "tags": [
        "Double Extortion",
        "RaaS",
        "Manufacturing",
        "Supply Chain",
        "Japan"
      ],
      "categories": [
        "Ransomware",
        "Cyberattack",
        "Industrial Control Systems"
      ],
      "createdAt": "2025-10-08T15:00:00.000Z",
      "updatedAt": "2025-10-09T00:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "Qilin posts data samples, new technical observables and mitigation strategies detailed for Asahi attack.",
      "updateContent": "The Qilin ransomware group has escalated pressure on Asahi by posting samples of the stolen 27GB of data on their leak site, confirming the double extortion tactic. New technical details include specific cyber observables such as `powershell.exe -enc <base64_blob>` commands, `bitsadmin.exe` and `curl.exe` usage, and the `*.qilin` file extension. Enhanced detection strategies involve monitoring for data staging, analyzing PowerShell logs, and strict network egress monitoring. Mitigation advice now emphasizes offline backups, hardening public-facing services, and user training against phishing."
    },
    {
      "id": "d69a02fa-c01c-4125-909f-cd68d1253764",
      "slug": "legitimate-dfir-tool-velociraptor-weaponized-in-ransomware-attacks",
      "headline": "Living Off the Land: Hackers Abuse Velociraptor DFIR Tool to Deploy Ransomware",
      "title": "China-Linked Group Storm-2603 Abuses Velociraptor DFIR Tool to Deploy LockBit, Babuk Ransomware",
      "severity": "high",
      "excerpt": "A suspected China-based threat group, Storm-2603, is weaponizing the legitimate open-source digital forensics and incident response (DFIR) tool, Velociraptor. According to Cisco Talos, the attackers are using an outdated and vulnerable version of the tool (exploiting CVE-2025-6264) to gain persistence, escalate privileges, and deploy multiple ransomware families, including Warlock, LockBit, and Babuk. The campaign highlights the growing trend of attackers abusing trusted security tools to evade detection while compromising VMware ESXi and Windows environments.",
      "tags": [
        "Living off the Land",
        "DFIR",
        "Velociraptor",
        "Storm-2603",
        "LockBit",
        "Babuk",
        "VMware"
      ],
      "categories": [
        "Threat Actor",
        "Ransomware",
        "Malware"
      ],
      "createdAt": "2025-10-09T15:00:00.000Z",
      "updatedAt": "2025-10-09T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-6264"
      ],
      "isUpdate": false
    },
    {
      "id": "479a9828-475a-4ca2-afbb-07f692d6f3ef",
      "slug": "microsoft-links-storm-1175-to-goanywhere-mft-zero-day-cve-2025-10035",
      "headline": "Perfect 10.0 CVSS Flaw in GoAnywhere MFT Exploited by Medusa Ransomware Group",
      "title": "Microsoft Attributes GoAnywhere MFT Zero-Day Exploitation (CVE-2025-10035) to Medusa Ransomware Operator Storm-1175",
      "severity": "critical",
      "excerpt": "Microsoft has linked the cybercrime group Storm-1175, known for deploying Medusa ransomware, to the active exploitation of a critical vulnerability in Fortra's GoAnywhere Managed File Transfer (MFT) solution. The flaw, CVE-2025-10035, is an unauthenticated remote code execution vulnerability with a perfect 10.0 CVSS score. Storm-1175 has been exploiting this zero-day since at least September 11, 2025, to compromise organizations in finance, healthcare, and technology, deploying backdoors and RMM tools before exfiltrating data and deploying ransomware.",
      "tags": [
        "Deserialization",
        "RCE",
        "MFT",
        "GoAnywhere",
        "Storm-1175",
        "Medusa Ransomware"
      ],
      "categories": [
        "Vulnerability",
        "Ransomware",
        "Threat Actor"
      ],
      "createdAt": "2025-10-09T15:00:00.000Z",
      "updatedAt": "2025-10-09T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-10035"
      ],
      "cvssScore": 10,
      "isUpdate": false
    },
    {
      "id": "d049647b-a4ca-4105-abbd-d5069a50af49",
      "slug": "fake-job-phishing-campaign-targets-marketing-professionals",
      "headline": "Phishing Campaign Lures Marketing Professionals with Fake Jobs at Tesla, Google",
      "title": "Cofense Uncovers Phishing Campaign Targeting Marketers with Fake Job Offers from Major Brands",
      "severity": "medium",
      "excerpt": "Security firm Cofense has detailed a sophisticated phishing campaign that targets marketing and social media professionals with fake job opportunities from high-profile brands like Tesla, Google, Ferrari, and Red Bull. The campaign uses realistic emails and multi-step credential harvesting portals to trick victims. Unlike typical phishing attacks, the primary goal is to collect detailed resumes and other personally identifiable information (PII). This data can then be used by threat actors to craft more convincing social engineering attacks, bypass security questions, or commit identity theft.",
      "tags": [
        "Phishing",
        "Social Engineering",
        "Credential Harvesting",
        "PII",
        "Cofense"
      ],
      "categories": [
        "Phishing",
        "Data Breach"
      ],
      "createdAt": "2025-10-09T15:00:00.000Z",
      "updatedAt": "2025-10-09T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "0dfec9e0-d167-4b4e-b8de-e950268daec9",
      "slug": "financial-firms-boost-cyber-budgets-and-board-oversight-moodys-report",
      "headline": "Financial Firms Tie CEO Pay to Cyber Performance Amid Budget Hikes, Moody's Finds",
      "title": "Moody's Report: Financial and Insurance Firms Increase Cyber Budgets and Board-Level Governance",
      "severity": "informational",
      "excerpt": "A new report from Moody's indicates a significant shift in how financial and insurance firms are managing cyber risk. Companies are increasing cybersecurity spending, with nearly half dedicating 8% or more of their IT budget to cyber. Governance is also strengthening, as 40% of firms now link CEO compensation directly to cybersecurity performance, up from 24% in 2023. Furthermore, CISO briefings to the board are becoming more frequent, and firms are maturing their operational readiness with annual incident response tests and daily data backups.",
      "tags": [
        "Cybersecurity Budget",
        "Governance",
        "Board of Directors",
        "Financial Services",
        "Insurance",
        "Moody's"
      ],
      "categories": [
        "Policy and Compliance",
        "Security Operations"
      ],
      "createdAt": "2025-10-09T15:00:00.000Z",
      "updatedAt": "2025-10-09T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    },
    {
      "id": "e8c43ebd-0759-4794-8910-776d7ecc0540",
      "slug": "guidance-on-protecting-critical-infrastructure-with-limited-budgets",
      "headline": "Expert Advice on Securing Critical Infrastructure with Limited Budgets",
      "title": "Security Leaders Advised on Protecting Critical Infrastructure Amid Budget Constraints",
      "severity": "informational",
      "excerpt": "In a recent podcast, cybersecurity expert Chetrice Romero from Ice Miller provided guidance for leaders responsible for protecting critical infrastructure, particularly those facing limited budgets. The discussion covered common cyber and physical threats to utilities, the need for scalable and resilient strategies, and practical advice for maximizing security investments. Key recommendations included embracing cloud-native platforms for efficiency and designing future-proof command centers, offering actionable insights for securing essential systems in a challenging economic environment.",
      "tags": [
        "Critical Infrastructure",
        "Budget",
        "Cybersecurity Strategy",
        "Resilience",
        "ICS Security",
        "OT Security"
      ],
      "categories": [
        "Security Operations",
        "Industrial Control Systems",
        "Policy and Compliance"
      ],
      "createdAt": "2025-10-09T15:00:00.000Z",
      "updatedAt": "2025-10-09T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    }
  ]
}