{
  "pub_id": "pub-2026-01-25",
  "headline": "Massive 149M Credential Leak, Sandworm's 'DynoWiper' Targets Poland, and FortiGate Firewalls Breached Despite Patches",
  "summary": "This cybersecurity brief for January 25, 2026, covers a series of critical incidents. A massive 149 million credential leak has exposed users of Gmail, Facebook, and financial services. The Russian state-sponsored group Sandworm deployed a new 'DynoWiper' malware in an attack on Poland's power grid. Fully patched FortiGate firewalls are being compromised via a new SSO bypass. Other major events include data breach claims against Nike and Under Armour, a critical 11-year-old Telnet vulnerability, and multiple patch-related issues from Microsoft causing boot failures and application freezes.",
  "pub_date": "2026-01-25",
  "total_articles": 9,
  "articles": [
    {
      "id": "9c8eb030-c808-48cf-a6a9-20b56192750f",
      "slug": "microsoft-releases-emergency-oob-updates-to-fix-january-patch-tuesday-issues",
      "headline": "Microsoft Issues Emergency Out-of-Band Patches for Flawed January Updates",
      "title": "Microsoft Releases Out-of-Band Updates to Fix Remote Desktop and Cloud Storage Bugs from January Patches",
      "severity": "medium",
      "excerpt": "Microsoft has released several emergency out-of-band (OOB) updates on January 24, 2026, to address significant bugs introduced by its January 13 Patch Tuesday release. The faulty updates caused a range of issues, including Remote Desktop connection failures, application hangs when accessing cloud storage like OneDrive, and system restart failures. The new cumulative updates, including KB5078136 and KB5078238, are available for various Windows versions and are intended to restore stability and functionality for affected users.",
      "tags": [
        "Microsoft",
        "Windows Update",
        "Patch Tuesday",
        "Out-of-Band",
        "KB5078136",
        "KB5078238",
        "Remote Desktop",
        "Bug Fix"
      ],
      "categories": [
        "Patch Management",
        "Security Operations"
      ],
      "createdAt": "2026-01-24T15:00:00.000Z",
      "updatedAt": "2026-01-25T00:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "New critical boot failures reported on Windows 11 after January updates, Microsoft investigating.",
      "updateContent": "Microsoft is investigating widespread reports of Windows 11 devices failing to boot with 'UNMOUNTABLE_BOOT_VOLUME' errors after installing the January 2026 security updates, specifically KB5074109. This critical issue primarily impacts physical Windows 11 25H2 and 24H2 devices, causing system unavailability. Unlike previous issues, no official fix or workaround has been released yet, and users are forced into manual recovery processes. This represents a significant escalation in the impact of the January updates."
    },
    {
      "id": "72d52abd-a4ab-4119-9645-bc1488165dc9",
      "slug": "massive-149m-credential-leak-exposes-gmail-facebook-financial-services",
      "headline": "Massive 149 Million Credential Leak Exposes Gmail, Facebook, and Financial Service Users",
      "title": "Unprotected Database Exposes 149 Million Unique Login Credentials from Infostealer Malware Logs",
      "severity": "high",
      "excerpt": "A publicly accessible, unencrypted 96 GB database containing 149.4 million unique login credentials has been discovered by a security researcher. The data, believed to be compiled from various infostealer malware logs and past breaches, impacts an estimated 48 million Gmail accounts, alongside users of Facebook, financial services, government portals, and numerous other online platforms. The leak includes usernames, passwords, and the direct login URLs, posing a significant risk of account takeover and fraud for millions of individuals globally.",
      "tags": [
        "credential leak",
        "infostealer",
        "data exposure",
        "password security",
        "account takeover"
      ],
      "categories": [
        "Data Breach",
        "Malware",
        "Threat Intelligence"
      ],
      "createdAt": "2026-01-25T15:00:00.000Z",
      "updatedAt": "2026-01-25T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "79337abe-f732-4163-aea9-1c08c0689583",
      "slug": "nike-investigates-data-breach-claim-from-worldleaks-extortion-group",
      "headline": "Nike Probes Data Breach Claim by 'WorldLeaks' Extortion Group",
      "title": "Extortion Group 'WorldLeaks' Targets Nike, Threatens to Leak Stolen Corporate Data",
      "severity": "high",
      "excerpt": "Global apparel giant Nike has launched an investigation into a potential data breach after being listed as a victim by the 'WorldLeaks' data extortion group. The group, which emerged in 2025 and focuses on data theft without deploying ransomware, threatened to publish stolen Nike data on January 24. Nike has confirmed it is assessing the situation. The type and volume of the allegedly stolen data have not been disclosed by the attackers.",
      "tags": [
        "WorldLeaks",
        "extortion",
        "data theft",
        "cybercrime",
        "retail"
      ],
      "categories": [
        "Data Breach",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2026-01-25T15:00:00.000Z",
      "updatedAt": "2026-01-25T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "d87ea4e6-0db8-473a-b89b-7a19facd8b16",
      "slug": "sandworm-deploys-new-dynowiper-malware-in-attack-on-polish-power-grid",
      "headline": "Sandworm Deploys New 'DynoWiper' Malware in Failed Attack on Polish Power Grid",
      "title": "Russian State-Sponsored Group Sandworm Linked to 'DynoWiper' Attack on Poland's Energy Infrastructure",
      "severity": "critical",
      "excerpt": "The Russian state-sponsored hacking group Sandworm has been attributed with a major, albeit unsuccessful, cyberattack against Poland's power system in late December 2025. Poland's energy minister described it as the 'largest cyber attack' on their energy infrastructure in years. Cybersecurity firm ESET linked the attack to Sandworm and discovered the use of a previously undocumented destructive malware, which has been named 'DynoWiper'. This incident underscores Sandworm's continued focus on targeting critical infrastructure with new cyber weapons.",
      "tags": [
        "Sandworm",
        "DynoWiper",
        "wiper malware",
        "critical infrastructure",
        "Poland",
        "Russia",
        "nation-state",
        "ICS",
        "OT"
      ],
      "categories": [
        "Cyberattack",
        "Threat Actor",
        "Malware"
      ],
      "createdAt": "2026-01-25T15:00:00.000Z",
      "updatedAt": "2026-01-25T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "88c2ab18-8042-4af7-a4ab-c8b86792da9c",
      "slug": "multi-stage-phishing-campaign-targets-russia-with-amnesia-rat-and-ransomware",
      "headline": "Phishing Campaign Hits Russia with Amnesia RAT, Uses GitHub and Dropbox for Payload Delivery",
      "title": "Multi-Stage Phishing Attack on Russian Users Deploys Amnesia RAT and Ransomware, Disables Microsoft Defender",
      "severity": "high",
      "excerpt": "A sophisticated, multi-stage phishing campaign is targeting users in Russia, delivering a combination of the Amnesia remote access trojan (RAT) and ransomware. The attack, analyzed by Fortinet FortiGuard Labs, is notable for its use of public cloud services like GitHub and Dropbox to host payloads and its use of a tool called 'defendnot' to disable Microsoft Defender antivirus. The campaign relies on social engineering and abuse of native Windows features rather than software exploits to achieve system compromise.",
      "tags": [
        "phishing",
        "Amnesia RAT",
        "ransomware",
        "Microsoft Defender",
        "GitHub",
        "Dropbox",
        "defense evasion"
      ],
      "categories": [
        "Phishing",
        "Malware",
        "Ransomware"
      ],
      "createdAt": "2026-01-25T15:00:00.000Z",
      "updatedAt": "2026-01-25T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "2e72def7-c70c-4437-99fd-d6070e6ed070",
      "slug": "shinyhunters-claims-breaches-of-crunchbase-betterment-via-okta-vishing",
      "headline": "ShinyHunters Claims Breach of Crunchbase, Betterment via Okta Vishing Attacks",
      "title": "Extortion Group ShinyHunters Alleges Compromise of Crunchbase and Betterment Using Okta Voice Phishing",
      "severity": "high",
      "excerpt": "The notorious cyber extortion syndicate ShinyHunters has claimed responsibility for breaching business intelligence firm Crunchbase and financial advisory company Betterment. According to the threat actor, the initial access was gained by using sophisticated voice phishing (vishing) attacks to socially engineer employees and compromise their Okta single sign-on (SSO) credentials. This method allows attackers to bypass weaker forms of multi-factor authentication. Neither of the targeted companies has publicly confirmed the breach.",
      "tags": [
        "ShinyHunters",
        "vishing",
        "social engineering",
        "Okta",
        "MFA bypass",
        "Crunchbase",
        "Betterment"
      ],
      "categories": [
        "Phishing",
        "Data Breach",
        "Threat Actor"
      ],
      "createdAt": "2026-01-25T15:00:00.000Z",
      "updatedAt": "2026-01-25T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "65b0cf3f-463c-410d-9dc9-5e04e65a1afa",
      "slug": "everest-ransomware-group-leaks-343gb-of-under-armour-customer-data",
      "headline": "Everest Ransomware Group Leaks 343GB of Under Armour Customer Data",
      "title": "Russia-Linked Everest Group Leaks 343 GB of Data Allegedly Stolen from Under Armour",
      "severity": "high",
      "excerpt": "The Russia-linked Everest ransomware group has leaked 343 GB of data allegedly stolen from global sportswear brand Under Armour. The massive data dump, which occurred on January 24, 2026, followed a failed extortion attempt. The leaked data is reported to contain the personally identifiable information (PII) of millions of customers, highlighting the 'double extortion' tactic where data publication is the primary threat. Under Armour has not yet commented on the incident.",
      "tags": [
        "Everest",
        "ransomware",
        "data leak",
        "Under Armour",
        "PII",
        "double extortion"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Threat Actor"
      ],
      "createdAt": "2026-01-25T15:00:00.000Z",
      "updatedAt": "2026-01-25T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "dc73e147-d212-4cdc-836a-3ba68852c653",
      "slug": "fully-patched-fortigate-firewalls-compromised-via-sso-bypass",
      "headline": "Warning: Fully Patched FortiGate Firewalls Are Being Compromised via New SSO Bypass",
      "title": "New Attack Path Allows Compromise of Fully Patched FortiGate Firewalls with SAML SSO Enabled",
      "severity": "critical",
      "excerpt": "Security analysts are warning of a new wave of attacks compromising even fully patched Fortinet FortiGate firewalls. The activity, observed since January 15, 2026, allows attackers to bypass SAML-based single sign-on (SSO) authentication to gain administrative access. The attacks result in unauthorized configuration changes, creation of persistent user accounts, and exfiltration of device configurations. Fortinet has reportedly identified a new, distinct attack path related to previously disclosed vulnerabilities (CVE-2025-59718, CVE-2025-59719), suggesting existing patches may not be fully effective.",
      "tags": [
        "FortiGate",
        "Fortinet",
        "SSO",
        "SAML",
        "authentication bypass",
        "firewall",
        "zero-day"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Patch Management"
      ],
      "createdAt": "2026-01-25T15:00:00.000Z",
      "updatedAt": "2026-01-25T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-59718",
        "CVE-2025-59719"
      ],
      "isUpdate": false
    },
    {
      "id": "f011ed23-42a2-4a30-964f-5d641f77eca8",
      "slug": "trend-micro-details-new-rce-exploit-for-metagpt-cve-2026-0761",
      "headline": "Trend Micro Details New RCE Flaw in MetaGPT (CVE-2026-0761)",
      "title": "New High-Severity RCE Vulnerability (CVE-2026-0761) in Foundation Agents MetaGPT Detailed by Trend Micro",
      "severity": "high",
      "excerpt": "Trend Micro has published details and a detection rule for a new high-severity remote code execution (RCE) vulnerability in Foundation Agents MetaGPT, tracked as CVE-2026-0761. The exploit, which occurs over HTTP, can be leveraged by an attacker for initial access into a network or for lateral movement. Trend Micro has released DDI RULE 5627 to detect exploitation attempts and advises organizations to update security products and scan for signs of compromise.",
      "tags": [
        "CVE-2026-0761",
        "RCE",
        "MetaGPT",
        "Trend Micro",
        "vulnerability",
        "exploit"
      ],
      "categories": [
        "Vulnerability",
        "Threat Intelligence"
      ],
      "createdAt": "2026-01-25T15:00:00.000Z",
      "updatedAt": "2026-01-25T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2026-0761"
      ],
      "isUpdate": false
    }
  ]
}