{
  "pub_id": "pub-2025-12-05",
  "headline": "Critical 'React2Shell' RCE Exploited by Chinese Hackers; Google Patches Android Zero-Days",
  "summary": "This cybersecurity brief for December 5, 2025, covers a critical 10.0 CVSS vulnerability dubbed 'React2Shell' (CVE-2025-55182) being actively exploited by Chinese state-sponsored actors just hours after disclosure. Other major incidents include Google patching two actively exploited Android zero-days, a joint US-Canada alert on new 'BRICKSTORM' malware targeting VMware, and the Clop ransomware group breaching a major UK NHS trust.",
  "pub_date": "2025-12-05",
  "total_articles": 5,
  "articles": [
    {
      "id": "bff50863-f8f0-4b0b-a731-84f7fd3ab456",
      "slug": "washington-post-confirms-breach-in-massive-oracle-software-attack",
      "headline": "Washington Post Breached by Clop Ransomware via Oracle Flaws",
      "title": "Washington Post Confirms Breach in Widespread Clop Ransomware Campaign Targeting Oracle E-Business Suite",
      "severity": "high",
      "excerpt": "The Washington Post has officially confirmed it was a victim of a large-scale cyberattack orchestrated by the Clop ransomware group. The threat actors exploited vulnerabilities in Oracle's E-Business Suite, compromising over 100 organizations globally. The campaign involves data exfiltration followed by aggressive extortion tactics, with Clop publicly naming victims on its dark web leak site to pressure them into paying ransoms reportedly as high as $50 million. This incident underscores the significant risk posed by vulnerabilities in widely used enterprise software and the sophisticated, multi-faceted extortion methods employed by modern ransomware gangs.",
      "tags": [
        "Clop",
        "Ransomware",
        "Oracle",
        "E-Business Suite",
        "Data Breach",
        "Extortion",
        "TA505"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Cyberattack"
      ],
      "createdAt": "2025-11-09T15:00:00.000Z",
      "updatedAt": "2025-12-05T00:00:00.000Z",
      "readingTime": 6,
      "isUpdate": true,
      "updateSummary": "Clop ransomware has added Barts Health NHS Trust, the UK's largest NHS trust, as a new victim in its ongoing Oracle E-business Suite campaign.",
      "updateContent": "The Clop ransomware group has claimed another high-profile victim in its ongoing campaign targeting Oracle E-business Suite vulnerabilities. Barts Health NHS Trust, the largest NHS trust in the UK, confirmed on December 5, 2025, that it suffered a data breach where attackers stole files from one of its databases. This incident highlights the continued threat posed by Clop's exploitation of enterprise software flaws and the severe impact on critical sectors like healthcare, potentially exposing sensitive patient and staff data. The attack pattern aligns with previous incidents, involving initial access via Oracle vulnerabilities and subsequent data exfiltration for extortion."
    },
    {
      "id": "592eddd6-164f-4283-915e-2afc10d41813",
      "slug": "cisa-warns-of-brickstorm-malware-used-by-chinese-hackers-against-us-government",
      "headline": "CISA Exposes 'BRICKSTORM' Backdoor Used by Chinese State Actors to Infiltrate US Government",
      "title": "CISA, NSA, and Canadian Cyber Centre Issue Joint Advisory on 'BRICKSTORM' Malware Used by PRC State-Sponsored Actors",
      "severity": "high",
      "excerpt": "The US Cybersecurity and Infrastructure Security Agency (CISA), NSA, and Canadian Centre for Cyber Security have jointly exposed a sophisticated backdoor named 'BRICKSTORM'. According to the December 4, 2025 advisory, People's Republic of China (PRC) state-sponsored actors are using this malware to target government and IT sector organizations. BRICKSTORM is designed for stealth and long-term persistence in both VMware vSphere and Windows environments. It employs multi-layered encrypted communications, including DNS-over-HTTPS (DoH), to hide its C2 traffic. The advisory details an attack chain where actors used a web shell for initial access, moved laterally via RDP, and ultimately deployed BRICKSTORM on a VMware vCenter server to compromise domain controllers. Agencies are urged to hunt for this threat immediately.",
      "tags": [
        "BRICKSTORM",
        "CISA",
        "NSA",
        "PRC",
        "China",
        "State-Sponsored",
        "Backdoor",
        "VMware",
        "Threat Actor"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Cyberattack"
      ],
      "createdAt": "2025-12-04T15:00:00.000Z",
      "updatedAt": "2025-12-05T00:00:00.000Z",
      "readingTime": 6,
      "isUpdate": true,
      "updateSummary": "Chinese state actor 'Warp Panda' identified, active since 2022, impacting dozens of US orgs via edge device exploits.",
      "updateContent": "New intelligence attributes the BRICKSTORM campaign to the Chinese state-sponsored threat actor 'Warp Panda,' active since at least 2022. Initial access often leverages vulnerabilities in internet-facing edge devices like firewalls and VPN concentrators. Reports indicate dozens of U.S. organizations have been impacted, highlighting the long-term persistence and broad scope of this espionage campaign. The update also explicitly maps several MITRE ATT&CK TTPs, including T1190 (Exploit Public-Facing Application) and T1078 (Valid Accounts), providing more granular technical context for detection and mitigation efforts."
    },
    {
      "id": "dccd3cbf-8f1e-4411-8a99-cf141ee276ba",
      "slug": "actively-exploited-android-zero-days-added-to-cisa-kev-catalog",
      "headline": "Android Zero-Days Under Active Attack, CISA Adds to KEV Catalog",
      "title": "CISA Adds Two Actively Exploited Android Framework Zero-Days (CVE-2025-48633, CVE-2025-48572) to KEV Catalog",
      "severity": "high",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added two high-severity Android zero-day vulnerabilities to its Known Exploited Vulnerabilities (KEV) catalog, indicating they are under active attack. The vulnerabilities, CVE-2025-48633 (Information Disclosure) and CVE-2025-48572 (Elevation of Privilege), affect the core Android Framework on versions 13, 14, 15, and 16. Google's December 2025 security bulletin confirmed the flaws may be subject to 'limited, targeted exploitation,' a pattern often associated with sophisticated spyware campaigns. Federal agencies are now mandated to patch these vulnerabilities, and all Android users are urged to apply the latest security updates as soon as possible to protect against potential device compromise.",
      "tags": [
        "Android",
        "Zero-Day",
        "KEV",
        "CISA",
        "Vulnerability",
        "Mobile Security",
        "CVE-2025-48633",
        "CVE-2025-48572"
      ],
      "categories": [
        "Vulnerability",
        "Mobile Security",
        "Threat Intelligence"
      ],
      "createdAt": "2025-12-04T15:00:00.000Z",
      "updatedAt": "2025-12-05T00:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-48633",
        "CVE-2025-48572"
      ],
      "isUpdate": true,
      "updateSummary": "Google released December 2025 Android Security Bulletin, patching 107 vulnerabilities including the two zero-days, with a Dec 23 deadline for federal agencies.",
      "updateContent": "Google has officially released its December 2025 Android Security Bulletin, addressing a total of 107 vulnerabilities. This bulletin includes patches for the previously reported zero-day vulnerabilities, CVE-2025-48633 and CVE-2025-48572, which remain under active, targeted exploitation. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has set a mandatory patch deadline of December 23, 2025, for all U.S. federal agencies. The bulletin also addresses another critical remote denial-of-service vulnerability, CVE-2025-48631, though it is not currently known to be exploited in the wild."
    },
    {
      "id": "cb0e99a7-c04c-4a40-b5fb-3280bea1e234",
      "slug": "new-benzona-ransomware-strain-emerges",
      "headline": "New \"Benzona\" Ransomware Strain Discovered in the Wild",
      "title": "CYFIRMA Researchers Identify New \"Benzona\" Ransomware Encrypting Files and Using TOR for Negotiations",
      "severity": "medium",
      "excerpt": "Security researchers at CYFIRMA have discovered a new ransomware strain named \"Benzona.\" The malware encrypts files on Windows, macOS, and Linux systems, appending a \".benzona\" extension and dropping a ransom note titled \"RECOVERY_INFO.txt\". Victims are instructed to use the TOR browser to access a chat portal for recovery negotiations. The threat actors behind Benzona are believed to use a variety of initial access vectors, including social engineering, botnets, and exploitation of software vulnerabilities.",
      "tags": [
        "Ransomware",
        "Benzona",
        "CYFIRMA",
        "Malware",
        "TOR"
      ],
      "categories": [
        "Ransomware",
        "Malware"
      ],
      "createdAt": "2025-12-05T15:00:00.000Z",
      "updatedAt": "2025-12-05T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "fd0be9ca-07bf-44e7-a93f-10d3abaebdfb",
      "slug": "active-exploitation-of-critical-7-zip-rce-vulnerability-confirmed",
      "headline": "Critical 7-Zip RCE Vulnerability Now Under Active Exploitation",
      "title": "Active Exploitation Confirmed for Critical 7-Zip RCE Vulnerability (CVE-2025-11001)",
      "severity": "high",
      "excerpt": "A critical remote code execution (RCE) vulnerability in the popular 7-Zip file archiver, tracked as CVE-2025-11001, is now being actively exploited in the wild. The path traversal flaw, which affects versions prior to 25.0.0, can be triggered when a user extracts a specially crafted malicious archive. This allows an attacker to write files to arbitrary locations and execute code. NHS England has issued an advisory confirming active exploitation, urging all organizations to update their installations immediately.",
      "tags": [
        "7-Zip",
        "RCE",
        "Vulnerability",
        "Path Traversal",
        "Zip Slip",
        "Patch Management"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2025-12-05T15:00:00.000Z",
      "updatedAt": "2025-12-05T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-11001",
        "CVE-2025-11002"
      ],
      "cvssScore": 7,
      "isUpdate": false
    }
  ]
}