{
  "pub_id": "pub-2026-01-09",
  "headline": "Critical 'Ni8mare' Flaw Hits n8n; Chinese Hackers Wielded VMware Zero-Day for a Year",
  "summary": "This cybersecurity brief for January 9, 2026, covers a critical unauthenticated RCE vulnerability (CVSS 10.0) in the n8n platform, revelations that a Chinese state-sponsored actor possessed a VMware ESXi zero-day exploit for over a year before its disclosure, and an FBI warning about North Korean 'quishing' campaigns. Other major events include data breaches affecting London councils and New Zealand's largest patient portal, new malware strains like Ripper Ransomware, and CISA adding actively exploited flaws in HPE and legacy PowerPoint to its KEV catalog.",
  "pub_date": "2026-01-09",
  "total_articles": 9,
  "articles": [
    {
      "id": "3ac6e874-37bc-42c8-8bdc-c6f75e1793f0",
      "slug": "cisa-updates-report-on-state-sponsored-brickstorm-backdoor",
      "headline": "State-Sponsored \"BRICKSTORM\" Backdoor Targets VMware and Windows in Critical Infrastructure",
      "title": "CISA and NSA Update Analysis of \"BRICKSTORM\" Backdoor Used by State-Sponsored Actors Against VMware and Windows Systems",
      "severity": "high",
      "excerpt": "CISA, the NSA, and the Canadian Centre for Cyber Security have released an updated report on BRICKSTORM, a sophisticated backdoor malware. The report links the malware to Chinese state-sponsored threat actors who are using it to compromise VMware vSphere and Windows environments, primarily within public sector and critical infrastructure organizations. BRICKSTORM is designed for long-term persistence, credential theft, and data exfiltration, posing a significant espionage threat to enterprise virtualization platforms.",
      "tags": [
        "BRICKSTORM",
        "APT",
        "State-Sponsored",
        "CISA",
        "NSA",
        "VMware",
        "vSphere",
        "Backdoor"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Industrial Control Systems"
      ],
      "createdAt": "2025-12-28T15:00:00.000Z",
      "updatedAt": "2026-01-09T00:00:00.000Z",
      "readingTime": 6,
      "isUpdate": true,
      "updateSummary": "New research reveals Chinese state-sponsored actors used 'ESXicape' zero-day vulnerabilities (CVE-2025-22224, -22225, -22226) for VM escape to ESXi hypervisor, developed a year before patches.",
      "updateContent": "New research from Huntress details how Chinese state-sponsored actors exploited three VMware ESXi zero-day vulnerabilities, collectively named 'ESXicape' (CVE-2025-22224, -22225, -22226), to achieve VM escape and execute code on the hypervisor. These exploits were developed as early as February 2024, a year before patches were released in March 2025. The attack chain observed in December 2025 involved initial access via a compromised SonicWall VPN, followed by privilege escalation and deployment of the ESXi exploit toolkit. This allows for persistent control over virtual infrastructure, total data access, and potential for widespread sabotage or ransomware. Over 30,000 internet-exposed ESXi instances may still be vulnerable, significantly increasing the threat level."
    },
    {
      "id": "169f440f-fc47-4710-929d-9729a0b58118",
      "slug": "new-zealand-managemyhealth-patient-portal-data-breach-exposes-126k",
      "headline": "NZ Patient Portal Breach Exposes Health Records of 126,000",
      "title": "New Zealand's ManageMyHealth Patient Portal Discloses Major Data Breach Affecting Up to 126,000 Users",
      "severity": "high",
      "excerpt": "ManageMyHealth, New Zealand's largest online patient portal, has confirmed a significant data breach discovered on December 30, 2025. The cyberattack compromised the 'My Health Documents' module, exposing the sensitive medical records of between 108,000 and 126,000 users. A threat actor using the alias 'Kazu' has claimed responsibility, alleging the exfiltration of 108 gigabytes of data and issuing a ransom demand. Compromised information includes clinical notes, lab results, and hospital discharge summaries. ManageMyHealth has engaged cybersecurity specialists, notified authorities including the Office of the Privacy Commissioner, and obtained a High Court injunction to prevent the stolen data's distribution.",
      "tags": [
        "patient data",
        "PHI",
        "cyberattack",
        "ransom demand",
        "New Zealand",
        "extortion"
      ],
      "categories": [
        "Data Breach",
        "Ransomware",
        "Threat Actor"
      ],
      "createdAt": "2026-01-02T15:00:00.000Z",
      "updatedAt": "2026-01-09T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "ManageMyHealth faces severe criticism for its handling of the data breach, with patients reporting slow, confusing notifications and access issues.",
      "updateContent": "ManageMyHealth (MMH) is facing significant backlash for its poor communication following the data breach. Affected patients have reported receiving slow, confusing, and contradictory notifications, with some even locked out of their accounts when attempting to secure them. This has led to widespread frustration and anger among the 125,000 affected individuals. The new report also reveals an anonymous tip about a potential exposure was sent to the Privacy Commissioner in June 2025, prior to the confirmed breach, suggesting earlier security concerns. MMH has declined to comment on the attacker's identity or ransom demands, further fueling public discontent and increasing the incident's overall negative impact."
    },
    {
      "id": "3962213f-3839-4392-bff7-025b869e10d4",
      "slug": "fbi-warns-of-north-korean-quishing-campaigns-using-malicious-qr-codes",
      "headline": "FBI: North Korea's Kimsuky APT Using 'Quishing' to Bypass MFA",
      "title": "FBI Warns of North Korean 'Quishing' Campaigns by Kimsuky (APT43) Targeting Government and Academia",
      "severity": "high",
      "excerpt": "The U.S. Federal Bureau of Investigation (FBI) has issued a formal advisory warning that the North Korean state-sponsored threat group Kimsuky (also known as APT43) is actively using malicious QR codes in spear-phishing emails. This tactic, dubbed 'quishing,' is designed to bypass traditional email security by tricking users into scanning the code with a personal mobile device. The goal is to harvest credentials and session tokens from high-value targets in government, academic institutions, and think tanks, effectively bypassing multi-factor authentication (MFA) through session hijacking.",
      "tags": [
        "quishing",
        "QR code",
        "phishing",
        "Kimsuky",
        "APT43",
        "FBI",
        "MFA bypass",
        "North Korea"
      ],
      "categories": [
        "Phishing",
        "Threat Actor",
        "Policy and Compliance"
      ],
      "createdAt": "2026-01-09T15:00:00.000Z",
      "updatedAt": "2026-01-09T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "9c7e12b2-11fd-4493-a6fc-d87f86d11634",
      "slug": "data-breach-at-london-councils-exposes-residents-personal-information",
      "headline": "London Councils Hit by Major Cyberattack, Resident Data Exposed",
      "title": "Data Breach at London Councils Exposes Sensitive Resident Information After Cyberattack on Shared IT System",
      "severity": "high",
      "excerpt": "A significant cyberattack targeting a shared IT system used by multiple London councils has resulted in a data breach exposing the sensitive personal information of thousands of residents. The incident, which affected Kensington and Chelsea Council among others, has caused widespread service disruptions and has triggered an investigation by the UK's National Cyber Security Centre (NCSC) and the Metropolitan Police. The attack highlights the systemic risks associated with interconnected IT platforms in the public sector, where a single point of failure can have cascading consequences.",
      "tags": [
        "data breach",
        "London",
        "local government",
        "public sector",
        "NCSC",
        "shared services",
        "systemic risk"
      ],
      "categories": [
        "Data Breach",
        "Cyberattack",
        "Regulatory"
      ],
      "createdAt": "2026-01-09T15:00:00.000Z",
      "updatedAt": "2026-01-09T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "96c8bf7a-63c1-4bba-9113-772a1154c1df",
      "slug": "trend-micro-apex-central-hit-by-critical-rce-flaw",
      "headline": "Critical 9.8 CVSS RCE Flaw Hits Trend Micro Apex Central",
      "title": "Trend Micro Patches Critical 9.8 CVSS Remote Code Execution Flaw (CVE-2025-69258) in Apex Central",
      "severity": "critical",
      "excerpt": "Trend Micro has released patches for multiple vulnerabilities in its on-premise Apex Central security management console, including a critical remote code execution (RCE) flaw, CVE-2025-69258, with a CVSS score of 9.8. The vulnerability allows an unauthenticated remote attacker to load a malicious DLL and execute code with SYSTEM-level privileges. The flaw resides in the 'MsgReceiver.exe' component listening on TCP port 20001. Two other high-severity denial-of-service flaws were also fixed. Customers are urged to update to Build 7190 or later.",
      "tags": [
        "Trend Micro",
        "Apex Central",
        "RCE",
        "vulnerability",
        "CVSS 9.8",
        "patch management"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2026-01-09T15:00:00.000Z",
      "updatedAt": "2026-01-09T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-69258",
        "CVE-2025-69259",
        "CVE-2025-69260"
      ],
      "cvssScore": 9.8,
      "isUpdate": false
    },
    {
      "id": "9d164bed-cdac-4003-999a-9355e1aeb8a1",
      "slug": "qilin-ransomware-gang-claims-attack-on-italian-manufacturer-cressi",
      "headline": "Qilin Ransomware Gang Claims Attack on Italian Manufacturer Cressi",
      "title": "Russia-Linked Qilin Ransomware Gang Alleges Cyberattack Against Italian Manufacturer Cressi",
      "severity": "high",
      "excerpt": "The prolific Russia-linked Qilin ransomware gang has claimed responsibility for a cyberattack on Cressi, a major Italian manufacturer of diving and water sports equipment. The claim was posted on the group's darknet leak site. As of January 9, 2026, the gang has not leaked any stolen data or set a public ransom deadline, which is a common extortion tactic. Cressi has not yet commented on the allegation. The Qilin group is one of the most active ransomware operations, known for targeting manufacturing and healthcare sectors and for its high-profile attacks in 2025.",
      "tags": [
        "Qilin",
        "ransomware",
        "Russia",
        "manufacturing",
        "data leak",
        "darknet"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2026-01-09T15:00:00.000Z",
      "updatedAt": "2026-01-09T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "667f77aa-a9ec-4b3d-bc83-a1a910ce267b",
      "slug": "cisa-publishes-six-new-advisories-for-industrial-control-systems",
      "headline": "CISA Issues Six New Advisories for Hitachi and Mitsubishi ICS Flaws",
      "title": "CISA Publishes Six New Advisories for Vulnerabilities in Hitachi Energy and Mitsubishi Electric Industrial Control Systems",
      "severity": "medium",
      "excerpt": "On January 8, 2026, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) released six new Industrial Control Systems (ICS) advisories. The alerts detail vulnerabilities discovered in products from Hitachi Energy and Mitsubishi Electric. These products, including the Hitachi Energy Asset Suite and Mitsubishi Electric's ICONICS Digital Solutions, are widely deployed across multiple critical infrastructure sectors, with a specific mention of the Energy sector. CISA is urging organizations using this equipment to review the advisories and remediate the flaws to prevent potential disruption of industrial processes.",
      "tags": [
        "ICS",
        "SCADA",
        "CISA",
        "Hitachi",
        "Mitsubishi",
        "OT",
        "critical infrastructure"
      ],
      "categories": [
        "Industrial Control Systems",
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2026-01-09T15:00:00.000Z",
      "updatedAt": "2026-01-09T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "e412959a-eba8-4afe-a839-c9f0a8e3535c",
      "slug": "cisco-patches-zero-day-info-disclosure-flaw-in-ise",
      "headline": "Cisco Patches Zero-Day Information Disclosure Flaw in ISE Platform",
      "title": "Cisco Patches High-Severity Zero-Day Information Disclosure Flaw (CVE-2026-20029) in ISE",
      "severity": "high",
      "excerpt": "Cisco has patched a high-severity zero-day vulnerability, CVE-2026-20029, in its Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC). The flaw could allow an authenticated, remote administrator to read arbitrary files from the underlying system. The vulnerability is due to improper parsing of XML in the web-based management interface. An attacker could exploit it by uploading a malicious file. Cisco has released software updates to address the issue and urges customers to apply them promptly to prevent sensitive data exposure.",
      "tags": [
        "Cisco",
        "ISE",
        "zero-day",
        "vulnerability",
        "information disclosure",
        "patch management"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Security Operations"
      ],
      "createdAt": "2026-01-09T15:00:00.000Z",
      "updatedAt": "2026-01-09T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2026-20029"
      ],
      "isUpdate": false
    },
    {
      "id": "3e63596f-8fae-48ad-a241-9b4fb43a5564",
      "slug": "cyberattacks-on-automotive-and-logistics-supply-chains-skyrocket",
      "headline": "Cyberattacks on Automotive and Logistics Supply Chains Skyrocket",
      "title": "Report: Cyberattacks on Automotive Supply Chain Soar by 722% in 2025",
      "severity": "high",
      "excerpt": "A new report from Everstream Analytics reveals a dramatic escalation in cyberattacks targeting global supply chains. In 2025, the automotive manufacturing industry experienced a staggering 722% increase in cyber incidents compared to the previous year. The logistics industry was also heavily impacted, with attacks growing by 61%. The report identifies this surge in cyber warfare as a primary factor set to disrupt trade and logistics in 2026, alongside hybrid warfare, aging infrastructure, and the weaponization of trade regulations. This transforms supply chain risk from a cost issue to a major security challenge.",
      "tags": [
        "supply chain",
        "automotive",
        "logistics",
        "cyberattack",
        "manufacturing",
        "risk management"
      ],
      "categories": [
        "Supply Chain Attack",
        "Cyberattack",
        "Industrial Control Systems"
      ],
      "createdAt": "2026-01-09T15:00:00.000Z",
      "updatedAt": "2026-01-09T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}