{
  "pub_id": "pub-2025-11-22",
  "headline": "Massive Supply Chain Attack Hits Salesforce Ecosystem; Critical Flaws in Oracle, Azure, and Grafana Emerge",
  "summary": "This cybersecurity brief for November 22, 2025, covers a series of high-impact events. A major supply chain attack attributed to 'Scattered Lapsus$ Hunters' compromised over 200 companies by abusing OAuth tokens in a Salesforce-integrated app. Concurrently, CISA issued warnings for a critical, actively exploited RCE in Oracle Identity Manager. Critical 10.0 CVSS vulnerabilities were also disclosed in Microsoft Azure Bastion and Grafana Enterprise. Other significant threats include a new Android trojan stealing encrypted messages, a sophisticated Chinese APT campaign targeting Russia, and a botnet using the Ethereum blockchain for C2.",
  "pub_date": "2025-11-22",
  "total_articles": 6,
  "articles": [
    {
      "id": "0fb3e40c-7182-4a00-b8ed-e3d27e1369d8",
      "slug": "cisa-warns-of-actively-exploited-oracle-identity-manager-rce-flaw-cve-2025-61757",
      "headline": "CISA KEV Alert: Actively Exploited Oracle RCE Flaw Allows Full System Takeover",
      "title": "CISA Adds Critical Oracle Identity Manager RCE Vulnerability (CVE-2025-61757) to KEV Catalog",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical remote code execution (RCE) vulnerability in Oracle Identity Manager, CVE-2025-61757, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, with a CVSS score of 9.8, allows an unauthenticated attacker to achieve RCE by chaining an authentication bypass with a code injection flaw in a Groovy script endpoint. Evidence of in-the-wild exploitation, including scans detected weeks before a patch was available, has prompted CISA to issue a patching deadline of December 12, 2025, for federal agencies.",
      "tags": [
        "CVE-2025-61757",
        "Oracle",
        "RCE",
        "Zero-Day",
        "CISA",
        "KEV",
        "Vulnerability",
        "Patch Management"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Threat Intelligence"
      ],
      "createdAt": "2025-11-22T15:00:00.000Z",
      "updatedAt": "2025-11-22T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-61757"
      ],
      "cvssScore": 9.8,
      "isUpdate": false
    },
    {
      "id": "f67f5cb8-edcf-45e3-a37e-405a9e4d0baa",
      "slug": "apt24-deploys-badaudio-malware-in-long-running-espionage-campaign-against-taiwan",
      "headline": "Chinese APT24 Group Uses 'BadAudio' Malware in Years-Long Espionage Campaign Targeting Taiwan",
      "title": "APT24 (Pitty Tiger) Deploys Custom 'BadAudio' Malware in Sophisticated Cyberespionage Campaign",
      "severity": "high",
      "excerpt": "The Chinese-nexus threat group APT24, also known as Pitty Tiger, is behind a nearly three-year cyberespionage campaign utilizing a new custom malware called 'BadAudio'. According to Google's Threat Intelligence Group, the campaign, active since November 2022, has targeted organizations primarily in Taiwan. The group has evolved its tactics from broad web compromises to sophisticated supply chain attacks and spear-phishing. BadAudio is a C++ downloader that uses DLL search-order hijacking and control flow flattening to evade detection before deploying second-stage payloads like Cobalt Strike.",
      "tags": [
        "APT24",
        "Pitty Tiger",
        "BadAudio",
        "Cyber Espionage",
        "Malware",
        "Supply Chain Attack",
        "Taiwan",
        "Cobalt Strike"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Supply Chain Attack"
      ],
      "createdAt": "2025-11-22T15:00:00.000Z",
      "updatedAt": "2025-11-22T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "846b98c8-715a-45bb-9efc-7d86f482eb26",
      "slug": "mortgage-vendor-situsamc-discloses-breach-affecting-major-wall-street-banks",
      "headline": "Major Wall Street Banks Exposed After Breach at Mortgage Vendor SitusAMC",
      "title": "Mortgage Tech Vendor SitusAMC Discloses Data Breach, Impacting Clients Like JPMorgan Chase and Citi",
      "severity": "high",
      "excerpt": "SitusAMC, a critical technology and services provider for the real estate finance industry, has disclosed a significant data breach discovered on November 12, 2025. The cyberattack compromised corporate information and, more critically, data belonging to its clients' customers, which could include sensitive personal information from mortgage applications. Major financial institutions, including JPMorgan Chase, Citigroup, and Morgan Stanley, have reportedly been notified of their potential exposure. The FBI is investigating the incident, which highlights the systemic risk posed by third-party vendors in the financial sector.",
      "tags": [
        "SitusAMC",
        "Data Breach",
        "Supply Chain Attack",
        "JPMorgan Chase",
        "Citigroup",
        "Morgan Stanley",
        "Financial Services",
        "FBI"
      ],
      "categories": [
        "Data Breach",
        "Supply Chain Attack",
        "Incident Response"
      ],
      "createdAt": "2025-11-22T15:00:00.000Z",
      "updatedAt": "2025-11-22T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "2abf3c99-d8f3-4267-a037-b4364539a558",
      "slug": "critical-cvss-10-vulnerability-in-grafana-enterprise-allows-admin-impersonation",
      "headline": "Grafana Enterprise Hit by Critical 10.0 CVSS Flaw Allowing Admin Impersonation",
      "title": "Grafana Patches Critical CVSS 10.0 Vulnerability (CVE-2025-41115) Enabling Admin Impersonation",
      "severity": "critical",
      "excerpt": "Grafana Labs has patched a critical vulnerability, CVE-2025-41115, in Grafana Enterprise that carries the maximum CVSS score of 10.0. The flaw resides in the SCIM provisioning feature and allows a malicious SCIM client to escalate privileges and impersonate any user, including the default administrator, by manipulating the 'externalId' attribute. The vulnerability affects Grafana Enterprise versions 12.0.0 through 12.2.1 and requires specific feature flags to be enabled. Grafana has released patches and confirmed its own cloud instances were not exploited.",
      "tags": [
        "CVE-2025-41115",
        "Grafana",
        "Vulnerability",
        "Privilege Escalation",
        "CVSS 10",
        "SCIM",
        "Patch Management"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cloud Security"
      ],
      "createdAt": "2025-11-22T15:00:00.000Z",
      "updatedAt": "2025-11-22T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-41115"
      ],
      "cvssScore": 10,
      "isUpdate": false
    },
    {
      "id": "b398b501-4129-4213-b913-3f1af3cee592",
      "slug": "crowdstrike-fires-employee-for-leaking-internal-data-to-hacking-group",
      "headline": "CrowdStrike Fires Insider for Leaking Screenshots to 'Scattered Lapsus$ Hunters' Hacking Group",
      "title": "CrowdStrike Confirms Termination of Employee for Leaking Internal Information to Cybercrime Group",
      "severity": "medium",
      "excerpt": "Cybersecurity giant CrowdStrike has confirmed it fired an employee last month for acting as a malicious insider. The employee leaked screenshots of internal systems, including an Okta dashboard, to the 'Scattered Lapsus$ Hunters' hacking group, who then posted them on Telegram. CrowdStrike stated that it detected and terminated the insider, that its corporate systems were not breached, and that no customer data was compromised. The hackers claimed to have offered the employee $25,000 for access, highlighting the persistent threat of malicious insiders even at top security firms.",
      "tags": [
        "Insider Threat",
        "CrowdStrike",
        "Scattered Lapsus$ Hunters",
        "Okta",
        "Data Leak",
        "Incident Response"
      ],
      "categories": [
        "Incident Response",
        "Threat Actor",
        "Security Operations"
      ],
      "createdAt": "2025-11-22T15:00:00.000Z",
      "updatedAt": "2025-11-22T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "e77b6746-4909-40b0-b35f-52701b3a164d",
      "slug": "critical-azure-bastion-flaw-cve-2025-49752-allows-complete-cloud-takeover",
      "headline": "Critical 10.0 CVSS Flaw in Azure Bastion Allows Full Cloud Takeover",
      "title": "Microsoft Patches Critical Authentication Bypass Vulnerability (CVE-2025-49752) in Azure Bastion",
      "severity": "critical",
      "excerpt": "Microsoft has patched a critical authentication bypass vulnerability, CVE-2025-49752, in its Azure Bastion service. The flaw, which scores a perfect 10.0 on the CVSS scale, could allow a remote, unauthenticated attacker to gain administrative control over all virtual machines connected via a vulnerable Bastion host. The vulnerability is a capture-replay flaw, where an attacker can intercept and reuse authentication tokens. All Azure Bastion deployments created before the patch on November 20, 2025, are considered vulnerable, and customers are urged to ensure their instances are updated.",
      "tags": [
        "CVE-2025-49752",
        "Azure",
        "Microsoft",
        "Azure Bastion",
        "Vulnerability",
        "Authentication Bypass",
        "CVSS 10",
        "Cloud Security"
      ],
      "categories": [
        "Vulnerability",
        "Cloud Security",
        "Patch Management"
      ],
      "createdAt": "2025-11-22T15:00:00.000Z",
      "updatedAt": "2025-11-22T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-49752"
      ],
      "cvssScore": 10,
      "isUpdate": false
    }
  ]
}