{
  "pub_id": "pub-2025-11-25",
  "headline": "Massive 'Sha1-Hulud' Supply Chain Attack Compromises 25,000+ GitHub Repos; CISA Warns of Multiple Actively Exploited Zero-Days",
  "summary": "This intelligence briefing for November 25, 2025, covers a massive software supply chain attack named 'Sha1-Hulud' that has compromised over 25,000 GitHub repositories via malicious npm packages. Additionally, CISA has issued directives for actively exploited zero-day vulnerabilities in Oracle Identity Manager, Google Chrome, and Fortinet's FortiWeb. Other major threats include the Akira ransomware group targeting M&A activities, a surge in Black Friday phishing scams, and a data breach at a major banking vendor, SitusAMC.",
  "pub_date": "2025-11-25",
  "total_articles": 2,
  "articles": [
    {
      "id": "815dbf5f-459d-4979-b189-ce8c9d974fb6",
      "slug": "cisa-mandates-7-day-patch-for-actively-exploited-fortinet-fortiweb-zero-day-cve-2025-58034",
      "headline": "URGENT: CISA Orders 7-Day Patch for Actively Exploited FortiWeb Zero-Day",
      "title": "Fortinet Discloses Critical FortiWeb Zero-Day (CVE-2025-58034) Under Active Attack; CISA Issues Emergency Directive",
      "severity": "critical",
      "excerpt": "Fortinet has disclosed a critical OS command injection zero-day vulnerability, CVE-2025-58034, in its FortiWeb Web Application Firewall (WAF) that is being actively exploited in the wild. The flaw allows an authenticated attacker to execute arbitrary commands on the underlying system. In response to observed attacks, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog and issued an emergency directive mandating federal agencies apply patches within an accelerated seven-day window, by November 25, 2025. Researchers have detected approximately 2,000 attacks leveraging the flaw and warn it could potentially be chained with a recently disclosed authentication bypass vulnerability (CVE-2025-64446) to achieve unauthenticated remote code execution.",
      "tags": [
        "Zero-Day",
        "WAF",
        "Command Injection",
        "CISA",
        "KEV",
        "Fortinet",
        "FortiWeb"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2025-11-20T15:00:00.000Z",
      "updatedAt": "2025-11-25T00:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-58034",
        "CVE-2025-64446"
      ],
      "isUpdate": true,
      "updateSummary": "Fortinet confirms CVE-2025-58034 (medium severity) chains with CVE-2025-64446 (path traversal) for unauthenticated RCE. Patched versions released.",
      "updateContent": "Fortinet has provided critical updates regarding the actively exploited FortiWeb zero-day, CVE-2025-58034. While rated medium severity (CVSS 6.7) in isolation, it can be chained with the previously disclosed path-traversal vulnerability, CVE-2025-64446, to achieve unauthenticated remote code execution. This chain allows attackers to bypass authentication, create an admin account, and then exploit CVE-2025-58034 for full system takeover. Fortinet has released specific patched versions, including 7.0.12, 7.2.12, 7.4.11, 7.6.6, and 8.0.2, urging immediate upgrades. Widespread scanning for CVE-2025-64446 has been detected, indicating active targeting. New detection methods include monitoring for unauthorized admin account creation and web server processes spawning shells."
    },
    {
      "id": "440d30a0-2641-4542-95e7-fdf83694a197",
      "slug": "akira-ransomware-exploits-unpatched-sonicwall-devices-during-ma",
      "headline": "Akira Ransomware Targets M&A Blind Spots, Breaching Firms via Inherited SonicWall Devices",
      "title": "Akira Ransomware Exploits M&A Security Gaps by Infiltrating Networks Through Unpatched SonicWall Appliances",
      "severity": "high",
      "excerpt": "The Akira ransomware group is exploiting security blind spots created during corporate mergers and acquisitions (M&A). According to research by ReliaQuest, Akira affiliates are gaining initial access to acquiring companies by compromising vulnerable SonicWall SSL VPN appliances inherited from smaller, acquired firms. Attackers leverage the fact that the acquiring organizations are often unaware of these unpatched, legacy devices on their new network. Once inside, they use zombie credentials and move laterally, with the time from lateral movement to ransomware deployment averaging less than one hour, highlighting a rapid and effective attack chain.",
      "tags": [
        "Akira",
        "ransomware",
        "M&A",
        "SonicWall",
        "supply chain",
        "vulnerability",
        "ReliaQuest"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2025-11-25T15:00:00.000Z",
      "updatedAt": "2025-11-25T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}