{
  "pub_id": "pub-2025-12-13",
  "headline": "React2Shell Ignites Global Exploitation Frenzy; Microsoft Patches Actively Exploited Zero-Day",
  "summary": "This cybersecurity brief for December 13, 2025, covers a critical period marked by widespread, active exploitation of the 'React2Shell' vulnerability (CVE-2025-55182) by both criminal and state-sponsored actors, prompting urgent CISA directives. Concurrently, Microsoft's December Patch Tuesday addressed 57 flaws, including an actively exploited Windows zero-day (CVE-2025-62221). Other major incidents include a new Chrome zero-day on macOS, an unpatched zero-day in the Gogs Git service, a major npm supply chain attack by the 'Shai-Hulud 2.0' worm, and new campaigns from the Makop ransomware group and the Hamas-linked WIRTE APT.",
  "pub_date": "2025-12-13",
  "total_articles": 5,
  "articles": [
    {
      "id": "8512f253-ec02-454b-b9f8-da7f04e1d66c",
      "slug": "google-patches-actively-exploited-chrome-zero-day-december-2025",
      "headline": "Google Patches Eighth Chrome Zero-Day of 2025 Under Active Attack",
      "title": "Google Issues Emergency Patch for Actively Exploited High-Severity Chrome Zero-Day Vulnerability",
      "severity": "critical",
      "excerpt": "Google has released an emergency, out-of-band security update for its Chrome browser, patching its eighth zero-day vulnerability of 2025. The high-severity flaw, tracked as issue 466192044, is confirmed to be actively exploited in the wild. To prevent further abuse, Google has withheld technical details but analysis suggests it may be a buffer overflow in the ANGLE graphics library. All 3.4 billion Chrome users are urged to update their browsers immediately to version 143.0.7499.109 or later.",
      "tags": [
        "Chrome",
        "Zero-Day",
        "Browser Security",
        "Emergency Patch",
        "ANGLE",
        "Google"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2025-12-12T15:00:00.000Z",
      "updatedAt": "2025-12-13T10:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "CISA adds Chrome zero-day CVE-2025-14174 to KEV catalog, confirming active exploitation on macOS. Update to 143.0.7499.110.",
      "updateContent": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has officially added the actively exploited Google Chrome zero-day to its Known Exploited Vulnerabilities (KEV) catalog, assigning it CVE-2025-14174. This high-severity flaw, an out-of-bounds memory access issue in ANGLE, is confirmed to specifically impact Chrome browsers on macOS. CISA's listing mandates U.S. federal agencies to patch immediately. All users, particularly those on macOS, are urged to update their Chrome browsers to version 143.0.7499.110 or later to mitigate the threat of remote code execution via malicious webpages. This update formalizes the critical nature and widespread threat of this vulnerability."
    },
    {
      "id": "6b4479cd-f01b-45d5-905b-75c8228611d2",
      "slug": "nanoremote-backdoor-uses-google-drive-api-for-stealthy-c2",
      "headline": "Stealthy NANOREMOTE Backdoor Abuses Google Drive API for C2 Communications",
      "title": "New Windows Backdoor 'NANOREMOTE' Leverages Google Drive API for Covert Command and Control",
      "severity": "high",
      "excerpt": "A new and fully-featured Windows backdoor, dubbed NANOREMOTE, has been discovered by Elastic Security Labs. Written in C++, the malware distinguishes itself by using the Google Drive API for all command-and-control (C2) communications, allowing it to blend in with legitimate cloud traffic and evade traditional network security. The malware, which shares characteristics with the FINALDRAFT implant, is capable of reconnaissance, file transfer, and command execution. This tactic poses a significant challenge for organizations, especially those using Google Workspace, as it makes detecting malicious activity within sanctioned cloud services difficult.",
      "tags": [
        "NANOREMOTE",
        "Backdoor",
        "Malware",
        "Google Drive",
        "C2",
        "Cloud Security",
        "FINALDRAFT",
        "Windows"
      ],
      "categories": [
        "Malware",
        "Threat Intelligence",
        "Cloud Security"
      ],
      "createdAt": "2025-12-13T15:00:00.000Z",
      "updatedAt": "2025-12-13T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "e594597e-7354-4656-95ad-5d5c21016a84",
      "slug": "openai-details-strategy-for-managing-advanced-ai-cybersecurity-risks",
      "headline": "OpenAI Unveils Strategy to Manage 'High' Risk AI Cybersecurity Threats",
      "title": "OpenAI Outlines Plan to Mitigate Cybersecurity Risks from Advanced AI Models",
      "severity": "informational",
      "excerpt": "OpenAI has announced its strategy for managing the significant cybersecurity risks posed by its increasingly powerful AI models. The company will now treat all future models as potentially 'High' risk under its Preparedness Framework, capable of automating vulnerability discovery and exploitation. Key components of the plan include forming a 'Frontier Risk Council' of external experts, creating a tiered, trusted access program for cyber defense tools, and collaborating with industry partners. The move reflects growing concerns over the potential weaponization of AI for malicious cyber operations.",
      "tags": [
        "AI",
        "Artificial Intelligence",
        "OpenAI",
        "Cybersecurity Policy",
        "Risk Management",
        "AI Safety"
      ],
      "categories": [
        "Policy and Compliance",
        "Threat Intelligence"
      ],
      "createdAt": "2025-12-13T15:00:00.000Z",
      "updatedAt": "2025-12-13T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    },
    {
      "id": "296e789b-fa5c-4b80-a283-a3e9bfebf375",
      "slug": "cisa-updates-cybersecurity-performance-goals-for-critical-infrastructure",
      "headline": "CISA Updates Cybersecurity Performance Goals for Critical Infrastructure",
      "title": "CISA Releases Updated Cybersecurity Performance Goals (CPGs) for Critical Infrastructure",
      "severity": "informational",
      "excerpt": "On December 11, CISA released an updated version of its voluntary Cybersecurity Performance Goals (CPGs), designed to help critical infrastructure operators bolster their defenses. The new version aligns with the latest NIST standards and places a stronger emphasis on governance, accountability, and risk management. The CPGs provide a baseline of measurable cybersecurity actions that organizations, including those in the healthcare sector, can take to protect against common and impactful threats, promoting a more resilient and proactive security posture.",
      "tags": [
        "CISA",
        "CPG",
        "Cybersecurity Performance Goals",
        "Critical Infrastructure",
        "NIST",
        "Governance",
        "Policy"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory"
      ],
      "createdAt": "2025-12-13T15:00:00.000Z",
      "updatedAt": "2025-12-13T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    },
    {
      "id": "6dbe58b4-0fc0-4ebb-b318-a1f62d234443",
      "slug": "makop-ransomware-campaign-evolves-with-guloader-and-new-exploits",
      "headline": "Makop Ransomware Evolves, Using GuLoader and New Exploits in Attacks on India",
      "title": "Makop Ransomware Campaign Leverages GuLoader, AgentTesla, and Privilege Escalation Exploits",
      "severity": "high",
      "excerpt": "A new campaign by the Makop ransomware group is primarily targeting enterprises in India, with additional victims in Brazil and Germany. The attackers continue to use brute-force attacks against exposed RDP services for initial access. Once inside, they now use the GuLoader downloader to deliver secondary payloads like the AgentTesla and FormBook infostealers. For privilege escalation, the group is exploiting vulnerabilities like CVE-2025-7771 in the ThrottleStop driver to gain kernel-level access and disable security products before deploying the final ransomware payload.",
      "tags": [
        "Makop",
        "Ransomware",
        "GuLoader",
        "Phobos",
        "RDP",
        "BYOVD",
        "CVE-2025-7771",
        "India"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Malware"
      ],
      "createdAt": "2025-12-13T15:00:00.000Z",
      "updatedAt": "2025-12-13T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-7771"
      ],
      "isUpdate": false
    }
  ]
}