{
  "pub_id": "pub-2026-02-07",
  "headline": "CISA Warns of Actively Exploited SmarterMail RCE; Asian APT Hits 70 Orgs; 'Shai-Hulud' Worm Automates Supply Chain Attacks",
  "summary": "This cybersecurity brief for February 7, 2026, covers multiple critical threats. CISA has added a SmarterMail RCE vulnerability (CVE-2026-24423) to its KEV catalog due to active exploitation in ransomware attacks. A massive year-long cyber-espionage campaign by an Asian APT group, TGR-STA-1030, has compromised at least 70 government and critical infrastructure organizations across 37 nations. Additionally, a new self-propagating worm, 'Shai-Hulud,' is automating software supply chain attacks by stealing developer credentials to infect npm packages. Other major developments include CISA's new directive to remove unsupported edge devices from federal networks and the discovery of new malware strains like Odyssey Stealer, Milkyway Ransomware, and the covert Pulsar RAT.",
  "pub_date": "2026-02-07",
  "total_articles": 7,
  "articles": [
    {
      "id": "09839cb6-cf6c-46e2-9600-ef316190b755",
      "slug": "cisa-warns-of-actively-exploited-smartermail-rce-flaw-in-ransomware-attacks",
      "headline": "CISA: Critical SmarterMail RCE Flaw Actively Exploited in Ransomware Attacks",
      "title": "CISA Adds Critical SmarterMail RCE Vulnerability (CVE-2026-24423) to KEV Catalog Amid Ransomware Exploitation",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical remote code execution (RCE) vulnerability in SmarterTools' SmarterMail, CVE-2026-24423, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, which has a CVSS score of 9.3, allows an unauthenticated attacker to take full control of a mail server by abusing an API method with a missing authentication check. CISA confirms the vulnerability is being actively used in ransomware campaigns and has mandated that federal agencies patch by February 26, 2026. All organizations using the affected email server software are strongly urged to update to build 9511 or later immediately.",
      "tags": [
        "CVE-2026-24423",
        "RCE",
        "KEV",
        "SmarterMail",
        "Ransomware",
        "CISA"
      ],
      "categories": [
        "Vulnerability",
        "Ransomware",
        "Patch Management"
      ],
      "createdAt": "2026-02-06T15:00:00.000Z",
      "updatedAt": "2026-02-07T00:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-24423"
      ],
      "cvssScore": 9.3,
      "isUpdate": true,
      "updateSummary": "New technical details for SmarterMail RCE (CVE-2026-24423) include precise API endpoint, related CVEs, and D3FEND techniques for enhanced detection and mitigation.",
      "updateContent": "The vulnerable API endpoint for CVE-2026-24423 is more precisely identified as '/api/v1/settings/sysadmin/connect-to-hub', and the vulnerability is classified as CWE-306. This is the third SmarterMail flaw in KEV, following CVE-2025-52691 and CVE-2026-23760. New detection guidance includes monitoring 'MailService.exe' and leveraging D3FEND techniques like Process Analysis (D3-PA) and Network Traffic Analysis (D3-NTA). Mitigation now explicitly advises assuming compromise for unpatched systems and applying Inbound Traffic Filtering (D3-ITF) and Software Update (D3-SU)."
    },
    {
      "id": "b20c4a99-e3d3-4e5c-a3bd-f3909e6c96a9",
      "slug": "transparent-tribe-apt-pivots-to-target-indias-startup-ecosystem",
      "headline": "Transparent Tribe (APT36) Shifts Focus, Targeting Indian Startups with Crimson RAT",
      "title": "Pakistan-linked APT Transparent Tribe Pivots from Government to Target India's Startup Ecosystem",
      "severity": "high",
      "excerpt": "The Pakistan-aligned APT group Transparent Tribe (also known as APT36) has strategically shifted its targeting from Indian government and military entities to the country's growing startup sector. A new campaign, identified by researchers, uses the group's signature Crimson RAT malware delivered via malicious ISO files in phishing emails. The lures are themed around startups, with some attacks leveraging scraped personal information of real founders to appear more legitimate. The focus on startups in the cybersecurity and intelligence fields suggests the group aims to steal intellectual property and potentially use compromised companies as a supply chain vector to attack their government clients.",
      "tags": [
        "APT",
        "Crimson RAT",
        "ISO file",
        "Phishing",
        "Startup",
        "India",
        "Pakistan"
      ],
      "categories": [
        "Threat Actor",
        "Phishing",
        "Cyberattack"
      ],
      "createdAt": "2026-02-07T15:00:00.000Z",
      "updatedAt": "2026-02-07T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "0beff8b9-6545-4536-b44e-8901eb35bf19",
      "slug": "bulletproof-hosters-abuse-legitimate-isp-software-for-cybercrime-ops",
      "headline": "Ransomware Gangs Like LockBit and BlackCat Use Legitimate ISP Software for Anonymous Server Provisioning",
      "title": "Sophos Uncovers How Bulletproof Hosters Exploit ISPsystem's VMmanager to Power Ransomware Infrastructure",
      "severity": "high",
      "excerpt": "Researchers at Sophos have discovered how bulletproof hosting (BPH) providers are abusing legitimate server management software from ISPsystem to anonymously provision virtual machines for cybercriminals. The software, VMmanager, leaves a default hostname fingerprint (`WIN-J9D866ESIJ2`) that allowed researchers to link thousands of malicious servers to BPH providers like Stark Industries Solutions and MasterRDP. This infrastructure is actively being used to support operations for top-tier ransomware groups, including LockBit, BlackCat (ALPHV), and Conti, highlighting a critical link between legitimate tools and the cybercrime underworld.",
      "tags": [
        "Bulletproof Hosting",
        "BPH",
        "RDP",
        "Infrastructure",
        "Cybercrime",
        "RaaS"
      ],
      "categories": [
        "Threat Intelligence",
        "Ransomware",
        "Cyberattack"
      ],
      "createdAt": "2026-02-07T15:00:00.000Z",
      "updatedAt": "2026-02-07T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "947511b4-1159-415d-b20a-856626635dbe",
      "slug": "new-odyssey-stealer-malware-campaign-rapidly-infects-macos-users",
      "headline": "Aggressive Odyssey Stealer Malware Campaign Targets macOS Users Globally",
      "title": "New Wave of Odyssey Stealer Malware Expands Rapidly, Targeting macOS Users Worldwide with Evasive Variants",
      "severity": "high",
      "excerpt": "A new and aggressive campaign featuring the Odyssey Stealer malware is actively targeting Apple macOS users across the globe. Initially focused on the US and Europe, the attack's reach expanded within 24 hours to South America, Africa, and Asia. Odyssey Stealer is an info-stealer designed to harvest browser credentials, crypto wallets, and system data. This latest variant uses builders to automatically generate unique, obfuscated samples, making it difficult for signature-based antivirus to detect. The malware spreads via social engineering, using fake or cracked software downloads and phishing lures to trick users into installing it.",
      "tags": [
        "macOS",
        "InfoStealer",
        "Credential Theft",
        "Cryptocurrency",
        "Polymorphic Malware"
      ],
      "categories": [
        "Malware",
        "Phishing",
        "Mobile Security"
      ],
      "createdAt": "2026-02-07T15:00:00.000Z",
      "updatedAt": "2026-02-07T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "2394d2f3-4d91-4c7b-be36-307d841078bf",
      "slug": "threat-actors-deploy-rmm-tools-using-windows-screensaver-files",
      "headline": "Attackers Abuse Windows Screensaver (.scr) Files to Drop RMM Tools for Persistent Access",
      "title": "Novel Attack Vector: Threat Actors Use Malicious Windows Screensaver Files to Deploy Remote Management Tools",
      "severity": "medium",
      "excerpt": "A novel attack technique has been observed where threat actors are abusing Windows screensaver (.scr) files as droppers for legitimate remote monitoring and management (RMM) tools. By tricking users into executing a malicious screensaver file, attackers can bypass security controls that might block direct RMM installation. Because .scr files are executables, they can be weaponized to install the RMM software, providing the attacker with persistent, stealthy remote access to the compromised machine for data theft, surveillance, or lateral movement. This method highlights the ongoing trend of attackers using living-off-the-land techniques.",
      "tags": [
        "RMM",
        "Living off the Land",
        "LoTL",
        "Screensaver",
        "Dropper",
        "Windows"
      ],
      "categories": [
        "Malware",
        "Phishing",
        "Security Operations"
      ],
      "createdAt": "2026-02-07T15:00:00.000Z",
      "updatedAt": "2026-02-07T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "5e693b2b-0526-4d16-a19f-a38ddda28a1c",
      "slug": "telegram-phishing-campaign-re-emerges-abusing-authorization-prompts",
      "headline": "Evolving Telegram Phishing Campaign Tricks Users into Approving Account Takeover",
      "title": "Re-Emerging Telegram Phishing Campaign Abuses Authorization Prompts for Session Hijacking",
      "severity": "medium",
      "excerpt": "A sophisticated phishing campaign targeting Telegram users has re-emerged, using the platform's own features to hijack accounts. As reported by CYFIRMA, the attack tricks users with fake security alerts, directing them to a malicious site or bot that mimics an official Telegram service. The core of the attack is manipulating the user into approving a legitimate-looking authorization prompt for a 'new device' within their own Telegram app. Approving this prompt grants the attacker's device full session access, enabling them to take over the account, read private chats, and exfiltrate data. The campaign highlights the effectiveness of social engineering attacks that exploit user trust in a platform's native functions.",
      "tags": [
        "Telegram",
        "Phishing",
        "Social Engineering",
        "Account Takeover",
        "Session Hijacking",
        "2FA"
      ],
      "categories": [
        "Phishing",
        "Mobile Security"
      ],
      "createdAt": "2026-02-07T15:00:00.000Z",
      "updatedAt": "2026-02-07T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "abf447ec-f8c0-41c4-892c-a7bfea764bdb",
      "slug": "ransomware-attacks-on-education-sector-slowed-in-2025-says-report",
      "headline": "Ransomware Attacks on Education Sector Slowed in 2025, But U.S. Remains Top Target",
      "title": "Comparitech Report: Ransomware Attacks on Education Sector See Slower Growth in 2025",
      "severity": "informational",
      "excerpt": "A 2025 report from Comparitech indicates a slowdown in the growth of ransomware attacks against the global education sector. There were 251 attacks recorded worldwide, a slight 2% increase from the previous year. These incidents resulted in at least 3.96 million breached records. The United States was the most affected country with 130 attacks, though this marked a 9% decrease for the nation year-over-year. High-profile incidents included demands of $400,000 against school districts by the Medusa ransomware gang, highlighting the continued financial and operational strain these attacks place on educational institutions.",
      "tags": [
        "Education",
        "K-12",
        "University",
        "Data Breach",
        "Statistics"
      ],
      "categories": [
        "Ransomware",
        "Threat Intelligence",
        "Data Breach"
      ],
      "createdAt": "2026-02-07T15:00:00.000Z",
      "updatedAt": "2026-02-07T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}