{
  "pub_id": "pub-2025-10-22",
  "headline": "Ransomware Surges, JLR Hack Costs UK £1.9B, and 'GlassWorm' Hits Developers in Widespread Attacks",
  "summary": "This cybersecurity advisory for October 21-22, 2025, covers a dramatic 34% surge in ransomware attacks against global critical infrastructure, with the U.S. being the top target. A separate analysis reveals the staggering economic fallout of a cyberattack on Jaguar Land Rover, costing the UK economy an estimated £1.9 billion. A sophisticated new worm, 'GlassWorm', is spreading through the VS Code ecosystem using invisible code to infect developers. Additionally, critical vulnerabilities have been disclosed in the Netty Java library and Oracle's E-Business Suite, while the UK government issues an urgent call for businesses to bolster defenses.",
  "pub_date": "2025-10-22",
  "total_articles": 4,
  "articles": [
    {
      "id": "c2523115-4b81-495d-af64-b12331079d23",
      "slug": "critical-zero-day-in-netty-library-allows-email-auth-bypass",
      "headline": "Critical Netty Zero-Day Bypasses All Major Email Authentication",
      "title": "CVE-2025-59419: Critical SMTP Injection Flaw in Netty Library Allows Full Bypass of SPF, DKIM, and DMARC",
      "severity": "critical",
      "excerpt": "A critical zero-day vulnerability, CVE-2025-59419, has been discovered in the widely used Netty Java library, affecting countless applications that handle email. The flaw allows an unauthenticated attacker to perform SMTP injection by embedding carriage return and line feed characters into email commands. This enables them to bypass standard email authentication defenses like SPF, DKIM, and DMARC, making it possible to send highly convincing spoofed emails that appear to originate from trusted domains. A patch is available and should be applied immediately.",
      "tags": [
        "CVE-2025-59419",
        "Netty",
        "Java",
        "zero-day",
        "vulnerability",
        "email security",
        "SMTP injection",
        "phishing"
      ],
      "categories": [
        "Vulnerability",
        "Phishing",
        "Patch Management"
      ],
      "createdAt": "2025-10-22T15:00:00.000Z",
      "updatedAt": "2025-10-22T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-59419"
      ],
      "isUpdate": false
    },
    {
      "id": "ced22459-5550-4ad9-bb0d-683544c191e7",
      "slug": "iran-linked-muddywater-apt-targets-governments-with-phoenix-backdoor",
      "headline": "Iran's MuddyWater APT Targets 100+ Governments with Phoenix Backdoor",
      "title": "MuddyWater Cyber-Espionage Campaign Uses Compromised Mailbox and Macros to Deploy Phoenix v4 Backdoor",
      "severity": "high",
      "excerpt": "The Iranian state-sponsored threat group MuddyWater is conducting a large-scale cyber-espionage campaign targeting over 100 government entities, primarily in the Middle East and North Africa (MENA). According to Group-IB, the attackers are using phishing emails sent from a compromised mailbox, leveraging the NordVPN service for anonymity. The emails contain malicious Word documents that use macros to deploy version 4 of the 'Phoenix' backdoor, a payload designed for foreign intelligence gathering. The campaign highlights the group's return to classic macro-based attack vectors.",
      "tags": [
        "MuddyWater",
        "APT",
        "Iran",
        "Phoenix",
        "cyber-espionage",
        "phishing",
        "macros",
        "MENA"
      ],
      "categories": [
        "Threat Actor",
        "Cyberattack",
        "Phishing"
      ],
      "createdAt": "2025-10-22T15:00:00.000Z",
      "updatedAt": "2025-10-22T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "e0504a65-01e2-4deb-beac-941a073a0321",
      "slug": "oracle-e-business-suite-hit-by-critical-marketing-module-flaws",
      "headline": "Patch Now: Critical RCE Flaws in Oracle E-Business Suite Marketing Module",
      "title": "Oracle Patches Two Critical 9.8 CVSS RCE Flaws (CVE-2025-53072, CVE-2025-62481) in E-Business Suite",
      "severity": "critical",
      "excerpt": "Oracle has issued urgent patches for two critical, unauthenticated remote code execution (RCE) vulnerabilities in its E-Business Suite. The flaws, CVE-2025-53072 and CVE-2025-62481, both carry a CVSS score of 9.8 and affect the Oracle Marketing module. An attacker with network access can exploit these vulnerabilities via a simple HTTP request, without any user interaction, to achieve a full takeover of the marketing component. Oracle urges customers using affected versions (12.2.3 through 12.2.14) to apply the October 2025 Critical Patch Update immediately.",
      "tags": [
        "CVE-2025-53072",
        "CVE-2025-62481",
        "Oracle",
        "E-Business Suite",
        "RCE",
        "vulnerability",
        "patch management"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Data Breach"
      ],
      "createdAt": "2025-10-22T15:00:00.000Z",
      "updatedAt": "2025-10-22T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-53072",
        "CVE-2025-62481"
      ],
      "cvssScore": 9.8,
      "isUpdate": false
    },
    {
      "id": "f1c82939-249a-460a-a0a3-ac64a1ff4eb3",
      "slug": "pwn2own-ireland-day-1-hackers-earn-522k-for-34-zero-days",
      "headline": "Pwn2Own Day 1: Hackers Net $522K for 34 Zero-Days in SOHO Devices",
      "title": "Pwn2Own Ireland 2025 Day 1 Sees Researchers Earn $522,500 for 34 Zero-Days Across Printers, NAS, and Routers",
      "severity": "high",
      "excerpt": "The first day of Trend Micro's Pwn2Own Ireland 2025 competition was a resounding success for security researchers, who earned a total of $522,500 for demonstrating 34 unique zero-day vulnerabilities. In a stunning display, every single one of the 17 scheduled attempts against popular SOHO devices—including printers, NAS devices, and smart home products from brands like QNAP, Synology, Canon, and HP—was successful. The highlight was a complex 'SOHO Smashup' that chained eight bugs to compromise a router and a NAS device.",
      "tags": [
        "Pwn2Own",
        "zero-day",
        "vulnerability",
        "hacking",
        "IoT",
        "SOHO",
        "ZDI"
      ],
      "categories": [
        "Vulnerability",
        "IoT Security",
        "Threat Intelligence"
      ],
      "createdAt": "2025-10-22T15:00:00.000Z",
      "updatedAt": "2025-10-22T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}