{
  "pub_id": "pub-2025-12-24",
  "headline": "Critical Zero-Days in Cisco, React, and Android Under Active Attack; WatchGuard & Fortinet Race to Patch Exploited Flaws",
  "summary": "This cybersecurity brief for December 24, 2025, covers a surge of actively exploited critical vulnerabilities. Chinese state-sponsored actors are leveraging a CVSS 10.0 zero-day in Cisco email gateways, while another CVSS 10.0 flaw, React2Shell, is being used by nation-states against SaaS and FinTech firms. CISA has issued urgent patch deadlines for these, as well as for exploited flaws in WatchGuard firewalls, Fortinet devices, and the Android OS. Major data breaches were also disclosed, with Nissan confirming a supply chain attack via Red Hat affecting 21,000 customers, and the University of Sydney reporting a breach impacting 27,000 individuals due to a DevSecOps failure.",
  "pub_date": "2025-12-24",
  "total_articles": 3,
  "articles": [
    {
      "id": "b39aa585-74eb-4582-b7db-484c6bb8f937",
      "slug": "cisa-adds-actively-exploited-fortinet-sso-vulnerability-to-kev-catalog",
      "headline": "CISA Adds Actively Exploited Fortinet SSO Flaw to KEV Catalog, Urges Immediate Patching",
      "title": "CISA Warns of Active Exploitation of Critical Fortinet SSO Bypass Vulnerability (CVE-2025-59718)",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical Fortinet vulnerability, CVE-2025-59718, to its Known Exploited Vulnerabilities (KEV) catalog, indicating active attacks in the wild. The flaw, rated 9.1 CVSS, allows an unauthenticated attacker to bypass FortiCloud single sign-on (SSO) authentication on multiple products, including FortiOS and FortiProxy, by sending a crafted SAML message. Security firm Arctic Wolf observed attackers exploiting the flaw within days of its disclosure to export device configurations and harvest credentials. CISA has mandated that federal agencies patch by December 23, 2025, and strongly advises all organizations to apply updates or disable the feature immediately.",
      "tags": [
        "CISA",
        "KEV",
        "Fortinet",
        "CVE-2025-59718",
        "SSO",
        "Authentication Bypass",
        "FortiOS",
        "Vulnerability",
        "Patch Management"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2025-12-17T15:00:00.000Z",
      "updatedAt": "2025-12-24T12:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-59718",
        "CVE-2025-59719"
      ],
      "cvssScore": 9.1,
      "isUpdate": true,
      "updateSummary": "New technical analysis, MITRE ATT&CK mappings, and detailed cyber observables for detection of CVE-2025-59718 provided, following the federal agency patch deadline.",
      "updateContent": "The federal agency patch deadline of December 23, 2025, for CVE-2025-59718 has now passed. This update provides enhanced technical analysis, including specific MITRE ATT&CK TTPs such as Defense Evasion (T1553.002), Initial Access (T1190), and Privilege Escalation (T1068). Detailed cyber observables for detection are outlined, focusing on anomalous authentication events, network traffic patterns, and firmware integrity checks. Mitigation advice is expanded to include restricting management interface access and continuous configuration hardening, reinforcing the critical need for immediate patching and robust security practices."
    },
    {
      "id": "12ad4682-4e34-4492-8ed4-ac96ab9fac75",
      "slug": "multiple-vulnerabilities-disclosed-in-thegem-wordpress-theme-plugin",
      "headline": "High-Severity Flaws in 'TheGem' WordPress Plugin Expose Sites to RFI and XSS Attacks",
      "title": "High-Severity Flaws in 'TheGem' WordPress Plugin Expose Sites to RFI and XSS Attacks",
      "severity": "informational",
      "excerpt": "Security researchers have disclosed two vulnerabilities in the 'TheGem Theme Elements' plugin for WordPress, affecting versions up to 5.10.5.1. The more severe flaw, CVE-2025-68560, is a high-risk PHP Remote File Inclusion (RFI) vulnerability with a CVSS score of 7.5, which could allow an attacker to execute arbitrary code and achieve a full site compromise. The second flaw, CVE-2025-68559, is a medium-severity Cross-Site Scripting (XSS) vulnerability (CVSS 6.5) that allows for the injection of malicious scripts. Administrators of websites using this popular plugin are urged to update immediately to a patched version to mitigate the risk of attack.",
      "tags": [],
      "categories": [],
      "createdAt": "2025-12-24T15:00:00.000Z",
      "updatedAt": "2025-12-24T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "9f91a905-7299-4e10-9930-948b623129af",
      "slug": "cis-detects-malicious-crystal-pdf-converter-targeting-sltt-networks",
      "headline": "Warning Issued for 'Crystal PDF Converter' Malware Targeting U.S. Government Networks",
      "title": "Warning Issued for 'Crystal PDF Converter' Malware Targeting U.S. Government Networks",
      "severity": "informational",
      "excerpt": "The Center for Internet Security (CIS) has issued an advisory about a malicious software campaign disguised as a legitimate tool named 'Crystal PDF Converter.' Activity associated with this malware has been detected on the networks of U.S. State, Local, Tribal, and Territorial (SLTT) government entities since October 2025. The campaign uses social engineering to trick employees into installing the malicious payload. The CIS advisory urges IT and security professionals in SLTT organizations to be vigilant, as these often under-resourced entities manage sensitive citizen data and are attractive targets for cybercriminals.",
      "tags": [],
      "categories": [],
      "createdAt": "2025-12-24T15:00:00.000Z",
      "updatedAt": "2025-12-24T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}