{
  "pub_id": "pub-2025-11-13",
  "headline": "Microsoft Patches Actively Exploited Windows Zero-Day as Global Law Enforcement Dismantles Major Cybercrime Rings",
  "summary": "In a critical 24-hour period ending November 13, 2025, the cybersecurity landscape was dominated by Microsoft's emergency patch for an actively exploited Windows Kernel zero-day (CVE-2025-62215) and a major international law enforcement action, 'Operation Endgame,' which dismantled the infrastructure of several malware-as-a-service operations. Other significant events include the discovery of an APT exploiting Cisco and Citrix zero-days, the introduction of a sweeping new cyber resilience bill in the UK, and CISA's addition of newly exploited vulnerabilities to its KEV catalog.",
  "pub_date": "2025-11-13",
  "total_articles": 6,
  "articles": [
    {
      "id": "38c34b9f-0a4c-4a5e-8fcf-9e6a873aba76",
      "slug": "operation-endgame-dismantles-rhadamanthys-venomrat-cybercrime-infrastructure",
      "headline": "GAME OVER: 'Operation Endgame' Dismantles Global Cybercrime Services",
      "title": "International Law Enforcement Takedown 'Operation Endgame' Neutralizes Rhadamanthys Infostealer, VenomRAT, and Elysium Botnet",
      "severity": "high",
      "excerpt": "In a massive international crackdown dubbed 'Operation Endgame,' law enforcement agencies from 11 countries, coordinated by Europol, have dismantled the infrastructure of three major cybercrime-as-a-service platforms: the Rhadamanthys information stealer, the VenomRAT remote access trojan, and the Elysium botnet. The operation resulted in the seizure of over 1,025 servers, the takedown of 20 domains, and the arrest of the main suspect behind VenomRAT. The targeted malware was responsible for infecting hundreds of thousands of computers worldwide, stealing vast amounts of data, including millions in cryptocurrency.",
      "tags": [
        "Operation Endgame",
        "Rhadamanthys",
        "VenomRAT",
        "Europol",
        "Cybercrime",
        "Takedown",
        "Infostealer",
        "RAT"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Incident Response"
      ],
      "createdAt": "2025-11-13T15:00:00.000Z",
      "updatedAt": "2025-11-13T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "61783012-c29c-4ae0-8237-c8fad1192a57",
      "slug": "synnovis-confirms-patient-data-stolen-in-qilin-ransomware-attack",
      "headline": "Synnovis Confirms Patient Data Stolen in Qilin Ransomware Attack on London Hospitals",
      "title": "Synnovis Confirms Theft of Patient Data Following Devastating Qilin Ransomware Attack in June 2024",
      "severity": "high",
      "excerpt": "Pathology service provider Synnovis has officially confirmed that patient personal data, including names, NHS numbers, and dates of birth, was stolen during the June 2024 ransomware attack attributed to the Qilin gang. The attack caused widespread disruption to London hospitals, leading to the cancellation of over 1,100 procedures. After a lengthy forensic investigation, Synnovis acknowledged the data breach, which followed the attackers leaking approximately 400GB of data. Affected NHS trusts are now beginning the process of notifying individual patients whose information was compromised.",
      "tags": [
        "Qilin",
        "Ransomware",
        "Data Breach",
        "Healthcare",
        "Synnovis",
        "NHS",
        "Double Extortion"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Cyberattack"
      ],
      "createdAt": "2025-11-13T15:00:00.000Z",
      "updatedAt": "2025-11-13T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "2370aaad-ab80-401b-8a5a-fe72d747cee1",
      "slug": "retail-sector-faces-surge-in-ai-driven-cyber-threats-report",
      "headline": "Retailers Unprepared for AI-Powered Cyberattack Tsunami, Report Warns",
      "title": "New LevelBlue Report Finds Retail Sector Facing Surge in AI-Driven Threats Amidst Critical Preparedness Gap",
      "severity": "medium",
      "excerpt": "A new report from managed security provider LevelBlue reveals a troubling state of cybersecurity in the retail sector. The study found that 44% of retailers have experienced a significant increase in cyberattacks, with many feeling unprepared for the next wave of AI-powered threats. Despite 45% of executives expecting AI-driven attacks, only 25% believe their organization is ready to defend against them. The report also highlights major weaknesses in supply chain security, with nearly half of retailers admitting to having poor visibility into their suppliers' security practices, creating significant risk across the industry.",
      "tags": [
        "Retail",
        "AI",
        "Artificial Intelligence",
        "Deepfake",
        "Supply Chain",
        "Threat Intelligence",
        "LevelBlue"
      ],
      "categories": [
        "Threat Intelligence",
        "Phishing",
        "Supply Chain Attack"
      ],
      "createdAt": "2025-11-13T15:00:00.000Z",
      "updatedAt": "2025-11-13T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "bdf311cf-d6a4-4d1a-9b5b-0c46452c80d0",
      "slug": "dell-patches-critical-privilege-escalation-vulnerability-in-data-lakehouse",
      "headline": "Dell Patches Critical 9.1 CVSS Flaw in Data Lakehouse Platform",
      "title": "Dell Issues Patch for Critical Privilege Escalation Vulnerability (CVE-2025-46608) in Data Lakehouse",
      "severity": "critical",
      "excerpt": "Dell has released a security update to address a critical vulnerability (CVE-2025-46608) in its Data Lakehouse platform, which received a CVSS score of 9.1. The flaw is an improper access control issue that could be exploited by a remote, high-privileged attacker to gain further elevated rights and potentially compromise the entire system. Due to the severity and the potential for a complete confidentiality, integrity, and availability loss, Dell is urging all customers to upgrade to version 1.6.0.0 immediately.",
      "tags": [
        "CVE-2025-46608",
        "Dell",
        "Data Lakehouse",
        "Vulnerability",
        "Privilege Escalation",
        "Patch Management"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2025-11-13T15:00:00.000Z",
      "updatedAt": "2025-11-13T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-46608"
      ],
      "cvssScore": 9.1,
      "isUpdate": false
    },
    {
      "id": "f4b127f4-e997-4a72-8713-757a5b36c51a",
      "slug": "cisa-adds-actively-exploited-watchguard-and-triofox-flaws-to-kev-catalog",
      "headline": "CISA KEV Alert: WatchGuard and Triofox Flaws Now Under Active Attack",
      "title": "CISA Adds Actively Exploited WatchGuard Firebox and Gladinet Triofox Vulnerabilities to KEV Catalog",
      "severity": "high",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added three new vulnerabilities to its Known Exploited Vulnerabilities (KEV) catalog, indicating they are under active attack. The additions include CVE-2025-9242, an out-of-bounds write flaw in WatchGuard Firebox appliances, and CVE-2025-12480, an improper access control vulnerability in Gladinet's Triofox product. The third is the recently disclosed Windows Kernel zero-day, CVE-2025-62215. Federal agencies are now mandated to patch these flaws by a specified deadline, and CISA strongly urges all organizations to prioritize remediation.",
      "tags": [
        "CISA",
        "KEV",
        "CVE-2025-9242",
        "CVE-2025-12480",
        "WatchGuard",
        "Gladinet",
        "Vulnerability",
        "Active Exploitation"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2025-11-13T15:00:00.000Z",
      "updatedAt": "2025-11-13T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-9242",
        "CVE-2025-12480",
        "CVE-2025-62215"
      ],
      "isUpdate": false
    },
    {
      "id": "f6056d1b-52b0-4247-ae4a-0212e083a578",
      "slug": "european-organizations-targeted-by-phishing-campaign-using-html-smuggling-and-telegram-bots",
      "headline": "Stealthy Phishing Attack Uses HTML Smuggling & Telegram Bots to Steal Credentials",
      "title": "Phishing Campaign Targets European Organizations with HTML Smuggling and Exfiltrates Credentials via Telegram Bot API",
      "severity": "high",
      "excerpt": "A sophisticated phishing campaign is targeting organizations across Central and Eastern Europe, using HTML smuggling to deliver credential harvesting forms. Researchers at Cyble discovered the attack, which uses malicious HTML file attachments to bypass email security filters. Once a victim enters their credentials into the fake login page, an embedded JavaScript code exfiltrates the data directly to the attackers' private Telegram channels via the Telegram Bot API. This technique makes the campaign highly evasive, as it avoids the use of traditional, blockable C2 infrastructure.",
      "tags": [
        "Phishing",
        "HTML Smuggling",
        "Telegram",
        "Credential Theft",
        "Cyble",
        "Europe"
      ],
      "categories": [
        "Phishing",
        "Threat Intelligence",
        "Malware"
      ],
      "createdAt": "2025-11-13T15:00:00.000Z",
      "updatedAt": "2025-11-13T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}