{
  "pub_id": "pub-2025-12-16",
  "headline": "Massive Financial Breaches Expose 18M+; Apple & Google Patch Actively Exploited Zero-Days",
  "summary": "This cybersecurity brief for December 16, 2025, covers a series of critical incidents. Major data breaches at financial firms 700Credit and Prosper Marketplace have exposed the sensitive information of over 18 million individuals. Concurrently, Apple and Google rushed to patch two actively exploited zero-day vulnerabilities in the WebKit engine. Other significant events include CISA's mandate to patch a critical GeoServer flaw, active attacks on Fortinet SSO vulnerabilities, and data exposures at SoundCloud and Pornhub. Ransomware continues to plague the healthcare sector with an attack on Fieldtex by the Akira group, while new malware campaigns target developers on GitHub.",
  "pub_date": "2025-12-16",
  "total_articles": 5,
  "articles": [
    {
      "id": "c3f9d6a8-43cb-44e6-9d47-07c5600788cc",
      "slug": "soundcloud-and-pornhub-disclose-user-data-breaches",
      "headline": "SoundCloud and Pornhub Confirm User Data Exposure in Separate Breaches, One Via Third-Party",
      "title": "SoundCloud and Pornhub Disclose Data Breaches; Pornhub Incident Linked to Third-Party Vendor Mixpanel",
      "severity": "high",
      "excerpt": "Both SoundCloud and Pornhub have confirmed security incidents exposing user data. SoundCloud suffered a direct breach of an ancillary service dashboard, resulting in the exfiltration of email addresses and public profile information for up to 28 million users (20% of its user base). The company states passwords and financial data were not affected. Separately, Pornhub announced that historical analytics data of some Premium members was exposed due to a breach at its former third-party analytics vendor, Mixpanel. The notorious hacking group ShinyHunters has claimed the Mixpanel breach and is attempting to extort Pornhub, alleging they stole a massive database of user search and watch history.",
      "tags": [
        "Data Breach",
        "Supply Chain Attack",
        "ShinyHunters",
        "Mixpanel",
        "SoundCloud",
        "Pornhub",
        "DDoS",
        "Extortion"
      ],
      "categories": [
        "Data Breach",
        "Supply Chain Attack",
        "Threat Actor"
      ],
      "createdAt": "2025-12-16T15:00:00.000Z",
      "updatedAt": "2025-12-16T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "bfaeaf04-9c23-42e5-9d23-c0ea2d756707",
      "slug": "cisa-orders-patch-for-actively-exploited-geoserver-xxe-vulnerability",
      "headline": "CISA Orders Federal Agencies to Patch Actively Exploited Critical GeoServer XXE Flaw",
      "title": "CISA Adds Critical GeoServer XXE Vulnerability (CVE-2025-58360) to KEV Catalog Amid Active Exploitation",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical XML External Entity (XXE) injection vulnerability in OSGeo GeoServer, CVE-2025-58360, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, which has a CVSS score up to 9.8, allows an unauthenticated remote attacker to read arbitrary files, perform Server-Side Request Forgery (SSRF) attacks, or cause a denial-of-service. Due to evidence of active exploitation, CISA has mandated that all Federal Civilian Executive Branch agencies patch the vulnerability by January 1, 2026. All organizations using the popular open-source geospatial data server are strongly urged to apply the available updates immediately.",
      "tags": [
        "CVE-2025-58360",
        "GeoServer",
        "CISA",
        "KEV",
        "XXE",
        "SSRF",
        "Vulnerability",
        "Patch Management"
      ],
      "categories": [
        "Vulnerability",
        "Threat Intelligence",
        "Regulatory"
      ],
      "createdAt": "2025-12-16T15:00:00.000Z",
      "updatedAt": "2025-12-16T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-58360"
      ],
      "cvssScore": 9.8,
      "isUpdate": false
    },
    {
      "id": "bc2fc193-f34b-412a-8566-70308c4db0cd",
      "slug": "fortinet-sso-bypass-vulnerabilities-under-active-attack",
      "headline": "Active Attacks Exploit Critical Fortinet SSO Bypass Flaws to Gain Admin Access",
      "title": "Threat Actors Actively Exploiting Critical Fortinet Authentication Bypass Vulnerabilities (CVE-2025-59718, CVE-2025-59719)",
      "severity": "critical",
      "excerpt": "Security firm Arctic Wolf has observed active exploitation of two critical authentication bypass vulnerabilities in Fortinet products, CVE-2025-59718 and CVE-2025-59719. Both flaws, rated 9.1 in severity, allow an unauthenticated attacker to bypass FortiCloud single sign-on (SSO) by forging a SAML message, granting them administrative access to affected devices. The attacks, observed since December 12, 2025, target the default 'admin' account. The vulnerability is present if the FortiCloud SSO feature is enabled, which can be activated automatically when registering a device. Patches are available, and administrators are urged to upgrade immediately or disable the vulnerable SSO feature.",
      "tags": [
        "Fortinet",
        "CVE-2025-59718",
        "CVE-2025-59719",
        "SSO",
        "SAML",
        "Authentication Bypass",
        "Active Exploitation",
        "Cyberattack"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Patch Management"
      ],
      "createdAt": "2025-12-16T15:00:00.000Z",
      "updatedAt": "2025-12-16T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-59718",
        "CVE-2025-59719"
      ],
      "cvssScore": 9.1,
      "isUpdate": false
    },
    {
      "id": "1cd79e4d-0735-45ae-8777-3e5a700b517a",
      "slug": "critical-authentication-bypass-and-rce-flaws-patched-in-freepbx",
      "headline": "FreePBX Patches Critical Auth Bypass and RCE Flaws; Update VoIP Platforms Immediately",
      "title": "Multiple Critical Vulnerabilities Patched in FreePBX VoIP Platform, Including Authentication Bypass and Remote Code Execution",
      "severity": "critical",
      "excerpt": "The popular open-source VoIP platform FreePBX has been updated to fix several serious security vulnerabilities, including a critical authentication bypass (CVE-2025-66039) with a 9.3 CVSS score. This flaw, present in a non-default configuration, allows an attacker to bypass the admin login and potentially achieve remote code execution. Other patched high-severity issues include multiple authenticated SQL injection flaws (CVE-2025-61675) and an arbitrary file upload bug (CVE-2025-61678). These could be chained to upload a web shell and take full control of the server. Administrators are urged to update their FreePBX instances to the latest versions to mitigate these risks.",
      "tags": [
        "FreePBX",
        "VoIP",
        "Vulnerability",
        "CVE-2025-66039",
        "RCE",
        "Authentication Bypass",
        "SQL Injection"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Industrial Control Systems"
      ],
      "createdAt": "2025-12-16T15:00:00.000Z",
      "updatedAt": "2025-12-16T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-66039",
        "CVE-2025-61675",
        "CVE-2025-61678"
      ],
      "cvssScore": 9.3,
      "isUpdate": false
    },
    {
      "id": "3a0bacf3-dc8b-487d-8ac8-2a0f19a4e7c4",
      "slug": "pystorerat-malware-targets-developers-via-fake-github-repos",
      "headline": "New 'PyStoreRAT' Malware Spreads Via Fake OSINT and AI Tools on GitHub",
      "title": "'PyStoreRAT' Malware Campaign Targets Developers with Lures of Fake OSINT and AI Tools on GitHub",
      "severity": "high",
      "excerpt": "A new malware campaign is distributing an information-stealing Remote Access Trojan (RAT) called 'PyStoreRAT' through fake GitHub repositories. Threat actors create repositories for what appear to be legitimate OSINT, AI, or DeFi tools, artificially inflating their popularity with fake stars and forks. After gaining a user's trust, the attackers push a malicious update containing PyStoreRAT. The malware is designed to evade detection, establish persistence, and steal sensitive data, with a particular focus on cryptocurrency wallets. It can also download secondary payloads like the Rhadamanthys infostealer and propagates via USB drives, posing a significant threat to developers and security researchers.",
      "tags": [
        "PyStoreRAT",
        "Rhadamanthys",
        "Malware",
        "GitHub",
        "Supply Chain Attack",
        "InfoStealer",
        "Cryptocurrency",
        "Developer"
      ],
      "categories": [
        "Malware",
        "Supply Chain Attack",
        "Threat Intelligence"
      ],
      "createdAt": "2025-12-16T15:00:00.000Z",
      "updatedAt": "2025-12-16T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    }
  ]
}