{
  "pub_id": "pub-2025-11-17",
  "headline": "Jaguar Land Rover Reels from £680M Cyberattack Loss; Cl0p Exploits Oracle Zero-Day in Massive Campaign",
  "summary": "This intelligence brief for November 16-17, 2025, covers a series of high-impact cyber events. Key incidents include Jaguar Land Rover's staggering £680 million loss from a production-halting cyberattack, a widespread campaign by the Cl0p ransomware gang exploiting an Oracle E-Business Suite zero-day to breach Logitech and others, and the introduction of a sweeping new cybersecurity bill in the UK. Other major events include the discovery of 150,000 malicious NPM packages in a crypto-farming scheme, an actively exploited Windows Kernel zero-day patch from Microsoft, and multiple data breaches affecting DoorDash and Eurofiber.",
  "pub_date": "2025-11-17",
  "total_articles": 6,
  "articles": [
    {
      "id": "bff50863-f8f0-4b0b-a731-84f7fd3ab456",
      "slug": "washington-post-confirms-breach-in-massive-oracle-software-attack",
      "headline": "Washington Post Breached by Clop Ransomware via Oracle Flaws",
      "title": "Washington Post Confirms Breach in Widespread Clop Ransomware Campaign Targeting Oracle E-Business Suite",
      "severity": "high",
      "excerpt": "The Washington Post has officially confirmed it was a victim of a large-scale cyberattack orchestrated by the Clop ransomware group. The threat actors exploited vulnerabilities in Oracle's E-Business Suite, compromising over 100 organizations globally. The campaign involves data exfiltration followed by aggressive extortion tactics, with Clop publicly naming victims on its dark web leak site to pressure them into paying ransoms reportedly as high as $50 million. This incident underscores the significant risk posed by vulnerabilities in widely used enterprise software and the sophisticated, multi-faceted extortion methods employed by modern ransomware gangs.",
      "tags": [
        "Clop",
        "Ransomware",
        "Oracle",
        "E-Business Suite",
        "Data Breach",
        "Extortion",
        "TA505"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Cyberattack"
      ],
      "createdAt": "2025-11-09T15:00:00.000Z",
      "updatedAt": "2025-11-17T00:00:00.000Z",
      "readingTime": 6,
      "isUpdate": true,
      "updateSummary": "Clop gang exploited Oracle EBS zero-day CVE-2025-61882, breaching Logitech, Allianz UK, and GlobalLogic, confirming active exploitation for months.",
      "updateContent": "New information confirms the Clop ransomware group exploited a zero-day vulnerability, now tracked as CVE-2025-61882, in Oracle's E-Business Suite. This critical flaw allowed for unauthorized data access and was actively exploited for months before patches were released. Swiss electronics giant Logitech, Allianz UK, and GlobalLogic have been identified as additional victims in this widespread data exfiltration campaign, alongside The Washington Post. Organizations are urged to apply emergency patches immediately and assume compromise if running vulnerable EBS versions (12.2.3-12.2.14)."
    },
    {
      "id": "239e2a36-8d94-4c60-a849-8fabc2779328",
      "slug": "microsoft-patches-actively-exploited-windows-kernel-flaw",
      "headline": "Microsoft Patches Actively Exploited Windows Kernel Zero-Day in November Update",
      "title": "Microsoft's November 2025 Patch Tuesday Addresses Actively Exploited Windows Kernel Privilege Escalation Zero-Day (CVE-2025-62215)",
      "severity": "critical",
      "excerpt": "As part of its November 2025 Patch Tuesday release, Microsoft has addressed 63 security flaws, including a zero-day vulnerability in the Windows Kernel (CVE-2025-62215) that is being actively exploited. The flaw is an elevation of privilege vulnerability with a CVSS score of 7.0, allowing a local attacker to gain SYSTEM-level access. The vulnerability affects all supported versions of Windows and Windows Server. Due to its active exploitation in the wild, immediate patching is strongly recommended.",
      "tags": [
        "Patch Tuesday",
        "Microsoft",
        "Windows",
        "zero-day",
        "vulnerability",
        "CVE-2025-62215",
        "privilege escalation"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2025-11-14T15:00:00.000Z",
      "updatedAt": "2025-11-17T12:00:00.000Z",
      "readingTime": 3,
      "cves": [
        "CVE-2025-62215"
      ],
      "cvssScore": 7,
      "isUpdate": true,
      "updateSummary": "Update highlights additional critical RCE vulnerabilities, including a 9.8 CVSS flaw in Windows GDI+, and provides enhanced detection guidance.",
      "updateContent": "The update details two new critical vulnerabilities: CVE-2025-60274, a Windows GDI+ Remote Code Execution flaw with a CVSS of 9.8, and CVE-2025-62199, an RCE in Microsoft Office. These additions significantly broaden the scope of critical issues addressed in the November Patch Tuesday. Furthermore, the article provides more specific cyber observables for pre-patch detection, including Event ID 4688 and process monitoring, along with a refined deployment priority strategy for organizations. The presence of a 9.8 CVSS RCE vulnerability elevates the overall risk profile of this patch cycle."
    },
    {
      "id": "d2ca5ce2-944e-4f26-8a2a-dd7d7b62117c",
      "slug": "doordash-discloses-data-breach-after-employee-falls-for-social-engineering-scam",
      "headline": "DoorDash Hit by Data Breach After Employee Targeted in Social Engineering Scam",
      "title": "DoorDash Discloses Data Breach Affecting Users in Four Countries After Employee Falls for Social Engineering Scam",
      "severity": "high",
      "excerpt": "Food delivery service DoorDash has confirmed a data breach after an employee was compromised by a social engineering scam, allowing an unauthorized third party to access internal systems. The breach exposed the names, physical addresses, phone numbers, and email addresses of an undisclosed number of customers in the United States, Canada, Australia, and New Zealand. The company has stated that financial information was not accessed. This incident highlights the persistent threat of attackers targeting the 'human element' to bypass technical security controls.",
      "tags": [
        "data breach",
        "social engineering",
        "phishing",
        "DoorDash",
        "human element"
      ],
      "categories": [
        "Data Breach",
        "Phishing",
        "Cyberattack"
      ],
      "createdAt": "2025-11-17T15:00:00.000Z",
      "updatedAt": "2025-11-17T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "e00d1e2d-1692-4b3b-9322-495cef64ba3d",
      "slug": "iranian-apt-spearspecter-targets-officials-families-in-sophisticated-spy-campaign",
      "headline": "Iranian APT 'SpearSpecter' Targets Officials' Families in Sophisticated Espionage Campaign",
      "title": "Iranian APT 'SpearSpecter' (APT42) Targets Government Officials and Their Families with 'TameCat' Backdoor",
      "severity": "high",
      "excerpt": "The Iranian state-sponsored group APT42, also known by aliases like SpearSpecter, is conducting a highly sophisticated and ongoing espionage campaign targeting senior defense and government officials. According to the Israel National Digital Agency, the threat actors are using advanced social engineering tactics, including building trust over weeks and targeting victims' family members to apply psychological pressure. The campaign's technical core is 'TameCat,' a modular PowerShell-based backdoor that operates in-memory and uses legitimate services like Telegram and Discord for stealthy command-and-control.",
      "tags": [
        "APT42",
        "SpearSpecter",
        "Iran",
        "espionage",
        "threat actor",
        "TameCat",
        "PowerShell",
        "social engineering"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Cyberattack"
      ],
      "createdAt": "2025-11-17T15:00:00.000Z",
      "updatedAt": "2025-11-17T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "af5423c7-0d79-45bc-bbfd-d4ac4ec7d85a",
      "slug": "eurofiber-breach-exposes-data-from-thales-orange-and-french-government",
      "headline": "Eurofiber Breach Exposes Thales, Orange, and French Government Data in Major Supply Chain Incident",
      "title": "Eurofiber France Data Breach via GLPI Flaws Exposes Data from Thales, Orange, and Government Ministries",
      "severity": "critical",
      "excerpt": "European digital infrastructure provider Eurofiber has confirmed a major data breach in its French division, potentially exposing sensitive data from over 3,600 clients, including major corporations like Thales and Orange, and several French government ministries. A threat actor known as 'ByteToBreach' claims to have exploited vulnerabilities (CVE-2024-29889, CVE-2025-24799) in Eurofiber's GLPI IT asset management software via SQL injection. The stolen data, now for sale on the dark web, allegedly includes highly sensitive information such as SSH private keys, VPN configurations, and API keys, posing a severe supply chain risk.",
      "tags": [
        "data breach",
        "supply chain attack",
        "SQL injection",
        "vulnerability",
        "Eurofiber",
        "GLPI",
        "France",
        "CVE-2025-24799"
      ],
      "categories": [
        "Data Breach",
        "Vulnerability",
        "Supply Chain Attack"
      ],
      "createdAt": "2025-11-17T15:00:00.000Z",
      "updatedAt": "2025-11-17T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2024-29889",
        "CVE-2025-24799"
      ],
      "isUpdate": false
    },
    {
      "id": "f812e26b-404b-4206-8f92-8db4946b63b3",
      "slug": "pro-russian-hackers-launch-ddos-attacks-on-danish-government",
      "headline": "Pro-Russian Hackers Target Denmark with DDoS Attacks Ahead of Elections",
      "title": "Pro-Russian Group NoName057(16) Launches DDoS Attacks on Danish Government and Political Parties Before Elections",
      "severity": "medium",
      "excerpt": "The pro-Russian hacktivist group NoName057(16) has claimed responsibility for a series of Distributed Denial-of-Service (DDoS) attacks that targeted Danish government websites, political parties, and defense-related entities. The attacks, which occurred just before Denmark's municipal and regional elections, were designed to cause disruption and informational noise. Targets included the Danish Ministry of Transport and the national citizen portal, Borger.dk. While the outages were brief, the incident aligns with a pattern of politically motivated cyber activity by the group against European nations supporting Ukraine.",
      "tags": [
        "DDoS",
        "hacktivism",
        "NoName057(16)",
        "pro-Russian",
        "Denmark",
        "elections"
      ],
      "categories": [
        "Cyberattack",
        "Threat Actor"
      ],
      "createdAt": "2025-11-17T15:00:00.000Z",
      "updatedAt": "2025-11-17T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}