{
  "pub_id": "pub-2025-11-11",
  "headline": "Triofox Zero-Day Exploited In-the-Wild; CMMC Enforcement Begins for DoD Contractors",
  "summary": "This cybersecurity brief for November 11, 2025, covers several critical developments. A zero-day in Gladinet's Triofox (CVE-2025-12480) is being actively exploited for remote code execution. CISA added a zero-click Samsung mobile flaw (CVE-2025-21042) to its KEV catalog following active exploitation. The DoD has officially begun CMMC enforcement for its contractors. Other major incidents include a destructive campaign by the KONNI APT against Android users, and significant data breaches at Nikkei and Hyundai AutoEver.",
  "pub_date": "2025-11-11",
  "total_articles": 6,
  "articles": [
    {
      "id": "1174a996-cc57-4167-b1d8-5970d32972ae",
      "slug": "cisco-warns-new-attack-variant-exploiting-critical-firewall-vulnerabilities",
      "headline": "Cisco Firewalls Under Renewed Assault as New DoS Attack Variant Emerges",
      "title": "Cisco Issues Urgent Warning as New Attack Variant Exploits Critical ASA and FTD Firewall Vulnerabilities",
      "severity": "critical",
      "excerpt": "Cisco has issued an urgent security warning about a new denial-of-service (DoS) attack variant that is actively exploiting two previously patched vulnerabilities, CVE-2025-20333 and CVE-2025-20362, in its Secure Firewall ASA and FTD software. The campaign, which began on November 5, 2025, causes unpatched devices to enter a continuous reload loop, rendering them inoperable. This follows months of active exploitation by advanced threat actors, including a compromise of at least one US government agency. Cisco strongly urges all customers to apply the available patches immediately, as no effective workarounds exist.",
      "tags": [
        "Firewall",
        "DoS",
        "RCE",
        "Vulnerability",
        "Cisco",
        "Patch Management"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Patch Management"
      ],
      "createdAt": "2025-11-07T15:00:00.000Z",
      "updatedAt": "2025-11-11T12:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-20333",
        "CVE-2025-20362"
      ],
      "isUpdate": true,
      "updateSummary": "New details link Cisco firewall vulnerabilities to the state-sponsored 'ArcaneDoor' zero-day campaign, with a new DoS variant actively exploited.",
      "updateContent": "New information reveals the exploited Cisco firewall vulnerabilities (CVE-2025-20333, CVE-2025-20362) were originally part of the 'ArcaneDoor' zero-day campaign, attributed to a state-sponsored actor. While the original campaign aimed for full device takeover, a new DoS variant is now actively exploiting these flaws, causing devices to reboot. This variant is believed to be from less sophisticated actors reverse-engineering the original exploits, widening the threat landscape. Despite patches being available since September, nearly 50,000 devices remained unpatched, underscoring the critical need for immediate updates."
    },
    {
      "id": "c0945e0a-9100-471c-8d1d-e19dfb2f8163",
      "slug": "triofox-zero-day-exploited-by-unc6485-for-system-level-access",
      "headline": "Critical Triofox Zero-Day Actively Exploited for System-Level Access",
      "title": "UNC6485 Exploits Critical Triofox Zero-Day (CVE-2025-12480) for Full System Compromise",
      "severity": "critical",
      "excerpt": "A critical, unauthenticated remote code execution vulnerability (CVE-2025-12480) in Gladinet's Triofox file-sharing platform is being actively exploited by a threat group tracked as UNC6485. The attackers are bypassing authentication by spoofing HTTP Host headers to 'localhost', allowing them to create rogue administrator accounts. They then abuse a built-in antivirus feature to execute malicious code with SYSTEM-level privileges, leading to full system compromise. Post-exploitation activity includes the deployment of commercial remote access tools like Zoho UEMS and AnyDesk to maintain persistence. Gladinet has released a patch, and organizations are urged to update immediately.",
      "tags": [
        "zero-day",
        "RCE",
        "file sharing",
        "authentication bypass",
        "privilege escalation",
        "UNC6485",
        "Gladinet"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Threat Actor"
      ],
      "createdAt": "2025-11-11T15:00:00.000Z",
      "updatedAt": "2025-11-11T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-12480",
        "CVE-2025-30406",
        "CVE-2025-11371"
      ],
      "cvssScore": 9.1,
      "isUpdate": false
    },
    {
      "id": "b70da6f0-de13-46d4-92c0-25d196a00600",
      "slug": "konni-apt-abuses-google-find-hub-for-remote-data-wipes",
      "headline": "KONNI APT Weaponizes Google's Find Hub for Destructive Attacks",
      "title": "North Korean KONNI APT Abuses Google's Find Hub to Remotely Wipe Android Devices",
      "severity": "high",
      "excerpt": "The North Korea-linked threat group KONNI has been observed in a novel campaign targeting individuals in South Korea. The attackers use social engineering to deploy PC malware that steals Google account credentials. With these credentials, they access the victim's Google account and abuse the legitimate 'Find Hub' service (formerly Find My Device) to track the real-time location of the victim's Android phone and remotely trigger a factory reset, wiping all data. This campaign highlights the group's creativity in weaponizing legitimate services for destructive purposes.",
      "tags": [
        "KONNI",
        "APT",
        "data destruction",
        "social engineering",
        "credential theft",
        "Android",
        "Google"
      ],
      "categories": [
        "Threat Actor",
        "Cyberattack",
        "Malware"
      ],
      "createdAt": "2025-11-11T15:00:00.000Z",
      "updatedAt": "2025-11-11T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "8535de98-4fd5-4c57-8df3-6cb254b17b55",
      "slug": "pentagon-unveils-new-cyber-force-generation-model",
      "headline": "Pentagon Overhauls Cyber Force Model to Boost USCYBERCOM Readiness",
      "title": "Pentagon Announces New Cyber Force Generation Model to Bolster U.S. Cyber Command Effectiveness",
      "severity": "informational",
      "excerpt": "The U.S. Department of War (DoW) has announced a new cyber force generation model aimed at enhancing the operational effectiveness, specialization, and lethality of forces assigned to U.S. Cyber Command (USCYBERCOM). The revised plan is designed to create a more integrated and agile cyber force by streamlining the processes of recruiting, training, and retaining personnel across all military branches. This strategic shift seeks to address emerging cyber threats and deter aggression in the cyber domain more effectively.",
      "tags": [
        "USCYBERCOM",
        "DoD",
        "cyber policy",
        "military",
        "workforce development",
        "Pentagon"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Security Operations"
      ],
      "createdAt": "2025-11-11T15:00:00.000Z",
      "updatedAt": "2025-11-11T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    },
    {
      "id": "b9949a97-e5d7-4f4c-ae25-9de2f44e2bc3",
      "slug": "nikkei-discloses-slack-breach-exposing-data-of-17000-users",
      "headline": "Nikkei Slack Breach Exposes Data of 17,000 Users via Stolen Credentials",
      "title": "Japanese Media Giant Nikkei Discloses Slack Data Breach Affecting 17,368 Users via Infostealer Malware",
      "severity": "high",
      "excerpt": "Japanese media giant Nikkei Inc., owner of the Financial Times, has disclosed a significant data breach affecting its internal Slack workspace. An attacker gained access using authentication credentials stolen from an employee's personal computer, which was infected with infostealer malware. The incident, which was detected in September 2025, exposed the names, email addresses, and chat histories of 17,368 employees and business partners. The breach highlights the persistent threat of infostealer malware and the security risks associated with credentials stored in web browsers.",
      "tags": [
        "data breach",
        "infostealer",
        "Slack",
        "credential theft",
        "media",
        "session hijacking"
      ],
      "categories": [
        "Data Breach",
        "Cyberattack",
        "Malware"
      ],
      "createdAt": "2025-11-11T15:00:00.000Z",
      "updatedAt": "2025-11-11T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "837dcbc2-2327-43f7-a4d3-f6f6f97e4912",
      "slug": "hyundai-autoever-notifies-customers-of-major-data-breach",
      "headline": "Hyundai IT Affiliate Discloses Major Data Breach Exposing PII and SSNs",
      "title": "Hyundai AutoEver America Notifies Customers of Data Breach Exposing PII, Including Social Security Numbers",
      "severity": "high",
      "excerpt": "Hyundai AutoEver America, the IT services subsidiary of the Hyundai Group, has begun notifying customers of a major data breach that occurred between late February and early March 2025. The incident involved unauthorized access to the company's IT environment, exposing highly sensitive personally identifiable information (PII), including full names, driver's license numbers, and Social Security numbers. While the exact number of victims is unconfirmed, the company's software is used in up to 2.7 million vehicles in North America, indicating a potentially massive scale.",
      "tags": [
        "data breach",
        "automotive",
        "PII",
        "SSN",
        "Hyundai"
      ],
      "categories": [
        "Data Breach",
        "Cyberattack",
        "Other"
      ],
      "createdAt": "2025-11-11T15:00:00.000Z",
      "updatedAt": "2025-11-11T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}