{
  "pub_id": "pub-2026-01-14",
  "headline": "CISA Mandates Patches for Exploited Windows & Gogs Zero-Days; Ransomware Cripples Hospital & Energy Giant Breached",
  "summary": "In the last 24 hours, the cybersecurity landscape has been dominated by critical vulnerability disclosures and high-impact cyberattacks. The U.S. CISA has added two actively exploited zero-day vulnerabilities to its KEV catalog: a Windows information disclosure flaw (CVE-2026-20805) and a Gogs RCE flaw (CVE-2025-8110), mandating urgent action from federal agencies. In Europe, a suspected ransomware attack crippled Belgium's AZ Monica hospital, forcing the transfer of critical patients, while Spanish energy giant Endesa confirmed a massive data breach with a threat actor claiming to hold data on 20 million people. These incidents are compounded by new threat intelligence on evolving tactics from Russian GRU hackers and a strategic shift in the ransomware ecosystem towards encryptionless extortion.",
  "pub_date": "2026-01-14",
  "total_articles": 9,
  "articles": [
    {
      "id": "5fd8ba6e-9521-49c1-b6d0-4ce743deda49",
      "slug": "ransomware-tactics-evolve-amid-declining-profits-2026",
      "headline": "Ransomware Evolves: Groups Recruit Insiders, Add DDoS as Profits Fall",
      "title": "Ransomware Trends for 2026: Declining Profits Force Tactical Shifts to Insider Recruitment and DDoS Attacks",
      "severity": "informational",
      "excerpt": "The ransomware landscape is undergoing a significant evolution heading into 2026. Despite a 47% surge in publicly reported attacks in 2025, analysis from Recorded Future shows that overall profits for threat actors have declined. This financial pressure is forcing a tactical shift. Key trends to watch for include the bundling of DDoS services with ransomware to increase victim coercion, a more aggressive focus on recruiting corporate insiders to gain initial access, and a notable globalization of new ransomware groups emerging outside of the traditional Russian sphere of influence.",
      "tags": [
        "Ransomware",
        "Threat Intelligence",
        "DDoS",
        "Insider Threat",
        "RaaS",
        "Cybercrime"
      ],
      "categories": [
        "Threat Intelligence",
        "Ransomware",
        "Threat Actor"
      ],
      "createdAt": "2026-01-05T15:00:00.000Z",
      "updatedAt": "2026-01-14T00:00:00.000Z",
      "readingTime": 6,
      "isUpdate": true,
      "updateSummary": "Ransomware groups increasingly favor 'extortion-only' attacks, abandoning encryption for silent data theft, bypassing traditional backups.",
      "updateContent": "Recent analysis reveals a significant shift in ransomware tactics, with threat actors moving towards 'extortion-only' attacks that forgo data encryption entirely. Instead, they focus on silent, long-term data exfiltration, followed by threats to leak stolen information. This approach is stealthier, generates fewer alerts, and effectively bypasses backup-based recovery strategies, turning every incident into a data breach. Groups like Cl0p and ShinyHunters are pioneering this model, which accounted for a substantial portion of 2025's extortion incidents. This fundamentally changes the impact, making every attack a data breach with legal and reputational consequences, and renders backups ineffective against data leakage."
    },
    {
      "id": "0f6279e7-9758-4941-bd43-611091904ded",
      "slug": "cisa-mandates-patch-for-actively-exploited-windows-zero-day-cve-2026-20805",
      "headline": "CISA Mandates Patch for Exploited Windows Zero-Day Used in Attack Chains",
      "title": "CISA Adds Actively Exploited Windows Zero-Day (CVE-2026-20805) to KEV Catalog",
      "severity": "high",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has ordered federal agencies to patch a zero-day vulnerability in the Windows Desktop Window Manager (CVE-2026-20805) by February 3, 2026. The medium-severity information disclosure flaw is being actively exploited in the wild as a crucial component in multi-stage attack chains, allowing attackers to bypass Address Space Layout Randomization (ASLR) and enable more severe exploits like remote code execution. The flaw was addressed in Microsoft's January 2026 Patch Tuesday update.",
      "tags": [
        "CVE-2026-20805",
        "Windows",
        "Zero-Day",
        "CISA",
        "KEV",
        "ASLR Bypass",
        "DWM",
        "Patch Tuesday"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Threat Intelligence"
      ],
      "createdAt": "2026-01-14T15:00:00.000Z",
      "updatedAt": "2026-01-14T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-20805"
      ],
      "cvssScore": 5.5,
      "isUpdate": false
    },
    {
      "id": "0b7a75cc-a695-446a-8ae0-a333294f23a6",
      "slug": "spanish-energy-giant-endesa-suffers-major-data-breach",
      "headline": "Spanish Energy Giant Endesa Hit by Massive Data Breach, 20M Records Allegedly For Sale",
      "title": "Endesa Confirms Data Breach; Hacker Claims to Hold Data of 20 Million People",
      "severity": "high",
      "excerpt": "Spain's largest electric utility, Endesa, has confirmed a data breach after detecting unauthorized access to a commercial platform. The company admitted that customer PII, contact details, and bank account IBANs were potentially exposed. The situation is amplified by a threat actor on a cybercrime forum who claims to have stolen a 1.05 TB database containing the data of over 20 million people, which is now up for sale. Endesa, which serves over 10 million customers, is urging vigilance against phishing and fraud.",
      "tags": [
        "Data Breach",
        "Endesa",
        "Spain",
        "PII",
        "Energy Sector",
        "Cybercrime",
        "IBAN"
      ],
      "categories": [
        "Data Breach",
        "Cyberattack",
        "Industrial Control Systems"
      ],
      "createdAt": "2026-01-14T15:00:00.000Z",
      "updatedAt": "2026-01-14T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "a846d5d1-1db7-42e9-acbb-ad2f056cc44c",
      "slug": "pax8-data-leak-exposes-msp-and-customer-data",
      "headline": "Pax8 Data Leak Exposes Sensitive MSP and Customer Info via Accidental Email",
      "title": "Pax8 Accidentally Exposes Partner and Customer Business Data via Email",
      "severity": "medium",
      "excerpt": "Cloud commerce marketplace Pax8 has confirmed a data exposure incident caused by human error. On January 13, an employee mistakenly sent an email containing a CSV file with sensitive, non-PII business data for approximately 1,800 Managed Service Provider (MSP) partners. The email, sent to fewer than 40 UK-based partners, exposed valuable information such as customer names, Microsoft license counts, pricing, and contract renewal dates, creating a significant risk of targeted phishing and competitive poaching.",
      "tags": [
        "Data Leak",
        "Pax8",
        "MSP",
        "Human Error",
        "Data Exposure",
        "Supply Chain"
      ],
      "categories": [
        "Data Breach",
        "Supply Chain Attack",
        "Cloud Security"
      ],
      "createdAt": "2026-01-14T15:00:00.000Z",
      "updatedAt": "2026-01-14T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "68101472-1196-4036-896d-42356785ab37",
      "slug": "cisa-warns-of-critical-flaws-in-rockwell-automation-and-yosmart-ics-equipment",
      "headline": "CISA Warns of Critical Flaws in Rockwell & YoSmart ICS Equipment",
      "title": "CISA Issues Advisories for Critical Vulnerabilities in Rockwell Automation and YoSmart Industrial Control Systems",
      "severity": "high",
      "excerpt": "CISA has released several Industrial Control Systems (ICS) advisories, warning of significant vulnerabilities in widely deployed equipment from Rockwell Automation and YoSmart. A high-severity SQL injection flaw (CVE-2025-12807) in Rockwell's FactoryTalk platform could allow for database takeover, while another flaw (CVE-2025-9368) can cause a denial-of-service condition. Separately, multiple flaws in YoSmart smart home hubs could permit remote device control and data interception, posing risks to both manufacturing and communications sectors.",
      "tags": [
        "ICS",
        "SCADA",
        "CISA",
        "Rockwell Automation",
        "YoSmart",
        "Vulnerability",
        "SQL Injection",
        "DoS"
      ],
      "categories": [
        "Industrial Control Systems",
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2026-01-14T15:00:00.000Z",
      "updatedAt": "2026-01-14T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-12807",
        "CVE-2025-9368",
        "CVE-2025-59449",
        "CVE-2025-59451",
        "CVE-2025-59452",
        "CVE-2025-59448"
      ],
      "cvssScore": 8.8,
      "isUpdate": false
    },
    {
      "id": "8e78a6f9-2dd5-43c3-bc25-ad42b8f7d11e",
      "slug": "gru-linked-hackers-bluedelta-apt28-evolve-credential-harvesting-tactics",
      "headline": "Russian GRU Hackers (APT28) Evolve Credential-Harvesting Tactics",
      "title": "GRU-Linked BlueDelta (APT28) Refines Credential-Harvesting Operations Against European and Eurasian Targets",
      "severity": "high",
      "excerpt": "The Russian GRU-linked threat group BlueDelta, also known as APT28 or Fancy Bear, has been observed refining its credential-harvesting operations. According to research from Recorded Future, campaigns between February and September 2025 targeted energy, defense, and policy organizations in Europe and Eurasia. The group uses tailored spear-phishing emails, multi-stage redirection, and abuses low-cost, disposable infrastructure like ngrok and other free hosting services to enhance stealth and complicate attribution.",
      "tags": [
        "APT28",
        "Fancy Bear",
        "BlueDelta",
        "GRU",
        "Russia",
        "Credential Harvesting",
        "Phishing",
        "Threat Intelligence"
      ],
      "categories": [
        "Threat Actor",
        "Phishing",
        "Threat Intelligence"
      ],
      "createdAt": "2026-01-14T15:00:00.000Z",
      "updatedAt": "2026-01-14T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "7aaf4e5f-83f3-4e88-9b3e-b474f3b91919",
      "slug": "kremlin-hackers-target-ukrainian-military-with-pluggyape-malware",
      "headline": "Russian Hackers Target Ukrainian Military with \"PluggyApe\" Malware",
      "title": "Void Blizzard (UAC-0190) Targets Ukrainian Defense Forces with PluggyApe Malware via Charity-Themed Lures",
      "severity": "high",
      "excerpt": "A Russian-linked hacking group, Void Blizzard (also known as UAC-0190), has been targeting the Ukrainian Defense Forces with a new cyber-espionage campaign. According to CERT-UA, the attacks, which occurred between October and December 2025, use a novel malware strain called PluggyApe. The campaign employs sophisticated social engineering, with attackers making direct contact with targets on secure messaging apps like Signal and WhatsApp, using charity-themed lures to build trust and deliver the malware.",
      "tags": [
        "Void Blizzard",
        "PluggyApe",
        "Ukraine",
        "Russia",
        "Cyber Espionage",
        "Malware",
        "CERT-UA"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Cyberattack"
      ],
      "createdAt": "2026-01-14T15:00:00.000Z",
      "updatedAt": "2026-01-14T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "a732219b-2007-4f2f-9ac7-57557714a9d2",
      "slug": "connectpos-exposed-admin-github-token-for-four-years",
      "headline": "ConnectPOS Exposed Admin GitHub Token for Over Four Years, Creating Massive Supply Chain Risk",
      "title": "ConnectPOS Leaked Admin-Level GitHub Token in Public Docs for Four Years, Posing Major Supply Chain Risk",
      "severity": "critical",
      "excerpt": "Point-of-sale vendor ConnectPOS exposed a GitHub Personal Access Token (PAT) with full administrative privileges in its public documentation for over four years, from September 2021 until its discovery in January 2026. The blunder, found by security firm Sansec, put the vendor's entire software supply chain at risk. An attacker could have used the token to inject malicious code, such as a payment card skimmer, into the POS software, which would then be distributed to its 12,000+ customers, including major brands like Asus and Indiana University.",
      "tags": [
        "ConnectPOS",
        "Supply Chain Attack",
        "GitHub",
        "Secret Leak",
        "PAT",
        "Magecart",
        "Vulnerability"
      ],
      "categories": [
        "Supply Chain Attack",
        "Vulnerability",
        "Data Breach"
      ],
      "createdAt": "2026-01-14T15:00:00.000Z",
      "updatedAt": "2026-01-14T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "19f6c5b9-9ce5-48d9-afc6-af0f9b852c07",
      "slug": "microsoft-january-2026-patch-tuesday-fixes-114-vulnerabilities",
      "headline": "Microsoft's January 2026 Patch Tuesday Fixes 114 Flaws, Including One Exploited Zero-Day",
      "title": "Microsoft January 2026 Patch Tuesday Addresses 114 Vulnerabilities, Including One Exploited Zero-Day",
      "severity": "high",
      "excerpt": "Microsoft has released its first Patch Tuesday of 2026, a substantial update that addresses 114 security vulnerabilities across a wide range of its products, including Windows, Office, Azure, and SharePoint. The release includes fixes for eight critical remote code execution (RCE) vulnerabilities and, most notably, one moderate-severity information disclosure zero-day (CVE-2026-20805) that is confirmed to be actively exploited in the wild. This makes it the third-largest January update on record, urging administrators to prioritize deployment.",
      "tags": [
        "Patch Tuesday",
        "Microsoft",
        "Vulnerability",
        "Zero-Day",
        "RCE",
        "CVE-2026-20805"
      ],
      "categories": [
        "Patch Management",
        "Vulnerability"
      ],
      "createdAt": "2026-01-14T15:00:00.000Z",
      "updatedAt": "2026-01-14T15:00:00.000Z",
      "readingTime": 3,
      "cves": [
        "CVE-2026-20805"
      ],
      "isUpdate": false
    }
  ]
}