{
  "pub_id": "pub-2025-11-07",
  "headline": "Cisco Firewalls Under Siege by New DoS Attacks; AI Supercharges Ransomware Campaigns",
  "summary": "In the period covering November 6-7, 2025, the cybersecurity landscape was dominated by new attack variants targeting critical Cisco firewall vulnerabilities, causing persistent denial-of-service conditions. Concurrently, reports emerged detailing how threat actors are leveraging AI to drastically shorten ransomware attack timelines, with Europe becoming a primary target. Other major developments include a sophisticated global phishing campaign against Booking.com users, the discovery of Android spyware delivered via a Samsung zero-day, and a record-breaking month for software supply chain attacks driven by ransomware groups like Qilin and Akira.",
  "pub_date": "2025-11-07",
  "total_articles": 7,
  "articles": [
    {
      "id": "10f8b94c-1626-4df9-8d0d-937c7de276ab",
      "slug": "cisa-adds-actively-exploited-control-web-panel-flaw-to-kev-catalog",
      "headline": "CISA Adds Actively Exploited Control Web Panel RCE Flaw to KEV",
      "title": "CISA Warns of Active Exploitation of Critical RCE Vulnerability (CVE-2025-48703) in Control Web Panel, Adds to KEV Catalog",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical command injection vulnerability in Control Web Panel (CWP), CVE-2025-48703, to its Known Exploited Vulnerabilities (KEV) catalog. The action confirms the flaw is being actively exploited in the wild. The vulnerability allows a remote, unauthenticated attacker to achieve remote code execution (RCE) on servers running the popular Linux web hosting panel. CISA has mandated that all Federal Civilian Executive Branch agencies patch the vulnerability by November 25, 2025, and strongly urges all other organizations to remediate it immediately.",
      "tags": [
        "CISA",
        "KEV",
        "Vulnerability",
        "RCE",
        "CVE-2025-48703",
        "Control Web Panel",
        "Web Hosting"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2025-11-06T15:00:00.000Z",
      "updatedAt": "2025-11-07T00:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-48703"
      ],
      "cvssScore": 9,
      "isUpdate": true,
      "updateSummary": "New details confirm root-level RCE for CVE-2025-48703 in CWP, CISA advises discontinuing use if unpatchable.",
      "updateContent": "New information clarifies that CVE-2025-48703 in Control Web Panel (CWP) allows unauthenticated remote code execution with root privileges, a higher impact than previously detailed. The prerequisite for exploitation is knowing any valid username, including 'root'. CISA has also added a critical remediation step, advising federal agencies and other organizations to discontinue the use of CWP if patching is not immediately possible. Additional detection methods like process monitoring and a strong recommendation to hunt for compromise post-patching have also been highlighted, emphasizing the severe nature of this actively exploited vulnerability."
    },
    {
      "id": "ec5a2168-e1b0-41b4-9912-deb7896ee41d",
      "slug": "i-paid-twice-phishing-campaign-targets-booking-com-hotels-and-guests",
      "headline": "Massive 'I Paid Twice' Phishing Scheme Defrauds Booking.com Hotels and Guests",
      "title": "Global 'I Paid Twice' Phishing Campaign Uses Compromised Hotel Accounts on Booking.com to Defraud Travelers",
      "severity": "high",
      "excerpt": "A sophisticated global phishing campaign named 'I Paid Twice' is targeting hotels on Booking.com and Expedia, compromising their administrative accounts to defraud guests. Since at least April 2025, attackers have been using social engineering and the PureRAT malware to gain access to hotel systems. Once in, they impersonate hotel staff to send fraudulent payment requests to travelers with upcoming reservations, tricking them into paying a second time via a malicious portal. Security firm Sekoia.io, which discovered the operation, reports that the campaign is highly active and has resulted in financial losses for an unknown number of victims.",
      "tags": [
        "Phishing",
        "Malware",
        "PureRAT",
        "Booking.com",
        "Hospitality",
        "Social Engineering"
      ],
      "categories": [
        "Phishing",
        "Malware",
        "Cyberattack"
      ],
      "createdAt": "2025-11-07T15:00:00.000Z",
      "updatedAt": "2025-11-07T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "3ee94d0f-8fa4-402a-995f-6e11155c9d90",
      "slug": "samsung-zero-day-flaw-exploited-to-deploy-landfall-android-spyware",
      "headline": "Samsung Zero-Day Exploited in the Wild to Install 'LANDFALL' Android Spyware",
      "title": "Actively Exploited Zero-Day (CVE-2025-21042) in Samsung Devices Used to Deploy LANDFALL Spyware via WhatsApp",
      "severity": "critical",
      "excerpt": "A now-patched zero-day vulnerability, CVE-2025-21042, in Samsung Galaxy devices was actively exploited to install a commercial-grade Android spyware known as LANDFALL. Researchers from Palo Alto Networks' Unit 42 discovered that attackers sent malicious DNG image files via WhatsApp to targets in the Middle East. The flaw, an out-of-bounds write in an image processing library, allowed for remote code execution. This incident highlights the growing trend of exploiting mobile image parsing libraries to deliver spyware, echoing similar attacks against Apple devices.",
      "tags": [
        "Zero-Day",
        "Spyware",
        "Android",
        "Samsung",
        "Mobile Security",
        "CVE-2025-21042"
      ],
      "categories": [
        "Vulnerability",
        "Malware",
        "Mobile Security"
      ],
      "createdAt": "2025-11-07T15:00:00.000Z",
      "updatedAt": "2025-11-07T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-21042",
        "CVE-2025-21043",
        "CVE-2025-43300",
        "CVE-2025-55177"
      ],
      "cvssScore": 8.8,
      "isUpdate": false
    },
    {
      "id": "b776a201-dba5-431e-8622-d5928b0d1da2",
      "slug": "state-backed-hackers-escalate-attacks-on-ukraine-and-americas-eset-reports",
      "headline": "State-Backed Hacking Escalates: Russia Targets Ukraine, China Eyes Latin America",
      "title": "ESET Report: Russia- and China-Aligned APTs Intensify Cyber Operations Globally",
      "severity": "high",
      "excerpt": "A new report from ESET reveals a significant escalation in cyber operations by state-sponsored threat groups from Russia and China between April and September 2025. Russia-aligned groups, notably Sandworm, have accelerated destructive wiper malware attacks against Ukraine's critical infrastructure, including energy and logistics. Simultaneously, China-aligned actors like FamousSparrow have increased espionage activities targeting governmental entities in Latin America, potentially in response to shifting geopolitical dynamics. The report highlights a global landscape of heightened cyber conflict driven by national interests.",
      "tags": [
        "APT",
        "Threat Intelligence",
        "Sandworm",
        "Wiper",
        "Espionage",
        "Geopolitics"
      ],
      "categories": [
        "Threat Intelligence",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2025-11-07T15:00:00.000Z",
      "updatedAt": "2025-11-07T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "bad0bc44-53fd-4bdf-8c3f-e90d2d88b6b4",
      "slug": "malicious-nuget-packages-contain-time-delayed-industrial-sabotage-code",
      "headline": "Patient Sabotage: Malicious NuGet Packages with Time-Delayed ICS Payloads Discovered",
      "title": "Malicious NuGet Packages with Time-Delayed Industrial Sabotage Code Found on Official Repository",
      "severity": "critical",
      "excerpt": "Security researchers have discovered nine malicious packages on the NuGet repository, downloaded over 9,400 times, containing hidden, time-delayed sabotage code. One package, 'Sharp7Extend,' was specifically designed to corrupt write operations in industrial control systems (ICS) by silently causing them to fail after a grace period. This could lead to physical damage or production failures. The code was set to trigger on specific dates, some as far in the future as 2028, demonstrating a patient and highly destructive approach to supply chain attacks.",
      "tags": [
        "Supply Chain Attack",
        "ICS",
        "OT",
        "NuGet",
        "Sabotage",
        "Malware"
      ],
      "categories": [
        "Supply Chain Attack",
        "Industrial Control Systems",
        "Malware"
      ],
      "createdAt": "2025-11-07T15:00:00.000Z",
      "updatedAt": "2025-11-07T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "72d7eb15-1a1b-4730-b980-f106c8147761",
      "slug": "software-supply-chain-attacks-hit-record-high-cyble-report-reveals",
      "headline": "Software Supply Chain Attacks Skyrocket to Record High, Driven by Ransomware Gangs",
      "title": "Cyble Report: Software Supply Chain Attacks Surge to Record High in October 2025",
      "severity": "high",
      "excerpt": "Software supply chain attacks reached an all-time high in October 2025, with 41 claimed incidents, according to a new report from Cyble. This figure is over 30% higher than the previous monthly record. Ransomware groups, particularly Qilin and Akira, are identified as the primary drivers of this trend, responsible for a majority of attacks in 2025. The information technology, finance, and energy sectors are the most heavily targeted, highlighting a strategic shift by attackers to compromise organizations through their trusted third-party suppliers.",
      "tags": [
        "Supply Chain Attack",
        "Ransomware",
        "Qilin",
        "Akira",
        "Cyble",
        "Dark Web"
      ],
      "categories": [
        "Supply Chain Attack",
        "Ransomware",
        "Threat Intelligence"
      ],
      "createdAt": "2025-11-07T15:00:00.000Z",
      "updatedAt": "2025-11-07T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "e8b71e81-c91a-40f3-b56e-4a356ec8dada",
      "slug": "amazon-patches-high-severity-flaw-in-workspaces-linux-client",
      "headline": "Amazon Patches High-Severity Flaw in WorkSpaces Linux Client",
      "title": "AWS Patches High-Severity Authentication Token Leak Vulnerability (CVE-2025-12779) in Amazon WorkSpaces for Linux",
      "severity": "high",
      "excerpt": "Amazon Web Services (AWS) has patched a high-severity vulnerability, CVE-2025-12779, in its WorkSpaces client for Linux. The flaw, rated 8.8 CVSS, could allow a local attacker on a shared computer to extract another user's authentication token and gain unauthorized access to their virtual desktop session. The issue affects Linux client versions 2023.0 through 2024.8. AWS has released a patched version and recommends all users upgrade immediately to mitigate the risk.",
      "tags": [
        "AWS",
        "Cloud Security",
        "Vulnerability",
        "CVE-2025-12779",
        "Linux",
        "Authentication"
      ],
      "categories": [
        "Vulnerability",
        "Cloud Security",
        "Patch Management"
      ],
      "createdAt": "2025-11-07T15:00:00.000Z",
      "updatedAt": "2025-11-07T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-12779"
      ],
      "cvssScore": 8.8,
      "isUpdate": false
    }
  ]
}