{
  "pub_id": "pub-2025-12-21",
  "headline": "Multiple Zero-Days Under Active Attack; Critical Flaws in Windows, SonicWall, and Web Frameworks Threaten Global Systems",
  "summary": "For the period ending December 21, 2025, the cybersecurity landscape is dominated by a surge in actively exploited critical vulnerabilities. Security teams are grappling with zero-days in Microsoft Windows, SonicWall, and WatchGuard appliances, all added to CISA's KEV catalog. A new CVSS 10.0 flaw dubbed 'React2Shell' is being used to compromise web applications globally. Major incidents also include a significant data breach at fintech vendor Marquis impacting over 400,000 bank customers, a sophisticated 'GhostPairing' account takeover attack on WhatsApp, and a ransomware strike on an Australian fertility clinic. These events highlight persistent threats from unpatched systems, supply chain weaknesses, and social engineering.",
  "pub_date": "2025-12-21",
  "total_articles": 6,
  "articles": [
    {
      "id": "7cab1cd3-fcfa-4f0c-b287-44edc184d138",
      "slug": "react2shell-critical-rce-flaw-under-mass-exploitation-by-state-actors-and-botnets",
      "headline": "React2Shell Apocalypse: CVSS 10.0 Flaw Exploited by China, North Korea, and Botnets",
      "title": "React2Shell: Critical RCE Vulnerability (CVE-2025-55182) Under Mass Exploitation by State Actors and Criminals",
      "severity": "critical",
      "excerpt": "A critical, unauthenticated remote code execution vulnerability (CVSS 10.0) in React Server Components, dubbed 'React2Shell' and tracked as CVE-2025-55182, is under widespread attack. The flaw allows attackers to take full control of vulnerable servers with a single crafted HTTP request. Within hours of disclosure, Chinese and North Korean state-sponsored groups, alongside criminal botnets, began mass exploitation campaigns. These attacks deploy a range of malware, including the new EtherRAT backdoor, Cobalt Strike, and infostealers. With over 165,000 vulnerable instances identified and half remaining unpatched, CISA has issued an emergency directive for federal agencies to mitigate the threat immediately, highlighting the extreme urgency for all affected organizations to apply patches.",
      "tags": [
        "React2Shell",
        "RCE",
        "Zero-Day",
        "Next.js",
        "Deserialization",
        "State-Sponsored",
        "Botnet"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Threat Actor"
      ],
      "createdAt": "2025-12-10T15:00:00.000Z",
      "updatedAt": "2025-12-21T00:00:00.000Z",
      "readingTime": 7,
      "cves": [
        "CVE-2025-55182"
      ],
      "cvssScore": 10,
      "isUpdate": true,
      "updateSummary": "New exploitation campaigns for React2Shell (CVE-2025-55182) observed, deploying XMRig crypto miners and COMPOOD backdoor, targeting SaaS/eCommerce in Australia.",
      "updateContent": "New intelligence indicates that threat actors are actively exploiting the React2Shell vulnerability (CVE-2025-55182) with new payloads. Campaigns are now deploying the XMRig cryptocurrency miner to hijack server resources and the 'COMPOOD' backdoor for persistent access. Initial targeting appears focused on vulnerable SaaS and eCommerce platforms, particularly within Australia. New cyber observables for detection include the 'xmrig' process, 'compood.so' file, and 'stratum+tcp://' network traffic, indicating a broader and evolving threat landscape for this critical RCE."
    },
    {
      "id": "b39aa585-74eb-4582-b7db-484c6bb8f937",
      "slug": "cisa-adds-actively-exploited-fortinet-sso-vulnerability-to-kev-catalog",
      "headline": "CISA Adds Actively Exploited Fortinet SSO Flaw to KEV Catalog, Urges Immediate Patching",
      "title": "CISA Warns of Active Exploitation of Critical Fortinet SSO Bypass Vulnerability (CVE-2025-59718)",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical Fortinet vulnerability, CVE-2025-59718, to its Known Exploited Vulnerabilities (KEV) catalog, indicating active attacks in the wild. The flaw, rated 9.1 CVSS, allows an unauthenticated attacker to bypass FortiCloud single sign-on (SSO) authentication on multiple products, including FortiOS and FortiProxy, by sending a crafted SAML message. Security firm Arctic Wolf observed attackers exploiting the flaw within days of its disclosure to export device configurations and harvest credentials. CISA has mandated that federal agencies patch by December 23, 2025, and strongly advises all organizations to apply updates or disable the feature immediately.",
      "tags": [
        "CISA",
        "KEV",
        "Fortinet",
        "CVE-2025-59718",
        "SSO",
        "Authentication Bypass",
        "FortiOS",
        "Vulnerability",
        "Patch Management"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2025-12-17T15:00:00.000Z",
      "updatedAt": "2025-12-21T12:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-59718",
        "CVE-2025-59719"
      ],
      "cvssScore": 9.1,
      "isUpdate": true,
      "updateSummary": "Fortinet SSO flaws (CVE-2025-59718, CVE-2025-59719) now rated CVSS 9.8, allowing full auth bypass. International agencies, including Australia and Pakistan, issue urgent patching alerts.",
      "updateContent": "The critical Fortinet SSO vulnerabilities, CVE-2025-59718 and CVE-2025-59719, are now both rated CVSS 9.8, an increase from the previously reported 9.1 for CVE-2025-59718. These flaws enable unauthenticated attackers to gain full administrative control. While CISA previously confirmed active exploitation, new alerts from the Australian Cyber Security Centre (ACSC) and Pakistan's National CERT underscore the continued urgency for immediate patching. Fortinet has also provided more specific fixed versions for products like FortiOS, and new detection methods have been identified, including log monitoring for unusual SSO logins and D3FEND techniques like User Geolocation Logon Pattern Analysis."
    },
    {
      "id": "3e7cd6de-9542-48bf-9e5a-9c6f52a76619",
      "slug": "australian-fertility-clinic-genea-hit-by-termite-ransomware-gang",
      "headline": "Australian Fertility Clinic Genea Hit by 'Termite' Ransomware Gang",
      "title": "'Termite' Ransomware Gang Claims Attack on Australian Fertility Clinic Genea, Steals 700GB of Patient Data",
      "severity": "high",
      "excerpt": "The 'Termite' ransomware gang has claimed responsibility for an attack on Australian fertility provider Genea. The group, which uses a variant of the leaked Babuk ransomware code, alleges it exfiltrated 700GB of highly sensitive patient data, including medical histories and diagnostic results. This double-extortion attack places victims at severe risk of fraud and personal extortion, highlighting the growing threat to the healthcare sector.",
      "tags": [
        "Termite",
        "Ransomware",
        "Data Breach",
        "Healthcare",
        "Australia",
        "Genea",
        "Babuk"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Threat Actor"
      ],
      "createdAt": "2025-12-21T15:00:00.000Z",
      "updatedAt": "2025-12-21T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "551b3080-e363-4995-ad02-5d2754be7abc",
      "slug": "sonicwall-sma-zero-day-cve-2025-40602-actively-exploited-in-chained-attack",
      "headline": "SonicWall Zero-Day Chained with Older Flaw for Full Device Takeover",
      "title": "Actively Exploited Zero-Day (CVE-2025-40602) in SonicWall SMA Appliances Chained with Older Flaw for Root Access",
      "severity": "critical",
      "excerpt": "A new zero-day vulnerability (CVE-2025-40602) in SonicWall SMA 100 and 1000 series appliances is being actively exploited in the wild. Threat actors are chaining this local privilege escalation flaw with a previously patched critical pre-authentication vulnerability (CVE-2025-23006) to achieve full, unauthenticated root access on the secure access devices. Administrators are urged to patch immediately.",
      "tags": [
        "Zero-Day",
        "SonicWall",
        "Vulnerability",
        "CVE-2025-40602",
        "CVE-2025-23006",
        "Exploit Chain",
        "Cyberattack"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Patch Management"
      ],
      "createdAt": "2025-12-21T15:00:00.000Z",
      "updatedAt": "2025-12-21T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-40602",
        "CVE-2025-23006"
      ],
      "cvssScore": 9.8,
      "isUpdate": false
    },
    {
      "id": "3aa38ec3-d8c0-4117-b173-9032d352826f",
      "slug": "trump-administration-drafting-new-national-cybersecurity-strategy-for-2026",
      "headline": "Trump Administration Preparing New 6-Pillar National Cybersecurity Strategy",
      "title": "Trump Administration Drafting New 6-Pillar National Cybersecurity Strategy for 2026 Release",
      "severity": "informational",
      "excerpt": "The Trump administration is reportedly preparing a new, concise national cybersecurity strategy for release in January 2026. According to reports, the five-page document is structured around six core pillars and may be accompanied by a new executive order to mandate its implementation across all U.S. federal agencies, aiming to address accelerating threats from nation-states and criminal groups.",
      "tags": [
        "Cybersecurity Strategy",
        "US Government",
        "Policy",
        "Executive Order",
        "National Security"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory"
      ],
      "createdAt": "2025-12-21T15:00:00.000Z",
      "updatedAt": "2025-12-21T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "bfcad67d-0eae-4042-8c1a-441ffbb800f3",
      "slug": "nsw-health-audit-reveals-widespread-bypass-of-cybersecurity-controls-by-clinicians",
      "headline": "Australian Health Audit Finds Clinicians Routinely Bypass Security Controls",
      "title": "NSW Health Audit Uncovers \"Normalisation of Non-Compliance\" with Cybersecurity Controls",
      "severity": "medium",
      "excerpt": "An audit of the New South Wales (NSW) healthcare system in Australia has revealed that clinicians are routinely bypassing critical cybersecurity controls, such as password sharing and using personal devices, to save time in high-pressure environments. This widespread \"normalisation of non-compliance\" creates significant security gaps and increases the risk of cyberattacks in the already heavily targeted healthcare sector, highlighting a critical failure in security culture.",
      "tags": [
        "Healthcare",
        "Compliance",
        "Insider Risk",
        "Password Sharing",
        "Security Culture",
        "Australia"
      ],
      "categories": [
        "Policy and Compliance",
        "Security Operations",
        "Threat Intelligence"
      ],
      "createdAt": "2025-12-21T15:00:00.000Z",
      "updatedAt": "2025-12-21T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}