{
  "pub_id": "pub-2026-02-08",
  "headline": "CISA Warns of Actively Exploited SmarterMail RCE Flaw; BridgePay Payment Gateway Crippled by Ransomware",
  "summary": "A critical, actively exploited RCE vulnerability (CVE-2026-24423) in SmarterMail has been added to CISA's KEV catalog, fueling ransomware attacks. Concurrently, a major ransomware incident has crippled the BridgePay payment gateway, causing nationwide outages for merchants. Other significant developments in the past 24 hours include CISA mandating the removal of unsupported edge devices from federal networks, attribution of a Notepad++ supply chain attack to a Chinese APT, and the discovery of a new EDR-killing malware that abuses a decade-old driver.",
  "pub_date": "2026-02-08",
  "total_articles": 7,
  "articles": [
    {
      "id": "73bddb72-c39f-4e62-ad68-68333acf90b9",
      "slug": "european-commission-proposes-revisions-to-strengthen-eu-cybersecurity-act",
      "headline": "EU Proposes Revised Cybersecurity Act to Bolster Supply Chain Security & ENISA's Role",
      "title": "European Commission Proposes Revisions to Strengthen EU Cybersecurity Act and NIS2 Directive",
      "severity": "informational",
      "excerpt": "The European Commission has introduced a new cybersecurity package that includes a proposal for a revised Cybersecurity Act (CSA) and targeted amendments to the NIS2 Directive. The initiative aims to strengthen the EU's collective resilience against cyber threats by establishing a framework for ICT supply chain security, promoting 'cyber-secure by design' principles through certification, and enhancing the role of ENISA, the EU's cybersecurity agency. The amendments to NIS2 seek to clarify rules on jurisdiction and streamline ransomware incident data collection. Once adopted, member states will have one year to transpose the new provisions into national law.",
      "tags": [
        "EU",
        "Cybersecurity Act",
        "NIS2",
        "regulation",
        "compliance",
        "ENISA",
        "supply chain"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Supply Chain Attack"
      ],
      "createdAt": "2026-01-28T15:00:00.000Z",
      "updatedAt": "2026-02-08T00:00:00.000Z",
      "readingTime": 4,
      "isUpdate": true,
      "updateSummary": "EU's revised Cybersecurity Act and NIS2 are part of a global trend towards stricter cyber regulations, with DORA enforcement intensifying.",
      "updateContent": "The EU's proposed revised Cybersecurity Act (referred to as CSA2) and NIS2 Directive amendments are now seen within a global push for stricter cyber regulations. This includes Hong Kong's planned mandatory data breach reporting and new US rules for critical infrastructure and public companies. Enforcement of NIS2 and the Digital Operational Resilience Act (DORA) is intensifying, compelling financial services and critical sector organizations to adopt more dynamic incident response frameworks and standardized reporting, highlighting a broader regulatory shift towards greater accountability and transparency."
    },
    {
      "id": "fbdcd455-e997-4744-b3c4-8dbbfe19843b",
      "slug": "cisa-warns-of-actively-exploited-smartermail-rce-in-ransomware-attacks",
      "headline": "CISA Adds Critical SmarterMail RCE Flaw to KEV Catalog Amid Active Ransomware Attacks",
      "title": "CISA Mandates Patch for Actively Exploited SmarterMail RCE Vulnerability (CVE-2026-24423) Used in Ransomware Campaigns",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical remote code execution (RCE) vulnerability in SmarterTools' SmarterMail, CVE-2026-24423, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, which allows for unauthenticated RCE, is being actively weaponized by ransomware operators. The vulnerability stems from a missing authentication check in an API endpoint, enabling attackers to execute arbitrary commands on vulnerable email servers. CISA has directed all federal agencies to apply patches by February 26, 2026, and strongly urges all organizations using the affected software to update immediately to mitigate the significant risk of compromise.",
      "tags": [
        "RCE",
        "Unauthenticated",
        "KEV",
        "Email Server",
        "API Security",
        "CWE-306"
      ],
      "categories": [
        "Vulnerability",
        "Ransomware",
        "Patch Management"
      ],
      "createdAt": "2026-02-07T15:00:00.000Z",
      "updatedAt": "2026-02-08T00:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2026-24423",
        "CVE-2025-52691",
        "CVE-2026-23760"
      ],
      "cvssScore": 9.8,
      "isUpdate": true,
      "updateSummary": "New details for SmarterMail RCE (CVE-2026-24423) include CVSS 9.3 score, clarification of API endpoint, and impact on 15M users.",
      "updateContent": "Further analysis of the critical SmarterMail RCE (CVE-2026-24423) reveals a CVSS score of 9.3, underscoring its severe impact. The vulnerability, actively exploited by ransomware groups, affects an estimated 15 million users globally, often managed by MSPs and hosting providers. The specific vulnerable API endpoint is clarified as `/api/v1/settings/connect-to-hub`, allowing unauthenticated attackers to execute arbitrary commands. Organizations are urged to update to build 9511 or later immediately to mitigate the high risk of compromise and data exfiltration."
    },
    {
      "id": "164806c1-2a46-4040-9003-a4729fe50638",
      "slug": "ransomware-attack-cripples-bridgepay-payment-gateway-causing-nationwide-outages",
      "headline": "Nationwide Outage: BridgePay Payment Gateway Confirms Ransomware Attack Crippled Production Systems",
      "title": "BridgePay Confirms Ransomware Attack Responsible for Crippling Nationwide Payment Gateway Outage",
      "severity": "critical",
      "excerpt": "U.S. payment gateway provider BridgePay Network Solutions has confirmed a ransomware attack was the cause of a massive service outage that began on February 6, 2026. The attack took down numerous production systems, including the BridgePay Gateway API, virtual terminals, and hosted payment pages, disrupting credit and debit card processing for merchants across the United States in sectors like retail, hospitality, and government. Many businesses were forced to revert to cash-only operations. BridgePay has engaged the FBI and U.S. Secret Service. While the company states that an initial investigation suggests no usable payment card data was exposed due to encryption, a timeline for full service restoration has not been provided, and the process is expected to be lengthy.",
      "tags": [
        "Ransomware",
        "BridgePay",
        "Payment Gateway",
        "Cyberattack",
        "Outage",
        "Financial Services"
      ],
      "categories": [
        "Ransomware",
        "Cyberattack",
        "Data Breach"
      ],
      "createdAt": "2026-02-08T15:00:00.000Z",
      "updatedAt": "2026-02-08T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "8a2591cf-b8e0-4b7c-9fdf-666444a34a14",
      "slug": "attackers-weaponize-decade-old-encase-driver-to-terminate-edr-products",
      "headline": "EDR-Killer Malware Weaponizes Decade-Old EnCase Driver in BYOVD Attacks",
      "title": "Attackers Abuse Revoked EnCase Driver ('EnPortv.sys') in BYOVD Attack to Disable EDR and Deploy Ransomware",
      "severity": "high",
      "excerpt": "Threat actors are using a new EDR-killing malware that leverages a 'Bring Your Own Vulnerable Driver' (BYOVD) technique to disable endpoint security products. Researchers at Huntress discovered the malware during an intrusion that began with compromised SonicWall SSL VPN credentials. The attackers abuse `EnPortv.sys`, a legitimate but long-revoked kernel driver from Guidance Software's EnCase forensic toolkit. Despite its certificate being revoked in 2010, a gap in Windows' driver signature enforcement allows it to be loaded, granting the attackers kernel-level privileges. The malware uses these privileges to terminate 59 different processes associated with major EDR vendors like CrowdStrike, SentinelOne, and Microsoft, clearing the way for ransomware deployment.",
      "tags": [
        "BYOVD",
        "EDR",
        "Malware",
        "Ransomware",
        "EnCase",
        "EnPortv.sys",
        "Huntress",
        "Defense Evasion"
      ],
      "categories": [
        "Malware",
        "Ransomware",
        "Threat Actor"
      ],
      "createdAt": "2026-02-08T15:00:00.000Z",
      "updatedAt": "2026-02-08T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "5d1763f0-dff2-492b-9d20-28dcdc2beaf6",
      "slug": "us-finalizes-rules-to-ban-chinese-and-russian-tech-from-connected-vehicles",
      "headline": "U.S. Finalizes Ban on Chinese and Russian Tech in Connected Vehicles, Forcing Massive Supply Chain Overhaul",
      "title": "U.S. Finalizes Regulations Banning Chinese and Russian Technology from Connected Vehicles Starting with 2027 Models",
      "severity": "medium",
      "excerpt": "The United States has finalized new regulations from the Commerce Department that will ban hardware and software from China and Russia in connected vehicles sold in the U.S. The rules are designed to mitigate national security risks, preventing foreign adversaries from collecting sensitive data or manipulating vehicle functions. The ban will be phased in, starting with software for the 2027 model year and extending to hardware by 2029. The auto industry is facing what is being called 'one of the most consequential and complex auto regulations in decades,' forcing a massive and difficult overhaul of their deeply embedded global software and hardware supply chains.",
      "tags": [
        "Policy",
        "Regulation",
        "Automotive",
        "Connected Vehicle",
        "Supply Chain",
        "National Security",
        "China",
        "Russia"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Supply Chain Attack"
      ],
      "createdAt": "2026-02-08T15:00:00.000Z",
      "updatedAt": "2026-02-08T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "c0998c73-3f14-4762-871b-181b6343ceeb",
      "slug": "european-commission-contains-cyberattack-on-mobile-device-management-system",
      "headline": "European Commission Contains Cyberattack on its Mobile Device Management (MDM) System",
      "title": "European Commission Responds to Cyberattack on Central Mobile Device Management Infrastructure",
      "severity": "medium",
      "excerpt": "The European Commission disclosed on February 5, 2026, that it had identified and contained a cyberattack against its central infrastructure for managing mobile devices. The attack, detected on January 30, was reportedly contained and the system cleaned within nine hours. The Commission stated that the incident may have resulted in unauthorized access to some staff names and mobile numbers, but there is no evidence that any mobile devices themselves were compromised. The incident comes shortly after the Commission proposed a new, comprehensive cybersecurity package (CSA2) to strengthen security across the EU.",
      "tags": [
        "European Commission",
        "Cyberattack",
        "MDM",
        "Mobile Security",
        "Incident Response",
        "CERT-EU"
      ],
      "categories": [
        "Cyberattack",
        "Incident Response",
        "Mobile Security"
      ],
      "createdAt": "2026-02-08T15:00:00.000Z",
      "updatedAt": "2026-02-08T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    },
    {
      "id": "b7dfaa7a-7ecf-4078-825e-922a799af82a",
      "slug": "malicious-clawdbot-agent-in-vs-code-marketplace-deployed-rat-malware",
      "headline": "Malicious VS Code Extension 'ClawdBot Agent' Deployed ScreenConnect RAT via Marketplace",
      "title": "Fake 'ClawdBot Agent' Extension in Visual Studio Code Marketplace Deployed RAT Malware",
      "severity": "high",
      "excerpt": "A malicious extension named 'ClawdBot Agent' was discovered in the official Visual Studio Code Marketplace, impersonating a popular AI coding assistant to trick developers. The trojanized extension was fully functional, helping it evade suspicion while its malicious payload executed in the background upon VS Code launch. The attack chain fetched a remote configuration file that initiated the deployment of a weaponized version of the legitimate remote support tool, ConnectWise ScreenConnect, effectively turning it into a Remote Access Tool (RAT). This gave attackers full remote control over compromised developer machines. The extension was quickly removed by Microsoft, but the incident highlights the growing risk of supply chain attacks targeting developer ecosystems.",
      "tags": [
        "Supply Chain Attack",
        "VS Code",
        "Malware",
        "RAT",
        "ScreenConnect",
        "Developer Security"
      ],
      "categories": [
        "Supply Chain Attack",
        "Malware",
        "Cloud Security"
      ],
      "createdAt": "2026-02-08T15:00:00.000Z",
      "updatedAt": "2026-02-08T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}