{
  "pub_id": "pub-2025-12-11",
  "headline": "Microsoft Patches Actively Exploited Zero-Day as Gogs Git Service Reels from Unpatched Flaw",
  "summary": "In cybersecurity news for December 11, 2025, Microsoft issued its final Patch Tuesday of the year, addressing an actively exploited privilege escalation zero-day (CVE-2025-62221) in Windows. Concurrently, an unpatched zero-day (CVE-2025-8110) in the Gogs Git service is under active attack, compromising hundreds of instances. New malware threats emerged with 'DroidLock' targeting Android devices and the 'AshTag' suite used by the Ashen Lepus APT against Middle Eastern governments. Other significant developments include new vulnerabilities in React, sophisticated social engineering tactics detailed by HP, and an espionage campaign, 'Operation DupeHike,' targeting Russian corporations.",
  "pub_date": "2025-12-11",
  "total_articles": 8,
  "articles": [
    {
      "id": "fe71cd66-b93a-41f7-80af-d41dffd07243",
      "slug": "critical-react2shell-rce-vulnerability-in-react-and-nextjs-sparks-emergency-patching",
      "headline": "React2Shell: Critical 10.0 CVSS RCE Flaw in React and Next.js Under Active Exploitation",
      "title": "Critical 'React2Shell' RCE Vulnerability (CVE-2025-55182) in React Server Components Sparks Widespread Emergency Patching",
      "severity": "critical",
      "excerpt": "A critical, unauthenticated remote code execution (RCE) vulnerability, dubbed 'React2Shell' (CVE-2025-55182), has been disclosed in React Server Components, affecting popular frameworks like Next.js. With a maximum CVSS score of 10.0, the flaw allows attackers to compromise servers with a single crafted HTTP request, requiring no user interaction. The vulnerability stems from an unsafe deserialization process in the 'Flight' protocol. Following the public disclosure on December 3, 2025, multiple weaponized proofs-of-concept became available, and active exploitation attempts by threat actors, including China-nexus groups, were observed. CISA has added CVE-2025-55182 to its Known Exploited Vulnerabilities (KEV) catalog, mandating immediate patching for federal agencies and urging all organizations to update affected components.",
      "tags": [
        "RCE",
        "React",
        "Next.js",
        "CVE-2025-55182",
        "KEV",
        "Zero-Day",
        "Deserialization",
        "Web Security"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Threat Intelligence"
      ],
      "createdAt": "2025-12-04T15:00:00.000Z",
      "updatedAt": "2025-12-11T00:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-55182",
        "CVE-2025-66478"
      ],
      "cvssScore": 10,
      "isUpdate": true,
      "updateSummary": "New DoS and source code leak flaws discovered in React Server Components, requiring immediate re-patching for users who addressed React2Shell.",
      "updateContent": "Following the critical React2Shell RCE, two additional vulnerabilities have been disclosed in React Server Components. These include a high-severity Denial of Service (CVE-2025-55184, CVE-2025-67779) allowing attackers to trigger infinite loops and consume server resources, and a medium-severity Source Code Exposure (CVE-2025-55183) that could leak sensitive application data. These flaws affect the same `react-server-dom-*` packages and require immediate updates to versions 19.0.3, 19.1.4, 19.2.3 or later, even for systems already patched against React2Shell. While no active exploitation is reported yet, the discovery of these new issues further complicates the security landscape for React Server Component users."
    },
    {
      "id": "93bffa10-18b8-4f5f-8f8b-30c3aefd5e5d",
      "slug": "nato-tests-cyber-defenses-in-large-scale-cyber-coalition-exercise",
      "headline": "NATO Sharpens Cyber Defenses in Massive \"Cyber Coalition\" War Game",
      "title": "NATO's \"Cyber Coalition\" Exercise Simulates Hybrid Attacks on Critical Infrastructure",
      "severity": "informational",
      "excerpt": "NATO has successfully concluded its largest annual cyber defense exercise, \"Cyber Coalition,\" in Tallinn, Estonia. The week-long event involved approximately 1,500 military and civilian personnel from 29 NATO members and seven partner nations. Participants collaborated to defend a fictional nation's critical infrastructure against a series of realistic, hybrid cyberattacks, enhancing their collective ability to respond to modern threats.",
      "tags": [
        "NATO",
        "Cyber Exercise",
        "Cyber Coalition",
        "Hybrid Warfare",
        "Critical Infrastructure",
        "Estonia"
      ],
      "categories": [
        "Security Operations",
        "Policy and Compliance",
        "Industrial Control Systems"
      ],
      "createdAt": "2025-12-11T15:00:00.000Z",
      "updatedAt": "2025-12-11T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "feb6d0de-a8a8-49e1-b238-67ccbe981ab3",
      "slug": "report-reveals-critical-lack-of-ot-cybersecurity-training",
      "headline": "Critical Infrastructure at Risk Due to \"Deficient\" OT Cybersecurity Training",
      "title": "Secolve Report Finds OT Cybersecurity Training is \"Infrequent, Weak, and Generic\" in Critical Sectors",
      "severity": "medium",
      "excerpt": "A new report from Australian cybersecurity firm Secolve has exposed significant deficiencies in operational technology (OT) cybersecurity training across critical infrastructure sectors. The survey of senior professionals in industries like energy, manufacturing, and water found that training is often generic, infrequent, or completely ignored. This lack of specialized training is creating a dangerously immature security culture and leaving vital industrial environments unprepared for cyberattacks.",
      "tags": [
        "OT Security",
        "ICS",
        "Cybersecurity Training",
        "Critical Infrastructure",
        "Australia",
        "Report"
      ],
      "categories": [
        "Industrial Control Systems",
        "Policy and Compliance",
        "Security Operations"
      ],
      "createdAt": "2025-12-11T15:00:00.000Z",
      "updatedAt": "2025-12-11T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "3618ea27-26c5-4b70-b35d-e92a651eac40",
      "slug": "hp-report-cybercriminals-using-sophisticated-social-engineering-lures",
      "headline": "Hackers Use Animated Lures and Fake Legal Warnings to Spread Malware",
      "title": "HP Report: Cybercriminals Evolve Social Engineering with Animated Lures and Abuse of Trusted Platforms like Discord",
      "severity": "high",
      "excerpt": "HP's latest Threat Insights Report reveals a significant evolution in social engineering tactics, with cybercriminals using highly convincing lures such as professional animations and fake legal warnings to trick users into downloading malware. The report highlights a campaign impersonating the Colombian Prosecutor's Office to deliver PureRAT. It also details the abuse of trusted platforms like Discord for hosting malicious payloads like the Phantom Stealer and notes the rising threat of session cookie hijacking.",
      "tags": [
        "Social Engineering",
        "Phishing",
        "PureRAT",
        "Phantom Stealer",
        "InfoStealer",
        "HP",
        "Threat Intelligence"
      ],
      "categories": [
        "Phishing",
        "Malware",
        "Threat Intelligence"
      ],
      "createdAt": "2025-12-11T15:00:00.000Z",
      "updatedAt": "2025-12-11T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "ec699b2c-28c5-426e-86a8-fc0b56b4c745",
      "slug": "hamas-affiliated-apt-ashen-lepus-deploys-new-ashtag-malware",
      "headline": "Hamas-Linked APT \"Ashen Lepus\" Targets Middle East with New \"AshTag\" Malware",
      "title": "Ashen Lepus (WIRTE) APT Group Deploys New Modular \"AshTag\" Malware in Espionage Campaign Against Middle Eastern Governments",
      "severity": "high",
      "excerpt": "The Hamas-affiliated advanced persistent threat (APT) group known as Ashen Lepus (or WIRTE) is conducting an ongoing espionage campaign targeting governmental and diplomatic entities in the Middle East. Researchers have identified a new, modular .NET malware suite named AshTag being used in these attacks. The campaign marks a significant evolution in the group's sophistication, incorporating enhanced encryption, in-memory payload execution, and the use of legitimate-looking subdomains to evade detection.",
      "tags": [
        "Ashen Lepus",
        "WIRTE",
        "AshTag",
        "APT",
        "Cyber Espionage",
        "Middle East",
        "Malware"
      ],
      "categories": [
        "Threat Actor",
        "Malware",
        "Cyberattack"
      ],
      "createdAt": "2025-12-11T15:00:00.000Z",
      "updatedAt": "2025-12-11T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "370364f2-fff3-4fb6-bf79-25a6b663854b",
      "slug": "operation-dupehike-cyber-espionage-campaign-targets-russian-companies",
      "headline": "\"Operation DupeHike\" Espionage Campaign Targets Russian Corporate HR Depts",
      "title": "New Cyber-Espionage Campaign \"Operation DupeHike\" Targets Russian Corporations with Sophisticated Social Engineering",
      "severity": "high",
      "excerpt": "A highly targeted cyber-espionage campaign, dubbed \"Operation DupeHike,\" has been identified targeting employees in Russian corporations. Attributed to the threat actor cluster UNG0902, the campaign uses convincing social engineering lures, such as decoy documents about employee bonuses, to infiltrate networks. The primary targets are staff in HR, payroll, and administrative departments, with the goal of achieving persistent surveillance and exfiltrating sensitive corporate data.",
      "tags": [
        "Operation DupeHike",
        "UNG0902",
        "Cyber Espionage",
        "Russia",
        "APT",
        "Phishing"
      ],
      "categories": [
        "Threat Actor",
        "Phishing",
        "Cyberattack"
      ],
      "createdAt": "2025-12-11T15:00:00.000Z",
      "updatedAt": "2025-12-11T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "7931af66-7782-4bab-89a5-92513d78838d",
      "slug": "unpatched-gogs-git-service-zero-day-cve-2025-8110-actively-exploited",
      "headline": "Unpatched Zero-Day in Gogs Git Service Actively Exploited to Gain SSH Access",
      "title": "Active Exploitation of Unpatched Gogs Zero-Day (CVE-2025-8110) Compromises Over 700 Instances",
      "severity": "critical",
      "excerpt": "A critical, unpatched zero-day vulnerability in Gogs, a popular self-hosted Git service, is being actively exploited in the wild. Tracked as CVE-2025-8110 with a CVSS score of 8.7, the flaw is a bypass of a previously patched RCE and allows an attacker to overwrite arbitrary files, ultimately leading to SSH access on the server. Researchers at Wiz have identified over 700 compromised instances, with attackers deploying the Supershell C2 framework.",
      "tags": [
        "Gogs",
        "Zero-Day",
        "Vulnerability",
        "RCE",
        "Supershell",
        "Git",
        "Supply Chain"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack",
        "Cloud Security"
      ],
      "createdAt": "2025-12-11T15:00:00.000Z",
      "updatedAt": "2025-12-11T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2025-8110",
        "CVE-2024-55947"
      ],
      "cvssScore": 8.7,
      "isUpdate": false
    },
    {
      "id": "73047f9e-24c7-4e37-8616-fc6bd387a180",
      "slug": "fake-movie-torrent-spreads-agent-tesla-malware",
      "headline": "Fake Leonardo DiCaprio Movie Torrent Used as Bait to Spread Agent Tesla Trojan",
      "title": "Bitdefender Uncovers Campaign Distributing Agent Tesla Info-Stealer via Fake Movie Torrent",
      "severity": "high",
      "excerpt": "Cybercriminals are luring victims with a fake torrent for a new Leonardo DiCaprio movie to distribute the Agent Tesla information-stealing trojan. Security researchers at Bitdefender analyzed the campaign, revealing a complex, multi-stage attack chain that uses a malicious .lnk shortcut, hidden batch commands in subtitle files, and multiple layers of PowerShell to execute the final payload. The malware runs only in memory and establishes persistence through a fake audio diagnostic task, making it highly evasive.",
      "tags": [
        "Agent Tesla",
        "Malware",
        "Torrent",
        "InfoStealer",
        "Phishing",
        "PowerShell"
      ],
      "categories": [
        "Malware",
        "Phishing"
      ],
      "createdAt": "2025-12-11T15:00:00.000Z",
      "updatedAt": "2025-12-11T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}