{
  "pub_id": "pub-2025-12-14",
  "headline": "Apple Patches Actively Exploited Zero-Days; CISA Warns of Critical Router Flaw Amidst Ransomware Surge",
  "summary": "In the period covering December 13-14, 2025, the cybersecurity landscape was dominated by critical vulnerability disclosures and active exploitation campaigns. Apple released an emergency patch for two zero-day flaws in iOS being used in targeted spyware attacks. CISA added a high-severity RCE vulnerability in Sierra Wireless routers to its KEV catalog. Meanwhile, ransomware groups KillSec and Qilin continued their global extortion campaigns, and several major data breaches came to light, including a massive 16TB database exposing 4.3 billion records and a breach at Canadian airline WestJet affecting 1.2 million passengers.",
  "pub_date": "2025-12-14",
  "total_articles": 8,
  "articles": [
    {
      "id": "9d2f19c4-5c5e-4e40-8d57-8d21214e532f",
      "slug": "qilin-ransomware-group-claims-b-dynamic-as-new-victim",
      "headline": "Qilin Ransomware Gang Adds Business Services Firm B Dynamic to Leak Site",
      "title": "Qilin Ransomware Group Claims B Dynamic as New Victim in Ongoing Double-Extortion Campaign",
      "severity": "high",
      "excerpt": "The Qilin ransomware group, a prominent ransomware-as-a-service (RaaS) operation, has listed business services company 'B Dynamic' as its latest victim on its dark web data leak site. The December 1, 2025, posting indicates that the company has suffered a network compromise and data exfiltration. By publicizing the breach, the Qilin group is employing its standard double-extortion tactic to pressure the victim into paying a ransom to prevent the public release of stolen data. This incident highlights the persistent threat from established ransomware gangs.",
      "tags": [
        "Ransomware",
        "Qilin",
        "RaaS",
        "Double Extortion",
        "Dark Web"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2025-12-01T15:00:00.000Z",
      "updatedAt": "2025-12-14T00:00:00.000Z",
      "readingTime": 5,
      "isUpdate": true,
      "updateSummary": "Qilin ransomware claims multiple new victims including Vlp Hellas, Nepes, Spitzer Auto Group, and Dan Technologies, expanding its global campaign.",
      "updateContent": "The Qilin ransomware group, also known as Agenda, has significantly expanded its global campaign, claiming multiple new victims since December 1st. On December 14, 2025, Vlp Hellas, a Greek business services firm, was added to their leak site. This follows claims against Nepes (South Korea), Spitzer Auto Group (U.S.), and Dan Technologies (Denmark) on December 13. The group continues to employ double-extortion tactics, with updated TTPs including abusing legitimate remote access and backup tools, using PowerShell for execution, and exfiltrating data to cloud storage services (T1537) before encryption. This demonstrates Qilin's high operational tempo and broad targeting across diverse sectors."
    },
    {
      "id": "4f086543-f756-4b28-b92e-775821aecd4c",
      "slug": "apple-patches-two-actively-exploited-zero-days-in-ios-26-2",
      "headline": "Apple Rushes iOS 26.2 Update to Patch Two Actively Exploited Zero-Days",
      "title": "Apple Issues Emergency iOS 26.2 Update to Fix Two Zero-Day Flaws Used in Targeted Spyware Attacks",
      "severity": "critical",
      "excerpt": "Apple has released an emergency security update, iOS 26.2 and iPadOS 26.2, to address 26 vulnerabilities. Among these are two critical zero-day flaws, CVE-2025-43529 and CVE-2025-14174, both residing in the WebKit browser engine. The company confirmed reports that these vulnerabilities have been actively exploited in sophisticated, targeted spyware campaigns, potentially allowing attackers to execute arbitrary code on unpatched devices. The update also patches a severe kernel vulnerability, CVE-2025-46285, that could grant an attacker root privileges. All iPhone and iPad users are urged to update their devices immediately.",
      "tags": [
        "zero-day",
        "iOS",
        "WebKit",
        "spyware",
        "RCE",
        "privilege escalation",
        "patch"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Mobile Security"
      ],
      "createdAt": "2025-12-14T15:00:00.000Z",
      "updatedAt": "2025-12-14T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-43529",
        "CVE-2025-14174",
        "CVE-2025-46285"
      ],
      "isUpdate": false
    },
    {
      "id": "b0c47cf9-8fd5-4dfc-8231-dd6d3dca2acf",
      "slug": "cisa-warns-of-actively-exploited-flaw-in-sierra-wireless-routers",
      "headline": "CISA KEV Alert: Actively Exploited RCE Flaw in Sierra Wireless Routers",
      "title": "CISA Adds High-Severity Sierra Wireless Router Vulnerability (CVE-2018-4063) to KEV Catalog",
      "severity": "critical",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a critical vulnerability in Sierra Wireless AirLink routers, CVE-2018-4063, to its Known Exploited Vulnerabilities (KEV) catalog. The flaw, which has a CVSS score as high as 9.9, is an unrestricted file upload vulnerability that allows an authenticated attacker to achieve remote code execution (RCE). Due to evidence of active exploitation, CISA has mandated that all Federal Civilian Executive Branch (FCEB) agencies patch the vulnerability by a specified deadline, highlighting the severe risk it poses to network infrastructure.",
      "tags": [
        "CISA",
        "KEV",
        "RCE",
        "Sierra Wireless",
        "router",
        "vulnerability",
        "critical infrastructure"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Industrial Control Systems"
      ],
      "createdAt": "2025-12-14T15:00:00.000Z",
      "updatedAt": "2025-12-14T15:00:00.000Z",
      "readingTime": 4,
      "cves": [
        "CVE-2018-4063"
      ],
      "cvssScore": 9.9,
      "isUpdate": false
    },
    {
      "id": "2238b763-9864-46af-82a4-c13eda6b8603",
      "slug": "germany-summons-russian-ambassador-over-air-traffic-control-hack-allegations",
      "headline": "Germany Summons Russian Ambassador Over Suspected Air Traffic Control Cyberattack",
      "title": "Germany Demands Answers from Russia Over Suspected Cyberattack on Air Traffic Control Systems",
      "severity": "high",
      "excerpt": "In a significant diplomatic escalation, the German government has summoned the Russian Ambassador to Berlin following allegations of a cyberattack targeting the nation's air traffic control (ATC) systems. The incident, reported on December 13, 2025, has raised grave concerns about the security of Germany's critical national infrastructure and points towards a potential act of state-sponsored cyber-espionage or disruption. While technical details remain undisclosed, the move underscores the high stakes of cyber hostilities between Western nations and Russia.",
      "tags": [
        "geopolitics",
        "cyber warfare",
        "state-sponsored",
        "Germany",
        "Russia",
        "air traffic control",
        "critical infrastructure"
      ],
      "categories": [
        "Cyberattack",
        "Threat Actor",
        "Industrial Control Systems"
      ],
      "createdAt": "2025-12-14T15:00:00.000Z",
      "updatedAt": "2025-12-14T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "e5e5b8b4-49c1-409b-b847-8df2d895d2c5",
      "slug": "killsec-ransomware-group-attacks-daba-finance",
      "headline": "KillSec Ransomware Hits U.S. Financial Firm Daba Finance in Data Extortion Attack",
      "title": "KillSec Ransomware Group Claims Cyberattack on U.S.-Based Daba Finance",
      "severity": "high",
      "excerpt": "The ransomware group known as KillSec has claimed responsibility for a cyberattack against Daba Finance Inc., a financial services company in the United States. On December 14, 2025, the group listed the company on its data leak site, employing a double-extortion tactic by threatening to release sensitive stolen data if a ransom is not paid. This incident underscores the persistent threat that data extortion gangs pose to the financial sector, which remains a high-value target due to the sensitive customer and corporate information it handles.",
      "tags": [
        "ransomware",
        "data extortion",
        "KillSec",
        "Daba Finance",
        "financial services",
        "data breach"
      ],
      "categories": [
        "Ransomware",
        "Data Breach",
        "Threat Actor"
      ],
      "createdAt": "2025-12-14T15:00:00.000Z",
      "updatedAt": "2025-12-14T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "1d9d1d65-b4b7-4c07-a592-91dc8134f06a",
      "slug": "westjet-discloses-data-breach-affecting-1-2-million-customers",
      "headline": "WestJet Data Breach Exposes Info of 1.2 Million Passengers; Scattered Spider Suspected",
      "title": "WestJet Discloses Data Breach Affecting 1.2 Million Customers, Potentially Linked to Scattered Spider",
      "severity": "high",
      "excerpt": "Canadian airline WestJet has disclosed a significant data breach that occurred in June 2025, impacting approximately 1.2 million passengers. The compromised data includes sensitive personal information such as names, contact details, and travel documentation. While investigations are ongoing, some reports suggest the notorious Scattered Spider hacking group, known for its social engineering prowess, may be behind the attack. The breach poses a serious risk of identity theft and fraud for the affected customers.",
      "tags": [
        "data breach",
        "WestJet",
        "Scattered Spider",
        "aviation",
        "PII",
        "social engineering"
      ],
      "categories": [
        "Data Breach",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2025-12-14T15:00:00.000Z",
      "updatedAt": "2025-12-14T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "6ea09876-4e8a-4a0f-97b4-78eccf864bc5",
      "slug": "norwegian-news-agency-ntb-suffers-major-data-breach",
      "headline": "\"Catastrophic\" Data Breach at Norwegian News Agency NTB Exposes Customer Data",
      "title": "Norwegian News Agency NTB Hit by \"Catastrophic\" Data Breach",
      "severity": "high",
      "excerpt": "NTB (Norsk Telegrambyrå), Norway's leading news and content provider, has disclosed what it calls a \"catastrophic\" data breach that occurred in early December 2025. The company announced on December 13 that attackers exploited vulnerabilities in its systems to gain unauthorized access to its customer database, exposing sensitive personal information, detailed customer profiles, and internal communications for thousands of users. NTB is now undertaking a major overhaul of its security infrastructure in response.",
      "tags": [
        "data breach",
        "NTB",
        "Norway",
        "media",
        "vulnerability",
        "GDPR"
      ],
      "categories": [
        "Data Breach",
        "Cyberattack",
        "Vulnerability"
      ],
      "createdAt": "2025-12-14T15:00:00.000Z",
      "updatedAt": "2025-12-14T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    },
    {
      "id": "f16a7cbf-0b66-4b2e-b9f5-7810855de29e",
      "slug": "eswatini-cybersecurity-crisis-amidst-government-inaction",
      "headline": "Eswatini Faces Cybersecurity Crisis as Government Fails to Act on Rising Threats",
      "title": "Report Highlights Growing Cybersecurity Crisis in Eswatini Due to Government Inaction",
      "severity": "medium",
      "excerpt": "A report published on December 13, 2025, reveals a deepening cybersecurity crisis in the Kingdom of Eswatini. The nation is experiencing a significant increase in cyberattacks targeting citizens, businesses, and government bodies. This surge is compounded by a lack of effective government response, characterized by outdated laws, minimal funding for cybersecurity initiatives, a severe shortage of skilled personnel, and a failure to implement its own national cybersecurity strategy. As a result, the country's digital infrastructure remains highly vulnerable to escalating threats.",
      "tags": [
        "Eswatini",
        "cybersecurity policy",
        "governance",
        "national security",
        "cybercrime"
      ],
      "categories": [
        "Policy and Compliance",
        "Regulatory",
        "Other"
      ],
      "createdAt": "2025-12-14T15:00:00.000Z",
      "updatedAt": "2025-12-14T15:00:00.000Z",
      "readingTime": 3,
      "isUpdate": false
    }
  ]
}