{
  "pub_id": "pub-2025-11-20",
  "headline": "CISA Mandates Urgent Patching for Actively Exploited Fortinet, Chrome, and Windows Zero-Days",
  "summary": "This cybersecurity brief for November 20, 2025, covers a series of critical zero-day vulnerabilities under active exploitation, prompting emergency directives from CISA. Key advisories include a Fortinet FortiWeb command injection flaw (CVE-2025-58034), a Windows Kernel privilege escalation bug (CVE-2025-62215), and a Google Chrome RCE vulnerability (CVE-2025-13223), all added to the KEV catalog. Additionally, this report details ransomware attacks by the 'sinobi' and 'Inc Ransom' groups, new CISA guidance on bulletproof hosting and drone threats, and research on the surge in AI-driven cyberattacks and a new macOS infostealer.",
  "pub_date": "2025-11-20",
  "total_articles": 6,
  "articles": [
    {
      "id": "815dbf5f-459d-4979-b189-ce8c9d974fb6",
      "slug": "cisa-mandates-7-day-patch-for-actively-exploited-fortinet-fortiweb-zero-day-cve-2025-58034",
      "headline": "URGENT: CISA Orders 7-Day Patch for Actively Exploited FortiWeb Zero-Day",
      "title": "Fortinet Discloses Critical FortiWeb Zero-Day (CVE-2025-58034) Under Active Attack; CISA Issues Emergency Directive",
      "severity": "critical",
      "excerpt": "Fortinet has disclosed a critical OS command injection zero-day vulnerability, CVE-2025-58034, in its FortiWeb Web Application Firewall (WAF) that is being actively exploited in the wild. The flaw allows an authenticated attacker to execute arbitrary commands on the underlying system. In response to observed attacks, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added the vulnerability to its Known Exploited Vulnerabilities (KEV) catalog and issued an emergency directive mandating federal agencies apply patches within an accelerated seven-day window, by November 25, 2025. Researchers have detected approximately 2,000 attacks leveraging the flaw and warn it could potentially be chained with a recently disclosed authentication bypass vulnerability (CVE-2025-64446) to achieve unauthenticated remote code execution.",
      "tags": [
        "Zero-Day",
        "WAF",
        "Command Injection",
        "CISA",
        "KEV",
        "Fortinet",
        "FortiWeb"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Cyberattack"
      ],
      "createdAt": "2025-11-20T15:00:00.000Z",
      "updatedAt": "2025-11-20T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-58034",
        "CVE-2025-64446"
      ],
      "isUpdate": false
    },
    {
      "id": "7e99c327-7152-47c0-928c-cc3bff8424ab",
      "slug": "sinobi-ransomware-group-attacks-us-manufacturer-croft-and-indian-tech-firm-changepond",
      "headline": "Sinobi Ransomware Strikes US Manufacturer and Indian Tech Firm",
      "title": "'Sinobi' Ransomware Group Claims Attacks on US Manufacturer Croft and Indian Tech Company CHANGEPOND",
      "severity": "high",
      "excerpt": "The 'sinobi' ransomware group has claimed responsibility for two recent cyberattacks targeting organizations in the United States and India. The victims are Croft, a U.S.-based window and door manufacturer, and CHANGEPOND, an enterprise software company headquartered in Chennai, India. Both breaches were discovered on November 19, 2025, occurring within minutes of each other. These incidents underscore the global reach and indiscriminate targeting of ransomware operators, affecting diverse sectors including manufacturing and technology. The attacks highlight the persistent threat posed by ransomware and the importance of robust cybersecurity defenses.",
      "tags": [
        "Ransomware",
        "sinobi",
        "Data Breach",
        "Manufacturing",
        "Technology"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2025-11-20T15:00:00.000Z",
      "updatedAt": "2025-11-20T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "cfbe49fc-61b1-4c87-aab1-4d8c562b2c57",
      "slug": "cisa-and-fbi-release-guide-to-combat-malicious-bulletproof-hosting-providers",
      "headline": "CISA and Partners Release Guide to Combat Bulletproof Hosting",
      "title": "CISA, FBI, and NSA Publish Guidance to Mitigate Risks from Malicious Bulletproof Hosting Providers",
      "severity": "informational",
      "excerpt": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA), along with the FBI, NSA, and international partners, has published a comprehensive guide to help network defenders and Internet Service Providers (ISPs) combat the threat of bulletproof hosting (BPH) providers. These services knowingly lease infrastructure to cybercriminals for a wide range of malicious activities, including ransomware, phishing, and malware distribution. The guide, 'Bulletproof Defense,' provides actionable recommendations for filtering malicious traffic, enhancing network monitoring, and improving intelligence sharing to disrupt the criminal ecosystem that relies on BPH for anonymity and resilience.",
      "tags": [
        "CISA",
        "Bulletproof Hosting",
        "BPH",
        "Threat Intelligence",
        "ISP",
        "Policy"
      ],
      "categories": [
        "Policy and Compliance",
        "Threat Intelligence",
        "Security Operations"
      ],
      "createdAt": "2025-11-20T15:00:00.000Z",
      "updatedAt": "2025-11-20T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "5c70d4b9-e4d5-4d8a-ab1e-e52d21232c46",
      "slug": "cisa-publishes-six-new-advisories-for-industrial-control-systems-ics",
      "headline": "CISA Issues 6 New ICS Advisories for Schneider Electric, Shelly, METZ CONNECT",
      "title": "CISA Publishes Six New Advisories for Vulnerabilities in Schneider Electric, Shelly, and METZ CONNECT Industrial Control Systems",
      "severity": "medium",
      "excerpt": "On November 19, 2025, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) released six new Industrial Control Systems (ICS) advisories, highlighting multiple vulnerabilities in products from Schneider Electric, Shelly, and METZ CONNECT. The alerts affect a range of operational technology (OT) products, including SCADA systems and power monitoring devices. Four of the advisories are for Schneider Electric products like EcoStruxure and PowerChute. CISA urges administrators in critical infrastructure and manufacturing sectors to review the advisories and apply the recommended mitigations to prevent potential exploitation.",
      "tags": [
        "ICS",
        "SCADA",
        "OT Security",
        "CISA",
        "Schneider Electric",
        "Vulnerability"
      ],
      "categories": [
        "Industrial Control Systems",
        "Vulnerability",
        "Patch Management"
      ],
      "createdAt": "2025-11-20T15:00:00.000Z",
      "updatedAt": "2025-11-20T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "d067d417-2a56-46f3-99ce-449a6ef238e9",
      "slug": "cisa-launches-be-air-aware-guides-to-defend-critical-infrastructure-from-drone-threats",
      "headline": "CISA Releases \"Be Air Aware\" Guides to Combat Drone Threats",
      "title": "CISA Launches \"Be Air Aware\" Campaign with New Guides to Defend Critical Infrastructure From Drone Threats",
      "severity": "informational",
      "excerpt": "As part of Critical Infrastructure Security and Resilience Month, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has released three new guides under its \"Be Air Aware™\" campaign. These resources are designed to help critical infrastructure owners and operators understand, assess, and mitigate the growing security risks posed by Unmanned Aircraft Systems (UAS), or drones. The guides provide actionable information on detecting suspicious drone activity, implementing detection technologies, and safely handling downed aircraft, aiming to integrate aerial threat considerations into existing security plans.",
      "tags": [
        "CISA",
        "Drones",
        "UAS",
        "Critical Infrastructure",
        "Physical Security",
        "Policy"
      ],
      "categories": [
        "Policy and Compliance",
        "Industrial Control Systems",
        "Security Operations"
      ],
      "createdAt": "2025-11-20T15:00:00.000Z",
      "updatedAt": "2025-11-20T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    },
    {
      "id": "42fde474-a587-40b1-9f6f-8dbdd47159db",
      "slug": "new-nova-stealer-malware-targets-macos-users-for-cryptocurrency-wallets",
      "headline": "New 'Nova Stealer' Malware Targets macOS Crypto Wallets",
      "title": "Researchers Discover 'Nova Stealer' Malware Targeting macOS Users to Steal Cryptocurrency Wallets and Sensitive Data",
      "severity": "high",
      "excerpt": "A new information-stealing malware, dubbed 'Nova Stealer,' has been discovered actively targeting Apple macOS users. The malware's primary goal is the exfiltration of sensitive data, with a specific focus on cryptocurrency wallets. Nova Stealer operates as a trojan, infecting systems by replacing legitimate, installed applications with malicious versions. When a user launches the compromised application, the malware activates in the background to search for and steal wallet files and other valuable information. This discovery underscores the increasing trend of threat actors developing malware for the macOS platform, challenging the perception of it being inherently more secure than Windows.",
      "tags": [
        "macOS",
        "Malware",
        "InfoStealer",
        "Trojan",
        "Cryptocurrency"
      ],
      "categories": [
        "Malware",
        "Threat Intelligence",
        "Mobile Security"
      ],
      "createdAt": "2025-11-20T15:00:00.000Z",
      "updatedAt": "2025-11-20T15:00:00.000Z",
      "readingTime": 4,
      "isUpdate": false
    }
  ]
}