{
  "pub_id": "pub-2025-12-01",
  "headline": "Coupang Data Breach Exposes 33.7M Users; Google Patches Actively Exploited Android Zero-Days",
  "summary": "This cybersecurity brief for December 1, 2025, covers several critical incidents. The most prominent is a massive data breach at South Korean e-commerce giant Coupang, affecting 33.7 million users due to an authentication vulnerability. Concurrently, Google released an urgent Android update patching 107 flaws, including two zero-days under active exploitation. Other major events include the release of a proof-of-concept for a critical zero-click Outlook RCE, ongoing supply chain attacks from the Shai-Hulud 2.0 worm, and new intelligence on APT groups like Tomiris and those targeting industrial sectors.",
  "pub_date": "2025-12-01",
  "total_articles": 7,
  "articles": [
    {
      "id": "bfe7fa38-8fcb-422c-abe7-ed1f23f17076",
      "slug": "coupang-discloses-massive-data-breach-affecting-33-7-million-users",
      "headline": "Coupang Breach Exposes 33.7 Million Users in South Korea",
      "title": "South Korean E-Commerce Giant Coupang Discloses Massive Data Breach Affecting Over Half the Nation's Population",
      "severity": "high",
      "excerpt": "South Korean e-commerce leader Coupang has admitted to a significant data breach exposing the personal information of 33.7 million customers, impacting over half of South Korea's population. The breach, which began in June 2025 and was detected in mid-November, stemmed from authentication vulnerabilities and the potential misuse of an ex-employee's still-active authentication key. Exposed data includes names, emails, phone numbers, and addresses. Coupang has reset user passwords and is working with authorities, including the Korea Internet & Security Agency (KISA), on the investigation.",
      "tags": [
        "Data Breach",
        "E-commerce",
        "Authentication",
        "Access Control",
        "Insider Threat",
        "PII",
        "South Korea"
      ],
      "categories": [
        "Data Breach",
        "Regulatory",
        "Cloud Security"
      ],
      "createdAt": "2025-12-01T15:00:00.000Z",
      "updatedAt": "2025-12-01T15:00:00.000Z",
      "readingTime": 6,
      "isUpdate": false
    },
    {
      "id": "edc7ab8a-06dd-4aef-8c2d-43d7376e6a5d",
      "slug": "google-patches-107-android-flaws-including-two-actively-exploited-zero-days",
      "headline": "Urgent Android Update: Google Patches 107 Flaws, Two Zero-Days Under Active Attack",
      "title": "Google Releases December 2025 Android Security Update, Addressing Two Actively Exploited Zero-Day Vulnerabilities",
      "severity": "critical",
      "excerpt": "Google has issued its December 2025 Android security bulletin, patching a total of 107 vulnerabilities. The update is critical, as it addresses two high-severity zero-days, CVE-2025-48633 (Information Disclosure) and CVE-2025-48572 (Elevation of Privilege), which are under limited, targeted exploitation in the wild. The patch also fixes a critical remote denial-of-service (DoS) flaw, CVE-2025-48631, in the Android Framework. The update covers vulnerabilities in components from Qualcomm, Arm, MediaTek, and others, affecting Android versions 13 through 16. Users are urged to install the update as soon as it becomes available for their devices.",
      "tags": [
        "Android",
        "Zero-Day",
        "Vulnerability",
        "Patch Management",
        "Mobile Security",
        "Google",
        "Spyware",
        "DoS"
      ],
      "categories": [
        "Vulnerability",
        "Patch Management",
        "Mobile Security"
      ],
      "createdAt": "2025-12-01T15:00:00.000Z",
      "updatedAt": "2025-12-01T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2025-48633",
        "CVE-2025-48572",
        "CVE-2025-48631",
        "CVE-2025-48623",
        "CVE-2025-48624",
        "CVE-2025-48637",
        "CVE-2025-48638"
      ],
      "isUpdate": false
    },
    {
      "id": "a28ee1b3-24d9-4b9a-bb13-04af0b4a97c6",
      "slug": "kaspersky-details-q3-apt-attacks-on-industrial-organizations-winrar-zero-day",
      "headline": "APTs Exploit WinRAR Zero-Day to Target Industrial Sector in Q3 2025",
      "title": "Kaspersky Report: WinRAR Zero-Day (CVE-2025-8088) Exploited by RomCom and Paper Werewolf APTs in Attacks on Industrial Organizations",
      "severity": "high",
      "excerpt": "Kaspersky's Q3 2025 threat report for industrial organizations highlights extensive exploitation of a WinRAR zero-day vulnerability, CVE-2025-8088. The flaw was used by multiple threat actors, including the RomCom cybercrime group and the Paper Werewolf (GOFFEE) APT, to deploy backdoors like SnipBot and the Mythic agent against industrial targets. The report also details other significant cyber-espionage campaigns, such as PhantomCore's attacks on Russian critical infrastructure and Cavalry Werewolf's phishing operations against energy and manufacturing sectors, underscoring the persistent threat to industrial control systems (ICS).",
      "tags": [
        "APT",
        "Threat Intelligence",
        "ICS",
        "OT",
        "WinRAR",
        "Zero-Day",
        "Espionage",
        "RomCom",
        "Paper Werewolf"
      ],
      "categories": [
        "Threat Intelligence",
        "Threat Actor",
        "Industrial Control Systems"
      ],
      "createdAt": "2025-12-01T15:00:00.000Z",
      "updatedAt": "2025-12-01T15:00:00.000Z",
      "readingTime": 6,
      "cves": [
        "CVE-2025-8088",
        "CVE-2018-0171",
        "CVE-2025-32433",
        "CVE-2025-6218"
      ],
      "cvssScore": 10,
      "isUpdate": false
    },
    {
      "id": "a0bbc719-458a-4edf-9499-f1171df15634",
      "slug": "ftc-penalizes-illuminate-education-for-student-data-breach",
      "headline": "FTC Slams EdTech Firm Illuminate Education Over Breach of 10M Students' Data",
      "title": "Illuminate Education Faces FTC Penalties for Security Failures Leading to Breach of 10.1 Million Students' Personal and Health Data",
      "severity": "high",
      "excerpt": "The U.S. Federal Trade Commission (FTC) has taken enforcement action against education technology provider Illuminate Education for a 2021 data breach that exposed the personal and health information of 10.1 million students. The FTC alleged the company failed to implement reasonable security measures, citing the attacker's use of credentials from an employee who had left 3.5 years prior. Under the settlement, Illuminate must implement a comprehensive security program, delete non-essential student data, and undergo third-party assessments, highlighting severe consequences for failing to protect children's data.",
      "tags": [
        "FTC",
        "Data Breach",
        "EdTech",
        "Student Privacy",
        "COPPA",
        "Access Control",
        "Compliance"
      ],
      "categories": [
        "Regulatory",
        "Data Breach",
        "Policy and Compliance"
      ],
      "createdAt": "2025-12-01T15:00:00.000Z",
      "updatedAt": "2025-12-01T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "7695aca0-a3b2-4d17-8242-f4a8df0881c4",
      "slug": "public-poc-exploit-released-for-critical-outlook-0-click-rce-flaw",
      "headline": "Warning: Public PoC Exploit Released for Critical Zero-Click Outlook RCE Flaw",
      "title": "Public Proof-of-Concept Exploit for Critical 'MonikerLink' Zero-Click RCE Vulnerability in Microsoft Outlook (CVE-2024-21413) Released",
      "severity": "critical",
      "excerpt": "A proof-of-concept (PoC) exploit has been publicly released for CVE-2024-21413, a critical zero-click remote code execution (RCE) vulnerability in Microsoft Outlook nicknamed 'MonikerLink'. The flaw allows an attacker to execute arbitrary code on a victim's machine simply by sending a malicious email, with no user interaction required. The release of the PoC dramatically increases the risk of widespread exploitation. All organizations using affected versions of Outlook are urged to apply the security patches released by Microsoft immediately to prevent compromise.",
      "tags": [
        "Vulnerability",
        "RCE",
        "Zero-Click",
        "Microsoft",
        "Outlook",
        "CVE-2024-21413",
        "PoC",
        "Exploit"
      ],
      "categories": [
        "Vulnerability",
        "Cyberattack"
      ],
      "createdAt": "2025-12-01T15:00:00.000Z",
      "updatedAt": "2025-12-01T15:00:00.000Z",
      "readingTime": 5,
      "cves": [
        "CVE-2024-21413"
      ],
      "isUpdate": false
    },
    {
      "id": "9d2f19c4-5c5e-4e40-8d57-8d21214e532f",
      "slug": "qilin-ransomware-group-claims-b-dynamic-as-new-victim",
      "headline": "Qilin Ransomware Gang Adds Business Services Firm B Dynamic to Leak Site",
      "title": "Qilin Ransomware Group Claims B Dynamic as New Victim in Ongoing Double-Extortion Campaign",
      "severity": "high",
      "excerpt": "The Qilin ransomware group, a prominent ransomware-as-a-service (RaaS) operation, has listed business services company 'B Dynamic' as its latest victim on its dark web data leak site. The December 1, 2025, posting indicates that the company has suffered a network compromise and data exfiltration. By publicizing the breach, the Qilin group is employing its standard double-extortion tactic to pressure the victim into paying a ransom to prevent the public release of stolen data. This incident highlights the persistent threat from established ransomware gangs.",
      "tags": [
        "Ransomware",
        "Qilin",
        "RaaS",
        "Double Extortion",
        "Dark Web"
      ],
      "categories": [
        "Ransomware",
        "Threat Actor",
        "Cyberattack"
      ],
      "createdAt": "2025-12-01T15:00:00.000Z",
      "updatedAt": "2025-12-01T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    },
    {
      "id": "c47c131d-2768-44cf-9a5d-8371a6890fbf",
      "slug": "major-unnamed-tech-firm-suffers-breach-exposing-millions-of-users",
      "headline": "Mystery Breach: Major Tech Firm Exposes Millions of Users' Data",
      "title": "Major Unnamed Technology Company Suffers Massive Data Breach Exposing Millions of Users Globally",
      "severity": "critical",
      "excerpt": "A major, but currently unnamed, technology company has reportedly suffered a massive data breach, exposing the personal data of millions of users worldwide. The breach was detected on November 24, 2025, after unusual activity was observed on the company's servers, stemming from an unspecified vulnerability. The company has reportedly shut down the compromised servers, notified authorities, and begun alerting users. This incident is being described as one of the largest in recent years, placing millions at risk of identity theft and phishing attacks.",
      "tags": [
        "Data Breach",
        "Cyberattack",
        "Vulnerability",
        "Technology",
        "PII"
      ],
      "categories": [
        "Data Breach",
        "Cyberattack",
        "Vulnerability"
      ],
      "createdAt": "2025-12-01T15:00:00.000Z",
      "updatedAt": "2025-12-01T15:00:00.000Z",
      "readingTime": 5,
      "isUpdate": false
    }
  ]
}