[{"data":1,"prerenderedAt":153},["ShallowReactive",2],{"publication-daily-threat-publications-2025-12-09":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-12-09","Global Patching Scramble as Critical \"React2Shell\" RCE Vulnerability Sees Widespread Exploitation","This cybersecurity brief for December 9, 2025, covers a critical unauthenticated RCE vulnerability, dubbed \"React2Shell\" (CVE-2025-55182), affecting React Server Components and now under active exploitation by multiple threat actors, including state-sponsored groups. Other major developments include the DeadLock ransomware using a novel \"Bring Your Own Vulnerable Driver\" technique to disable EDRs, the evolution of IAB Storm-0249's tactics, and a new \"code-to-cloud\" attack vector abusing leaked GitHub Personal Access Tokens. The brief details these threats, provides technical analysis, and offers actionable mitigation strategies for defenders.","2025-12-09",8,[10,32,51,68,88,106,121,136],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":25,"createdAt":26,"updatedAt":27,"readingTime":28,"isUpdate":29,"updateSummary":30,"updateContent":31},"a9336500-426c-4331-bd89-24abc1faed06","marquis-software-breach-exposes-data-from-74-banks-and-credit-unions","Supply Chain Attack: Marquis Software Breach Hits 74 Banks, Akira Ransomware Suspected","Marquis Software Solutions Breach Exposes Data of Over 400,000 Customers from 74 U.S. Financial Institutions","high","Marquis Software Solutions, a U.S.-based financial software provider, has suffered a major data breach, compromising the sensitive information of over 400,000 customers across 74 client banks and credit unions. This significant supply chain attack is suspected to be the work of the Akira ransomware gang. According to investigators, the threat actors likely gained initial access by exploiting vulnerabilities in SonicWall firewall devices on Marquis's network. This incident highlights the cascading risk in the financial sector, where a compromise at a single software vendor can have widespread consequences for numerous downstream institutions and their customers.",[18,19,20,21,22,23,24],"Supply Chain Attack","Data Breach","Ransomware","Akira","SonicWall","Financial Services","Credit Union",[18,19,20],"2025-12-08T15:00:00.000Z","2025-12-09T00:00:00.000Z",5,true,"Marquis Software breach update: potential 780K victims, specific CVE-2024-40766 identified, possible ransom payment, and new TTPs including Mimikatz.","New information reveals the Marquis Software breach may affect up to 780,000 customers, an increase from initial estimates. The attack, detected August 14, 2025, specifically exploited SonicWall vulnerability CVE-2024-40766. Reports suggest Marquis may have paid a ransom to prevent data release. Compromised data includes Social Security numbers and financial account details. New cyber observables include Mimikatz for credential access and `vssadmin.exe delete shadows` for impact, providing critical TTPs for detection.",{"id":33,"slug":34,"headline":35,"title":36,"severity":15,"excerpt":37,"tags":38,"categories":44,"createdAt":47,"updatedAt":47,"readingTime":28,"cves":48,"isUpdate":50},"e00b2b78-398b-4b3b-b7b5-bc3c78e2bcd3","deadlock-ransomware-deploys-byovd-tactic-to-disable-edr","DeadLock Ransomware Uses Vulnerable Baidu Driver to Blind EDRs","DeadLock Ransomware Deploys New \"Bring Your Own Vulnerable Driver\" Tactic to Disable Security Tools","A new DeadLock ransomware campaign is leveraging a novel \"Bring Your Own Vulnerable Driver\" (BYOVD) loader to exploit a vulnerability (CVE-2024-51324) in a legitimate Baidu Antivirus driver, `BdApiUtil.sys`. This technique allows the threat actors to terminate any process, including endpoint detection and response (EDR) and antivirus solutions, from the kernel level. By blinding security tools, the attackers can deploy the ransomware unimpeded. The attack chain, analyzed by Cisco Talos, also involves PowerShell scripts to disable Windows Defender and delete volume shadow copies, severely hindering detection and recovery efforts.",[20,39,40,41,42,43],"DeadLock","BYOVD","EDR Evasion","Kernel","Defense Evasion",[20,45,46],"Malware","Threat Actor","2025-12-09T15:00:00.000Z",[49],"CVE-2024-51324",false,{"id":52,"slug":53,"headline":54,"title":55,"severity":15,"excerpt":56,"tags":57,"categories":65,"createdAt":47,"updatedAt":47,"readingTime":67,"isUpdate":50},"adf8fca4-ad51-4534-b7c7-5dc0b8d1017a","code-to-cloud-attack-vector-abuses-github-pats","Code-to-Cloud Attacks: Leaked GitHub Tokens Become Keys to the Kingdom","New \"Code-to-Cloud\" Attack Vector Sees Threat Actors Pivot From GitHub to Cloud Environments via Leaked PATs","Security researchers at Wiz have detailed an emerging \"code-to-cloud\" attack vector where threat actors leverage compromised GitHub Personal Access Tokens (PATs) to pivot from code repositories directly into production cloud environments. By abusing the trust between GitHub and connected Cloud Service Providers (CSPs), attackers with even basic read permissions can discover secret names, then use write permissions to execute malicious GitHub Actions that exfiltrate CSP credentials. The attack is particularly stealthy as API calls to search for secret names are not logged by GitHub Enterprise, creating a major visibility gap for defenders.",[58,59,60,61,62,63,64],"DevSecOps","GitHub","Cloud Security","CI/CD","Personal Access Token","PAT","Supply Chain",[60,18,66],"Vulnerability",6,{"id":69,"slug":70,"headline":71,"title":72,"severity":15,"excerpt":73,"tags":74,"categories":83,"createdAt":47,"updatedAt":47,"readingTime":67,"cves":86,"isUpdate":50},"949e75f3-1ce2-4956-9ba5-d50c847da1d2","broadside-botnet-targets-maritime-sector-via-dvr-flaw","New 'Broadside' Botnet Exploits DVRs to Target Maritime Logistics","'Broadside' Botnet Exploits DVR Flaw, Posing Significant Threat to Maritime Logistics Sector","A new, sophisticated variant of the Mirai botnet, dubbed \"Broadside,\" is actively exploiting a command injection vulnerability (CVE-2024-3721) in TBK Digital Video Recorder (DVR) devices. According to research from Cydome, the campaign specifically targets the maritime logistics sector, where these DVRs are common. Broadside is more advanced than typical Mirai variants, using stealthier techniques and a custom C2 protocol. Crucially, its goals extend beyond DDoS to include credential harvesting and lateral movement, turning compromised DVRs into strategic footholds on vessel networks.",[75,76,77,78,79,80,81,82],"Botnet","Mirai","Broadside","Maritime Security","IoT","DVR","ICS","OT",[45,84,85],"Industrial Control Systems","IoT Security",[87],"CVE-2024-3721",{"id":89,"slug":90,"headline":91,"title":92,"severity":93,"excerpt":94,"tags":95,"categories":103,"createdAt":47,"updatedAt":47,"readingTime":28,"isUpdate":50},"f6109035-1d6a-45ae-a576-4052e23153f8","ai-threat-hunting-uncovers-ghostpenguin-linux-backdoor","AI Threat Hunting Exposes 'GhostPenguin,' a Linux Backdoor Undetected for Months","Undetected for Over Four Months, 'GhostPenguin' Linux Backdoor Exposed by AI-Powered Threat Hunting","medium","Researchers at Trend Micro have discovered \"GhostPenguin,\" a sophisticated, multi-threaded Linux backdoor written in C++. The malware remained completely undetected on VirusTotal for over four months after its initial submission. It was ultimately found using an AI-driven automated threat hunting pipeline designed to analyze zero-detection samples. GhostPenguin provides attackers with full remote shell access and file system control over an RC5-encrypted UDP channel, using port 53 to masquerade as DNS traffic, highlighting the growing need for AI in detecting emerging, stealthy threats.",[96,97,98,99,100,101,102],"Linux","Backdoor","GhostPenguin","Threat Hunting","AI","C++","Stealth",[45,104,105],"Threat Intelligence","Security Operations",{"id":107,"slug":108,"headline":109,"title":110,"severity":93,"excerpt":111,"tags":112,"categories":119,"createdAt":47,"updatedAt":47,"readingTime":28,"isUpdate":50},"86a3044a-3ba3-4d07-99dc-d240fc82e5a4","vishing-campaign-abuses-microsoft-teams-and-quickassist","Vishing Attackers Impersonate IT on Teams, Trick Users into Running Fileless Malware","Vishing Campaign Abuses Microsoft Teams and QuickAssist to Deploy Fileless .NET Malware","A sophisticated vishing (voice phishing) campaign is abusing trusted enterprise tools to deploy stealthy malware. Attackers impersonate IT support staff on Microsoft Teams, convincing users to initiate a Windows Quick Assist session. Once they have remote access, the attackers direct the user to a malicious site to download a loader. This loader then fetches an encrypted payload and executes it directly in memory using .NET reflection, a fileless technique designed to evade traditional antivirus and endpoint detection solutions. The campaign highlights the increasing trend of blending social engineering with the abuse of legitimate software.",[113,114,115,116,117,118],"Vishing","Social Engineering","Microsoft Teams","QuickAssist","Fileless Malware",".NET",[120,45,105],"Phishing",{"id":122,"slug":123,"headline":124,"title":125,"severity":93,"excerpt":126,"tags":127,"categories":134,"createdAt":47,"updatedAt":47,"readingTime":135,"isUpdate":50},"80b28baa-84cd-409e-ab82-f3c386f9ac50","ibm-issues-critical-security-updates-for-enterprise-products","IBM Rolls Out Critical Patches for AIX, Cloud Pak, and Other Enterprise Software","IBM Issues Critical Security Updates for AIX, Aspera Shares, Cloud Pak, and More","IBM has released a wave of security updates addressing vulnerabilities in numerous enterprise products, prompting an advisory from the Canadian Centre for Cyber Security. The bulletins, published between December 1 and December 7, 2025, include critical patches for IBM AIX, VIOS, Aspera Shares, Business Automation Workflow, and Cloud Pak System, among others. Administrators are strongly urged to review the advisories and apply the necessary updates promptly to protect their infrastructure from potential exploitation.",[128,129,66,130,131,132,133],"IBM","Patch Management","AIX","Cloud Pak","Aspera","Enterprise Security",[129,66],4,{"id":137,"slug":138,"headline":139,"title":140,"severity":141,"excerpt":142,"tags":143,"categories":150,"createdAt":47,"updatedAt":47,"readingTime":135,"isUpdate":50},"26eaf91b-e57a-4623-9ba0-dc2a4860bbbf","ibm-and-turing-space-advance-digital-identity-solutions","Race for Secure Digital Identity Heats Up with New Platforms from IBM and Turing Space","IBM and Turing Space Launch New Digital Credential and Identity Platforms to Counter AI Threats","informational","The digital identity space is seeing rapid innovation as IBM launches \"Verify Digital Credentials,\" a new platform for issuing and authenticating secure digital documents like licenses and academic records. Built on open standards, it aims to reduce breach risk by decentralizing data storage. Concurrently, decentralized identity provider Turing Space is partnering with the IOTA blockchain to enhance its own verification offering, aiming to lower costs for enterprise-scale deployment. These moves highlight an industry-wide push towards verifiable credentials as a foundational defense against the growing threat of AI-powered deepfakes and identity fraud.",[144,145,146,147,148,149],"Digital Identity","Verifiable Credentials","Self-Sovereign Identity","SSI","Blockchain","Deepfake",[151,152,60],"Policy and Compliance","Regulatory",1768235928573]