[{"data":1,"prerenderedAt":137},["ShallowReactive",2],{"publication-daily-threat-publications-2026-02-04":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2026-02-04","Russian APT Exploits Patched Office Flaw in Days; Chinese Spies Hijack Notepad++ Updates","The cybersecurity landscape on February 4th, 2026, is dominated by sophisticated state-sponsored attacks. The Russian APT28 group was caught weaponizing a freshly patched Microsoft Office zero-day vulnerability (CVE-2026-21509) within days, targeting European entities. In a separate, long-running campaign, a Chinese APT compromised the Notepad++ update mechanism in a six-month supply chain attack. Other major incidents include the resurfacing of a massive AT&T customer dataset with 176 million records, a widespread DDoS campaign by pro-Russian hacktivists, and critical vulnerability disclosures for Django and Ingress-NGINX.","2026-02-04",9,[10,30,46,60,75,88,101,113,123],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":24,"createdAt":27,"updatedAt":27,"readingTime":28,"isUpdate":29},"b10e73ea-5339-4a38-b136-b6a52fe8c460","cisa-under-fire-for-quietly-updating-ransomware-vulnerability-data","CISA Criticized for Silently Updating KEV Catalog with Ransomware Data","CISA Faces Scrutiny for Lack of Notification on Ransomware Vulnerability Updates in KEV Catalog","informational","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) is facing criticism for its practice of silently updating its Known Exploited Vulnerability (KEV) catalog. In 2025, the agency updated 59 entries to indicate that the flaws were being used in ransomware attacks, but it did not issue any notifications for these changes. Security experts argue that this lack of communication is a significant missed opportunity for defenders, who use the ransomware designation as a key factor in prioritizing patching.",[18,19,20,21,22,23],"CISA","KEV","Ransomware","Vulnerability Management","Policy","Threat Intelligence",[25,23,26],"Policy and Compliance","Vulnerability","2026-02-04T15:00:00.000Z",4,false,{"id":31,"slug":32,"headline":33,"title":34,"severity":35,"excerpt":36,"tags":37,"categories":44,"createdAt":27,"updatedAt":27,"readingTime":45,"isUpdate":29},"3c622e6f-ff92-4586-86b3-a4890e50ada9","massive-att-dataset-with-social-security-numbers-resurfaces-online","Massive AT&T Customer Dataset with 148M SSNs Resurfaces in Criminal Circles","AT&T Data Breach: 176 Million Records with SSNs and Personal Info Circulating Privately","high","A massive and highly sensitive dataset allegedly containing the personal information of AT&T customers has resurfaced and is being circulated in criminal forums. The data trove reportedly includes approximately 176 million records, featuring over 133 million full names and addresses, and, most critically, up to 148 million full and partial Social Security numbers. The re-emergence of this consolidated data poses a severe and renewed risk of identity theft, phishing, and fraud for millions of individuals.",[38,39,40,41,42,43],"Data Breach","AT&T","PII","SSN","Identity Theft","Phishing",[38,43],5,{"id":47,"slug":48,"headline":49,"title":50,"severity":51,"excerpt":52,"tags":53,"categories":58,"createdAt":27,"updatedAt":27,"readingTime":28,"isUpdate":29},"d926713b-50f6-4309-bc36-14399feda781","linkedin-private-messages-abused-in-phishing-campaign-targeting-execs","LinkedIn Phishing Campaign Targets Executives Using Legitimate Pen-Testing Tools","Attackers Abuse LinkedIn Private Messages to Target Executives with Hard-to-Detect Malware","medium","A new phishing campaign discovered by ReliaQuest is abusing LinkedIn's private messaging feature to target executives and IT professionals. The attackers use social engineering to trick victims into downloading and running a malicious archive file. The attack's novelty lies in its use of a legitimate, open-source Python script designed for penetration testing. This 'living off the land' technique makes the malicious activity difficult to distinguish from normal administrative tasks, significantly reducing the risk of detection by security software.",[43,54,55,56,57],"LinkedIn","Social Engineering","Living off the Land","Python",[43,59],"Security Operations",{"id":61,"slug":62,"headline":63,"title":64,"severity":51,"excerpt":65,"tags":66,"categories":73,"createdAt":27,"updatedAt":27,"readingTime":28,"isUpdate":29},"9a73ab27-2c98-4916-b1cd-aeb674799fe3","fake-line-installer-spreads-valleyrat-malware","Fake LINE Messenger Installer Spreads ValleyRAT Malware","Silver Fox APT Group Distributes ValleyRAT via Trojanized LINE Installer","A malware campaign attributed to the Silver Fox APT group is distributing the ValleyRAT remote access trojan by disguising it as an installer for the popular LINE messaging app. The campaign, which primarily targets Chinese-speaking users, uses the trojanized software as a lure to infect systems. Once installed, ValleyRAT establishes persistence and focuses on stealing user credentials, leveraging advanced evasion techniques to remain undetected.",[67,68,69,70,71,72],"Malware","ValleyRAT","Silver Fox","APT","Trojan","LINE",[67,74,43],"Threat Actor",{"id":76,"slug":77,"headline":78,"title":79,"severity":80,"excerpt":81,"tags":82,"categories":87,"createdAt":27,"updatedAt":27,"readingTime":28,"isUpdate":29},"ea6456f4-b041-4b44-a958-31a645c1a8ba","critical-django-vulnerabilities-enable-dos-and-sql-injection","Critical Flaws in Django Framework Expose Sites to DoS and SQL Injection","Django Releases Patches for Critical Denial-of-Service and SQL Injection Vulnerabilities","critical","The maintainers of the Django web framework have released important security updates to address critical vulnerabilities. The flaws could allow remote attackers to conduct Denial-of-Service (DoS) and potential SQL injection attacks against web applications built with the framework. Due to the severity of these issues, which could lead to service disruption and data compromise, administrators are strongly urged to patch their Django instances immediately.",[83,26,84,85,86,57],"Django","SQL Injection","DoS","Patch Management",[26,86],{"id":89,"slug":90,"headline":91,"title":92,"severity":80,"excerpt":93,"tags":94,"categories":100,"createdAt":27,"updatedAt":27,"readingTime":45,"isUpdate":29},"a743f7fb-1dba-459e-8a04-c04dc55321d2","ingress-nginx-vulnerability-allows-arbitrary-code-execution","Critical RCE Flaw in Ingress-NGINX Threatens Kubernetes Clusters","Ingress-NGINX Vulnerability Allows Attackers to Execute Arbitrary Code","A critical vulnerability has been discovered in the widely used Ingress-NGINX controller for Kubernetes. The flaw could allow a remote attacker to achieve arbitrary code execution within the context of the ingress controller. A successful exploit could lead to a full compromise of the ingress, enabling traffic interception, data theft, and providing a powerful foothold for lateral movement into the underlying Kubernetes cluster environment. Users are urged to patch immediately.",[95,96,97,26,98,99],"Kubernetes","Ingress","NGINX","RCE","Cloud Security",[26,99,86],{"id":102,"slug":103,"headline":104,"title":105,"severity":35,"excerpt":106,"tags":107,"categories":111,"createdAt":27,"updatedAt":27,"readingTime":112,"isUpdate":29},"f37ec7a8-c90b-401f-b5be-a901330a200b","samsung-rolls-out-february-2026-security-update-with-37-patches","Samsung's February 2026 Update Fixes 37 Flaws in Galaxy Devices","Samsung Issues February 2026 Security Update, Patching 37 Vulnerabilities","Samsung has released its February 2026 security update for its Galaxy smartphones, tablets, and foldable devices. The update addresses a total of 37 vulnerabilities. This includes 25 patches from Google for the core Android OS and 12 Samsung-specific patches (SVEs) for its One UI software. The Samsung-specific fixes address flaws rated as high and moderate severity, including an access control vulnerability in the 'Emergency Sharing' feature. Users are advised to install the update promptly.",[108,109,86,110,26],"Samsung","Android","Mobile Security",[86,110],3,{"id":114,"slug":115,"headline":116,"title":117,"severity":35,"excerpt":118,"tags":119,"categories":122,"createdAt":27,"updatedAt":27,"readingTime":112,"isUpdate":29},"12242e77-db7d-4b37-908a-aab268feef7a","google-issues-february-2026-security-update-for-pixel-devices","Google Patches Multiple Vulnerabilities in February 2026 Pixel Update","Google Releases February 2026 Security Update for Pixel Devices","Google has released its monthly security update for all supported Pixel devices as part of its February 2026 patch cycle. The update addresses numerous security vulnerabilities detailed in the Android and Pixel-specific security bulletins. Installing the update will bring all supported Pixel devices to the 2026-02-05 patch level, ensuring they are protected against the latest discovered threats. The update also includes various functional improvements.",[120,121,109,86,110,26],"Google","Pixel",[86,110],{"id":124,"slug":125,"headline":126,"title":127,"severity":15,"excerpt":128,"tags":129,"categories":135,"createdAt":27,"updatedAt":27,"readingTime":112,"isUpdate":29},"1f0c1ce2-93f7-4f90-b090-37060f103d6e","uk-law-criminalizing-ai-generated-intimate-images-takes-effect","UK Law Criminalizing AI-Generated Deepfake Intimate Images Takes Effect","New UK Law Makes Creation of AI-Generated Intimate Images a Criminal Offense","A new law in the United Kingdom is set to come into force on February 6, 2026, making it a criminal offense to create or share AI-generated 'deepfake' intimate images of an adult without their consent. The law, part of the Data (Use and Access) Act 2025, amends the Sexual Offences Act 2003 to specifically address the malicious use of artificial intelligence to create harmful and abusive content. This legislative action is a direct response to the growing problem of non-consensual deepfake pornography.",[130,131,132,133,134,22],"AI","Deepfake","Law","Regulation","UK",[136,25],"Regulatory",1770214189302]