[{"data":1,"prerenderedAt":142},["ShallowReactive",2],{"publication-daily-threat-publications-2025-11-28":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-11-28","Supply Chain Attacks Surge as North Korean Hackers Flood NPM; CISA Issues Urgent Mobile & ICS Alerts","This cybersecurity advisory for November 27-28, 2025, highlights a significant escalation in software supply chain attacks, underscored by a North Korean campaign that flooded the NPM registry with nearly 200 malicious packages. Concurrently, CISA has issued critical warnings, adding an exploited ICS vulnerability (CVE-2021-26829) to its KEV catalog and releasing urgent guidance for mobile device security against commercial spyware. Other major incidents include a data breach at the French Football Federation exposing player information, a massive leak of over 17,000 secrets on public GitLab repositories, and evolving tactics from APT groups like Bloody Wolf and Tomiris targeting government entities across Central Asia.","2025-11-28",8,[10,29,44,61,75,90,106,128],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":24,"createdAt":26,"updatedAt":26,"readingTime":27,"isUpdate":28},"937353b8-8f2f-4d2c-ab38-00824760769c","french-football-federation-data-breach-compromised-account","French Football Federation Data Breach Exposes Player Info Via Single Compromised Account","French Football Federation Discloses Major Data Breach Affecting 2.3 Million Licensees After Attacker Used Compromised Privileged Account","high","The French Football Federation (FFF) announced a significant data breach on November 28, 2025, after an attacker gained access to a centralized administrative software platform using a single compromised user account. The breach exposed the personally identifiable information (PII) of a large number of its 2.3 million members, including names, contact details, and birth dates. The attackers did not exploit a software vulnerability but rather leveraged stolen credentials to gain administrative control. In response, the FFF disabled the account, forced a password reset for all users, and notified both the French data protection authority (CNIL) and the national cybersecurity agency (ANSSI). This incident highlights the critical risk posed by credential compromise and the trend of cyberattacks targeting sports organizations.",[18,19,20,21,22,23],"Data Breach","Credential Compromise","PII","GDPR","Phishing","Sports",[18,25,22],"Cyberattack","2025-11-28T15:00:00.000Z",6,false,{"id":30,"slug":31,"headline":32,"title":33,"severity":15,"excerpt":34,"tags":35,"categories":41,"createdAt":26,"updatedAt":26,"readingTime":43,"isUpdate":28},"ffff1d3d-e3dc-4c75-8e4b-74ff998c4a60","australian-hacker-jailed-evil-twin-wifi-attacks","IT Professional Jailed for 7 Years in Australia for 'Evil Twin' Wi-Fi Attacks on Flights","Australian IT Guru Michael Clapsis Sentenced to Over 7 Years for Using Wi-Fi Pineapple to Steal Credentials and Intimate Images","An Australian IT professional, Michael Clapsis, has been sentenced to seven years and four months in prison for conducting sophisticated 'evil twin' Wi-Fi attacks. Using a Wi-Fi Pineapple device, he created rogue Wi-Fi hotspots at airports and on flights to trick travelers into entering their credentials into a phishing portal. Clapsis then used this access to infiltrate the online accounts of multiple women, stealing thousands of private images and videos. The Australian Federal Police (AFP) investigation began after airline staff reported a suspicious network. Clapsis also attempted to obstruct the investigation by deleting evidence and abusing his IT privileges at work to spy on meetings between his employer and the AFP.",[36,37,38,22,39,40],"Evil Twin","Wi-Fi Pineapple","Man-in-the-Middle","Cybercrime","Australia",[25,22,42],"Threat Intelligence",5,{"id":45,"slug":46,"headline":47,"title":48,"severity":15,"excerpt":49,"tags":50,"categories":58,"createdAt":26,"updatedAt":26,"readingTime":27,"isUpdate":28},"ad7c7470-8e70-4480-bd86-fc6a9126cd3c","public-gitlab-repos-expose-over-17000-live-secrets","Massive Scan of Public GitLab Repositories Uncovers Over 17,000 Live Secrets","Security Researcher Finds 17,430 Verified Secrets, Including GCP Keys and GitLab Tokens, in 5.6 Million Public GitLab Repositories","A security engineer, Luke Marshall, conducted a large-scale scan of all 5.6 million public repositories on GitLab Cloud, uncovering 17,430 verified, live secrets. The exposed credentials include thousands of API keys and access tokens for over 2,800 unique domains, with Google Cloud Platform (GCP) keys being the most common. The scan, performed using the open-source tool TruffleHog, highlights the pervasive issue of developers hardcoding secrets in public code. Alarmingly, 406 valid GitLab access tokens were found within GitLab's own repositories. The research also uncovered 'zombie secrets' that have remained valid for over a decade, posing a long-term risk. Marshall's responsible disclosure efforts led to multiple bug bounty payouts.",[51,52,53,54,55,56,57],"GitLab","Secrets Management","Hardcoded Secrets","DevSecOps","Cloud Security","TruffleHog","API Keys",[55,59,60],"Security Operations","Supply Chain Attack",{"id":62,"slug":63,"headline":64,"title":65,"severity":15,"excerpt":66,"tags":67,"categories":73,"createdAt":26,"updatedAt":26,"readingTime":27,"isUpdate":28},"29eeb94c-e73f-4b7c-b899-7406e34a9852","legacy-python-zc-buildout-scripts-pose-domain-takeover-risk","Legacy Python Scripts Create Dormant Supply Chain Risk via Abandoned Domain","ReversingLabs Uncovers Latent Domain-Takeover Risk in PyPI Packages Using Legacy 'zc.buildout' Scripts","Security researchers at ReversingLabs have identified a long-dormant supply chain vulnerability within the Python ecosystem affecting packages that use the legacy 'zc.buildout' tool. Outdated bootstrap scripts (`bootstrap.py`) found in several PyPI packages contain hardcoded references to an abandoned domain, `python-distribute.org`. This domain, once used for a fork of the Setuptools project, is now for sale. An attacker could purchase the domain, host malicious code, and automatically compromise any developer or build system that runs one of these legacy scripts. This creates a direct vector for malware injection, exposing an unknown number of projects to a decade-old risk.",[68,69,60,70,71,72],"Python","PyPI","Domain Takeover","ReversingLabs","zc.buildout",[60,74,59],"Vulnerability",{"id":76,"slug":77,"headline":78,"title":79,"severity":15,"excerpt":80,"tags":81,"categories":88,"createdAt":26,"updatedAt":26,"readingTime":27,"isUpdate":28},"202e3338-3669-4760-b95b-3932c3a825d9","adversarial-poetry-universal-llm-jailbreak-technique","'Adversarial Poetry' Emerges as Universal Jailbreak for Major LLMs","Researchers Discover 'Adversarial Poetry' Can Universally Bypass Safety Guardrails on 25 Major Large Language Models","A new research paper has unveiled a simple yet powerful technique, dubbed 'adversarial poetry,' that can consistently bypass the safety guardrails of major Large Language Models (LLMs). By reformulating harmful prompts into verse, researchers were able to achieve jailbreak success rates up to 18 times higher than with plain text. The technique proved effective as a 'universal single-turn jailbreak' across 25 different AI models, including both proprietary and open-source ones. It successfully generated content related to dangerous topics like CBRN threats and cyber-offenses, revealing a fundamental weakness in current AI alignment strategies that appear overly sensitive to a prompt's style rather than its semantic content.",[82,83,84,85,86,87],"LLM","AI Security","Jailbreak","Prompt Injection","Adversarial AI","Responsible AI",[89,42],"Other",{"id":91,"slug":92,"headline":93,"title":94,"severity":15,"excerpt":95,"tags":96,"categories":104,"createdAt":26,"updatedAt":26,"readingTime":27,"isUpdate":28},"0d5aa310-0d0d-430e-9982-7a2faf217c83","bloody-wolf-apt-targets-central-asia-with-legitimate-rats","Bloody Wolf APT Shifts Tactics, Using Legitimate RATs to Target Central Asian Governments","Bloody Wolf APT Expands Cyber-Espionage Campaign to Kyrgyzstan and Uzbekistan, Leveraging NetSupport RAT","The cyber-espionage group 'Bloody Wolf' has expanded its campaign, now targeting government entities in Kyrgyzstan and Uzbekistan. According to research from Group-IB, the APT group has evolved its tactics, moving away from custom malware to a more streamlined, Java-based delivery method. The new attack chain tricks victims into installing the legitimate NetSupport Manager remote administration tool (RAT). By using a widely recognized commercial tool, Bloody Wolf aims to evade detection by blending its malicious activities with normal administrative network traffic, sustaining its long-term espionage and data exfiltration goals.",[97,98,99,100,101,102,103],"Bloody Wolf","APT","Cyber Espionage","NetSupport","RAT","Central Asia","Group-IB",[105,25,42],"Threat Actor",{"id":107,"slug":108,"headline":109,"title":110,"severity":111,"excerpt":112,"tags":113,"categories":123,"createdAt":26,"updatedAt":26,"readingTime":125,"cves":126,"cvssScore":127,"isUpdate":28},"0d702250-2e7c-497b-ac8a-451176cd3dba","cisa-adds-exploited-openplc-xss-flaw-to-kev-catalog","CISA Adds Actively Exploited OpenPLC XSS Flaw to KEV Catalog After Hacktivist Attacks","CISA Orders Federal Agencies to Patch OpenPLC ScadaBR XSS Flaw (CVE-2021-26829) Following Active Exploitation by Pro-Russian Group TwoNet","critical","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a cross-site scripting (XSS) vulnerability in OpenPLC ScadaBR, CVE-2021-26829, to its Known Exploited Vulnerabilities (KEV) catalog. The action, taken on November 28, 2025, follows confirmed reports of active exploitation by the pro-Russian hacktivist group TwoNet. The group was observed using the flaw to deface the HMI of an industrial control system honeypot. The medium-severity vulnerability allows an attacker with access to the system to inject malicious scripts. Federal agencies are now required to patch the flaw by December 19, 2025, to protect against this confirmed threat to ICS/OT environments.",[114,115,116,117,118,119,120,121,122],"CISA","KEV","CVE-2021-26829","OpenPLC","ICS","OT","SCADA","TwoNet","Hacktivism",[74,124,105],"Industrial Control Systems",7,[116],5.4,{"id":129,"slug":130,"headline":131,"title":132,"severity":15,"excerpt":133,"tags":134,"categories":141,"createdAt":26,"updatedAt":26,"readingTime":27,"isUpdate":28},"e5ab69b4-d9a0-4bd0-b563-f13bcad46411","tomiris-apt-upgrades-toolkit-for-espionage-against-diplomatic-targets","Tomiris APT Refines Toolkit, Using Discord and Telegram for C2 in Diplomatic Attacks","Tomiris APT Enhances Espionage Campaign Against Diplomatic Targets in Russia and Central Asia with New Tools","The cyber-espionage group 'Tomiris' has upgraded its tactical arsenal in a new wave of attacks targeting diplomatic and government organizations in Russia and Commonwealth of Independent States (CIS) countries. According to a new report from Kaspersky, the APT group is now using public services like Discord and Telegram for command-and-control (C2) communications to better evade detection. The group uses tailored spear-phishing emails to deliver a variety of payloads, including reverse shells and custom backdoors, and deploys specialized 'FileGrabber' malware to steal documents, demonstrating a focus on long-term intelligence gathering.",[135,98,99,136,137,138,139,140],"Tomiris","Discord","Telegram","C2","Kaspersky","Havoc",[105,25,42],1769791320971]