[{"data":1,"prerenderedAt":111},["ShallowReactive",2],{"publication-daily-threat-publications-2025-12-20":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-12-20","Critical Zero-Days and Actively Exploited Flaws Plague Cisco, Apple, HPE, and MongoDB","This cybersecurity advisory for December 20, 2025, covers a surge of critical vulnerabilities and active zero-day exploits. Major vendors including HPE, WatchGuard, Cisco, Apple, and MongoDB are scrambling to patch flaws being weaponized by threat actors, with CISA issuing multiple emergency directives. Highlights include a perfect 10.0 CVSS score for an HPE OneView RCE, actively exploited zero-days in Cisco email gateways and Apple products, and a memory leak in MongoDB dubbed 'MongoBleed'. Other significant events include a major data breach at the University of Sydney, a guilty plea from a Nefilim ransomware operator, and new social engineering attacks targeting WhatsApp users.","2025-12-20",6,[10,30,46,63,78,95],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":23,"createdAt":27,"updatedAt":27,"readingTime":28,"isUpdate":29},"2ec16d8f-d8e9-4747-a960-e43d324b6fcd","university-of-sydney-discloses-data-breach-affecting-27500","University of Sydney Data Breach Exposes Info of 27,500 Staff and Students","University of Sydney Discloses Data Breach After Hacker Accesses IT Code Library","high","The University of Sydney has announced a significant data breach affecting approximately 27,500 individuals after an unauthorized party gained access to an internal IT code library. The compromised repository contained historical data files with personal information of current and former staff, affiliates, students, and alumni, primarily from 2010-2019. Exposed data includes names, dates of birth, phone numbers, and home addresses. The university has secured the environment and is in the process of notifying all affected individuals while an investigation is ongoing.",[18,19,20,21,22],"PII","Education","Code Repository","Insider Threat","Misconfiguration",[24,25,26],"Data Breach","Cyberattack","Policy and Compliance","2025-12-20T15:00:00.000Z",5,false,{"id":31,"slug":32,"headline":33,"title":34,"severity":15,"excerpt":35,"tags":36,"categories":42,"createdAt":27,"updatedAt":27,"readingTime":28,"isUpdate":29},"f9343253-3733-4e26-865c-06714a34d75b","nefilim-ransomware-operator-artem-stryzhak-pleads-guilty","Nefilim Ransomware Operator Pleads Guilty in U.S. Court","Ukrainian Operator of Nefilim Ransomware, Artem Stryzhak, Pleads Guilty to Conspiracy Charges","Artem Aleksandrovych Stryzhak, a Ukrainian national, has pleaded guilty in a U.S. federal court for his role in the Nefilim ransomware conspiracy. Stryzhak, 35, was a key operator for the ransomware group that targeted high-revenue companies in the U.S. and Europe between 2018 and 2021, causing millions in damages. The group was known for its double-extortion tactics, stealing data before encryption and threatening to leak it on their 'Corporate Leaks' site. Stryzhak faces up to 10 years in prison, while his co-conspirator, Volodymyr Tymoshchuk, remains at large with an $11 million bounty offered by the U.S. Department of State.",[37,38,39,40,41],"Double Extortion","Big Game Hunting","Cybercrime","DOJ","Extradition",[43,44,45],"Ransomware","Threat Actor","Regulatory",{"id":47,"slug":48,"headline":49,"title":50,"severity":51,"excerpt":52,"tags":53,"categories":60,"createdAt":27,"updatedAt":27,"readingTime":28,"isUpdate":29},"8794948d-d5e2-4811-a1c2-88d1dbd23255","cisco-warns-active-zero-day-attacks-on-secure-email-gateway","URGENT: Cisco Warns of Active Zero-Day Attacks on Email Security Appliances","Cisco Warns of Actively Exploited Zero-Day Vulnerability in Secure Email Gateway and Web Manager","critical","Cisco has issued an urgent security advisory for an actively exploited zero-day vulnerability in its AsyncOS software, affecting Cisco Secure Email Gateway (formerly IronPort) and Secure Email and Web Manager appliances. Threat actors are leveraging the unpatched flaw to deploy persistent backdoors and tunneling tools, granting them long-term, stealthy access to enterprise email infrastructure. A patch is not yet available, and Cisco is strongly urging administrators to apply interim mitigations, restrict management access, and monitor logs for signs of compromise.",[54,55,56,57,58,59],"Zero-Day","0day","Email Security","IronPort","Backdoor","Active Exploitation",[61,25,62],"Vulnerability","Threat Intelligence",{"id":64,"slug":65,"headline":66,"title":67,"severity":15,"excerpt":68,"tags":69,"categories":75,"createdAt":27,"updatedAt":27,"readingTime":28,"isUpdate":29},"b4205c37-cfda-49c0-a223-862df951dd34","ghostpairing-attack-hijacks-whatsapp-accounts-via-device-linking","Warning: \"GhostPairing\" Attack Hijacks WhatsApp Accounts with Malicious QR Codes","\"GhostPairing\" Social Engineering Campaign Hijacks WhatsApp Accounts via Device Linking Feature","A new social engineering campaign dubbed \"GhostPairing\" is exploiting WhatsApp's multi-device linking feature to hijack user accounts. India's CERT-In has issued a high-severity warning about the attack, which tricks victims into scanning a malicious QR code or entering a pairing code from a fraudulent website. This action links the attacker's device to the victim's account, granting them full access to messages, contacts, and media without needing a password or SIM swap. The attack bypasses traditional authentication, relying purely on deceiving the user into performing the linking action themselves.",[70,71,72,73,74],"Social Engineering","WhatsApp","Account Takeover","QR Code","CERT-In",[76,77,25],"Phishing","Mobile Security",{"id":79,"slug":80,"headline":81,"title":82,"severity":15,"excerpt":83,"tags":84,"categories":90,"createdAt":27,"updatedAt":27,"readingTime":28,"cves":92,"cvssScore":94,"isUpdate":29},"d57ae952-af4e-4239-8169-778999f734c6","mongodb-mongobleed-vulnerability-cve-2025-14847-unauthenticated-data-leak","MongoDB 'MongoBleed' Flaw Allows Unauthenticated Data Leaks, Actively Exploited","MongoDB Discloses \"MongoBleed\" (CVE-2025-14847), a High-Severity Unauthenticated Memory Leak Vulnerability","MongoDB has disclosed a high-severity vulnerability, CVE-2025-14847, nicknamed \"MongoBleed.\" The flaw is an unauthenticated memory leak in the database server's zlib compression functionality. A remote, unauthenticated attacker can send a malformed message to a vulnerable server, causing it to leak contents of its memory. This exposed data can include sensitive information like plaintext passwords, API keys, and session tokens from other user sessions. The vulnerability affects multiple versions of MongoDB, and with a PoC exploit public and active exploitation confirmed, administrators are urged to upgrade immediately or disable zlib compression as a workaround.",[85,86,87,59,88,89],"Database Security","Memory Leak","Unauthenticated","PoC","zlib",[61,24,91],"Cloud Security",[93],"CVE-2025-14847",8.7,{"id":96,"slug":97,"headline":98,"title":99,"severity":51,"excerpt":100,"tags":101,"categories":109,"createdAt":27,"updatedAt":27,"readingTime":28,"isUpdate":29},"3a381eea-c6d4-4be2-8cd2-c895e11f1cb9","dotnet-soapwn-flaw-enables-authentication-bypass-and-rce",".NET \"SOAPwn\" Flaw Allows Authentication Bypass and RCE in Enterprise Apps","Critical \"SOAPwn\" Vulnerability in .NET Enables Authentication Bypass and Remote Code Execution","A critical vulnerability nicknamed \"SOAPwn\" has been discovered in .NET applications utilizing SOAP-based web services. The flaw, reported on December 19, 2025, allows an unauthenticated attacker to send a specially crafted SOAP request to bypass security checks and achieve remote code execution. This poses a severe risk to many enterprise applications that rely on the legacy SOAP protocol for critical business functions. Microsoft has issued guidance and released patches, urging organizations to update their applications immediately and monitor for suspicious SOAP traffic.",[102,103,104,105,106,107,108],"SOAP",".NET","WCF","ASMX","RCE","Authentication Bypass","Legacy Systems",[61,62,110],"Patch Management",1769004886208]