[{"data":1,"prerenderedAt":343},["ShallowReactive",2],{"publications-index":3},{"publications":4,"totalCount":16,"lastUpdated":342},[5,33,47,57,67,76,86,96,105,114,123,132,142,151,160,169,178,187,197,206,216,225,234,243,252,261,270,279,288,297,306,315,324,333],{"id":6,"slug":7,"title":8,"type":9,"publishedAt":10,"pub_date":10,"articleCount":11,"summary":12,"severityBreakdown":13,"statusCounts":18,"categories":20},"pub-2025-11-08","daily-threat-publications-2025-11-08","Samsung Zero-Day Exploited by LANDFALL Spyware; Sandworm Escalates Destructive Attacks on Ukraine","daily","2025-11-08",7,"This cybersecurity publication for November 8, 2025, covers a critical period marked by sophisticated mobile espionage, escalating nation-state attacks, and a record surge in supply chain compromises. Key stories include the discovery of the LANDFALL spyware using a Samsung zero-day for zero-click attacks in the Middle East, a new report detailing Russia's Sandworm group intensifying destructive wiper attacks against Ukraine's critical infrastructure, and data showing software supply chain attacks hit an all-time high in October, driven by ransomware gangs like Qilin.",{"critical":14,"high":15,"medium":14,"low":16,"informational":17},1,3,0,2,{"new":15,"updated":19},4,[21,22,23,24,25,26,27,28,29,30,31,32],"Cloud Security","Data Breach","Malware","Other","Phishing","Policy and Compliance","Ransomware","Security Operations","Supply Chain Attack","Threat Actor","Threat Intelligence","Vulnerability",{"id":34,"slug":35,"title":36,"type":9,"publishedAt":37,"pub_date":37,"articleCount":11,"summary":38,"severityBreakdown":39,"statusCounts":40,"categories":42},"pub-2025-11-07","daily-threat-publications-2025-11-07","Cisco Firewalls Under Siege by New DoS Attacks; AI Supercharges Ransomware Campaigns","2025-11-07","In the period covering November 6-7, 2025, the cybersecurity landscape was dominated by new attack variants targeting critical Cisco firewall vulnerabilities, causing persistent denial-of-service conditions. Concurrently, reports emerged detailing how threat actors are leveraging AI to drastically shorten ransomware attack timelines, with Europe becoming a primary target. Other major developments include a sophisticated global phishing campaign against Booking.com users, the discovery of Android spyware delivered via a Samsung zero-day, and a record-breaking month for software supply chain attacks driven by ransomware groups like Qilin and Akira.",{"critical":15,"high":19,"medium":16,"low":16,"informational":16},{"new":41,"updated":14},6,[21,43,44,23,45,46,25,27,29,30,31,32],"Cyberattack","Industrial Control Systems","Mobile Security","Patch Management",{"id":48,"slug":49,"title":50,"type":9,"publishedAt":51,"pub_date":51,"articleCount":11,"summary":52,"severityBreakdown":53,"statusCounts":54,"categories":55},"pub-2025-11-06","daily-threat-publications-2025-11-06","AI-Powered Malware Emerges as Critical Zero-Click Flaw Hits Billions of Android Devices","2025-11-06","This cybersecurity brief for November 6, 2025, covers a landmark shift in the threat landscape with Google's discovery of AI-powered malware like PROMPTFLUX, which uses LLMs to mutate its own code. Concurrently, a critical zero-click RCE vulnerability (CVE-2025-48593) was disclosed for Android versions 13-16, posing a severe risk to billions of users. Other major incidents include the Qilin ransomware gang's claimed breach of Habib Bank AG Zurich, a cyberattack on the U.S. Congressional Budget Office, and a supply chain attack by Cl0p impacting The Washington Post via an Oracle zero-day.",{"critical":15,"high":15,"medium":14,"low":16,"informational":16},{"new":41,"updated":14},[43,22,23,45,46,27,56,29,31,32],"Regulatory",{"id":58,"slug":59,"title":60,"type":9,"publishedAt":61,"pub_date":61,"articleCount":41,"summary":62,"severityBreakdown":63,"statusCounts":64,"categories":66},"pub-2025-11-05","daily-threat-publications-2025-11-05","Critical Infrastructure Under Fire: CISA Warns of Major ICS Flaws, State-Sponsor Breaches F5 BIG-IP","2025-11-05","This cybersecurity brief for November 5, 2025, covers a series of high-stakes threats targeting critical infrastructure and enterprise security. CISA has disclosed severe vulnerabilities in industrial control systems from five vendors, while a state-sponsored actor has breached F5, compromising its BIG-IP source code and creating a significant supply chain risk. Other major developments include the evolution of the DragonForce ransomware group into a 'cartel' with ties to Scattered Spider, the indictment of cybersecurity insiders for deploying BlackCat ransomware, and a massive data breach at a Swedish IT firm exposing 1.5 million individuals' data. These events underscore the growing threats to OT environments, the sophistication of ransomware actors, and the persistent danger of insider threats and cloud misconfigurations.",{"critical":15,"high":17,"medium":16,"low":16,"informational":14},{"new":65,"updated":14},5,[21,43,22,44,46,26,56,28,29,30,31,32],{"id":68,"slug":69,"title":70,"type":9,"publishedAt":71,"pub_date":71,"articleCount":65,"summary":72,"severityBreakdown":73,"statusCounts":74,"categories":75},"pub-2025-11-04","daily-threat-publications-2025-11-04","Insider Threats, Zero-Days, and Ransomware Shake Global Cybersecurity Landscape","2025-11-04","This 24-hour cybersecurity brief for November 4, 2025, covers critical developments including the indictment of cybersecurity professionals for running a BlackCat ransomware ring, a severe zero-click RCE in Android, and a new Cl0p campaign exploiting an Oracle zero-day. Reports also highlight the emergence of the Conti-derived DragonForce ransomware and the massive financial fallout for SK Telecom after a major data breach.",{"critical":14,"high":14,"medium":17,"low":16,"informational":14},{"new":19,"updated":14},[43,23,46,26,27,56,28,29,30,31,32],{"id":77,"slug":78,"title":79,"type":9,"publishedAt":80,"pub_date":80,"articleCount":11,"summary":81,"severityBreakdown":82,"statusCounts":83,"categories":84},"pub-2025-11-03","daily-threat-publications-2025-11-03","Chinese APT 'Airstalk' Malware Targets BPO Supply Chains; Insider Threats and Cl0p Zero-Day Exploits Escalate","2025-11-03","This cybersecurity brief for November 3rd, 2025, covers a surge in sophisticated threats. Key developments include the discovery of 'Airstalk,' a new Chinese APT malware using MDM APIs for C2 in supply chain attacks against the BPO sector. In a shocking insider threat case, cybersecurity professionals were indicted for using ALPHV/BlackCat ransomware. The Cl0p ransomware group is actively exploiting an Oracle zero-day (CVE-2025-61882), while an unpatched Windows LNK flaw (CVE-2025-9491) continues to be leveraged by APTs. Additionally, new reports highlight advanced phishing on LinkedIn, the massive financial fallout from the SK Telecom breach, and escalating ransomware attacks across Europe.",{"critical":14,"high":19,"medium":14,"low":16,"informational":14},{"new":65,"updated":17},[21,43,22,85,44,23,26,27,56,30,31,32],"Incident Response",{"id":87,"slug":88,"title":89,"type":9,"publishedAt":90,"pub_date":90,"articleCount":91,"summary":92,"severityBreakdown":93,"statusCounts":94,"categories":95},"pub-2025-11-02","daily-threat-publications-2025-11-02","Penn Breach Exposes 1.2M Records; Critical Android Zero-Click & Chinese APTs Target Zero-Days","2025-11-02",8,"This cybersecurity brief for November 2nd, 2025, covers a series of high-impact security incidents. A massive data breach at the University of Pennsylvania has allegedly exposed 1.2 million donor records. Google has issued an urgent patch for a critical zero-click RCE vulnerability in Android. Meanwhile, Chinese state-sponsored threat actors, including Bronze Butler and UNC6384, are actively exploiting zero-day vulnerabilities in Lanscope and Windows systems to deploy malware and spy on targets in Europe and Asia. Other significant events include a major data breach at a Polish loan company and an Australian government warning about new malware targeting Cisco devices.",{"critical":17,"high":19,"medium":14,"low":16,"informational":14},{"new":11,"updated":14},[43,22,23,45,46,26,56,29,31,32],{"id":97,"slug":98,"title":99,"type":9,"publishedAt":100,"pub_date":100,"articleCount":11,"summary":101,"severityBreakdown":102,"statusCounts":103,"categories":104},"pub-2025-11-01","daily-threat-publications-2025-11-01","China-Linked Actors Exploit Windows & VMware Zero-Days; Ransomware Gangs Hit Major Corporations","2025-11-01","This cybersecurity brief for November 1, 2025, covers a surge in state-sponsored cyber-espionage and critical zero-day exploitation. Chinese-linked threat actors are actively leveraging an unpatched Windows vulnerability (CVE-2025-9491) to spy on European diplomats and a now-patched VMware flaw (CVE-2025-41244) for privilege escalation. Concurrently, ransomware remains a dominant threat, with the Akira group claiming a breach at Apache OpenOffice, RansomHouse hitting Japanese retailer Askul, and a massive data breach at Conduent affecting over 10.5 million individuals. Other significant developments include the discovery of new malware families 'KYBER' and 'Airstalk', a supply chain attack on the npm registry, and an ongoing campaign targeting Cisco devices in Australia.",{"critical":14,"high":65,"medium":14,"low":16,"informational":16},{"new":65,"updated":17},[43,22,23,27,56,29,30,31,32],{"id":106,"slug":107,"title":108,"type":9,"publishedAt":109,"pub_date":109,"articleCount":11,"summary":110,"severityBreakdown":111,"statusCounts":112,"categories":113},"pub-2025-10-31","daily-threat-publications-2025-10-31","PhantomRaven Supply Chain Attack Hits npm; Conduent Breach Exposes 10.5M; CISA Flags Actively Exploited Flaws","2025-10-31","This cybersecurity brief for October 31, 2025, covers a surge in sophisticated threats. Highlights include the 'PhantomRaven' supply chain attack on npm using novel evasion techniques, a massive data breach at Conduent affecting 10.5 million individuals, and CISA adding critical, actively exploited vulnerabilities in XWiki and VMware to its KEV catalog. Other major incidents include a prolonged nation-state breach at a key telecom provider, a significant Azure outage, and escalating ransomware campaigns from the Qilin group.",{"critical":14,"high":65,"medium":14,"low":16,"informational":16},{"new":65,"updated":17},[21,43,22,44,46,25,26,27,56,29,30,31,32],{"id":115,"slug":116,"title":117,"type":9,"publishedAt":118,"pub_date":118,"articleCount":41,"summary":119,"severityBreakdown":120,"statusCounts":121,"categories":122},"pub-2025-10-30","daily-threat-publications-2025-10-30","Microsoft Azure Outage Causes Global Chaos; CISA Warns of Actively Exploited WSUS Flaw","2025-10-30","This cybersecurity brief for October 30, 2025, covers a widespread Microsoft Azure outage triggered by a configuration error, a critical CISA alert for an actively exploited Windows Server vulnerability (CVE-2025-59287), and massive data breaches at government contractor Conduent and consulting giant EY. New threats include the 'Herodotus' Android malware and the 'logins[.]zip' infostealer, while the UK government considers a ransomware payment ban in response to escalating attacks.",{"critical":14,"high":19,"medium":16,"low":16,"informational":14},{"new":65,"updated":14},[21,43,22,23,26,27,56,30,31,32],{"id":124,"slug":125,"title":126,"type":9,"publishedAt":127,"pub_date":127,"articleCount":11,"summary":128,"severityBreakdown":129,"statusCounts":130,"categories":131},"pub-2025-10-29","daily-threat-publications-2025-10-29","Urgent WSUS Patch Mandated Amidst Wave of Zero-Day Exploits Targeting Oracle, Chrome, and AI Agents","2025-10-29","This cybersecurity brief for October 29, 2025, covers a series of critical threats, led by an urgent CISA directive to patch an actively exploited, wormable RCE vulnerability in Windows Server Update Services (CVE-2025-59287). The threat landscape is further defined by major zero-day attacks, with the FIN11/Clop ransomware group targeting Oracle EBS systems at industrial giants, and the 'Mem3nt0 mori' APT exploiting a Chrome zero-day. New malware strains have also emerged, including 'Airstalk' in a suspected nation-state supply chain attack and 'Herodotus', an Android trojan that mimics human behavior. Additionally, a report highlights the destructive impact of the 'Scattered Spider' group and a massive surge in AI-powered vishing attacks.",{"critical":14,"high":65,"medium":14,"low":16,"informational":16},{"new":65,"updated":17},[21,43,22,23,45,25,26,27,29,30,32],{"id":133,"slug":134,"title":135,"type":9,"publishedAt":136,"pub_date":136,"articleCount":137,"summary":138,"severityBreakdown":139,"statusCounts":140,"categories":141},"pub-2025-10-28","daily-threat-publications-2025-10-28","Actively Exploited WSUS Flaw Triggers Emergency Patch; Qilin Ransomware Becomes 2025's Top Threat","2025-10-28",10,"This cybersecurity brief for October 28, 2025, covers several critical developments. Microsoft is scrambling to contain an actively exploited RCE vulnerability in WSUS (CVE-2025-59287) after a botched patch, forcing an emergency update. In the ransomware landscape, the Qilin group has surged to become the most prolific threat of 2025 with over 700 attacks, while payment rates have hit a record low. Other major incidents include a data breach at Sweden's power grid operator claimed by the Everest gang, a massive leak of 4.8 million patient records from Kenya's M-TIBA health platform, and new CISA alerts for critical flaws in industrial control systems and endpoint management software.",{"critical":19,"high":65,"medium":16,"low":16,"informational":14},{"new":91,"updated":17},[21,43,22,44,23,46,25,26,27,56,28,30,31,32],{"id":143,"slug":144,"title":145,"type":9,"publishedAt":146,"pub_date":146,"articleCount":41,"summary":147,"severityBreakdown":148,"statusCounts":149,"categories":150},"pub-2025-10-27","daily-threat-publications-2025-10-27","Microsoft Scrambles to Patch Actively Exploited WSUS Flaw as Qilin Ransomware Surges","2025-10-27","In cybersecurity news for October 27, 2025, Microsoft issued an emergency patch for a critical, actively exploited remote code execution vulnerability in Windows Server Update Services (WSUS). Concurrently, reports indicate the Qilin ransomware group has become the most prolific operator of 2025, claiming over 700 victims. Other major incidents include a massive China-linked smishing campaign using over 194,000 domains, active exploitation of a critical flaw in Adobe Commerce, and a series of data breaches affecting the retail and healthcare sectors.",{"critical":14,"high":19,"medium":14,"low":16,"informational":16},{"new":65,"updated":14},[21,43,22,23,27,56,30,31,32],{"id":152,"slug":153,"title":154,"type":9,"publishedAt":155,"pub_date":155,"articleCount":17,"summary":156,"severityBreakdown":157,"statusCounts":158,"categories":159},"pub-2025-10-26","daily-threat-publications-2025-10-26","Microsoft Scrambles to Patch Actively Exploited WSUS Flaw; Dublin Airport Breach Hits 3.8M","2025-10-26","This cybersecurity brief for October 26, 2025, covers several critical global incidents. A severe, actively exploited remote code execution vulnerability (CVE-2025-59287) in Microsoft's WSUS has prompted an emergency out-of-band patch, with CISA mandating immediate action. In a massive supply chain attack, Dublin Airport disclosed a data breach affecting 3.8 million passengers after a third-party provider, Collins Aerospace, was compromised by ransomware. Meanwhile, a DDoS attack on Russia's food safety agency crippled national supply chains, the Safepay ransomware group targeted a German video surveillance firm, and dozens of nations signed a landmark, albeit controversial, UN cybercrime treaty in Hanoi.",{"critical":16,"high":17,"medium":16,"low":16,"informational":16},{"new":17,"updated":16},[43,44,26,27,29,30],{"id":161,"slug":162,"title":163,"type":9,"publishedAt":164,"pub_date":164,"articleCount":91,"summary":165,"severityBreakdown":166,"statusCounts":167,"categories":168},"pub-2025-10-25","daily-threat-publications-2025-10-25","CISA Issues Emergency Directive for Actively Exploited Microsoft WSUS Flaw; Ransomware Surges 50% in 2025","2025-10-25","This cybersecurity brief for October 25, 2025, covers critical developments, led by an emergency CISA directive for an actively exploited remote code execution vulnerability (CVE-2025-59287) in Microsoft's Windows Server Update Service (WSUS). Other major stories include Microsoft's massive October Patch Tuesday fixing 193 flaws and six zero-days, a reported 50% surge in ransomware attacks in 2025 driven by new groups like Qilin, the resurgence of the LockBit ransomware gang with a new 'LockBit 5.0' variant, and a massive 'Smishing Triad' campaign using over 194,000 malicious domains. Global policy shifts are also noted, with the UK and Singapore launching a supply chain security initiative and the UN finalizing its Convention against Cybercrime.",{"critical":17,"high":17,"medium":16,"low":16,"informational":19},{"new":65,"updated":15},[43,44,45,46,26,27,56,28,30,31,32],{"id":170,"slug":171,"title":172,"type":9,"publishedAt":173,"pub_date":173,"articleCount":137,"summary":174,"severityBreakdown":175,"statusCounts":176,"categories":177},"pub-2025-10-24","daily-threat-publications-2025-10-24","Critical WSUS Zero-Day Exploited, Prosper Breach Hits 17.6M, and Iranian APT Deploys 'Phoenix' Backdoor","2025-10-24","This reporting period, October 23-24, 2025, has been marked by significant and active threats. A critical, actively exploited zero-day vulnerability (CVE-2025-59287) in Microsoft's WSUS has prompted an emergency patch and a CISA KEV alert, posing a severe risk to enterprise networks. In the financial sector, a massive data breach at Prosper Marketplace has exposed the highly sensitive personal and financial data of 17.6 million users. Concurrently, nation-state activity surged with an Iranian-linked APT group targeting over 100 government institutions globally using a new 'Phoenix' backdoor. Other major incidents include Google patching its sixth actively exploited Chrome zero-day of the year and multiple high-impact ransomware attacks affecting manufacturing, education, and critical infrastructure sectors.",{"critical":15,"high":65,"medium":17,"low":16,"informational":16},{"new":41,"updated":19},[21,43,22,44,46,25,27,56,29,30,31,32],{"id":179,"slug":180,"title":181,"type":9,"publishedAt":182,"pub_date":182,"articleCount":11,"summary":183,"severityBreakdown":184,"statusCounts":185,"categories":186},"pub-2025-10-23","daily-threat-publications-2025-10-23","Ransomware Automation Slashes Attack Times to Minutes; Supply Chain Overconfidence Creates Massive Risk","2025-10-23","In cybersecurity news for October 23, 2025, the threat landscape is defined by escalating speed and systemic risk. A new report reveals ransomware groups are using automation to compress attack timelines to just 18 minutes from initial access to lateral movement. Simultaneously, another study highlights a dangerous overconfidence in supply chain security, with 94% of firms feeling prepared despite a third failing to conduct basic supplier risk assessments. This is underscored by the staggering £1.9 billion economic cost of the Jaguar Land Rover hack, which cascaded through 5,000 supply chain organizations. Regulators are responding, with New York's DFS issuing new guidance on third-party risk. Meanwhile, CISA has added another actively exploited vulnerability to its KEV catalog, demanding immediate action from federal agencies.",{"critical":16,"high":15,"medium":15,"low":16,"informational":14},{"new":65,"updated":17},[21,43,22,24,46,25,26,27,56,29,31,32],{"id":188,"slug":189,"title":190,"type":9,"publishedAt":191,"pub_date":191,"articleCount":19,"summary":192,"severityBreakdown":193,"statusCounts":194,"categories":195},"pub-2025-10-22","daily-threat-publications-2025-10-22","Ransomware Surges, JLR Hack Costs UK £1.9B, and 'GlassWorm' Hits Developers in Widespread Attacks","2025-10-22","This cybersecurity advisory for October 21-22, 2025, covers a dramatic 34% surge in ransomware attacks against global critical infrastructure, with the U.S. being the top target. A separate analysis reveals the staggering economic fallout of a cyberattack on Jaguar Land Rover, costing the UK economy an estimated £1.9 billion. A sophisticated new worm, 'GlassWorm', is spreading through the VS Code ecosystem using invisible code to infect developers. Additionally, critical vulnerabilities have been disclosed in the Netty Java library and Oracle's E-Business Suite, while the UK government issues an urgent call for businesses to bolster defenses.",{"critical":17,"high":17,"medium":16,"low":16,"informational":16},{"new":19,"updated":16},[43,22,196,46,25,30,31,32],"IoT Security",{"id":198,"slug":199,"title":200,"type":9,"publishedAt":201,"pub_date":201,"articleCount":91,"summary":202,"severityBreakdown":203,"statusCounts":204,"categories":205},"pub-2025-10-21","daily-threat-publications-2025-10-21","Citrix Zero-Day Hits US Gov; APTs & Sophisticated Malware Campaigns Surge Globally","2025-10-21","This intelligence brief for October 21, 2025, covers a series of high-impact cybersecurity events. A critical Citrix zero-day, 'CitrixBleed 2.0', led to a major data breach at the U.S. Department of Homeland Security, exposing employee data. Nation-state activity remains high, with China-linked Salt Typhoon targeting European telecoms and Russia-linked COLDRIVER rapidly deploying new malware after public disclosure. A novel supply chain attack, 'GlassWorm', is targeting VS Code developers using advanced obfuscation and a blockchain-based C2. Meanwhile, new reports highlight a 34% surge in ransomware attacks on critical infrastructure and the growing challenge of AI-powered cyberattacks outpacing organizational defenses.",{"critical":17,"high":19,"medium":16,"low":16,"informational":17},{"new":91,"updated":16},[43,22,85,23,26,27,56,29,30,31,32],{"id":207,"slug":208,"title":209,"type":9,"publishedAt":210,"pub_date":210,"articleCount":211,"summary":212,"severityBreakdown":213,"statusCounts":214,"categories":215},"pub-2025-10-20","daily-threat-publications-2025-10-20","CISA Mandates Patches for Exploited Flaws; Nation-State Actors Breach F5 and Prosper Suffers Massive Data Leak","2025-10-20",9,"This cybersecurity brief for October 20, 2025, covers a series of high-impact events. CISA has added five actively exploited vulnerabilities to its KEV catalog, mandating urgent patching. In a significant supply-chain threat, a nation-state actor breached F5, stealing BIG-IP source code. Meanwhile, the Prosper lending platform disclosed a massive data breach affecting 17.6 million users, and the Cl0p ransomware gang is exploiting a new zero-day in Oracle E-Business Suite. These incidents highlight escalating threats across patch management, supply chain security, and data protection.",{"critical":14,"high":11,"medium":16,"low":16,"informational":14},{"new":19,"updated":65},[21,43,22,85,44,23,46,25,26,27,56,29,30,31,32],{"id":217,"slug":218,"title":219,"type":9,"publishedAt":220,"pub_date":220,"articleCount":41,"summary":221,"severityBreakdown":222,"statusCounts":223,"categories":224},"pub-2025-10-19","daily-threat-publications-2025-10-19","Europol Busts 'SIMCARTEL' CaaS Network; Everest Ransomware Claims Collins Aerospace Attack","2025-10-19","This cybersecurity brief for October 19, 2025, covers major international law enforcement actions, high-profile ransomware claims, and critical vulnerability disclosures. Key events include the dismantling of the 'SIMCARTEL' Cybercrime-as-a-Service platform in Europe, the Everest ransomware group claiming responsibility for the disruptive Collins Aerospace attack, and Microsoft's revocation of over 200 malicious certificates used by the Vanilla Tempest group. Additionally, CISA has issued warnings for two actively exploited Windows zero-day vulnerabilities, and a critical RCE flaw has been patched in Microsoft WSUS.",{"critical":14,"high":15,"medium":17,"low":16,"informational":16},{"new":19,"updated":17},[43,22,23,46,26,27,56,28,29,30,31,32],{"id":226,"slug":227,"title":228,"type":9,"publishedAt":229,"pub_date":229,"articleCount":211,"summary":230,"severityBreakdown":231,"statusCounts":232,"categories":233},"pub-2025-10-18","daily-threat-publications-2025-10-18","Nation-State Actors Breach F5 Networks Stealing BIG-IP Source Code; AI Phishing Effectiveness Skyrockets","2025-10-18","This cybersecurity brief for October 18, 2025, covers a critical supply chain attack against F5 Networks by a nation-state actor, resulting in the theft of BIG-IP source code and unpatched vulnerability data. Other major developments include a Microsoft report revealing AI-powered phishing is 4.5 times more effective, active exploitation of a Cisco zero-day to deploy rootkits, and the Clop ransomware group breaching an American Airlines subsidiary via Oracle EBS flaws. The period also saw rising ransomware attacks targeting healthcare and increased warnings about supply chain security from the UK's NCSC.",{"critical":17,"high":65,"medium":14,"low":16,"informational":14},{"new":41,"updated":15},[21,43,22,23,25,26,27,56,29,30,31,32],{"id":235,"slug":236,"title":237,"type":9,"publishedAt":238,"pub_date":238,"articleCount":91,"summary":239,"severityBreakdown":240,"statusCounts":241,"categories":242},"pub-2025-10-17","daily-threat-publications-2025-10-17","Microsoft Patches Three Zero-Days, F5 Suffers Nation-State Breach, and Critical Adobe Flaw Actively Exploited","2025-10-17","This cybersecurity brief for October 17, 2025, covers a massive Microsoft Patch Tuesday addressing over 172 vulnerabilities, including three actively exploited zero-days. In other major news, F5 Networks disclosed a significant breach by a nation-state actor resulting in source code theft, and CISA issued an urgent warning for a critical, actively exploited Adobe AEM vulnerability with a 10.0 CVSS score. Additional stories include a massive data breach at lending platform Prosper affecting 17.6 million users, a surge in AKIRA ransomware attacks targeting Swiss companies, and new regulatory pressures from a stricter data breach notification law in California.",{"critical":15,"high":17,"medium":17,"low":16,"informational":14},{"new":65,"updated":15},[43,22,44,46,25,26,27,56,29,30,31,32],{"id":244,"slug":245,"title":246,"type":9,"publishedAt":247,"pub_date":247,"articleCount":65,"summary":248,"severityBreakdown":249,"statusCounts":250,"categories":251},"pub-2025-10-16","daily-threat-publications-2025-10-16","CISA Emergency Directive Issued After F5 Source Code Theft by Nation-State Actor; Microsoft Patches Four Actively Exploited Zero-Days","2025-10-16","This cybersecurity brief for October 16, 2025, covers a critical supply chain threat following the theft of F5 source code by a Chinese nation-state actor, prompting a CISA emergency directive. Concurrently, Microsoft's October Patch Tuesday addresses over 170 flaws, including four actively exploited zero-days. Other major events include the disruption of a ransomware campaign using signed malware, the discovery of a Chinese APT targeting a Russian IT firm, a massive data breach affecting two major airlines, and the disclosure of critical flaws in industrial control systems.",{"critical":14,"high":19,"medium":16,"low":16,"informational":16},{"new":15,"updated":17},[21,43,22,44,23,27,29,30,32],{"id":253,"slug":254,"title":255,"type":9,"publishedAt":256,"pub_date":256,"articleCount":41,"summary":257,"severityBreakdown":258,"statusCounts":259,"categories":260},"pub-2025-10-15","daily-threat-publications-2025-10-15","Microsoft Patches 172 Flaws and Six Zero-Days; F5 Discloses Nation-State Breach Stealing BIG-IP Source Code","2025-10-15","This intelligence briefing for October 15, 2025, covers a massive Microsoft Patch Tuesday addressing 172 vulnerabilities, including three actively exploited zero-days. A critical supply chain threat emerges as F5 discloses a long-term breach by a nation-state actor who stole BIG-IP source code, prompting a CISA emergency directive. Other major developments include the return of the LockBit ransomware group with an upgraded version, a surge in overall ransomware attacks, and multiple data breach and vulnerability disclosures affecting companies like Canadian Tire and Fortinet.",{"critical":14,"high":15,"medium":14,"low":16,"informational":14},{"new":65,"updated":14},[43,22,23,46,27,56,29,30,31,32],{"id":262,"slug":263,"title":264,"type":9,"publishedAt":265,"pub_date":265,"articleCount":11,"summary":266,"severityBreakdown":267,"statusCounts":268,"categories":269},"pub-2025-10-14","daily-threat-publications-2025-10-14","Microsoft's Massive October Patch Tuesday Fixes 175 Flaws and 3 Zero-Days; F5 Discloses Nation-State Breach","2025-10-14","This cybersecurity advisory for October 14, 2025, covers a record-breaking Microsoft Patch Tuesday addressing 175 vulnerabilities, including three actively exploited zero-days. Additionally, F5 disclosed a major breach by a nation-state actor, resulting in the theft of BIG-IP source code and a CISA emergency directive. Other significant events include new campaigns by Chinese APTs Flax Typhoon and Jewelbug, a novel phishing attack abusing NPM infrastructure, and ongoing ransomware activity from the Qilin group.",{"critical":14,"high":19,"medium":17,"low":16,"informational":16},{"new":41,"updated":14},[43,22,46,27,29,30,31,32],{"id":271,"slug":272,"title":273,"type":9,"publishedAt":274,"pub_date":274,"articleCount":91,"summary":275,"severityBreakdown":276,"statusCounts":277,"categories":278},"pub-2025-10-13","daily-threat-publications-2025-10-13","Critical Oracle Zero-Day Exploited by TA505 & Cl0p; Discord Vendor Breach Exposes 70,000 IDs","2025-10-13","This cybersecurity brief for October 13, 2025, covers a critical zero-day vulnerability (CVE-2025-61882) in Oracle E-Business Suite being actively exploited by major extortion groups, leading to widespread data theft. Other significant events include a major data breach at a Discord third-party vendor exposing 70,000 user IDs, a novel phishing campaign abusing NPM infrastructure, and a report showing a 30% surge in ransomware attacks against healthcare vendors.",{"critical":14,"high":65,"medium":17,"low":16,"informational":16},{"new":11,"updated":14},[43,22,23,45,46,25,26,27,28,29,30,32],{"id":280,"slug":281,"title":282,"type":9,"publishedAt":283,"pub_date":283,"articleCount":11,"summary":284,"severityBreakdown":285,"statusCounts":286,"categories":287},"pub-2025-10-12","daily-threat-publications-2025-10-12","Massive Supply Chain Attacks Expose Millions; Clop Ransomware Targets Harvard and Oracle","2025-10-12","In the period covering October 12, 2025, the cybersecurity landscape was dominated by large-scale supply chain attacks and aggressive ransomware campaigns. A hacker collective dubbed 'Scattered Lapsus$ Hunters' leaked data for 5.7 million Qantas customers and 7.3 million Vietnam Airlines customers after compromising a shared Salesforce environment. Concurrently, the Clop ransomware gang claimed a breach of Harvard University and was found actively exploiting a zero-day in Oracle E-Business Suite, for which Oracle released an emergency patch for a separate, newly discovered high-severity flaw. Other significant events include the abuse of the Velociraptor DFIR tool to deploy ransomware and reports of North Korean hackers stealing a record $2 billion in crypto assets in 2025.",{"critical":14,"high":19,"medium":17,"low":16,"informational":16},{"new":11,"updated":16},[43,22,85,23,46,26,27,28,30,32],{"id":289,"slug":290,"title":291,"type":9,"publishedAt":292,"pub_date":292,"articleCount":91,"summary":293,"severityBreakdown":294,"statusCounts":295,"categories":296},"pub-2025-10-11","daily-threat-publications-2025-10-11","Critical Flaws in Oracle & Redis Under Active Threat; Widespread Supply Chain Attacks Target Developers and Cloud Services","2025-10-11","This intelligence briefing for October 11, 2025, covers a series of critical cybersecurity incidents. Major themes include the active exploitation of a zero-day in Oracle E-Business Suite by the Cl0p ransomware group and the patching of a 13-year-old RCE flaw in Redis. Supply chain attacks remain a dominant threat, with malicious npm and Node.js packages targeting developers, and a Discord breach originating from a third-party vendor. SonicWall disclosed two major incidents: active exploitation of its VPNs by Akira ransomware and a full-scale breach of its Cloud Backup service affecting all customers. Additionally, new malware strains like 'Chaosbot' and the AI-powered 'MalTerminal' demonstrate evolving attacker TTPs.",{"critical":15,"high":65,"medium":16,"low":16,"informational":16},{"new":11,"updated":14},[21,43,22,23,46,25,27,29,31,32],{"id":298,"slug":299,"title":300,"type":9,"publishedAt":301,"pub_date":301,"articleCount":211,"summary":302,"severityBreakdown":303,"statusCounts":304,"categories":305},"pub-2025-10-10","daily-threat-publications-2025-10-10","Cl0p Exploits Oracle Zero-Day in Massive Extortion Spree; SonicWall Breach Hits All Cloud Backup Users","2025-10-10","This cybersecurity brief for October 10, 2025, covers a critical period marked by high-impact zero-day exploitation and significant data breaches. A Cl0p-affiliated group has been exploiting an Oracle E-Business Suite zero-day (CVE-2025-61882) for months, leading to an FBI warning. Concurrently, SonicWall admitted a breach impacted all cloud backup customers, exposing firewall configurations. Other major incidents include the 'CamoLeak' flaw in GitHub Copilot allowing code exfiltration, a supply chain breach at crypto platform Shuffle.com, and the emergence of new ransomware and APT groups.",{"critical":14,"high":41,"medium":14,"low":16,"informational":14},{"new":91,"updated":14},[21,43,22,44,23,45,25,26,27,56,29,30,31,32],{"id":307,"slug":308,"title":309,"type":9,"publishedAt":310,"pub_date":310,"articleCount":91,"summary":311,"severityBreakdown":312,"statusCounts":313,"categories":314},"pub-2025-10-09","daily-threat-publications-2025-10-09","Cl0p Exploits Oracle Zero-Day; Threat Actors Weaponize Legitimate Security Tools in Widespread Attacks","2025-10-09","This cybersecurity brief for October 9, 2025, covers a surge in critical threats, led by the Cl0p ransomware gang's exploitation of a zero-day vulnerability (CVE-2025-61882) in Oracle's E-Business Suite. A significant trend this period is the abuse of legitimate tools, with threat actors weaponizing the Velociraptor DFIR tool and exploiting a critical flaw (CVE-2025-10035) in Fortra's GoAnywhere MFT. Other major events include the Qilin ransomware attack on Japanese beverage giant Asahi, a sophisticated phishing campaign targeting marketing professionals, and new guidance from the G7 and UK's NCSC on managing AI risks and a sharp rise in national-level cyberattacks.",{"critical":17,"high":17,"medium":14,"low":16,"informational":15},{"new":65,"updated":15},[43,22,44,23,25,26,27,56,28,30,31,32],{"id":316,"slug":317,"title":318,"type":9,"publishedAt":319,"pub_date":319,"articleCount":211,"summary":320,"severityBreakdown":321,"statusCounts":322,"categories":323},"pub-2025-10-08","daily-threat-publications-2025-10-08","Salesforce Defies Extortionists After Customer Data Heist; Cl0p Exploits Critical Oracle Zero-Day","2025-10-08","This cybersecurity brief for October 8, 2025, covers several critical incidents. A threat actor alliance named 'Scattered LAPSUS$ Hunters' claims to have stolen data from over 40 Salesforce customers via social engineering, though Salesforce itself was not breached and refuses to pay the ransom. Concurrently, the Cl0p ransomware group is actively exploiting a critical zero-day vulnerability (CVE-2025-61882) in Oracle's E-Business Suite. Other major events include a significant data breach at a Red Hat consulting GitLab instance exposing sensitive client data, a ransomware attack by the Qilin group on Japanese beverage giant Asahi, and CISA adding a Zimbra XSS flaw to its KEV catalog.",{"critical":17,"high":19,"medium":17,"low":16,"informational":14},{"new":41,"updated":15},[21,22,45,46,25,26,27,56,28,29,30,32],{"id":325,"slug":326,"title":327,"type":9,"publishedAt":328,"pub_date":328,"articleCount":137,"summary":329,"severityBreakdown":330,"statusCounts":331,"categories":332},"pub-2025-10-07","daily-threat-publications-2025-10-07","Clop Exploits Oracle Zero-Day; CISA Catalogs Multiple Actively Exploited Flaws","2025-10-07","This cybersecurity advisory for October 7, 2025, covers a critical period marked by the active exploitation of a zero-day vulnerability (CVE-2025-61882) in Oracle E-Business Suite by the Clop ransomware group, prompting urgent international warnings. Concurrently, CISA has added several other flaws to its KEV catalog, including vulnerabilities in Microsoft Windows and Zimbra. Other major developments include a new extortion campaign by the 'Scattered Lapsus$ Hunters' collective targeting Salesforce customers, a critical RCE flaw in Redis, and Signal's threat to exit the EU over the proposed 'Chat Control' surveillance bill.",{"critical":17,"high":65,"medium":16,"low":16,"informational":15},{"new":91,"updated":17},[21,43,22,85,44,46,25,26,27,56,28,30,32],{"id":334,"slug":335,"title":336,"type":9,"publishedAt":337,"pub_date":337,"articleCount":137,"summary":338,"severityBreakdown":339,"statusCounts":340,"categories":341},"pub-2025-10-06","daily-threat-publications-2025-10-06","Microsoft Patches 3 Zero-Days Under Active Attack; Cl0p, Qilin, and Flax Typhoon Launch Major Campaigns","2025-10-06","In the period of October 5-6, 2025, the cybersecurity landscape was dominated by Microsoft's massive October Patch Tuesday, which addressed 175 vulnerabilities including three actively exploited zero-days. Concurrently, major threat actors launched significant campaigns: the Cl0p ransomware group exploited a zero-day in Oracle E-Business Suite for mass extortion, the Qilin gang crippled Asahi Breweries demanding a $10M ransom, and the Chinese APT Flax Typhoon was found using a novel ArcGIS server backdoor for long-term espionage. Other key events include a major escalation in the SonicWall data breach, a novel phishing technique abusing the NPM registry, and new warnings from CISA regarding widespread ICS vulnerabilities.",{"critical":17,"high":65,"medium":14,"low":16,"informational":17},{"new":137,"updated":16},[21,43,22,44,23,45,46,25,26,27,56,29,30,31,32],"2025-11-09T01:36:30.153Z",1762652189732]