[{"data":1,"prerenderedAt":170},["ShallowReactive",2],{"publication-daily-threat-publications-2025-10-06":3},{"pub_id":4,"headline":5,"summary":6,"pub_date":7,"total_articles":8,"articles":9},"pub-2025-10-06","Microsoft Patches 3 Zero-Days Under Active Attack; Cl0p, Qilin, and Flax Typhoon Launch Major Campaigns","In the period of October 5-6, 2025, the cybersecurity landscape was dominated by Microsoft's massive October Patch Tuesday, which addressed 175 vulnerabilities including three actively exploited zero-days. Concurrently, major threat actors launched significant campaigns: the Cl0p ransomware group exploited a zero-day in Oracle E-Business Suite for mass extortion, the Qilin gang crippled Asahi Breweries demanding a $10M ransom, and the Chinese APT Flax Typhoon was found using a novel ArcGIS server backdoor for long-term espionage. Other key events include a major escalation in the SonicWall data breach, a novel phishing technique abusing the NPM registry, and new warnings from CISA regarding widespread ICS vulnerabilities.","2025-10-06",10,[10,40,58,71,87,102,118,132,146,156],{"id":11,"slug":12,"headline":13,"title":14,"severity":15,"excerpt":16,"tags":17,"categories":25,"createdAt":29,"updatedAt":29,"readingTime":30,"cves":31,"cvssScore":38,"isUpdate":39},"4e4731ac-f25f-4327-884c-325af1e320f0","microsoft-october-2025-patch-tuesday-fixes-3-actively-exploited-zero-days","Microsoft Patches 3 Zero-Days Under Active Attack in Massive October Update","Microsoft's October 2025 Patch Tuesday Addresses 175 Vulnerabilities, Including Three Actively Exploited Zero-Days","critical","Microsoft has released its October 2025 Patch Tuesday update, a colossal release addressing 175 security flaws across its product suite. The update is highlighted by emergency patches for three zero-day vulnerabilities confirmed to be actively exploited in the wild. These critical flaws, now added to CISA's KEV catalog, include two privilege escalation bugs in Windows components (CVE-2025-59230 and CVE-2025-24990) and a Secure Boot bypass (CVE-2025-47827). The update also fixes a critical 9.8 CVSS RCE vulnerability in WSUS (CVE-2025-59287), posing a significant supply-chain risk. Administrators are urged to apply these updates immediately to mitigate active threats.",[18,19,20,21,22,23,24],"Patch Tuesday","Zero-Day","Privilege Escalation","RCE","Secure Boot","Windows","CISA KEV",[26,27,28],"Patch Management","Vulnerability","Cyberattack","2025-10-06T15:00:00.000Z",5,[32,33,34,35,36,37],"CVE-2025-59230","CVE-2025-24990","CVE-2025-47827","CVE-2025-59287","CVE-2025-59291","CVE-2025-59292",9.8,false,{"id":41,"slug":42,"headline":43,"title":44,"severity":45,"excerpt":46,"tags":47,"categories":55,"createdAt":29,"updatedAt":29,"readingTime":30,"isUpdate":39},"850c557b-6554-4129-af07-24cdba996a4a","chinese-apt-flax-typhoon-uses-arcgis-server-as-backdoor-for-espionage","Chinese APT Flax Typhoon Weaponizes ArcGIS Server as Persistent Backdoor in Year-Long Spy Campaign","Flax Typhoon APT Exploited Esri ArcGIS Server for Over a Year as a Backdoor into Government Networks","high","The China-linked threat group Flax Typhoon (also known as Ethereal Panda) conducted a sophisticated, year-long espionage campaign against a government agency by compromising an Esri ArcGIS server. According to researchers at ReliaQuest, the attackers modified a legitimate Java server object extension (SOE) to create a persistent web shell. This backdoor, combined with extensive use of living-off-the-land techniques like PowerShell and a renamed SoftEther VPN client, allowed the APT group to maintain long-term access, move laterally, and harvest credentials while evading detection by hiding within legitimate server traffic.",[48,49,50,51,52,53,54],"APT","Flax Typhoon","Web Shell","Living-off-the-land","Espionage","ArcGIS","Government",[56,28,57],"Threat Actor","Industrial Control Systems",{"id":59,"slug":60,"headline":61,"title":62,"severity":45,"excerpt":63,"tags":64,"categories":70,"createdAt":29,"updatedAt":29,"readingTime":30,"isUpdate":39},"5b3a9737-c722-4150-8fb6-2e1e6a4fa744","qilin-ransomware-demands-10m-after-crippling-asahi-breweries","Qilin Ransomware Cripples Asahi Breweries, Demands $10 Million Ransom","Qilin Ransomware Group Claims Attack on Asahi, Halting Production and Demanding $10M Ransom","The Qilin ransomware group has claimed responsibility for a devastating cyberattack against Asahi Group Holdings, one of Japan's largest beverage companies. The attack, which occurred in late September, forced the company to halt production at 30 factories and suspend shipments, leading to significant operational and financial disruption. The threat actors are now reportedly demanding a $10 million ransom to prevent the public release of exfiltrated company data, employing a classic double extortion tactic. The incident highlights the increasing trend of ransomware gangs targeting the manufacturing sector to maximize impact and pressure victims into paying large ransoms.",[65,66,67,68,69],"Ransomware","Qilin","Double Extortion","Manufacturing","Japan",[65,28,57],{"id":72,"slug":73,"headline":74,"title":75,"severity":45,"excerpt":76,"tags":77,"categories":84,"createdAt":29,"updatedAt":29,"readingTime":86,"isUpdate":39},"4e038bfd-2ffc-4a59-a536-063a672dbc35","cisa-issues-advisories-for-widespread-industrial-control-system-flaws","CISA Warns of Widespread Flaws in Industrial Control Systems from Major Vendors","CISA Issues Multiple Advisories for Vulnerabilities in Rockwell, Hitachi, and Mitsubishi ICS Products","The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has released a series of advisories warning of numerous vulnerabilities in Industrial Control Systems (ICS) from prominent vendors, including Rockwell Automation, Hitachi Energy, Mitsubishi Electric, and Delta Electronics. These flaws affect products widely deployed in the energy sector and other critical infrastructure domains. CISA is urging administrators to review the advisories and apply patches and mitigations immediately to prevent potential exploitation that could lead to operational disruptions or cyberattacks against critical national infrastructure.",[78,79,80,27,81,82,83],"ICS","OT Security","CISA","Critical Infrastructure","Rockwell Automation","Hitachi Energy",[57,27,85],"Regulatory",4,{"id":88,"slug":89,"headline":90,"title":91,"severity":92,"excerpt":93,"tags":94,"categories":100,"createdAt":29,"updatedAt":29,"readingTime":86,"isUpdate":39},"3b22c614-55aa-4d69-b319-6fa60b7eb70e","novel-phishing-attack-abuses-npm-and-unpkg-cdn-for-credential-theft","Phishing Campaign Abuses NPM and UNPKG CDN to Steal Credentials","Novel \"Beamglea\" Phishing Campaign Weaponizes NPM Registry and UNPKG CDN to Deliver Malware","medium","A sophisticated phishing campaign, dubbed \"Beamglea,\" is abusing the public NPM registry and the trusted unpkg.com CDN to host and deliver credential-stealing malware. Researchers at Socket discovered over 175 malicious, disposable NPM packages created solely to serve a malicious JavaScript file. Attackers send HTML lures to victims that load the script from the reputable unpkg.com domain, bypassing traditional domain-based security filters. This technique, which has targeted over 135 organizations in Europe, represents a dangerous evolution in supply chain abuse, turning developer infrastructure into a tool for direct phishing attacks.",[95,96,97,98,99],"Phishing","Supply Chain Attack","NPM","CDN Abuse","Credential Theft",[95,96,101],"Malware",{"id":103,"slug":104,"headline":105,"title":106,"severity":107,"excerpt":108,"tags":109,"categories":115,"createdAt":29,"updatedAt":29,"readingTime":86,"isUpdate":39},"8a4fabd5-07e0-44e4-bc44-b2ff1c88d744","uk-ncsc-reports-nationally-significant-cyberattacks-more-than-doubled","UK's NCSC Warns of 'Alarming' Rise in Cyberattacks, Doubling in Past Year","UK's National Cyber Security Centre Reports \"Nationally Significant\" Cyberattacks More Than Doubled","informational","The UK's National Cyber Security Centre (NCSC) revealed in its 2025 annual review that it managed 204 \"nationally significant\" cyberattacks over the past year, more than double the 89 incidents from the previous year. The agency attributed the alarming surge to increasing threats from state-sponsored actors, particularly Russia and China, as well as the proliferation of sophisticated ransomware gangs. The NCSC has urged UK businesses to treat cybersecurity as a matter of survival and to elevate cyber resilience to a board-level responsibility to combat the growing threat.",[110,111,112,113,65,114],"NCSC","UK","Threat Report","State-Sponsored Hacking","Policy",[116,85,117],"Policy and Compliance","Threat Intelligence",{"id":119,"slug":120,"headline":121,"title":122,"severity":107,"excerpt":123,"tags":124,"categories":130,"createdAt":29,"updatedAt":29,"readingTime":86,"isUpdate":39},"2c8dfb05-b646-4f4b-b6e5-48d986719584","g7-cyber-experts-issue-statement-on-managing-ai-risks-in-financial-sector","G7 Cyber Experts Issue Statement on Managing AI Risks in Financial Sector","G7 Cyber Expert Group Publishes Statement on Managing Artificial Intelligence Risks in the Financial Sector","The G7 Cyber Expert Group (CEG) has issued a formal statement on the cybersecurity implications of Artificial Intelligence (AI) within the financial sector. Released on October 6, 2025, the document highlights the dual nature of AI, acknowledging its potential to bolster cyber defenses while also warning that it can amplify existing threats and introduce new vulnerabilities. The G7 CEG urges financial institutions and regulators to proactively develop robust governance and risk management frameworks to ensure the secure and resilient adoption of AI, promoting collaboration to establish global best practices.",[125,126,127,128,129,114],"AI","Artificial Intelligence","G7","Finance","Cyber Risk",[116,85,131],"Cloud Security",{"id":133,"slug":134,"headline":135,"title":136,"severity":15,"excerpt":137,"tags":138,"categories":143,"createdAt":29,"updatedAt":29,"readingTime":30,"cves":144,"isUpdate":39},"255dbbaf-45ad-423c-9033-df19bd7f0c20","cl0p-ransomware-exploits-oracle-e-business-suite-zero-day-in-mass-attack","Cl0p Ransomware Exploits Oracle E-Business Suite Zero-Day in Mass Attack","Cl0p Ransomware Gang Exploits Unauthenticated RCE Zero-Day (CVE-2025-61882) in Oracle E-Business Suite","The notorious Cl0p ransomware gang is conducting a widespread extortion campaign by exploiting a critical, unauthenticated remote code execution (RCE) zero-day vulnerability (CVE-2025-61882) in Oracle E-Business Suite. The campaign, active since at least August, involves Cl0p breaching vulnerable systems to steal data and then sending extortion emails to thousands of accounts. Oracle has released an emergency patch for the flaw, which affects versions 12.2.3 through 12.2.14, and is urging customers to update immediately. This attack follows Cl0p's established pattern of leveraging high-impact zero-days in enterprise software for mass compromise.",[139,65,19,140,141,142],"Cl0p","Oracle","Data Breach","Extortion",[65,27,141],[145],"CVE-2025-61882",{"id":147,"slug":148,"headline":149,"title":150,"severity":45,"excerpt":151,"tags":152,"categories":155,"createdAt":29,"updatedAt":29,"readingTime":30,"isUpdate":39},"fd5bf19a-d6c5-4d4f-b08d-3cb5eb4431f3","sonicwall-breach-escalates-100-percent-of-cloud-backups-stolen","SonicWall Breach Escalates: 100% of Cloud Backups Confirmed Stolen","SonicWall Confirms 100% of Cloud Backup Customers Had Firewall Configurations Stolen","Firewall vendor SonicWall has dramatically escalated the severity of a recent data breach, confirming that an investigation found that 100% of customers using its cloud backup service had their firewall configuration files stolen. This admission, made on October 6, 2025, after an investigation with Mandiant, starkly contrasts with the company's initial September statement that only 5% of its user base was affected. The stolen files, accessed via the MySonicWall portal, contain sensitive network architecture details and encrypted credentials, posing a significant reconnaissance risk for future attacks against all affected customers.",[141,153,96,131,154],"SonicWall","Firewall",[141,96,131],{"id":157,"slug":158,"headline":159,"title":160,"severity":45,"excerpt":161,"tags":162,"categories":168,"createdAt":29,"updatedAt":29,"readingTime":30,"isUpdate":39},"607ea6bb-2047-4dc9-84bb-4f7b349c92e6","maverick-new-banking-trojan-spreads-via-whatsapp-in-brazil","\"Maverick\": New Banking Trojan Spreads via WhatsApp in Brazil","New \"Maverick\" Banking Trojan Spreads via WhatsApp in Massive Campaign Targeting Brazilian Users","A new and sophisticated fileless banking Trojan named \"Maverick\" is spreading rapidly in Brazil through a large-scale WhatsApp campaign. According to Kaspersky researchers, the malware is delivered via ZIP archives containing malicious LNK files, a method that bypasses the platform's file-blocking. Maverick operates entirely in memory to evade detection, using PowerShell and encrypted shellcode to steal credentials for 26 Brazilian banks and multiple cryptocurrency exchanges. The Trojan also features a worm-like self-propagation mechanism, hijacking the victim's WhatsApp Web session to automatically send the malicious payload to all their contacts.",[101,163,164,165,166,95,167],"Banking Trojan","Maverick","WhatsApp","Fileless","Brazil",[101,95,169],"Mobile Security",1770214184747]